#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Multiplayer_MoonBoat

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Multiplayer_MoonBoat.ABP_Multiplayer_MoonBoat_C.AnimBlueprintGeneratedConstantData
// 0x01A7 (0x01A8 - 0x0001)
struct ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_9;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_10;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_11;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_14;                               // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_15;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_17;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_18;                                 // 0x0072(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_19;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0118(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0178(0x0030)()
};
static_assert(alignof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData) == 0x0001A8, "Wrong size on ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __NameProperty_9) == 0x000004, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__NameProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x00000C, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __StructProperty_11) == 0x000018, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__StructProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __BoolProperty_12) == 0x000038, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __FloatProperty_13) == 0x00003C, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __StructProperty_14) == 0x000040, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__StructProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __FloatProperty_15) == 0x00006C, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __BoolProperty_16) == 0x000070, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __EnumProperty_17) == 0x000071, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__EnumProperty_17' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __ByteProperty_18) == 0x000072, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__ByteProperty_18' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000074, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000118, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000148, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000178, "Member 'ABP_Multiplayer_MoonBoat::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

