#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDialogEmotion_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PlayerDialogEmotion_Template.ABP_PlayerDialogEmotion_Template_C.AnimBlueprintGeneratedConstantData
// 0x08D7 (0x08D8 - 0x0001)
struct ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_140;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_141;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_142;                                  // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_143;                                // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_144;                                // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_145;                                // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_146;                                // 0x0023(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_147;                                // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_148;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_149;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_150;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_151;                                // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_152;                                // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_153;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_154;                              // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_6;                         // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                         // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;                // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                         // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;               // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;                // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                         // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_1;                 // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                         // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                   // 0x0398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x03C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseBlendNode;                  // 0x03F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;            // 0x0428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                // 0x0458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x0488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6LayeredBoneBlend_4;           // 0x04B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x04E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x0518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x0548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x05A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x05D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x0608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x0668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;              // 0x0698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x06C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6LayeredBoneBlend_3;           // 0x06F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6PoseBlendNode_3;              // 0x0728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6PoseBlendNode_2;              // 0x0758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6PoseBlendNode_1;              // 0x0788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6PoseBlendNode;                // 0x07B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6LayeredBoneBlend_2;           // 0x07E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6LayeredBoneBlend_1;           // 0x0848(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6LayeredBoneBlend;             // 0x0878(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x08A8(0x0030)()
};
static_assert(alignof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData) == 0x0008D8, "Wrong size on ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_140) == 0x000004, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __BlendProfile_141) == 0x000010, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__BlendProfile_141' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __CurveFloat_142) == 0x000018, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__CurveFloat_142' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_143) == 0x000020, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_144) == 0x000021, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_145) == 0x000022, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_146) == 0x000023, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_147) == 0x000024, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_148) == 0x000028, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_149) == 0x00002C, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_150) == 0x000030, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_151) == 0x000031, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_152) == 0x000032, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_152' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_153) == 0x000034, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_154) == 0x000040, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000F8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000128, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_6) == 0x000158, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_5) == 0x000188, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_9) == 0x0001B8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_4) == 0x0001E8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_4) == 0x000218, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000248, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_8) == 0x000278, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_3) == 0x0002A8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose_1) == 0x0002D8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_2) == 0x000308, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000338, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_2) == 0x000368, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose) == 0x000398, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x0003C8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_PoseBlendNode) == 0x0003F8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_PoseBlendNode' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000428, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x000458, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x000488, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6LayeredBoneBlend_4) == 0x0004B8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x0004E8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x000518, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x000548, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000578, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0005A8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0005D8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000608, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000638, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000668, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000698, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0006C8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6LayeredBoneBlend_3) == 0x0006F8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6PoseBlendNode_3) == 0x000728, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6PoseBlendNode_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6PoseBlendNode_2) == 0x000758, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6PoseBlendNode_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6PoseBlendNode_1) == 0x000788, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6PoseBlendNode_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6PoseBlendNode) == 0x0007B8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6PoseBlendNode' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6LayeredBoneBlend_2) == 0x0007E8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000818, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6LayeredBoneBlend_1) == 0x000848, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6LayeredBoneBlend) == 0x000878, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0008A8, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

// ScriptStruct ABP_PlayerDialogEmotion_Template.ABP_PlayerDialogEmotion_Template_C.AnimBlueprintGeneratedMutableData
// 0x002F (0x0030 - 0x0001)
struct ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty;                                   // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_0;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3;                              // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData) == 0x000030, "Wrong size on ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData, __ArrayProperty) == 0x000008, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData::__ArrayProperty' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000018, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00001C, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_2) == 0x000020, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_3) == 0x000028, "Member 'ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_3' has a wrong offset!");

}

