#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_S0045D

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_S0045D.ABP_S0045D_C.AnimBlueprintGeneratedConstantData
// 0x021F (0x0220 - 0x0001)
struct ABP_S0045D::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_19;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_20;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_21;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;               // 0x0100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiPhysics;                   // 0x0130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiLiftLegRig;                // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiHorizontalRig;             // 0x01F0(0x0030)()
};
static_assert(alignof(ABP_S0045D::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_S0045D::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_S0045D::FAnimBlueprintGeneratedConstantData) == 0x000220, "Wrong size on ABP_S0045D::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000004, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, __NameProperty_20) == 0x00000C, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::__NameProperty_20' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, __StructProperty_21) == 0x000018, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::__StructProperty_21' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000D0, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000100, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiPhysics) == 0x000130, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiPhysics' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000160, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000190, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiLiftLegRig) == 0x0001C0, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiLiftLegRig' has a wrong offset!");
static_assert(offsetof(ABP_S0045D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiHorizontalRig) == 0x0001F0, "Member 'ABP_S0045D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiHorizontalRig' has a wrong offset!");

}

