#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_HandHolding

#include "Basic.hpp"

#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_HoldingHandBakedInfo_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateLeaderHandTarget
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateLeaderHandTarget final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidLinkPoint_Valid;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateLeaderHandTarget) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_UpdateLeaderHandTarget");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateLeaderHandTarget) == 0x000010, "Wrong size on ABP_Player_HandHolding_C_UpdateLeaderHandTarget");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateLeaderHandTarget, DeltaTime) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateLeaderHandTarget::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateLeaderHandTarget, CallFunc_IsValidLinkPoint_Valid) == 0x000008, "Member 'ABP_Player_HandHolding_C_UpdateLeaderHandTarget::CallFunc_IsValidLinkPoint_Valid' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateLeaderHandTarget, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'ABP_Player_HandHolding_C_UpdateLeaderHandTarget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateIkAndGestureAlphaByCurve
// 0x0038 (0x0038 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve final
{
public:
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve) == 0x000038, "Wrong size on ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_GetCurveValue_ReturnValue) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_GetCurveValue_ReturnValue_1) == 0x000004, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_FClamp_ReturnValue_1) == 0x000020, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000028, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x000030, "Member 'ABP_Player_HandHolding_C_UpdateIkAndGestureAlphaByCurve::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateHoldingHandsFloatMovingTurnAngle
// 0x0068 (0x0068 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle final
{
public:
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle) == 0x000068, "Wrong size on ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_Vector_Normal2D_ReturnValue) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_Dot_VectorVector_ReturnValue) == 0x000018, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_DegAcos_ReturnValue) == 0x000020, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_Cross_VectorVector_ReturnValue) == 0x000028, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_BreakVector_X) == 0x000040, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_BreakVector_Y) == 0x000048, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_BreakVector_Z) == 0x000050, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_SignOfFloat_ReturnValue) == 0x000058, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_Player_HandHolding_C_UpdateHoldingHandsFloatMovingTurnAngle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateHoldHandingSelfSocketTransform
// 0x00D0 (0x00D0 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform) == 0x000010, "Wrong alignment on ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform) == 0x0000D0, "Wrong size on ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000070, "Member 'ABP_Player_HandHolding_C_UpdateHoldHandingSelfSocketTransform::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateHandHoldTarget
// 0x0090 (0x0090 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateHandHoldTarget final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INavMovementInterface> CallFunc_IsFlying_self_CastInput;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlying_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INavMovementInterface> CallFunc_IsFlying_self_CastInput_1;                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlying_ReturnValue_1;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INavMovementInterface> CallFunc_IsFalling_self_CastInput;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INavMovementInterface> CallFunc_IsFalling_self_CastInput_1;               // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue_1;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Player_HandHolding_C*              K2Node_DynamicCast_AsABP_Player_Hand_Holding;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateHandHoldTarget) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_UpdateHandHoldTarget");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateHandHoldTarget) == 0x000090, "Wrong size on ABP_Player_HandHolding_C_UpdateHandHoldTarget");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, DeltaTime) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFlying_self_CastInput) == 0x000010, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFlying_self_CastInput' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFlying_ReturnValue) == 0x000020, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFlying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFlying_self_CastInput_1) == 0x000028, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFlying_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFlying_ReturnValue_1) == 0x000038, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFlying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFalling_self_CastInput) == 0x000040, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFalling_self_CastInput' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFalling_ReturnValue) == 0x000050, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFalling_self_CastInput_1) == 0x000058, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFalling_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsFalling_ReturnValue_1) == 0x000068, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsFalling_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_BooleanOR_ReturnValue) == 0x000069, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_BooleanOR_ReturnValue_1) == 0x00006A, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsValid_ReturnValue_2) == 0x00006B, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_BooleanOR_ReturnValue_2) == 0x00006C, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_Not_PreBool_ReturnValue) == 0x00006D, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_IsValid_ReturnValue_3) == 0x00006E, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_GetAnimInstance_ReturnValue) == 0x000070, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue) == 0x000078, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, K2Node_DynamicCast_AsABP_Player_Hand_Holding) == 0x000080, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::K2Node_DynamicCast_AsABP_Player_Hand_Holding' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateHandHoldTarget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'ABP_Player_HandHolding_C_UpdateHandHoldTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.UpdateFollowerHandTarget
// 0x0048 (0x0048 - 0x0000)
struct ABP_Player_HandHolding_C_UpdateFollowerHandTarget final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Player_HandHolding_C*              K2Node_DynamicCast_AsABP_Player_Hand_Holding;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_UpdateFollowerHandTarget");
static_assert(sizeof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget) == 0x000048, "Wrong size on ABP_Player_HandHolding_C_UpdateFollowerHandTarget");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue) == 0x000030, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_GetLinkedAnimLayerInstanceByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, K2Node_DynamicCast_AsABP_Player_Hand_Holding) == 0x000038, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::K2Node_DynamicCast_AsABP_Player_Hand_Holding' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_UpdateFollowerHandTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'ABP_Player_HandHolding_C_UpdateFollowerHandTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.StoreNHHFrameData
// 0x01A0 (0x01A0 - 0x0000)
struct ABP_Player_HandHolding_C_StoreNHHFrameData final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue_1;      // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_StoreNHHFrameData) == 0x000010, "Wrong alignment on ABP_Player_HandHolding_C_StoreNHHFrameData");
static_assert(sizeof(ABP_Player_HandHolding_C_StoreNHHFrameData) == 0x0001A0, "Wrong size on ABP_Player_HandHolding_C_StoreNHHFrameData");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, Temp_bool_Variable) == 0x000000, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, Temp_bool_Variable_1) == 0x000001, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, K2Node_Select_Default) == 0x000008, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000070, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, K2Node_Select_Default_1) == 0x0000D0, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0000E0, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_StoreNHHFrameData, CallFunc_MakeRelativeTransform_ReturnValue_1) == 0x000140, "Member 'ABP_Player_HandHolding_C_StoreNHHFrameData::CallFunc_MakeRelativeTransform_ReturnValue_1' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnUpdate_SM_Behavior_HoldHands
// 0x0040 (0x0040 - 0x0000)
struct ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FAnimationStateMachineReference        CallFunc_ConvertToAnimationStateMachinePure_AnimationState; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToAnimationStateMachinePure_Result; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetState_ReturnValue;                     // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands");
static_assert(sizeof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands) == 0x000040, "Wrong size on ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::Node' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, CallFunc_ConvertToAnimationStateMachinePure_AnimationState) == 0x000020, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::CallFunc_ConvertToAnimationStateMachinePure_AnimationState' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, CallFunc_ConvertToAnimationStateMachinePure_Result) == 0x000030, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::CallFunc_ConvertToAnimationStateMachinePure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, CallFunc_GetState_ReturnValue) == 0x000034, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, CallFunc_NotEqual_NameName_ReturnValue) == 0x00003C, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'ABP_Player_HandHolding_C_OnUpdate_SM_Behavior_HoldHands::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnStateEntry_InviteToHoldHands
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands");
static_assert(sizeof(ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands) == 0x000020, "Wrong size on ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnStateEntry_InviteToHoldHands::Node' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnStateEntry_HandHolding
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_HandHolding_C_OnStateEntry_HandHolding final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnStateEntry_HandHolding) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnStateEntry_HandHolding");
static_assert(sizeof(ABP_Player_HandHolding_C_OnStateEntry_HandHolding) == 0x000020, "Wrong size on ABP_Player_HandHolding_C_OnStateEntry_HandHolding");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_HandHolding, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnStateEntry_HandHolding::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_HandHolding, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnStateEntry_HandHolding::Node' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnStateEntry_ContextPose
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_HandHolding_C_OnStateEntry_ContextPose final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnStateEntry_ContextPose) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnStateEntry_ContextPose");
static_assert(sizeof(ABP_Player_HandHolding_C_OnStateEntry_ContextPose) == 0x000020, "Wrong size on ABP_Player_HandHolding_C_OnStateEntry_ContextPose");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_ContextPose, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnStateEntry_ContextPose::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnStateEntry_ContextPose, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnStateEntry_ContextPose::Node' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnBecomeRelevant_StartHoldingHands
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands");
static_assert(sizeof(ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands) == 0x000020, "Wrong size on ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_StartHoldingHands::Node' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnBecomeRelevant_SM_ContextPose
// 0x0038 (0x0038 - 0x0000)
struct ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FAnimationStateMachineReference        CallFunc_ConvertToAnimationStateMachinePure_AnimationState; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToAnimationStateMachinePure_Result; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose");
static_assert(sizeof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose) == 0x000038, "Wrong size on ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose::Node' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose, CallFunc_ConvertToAnimationStateMachinePure_AnimationState) == 0x000020, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose::CallFunc_ConvertToAnimationStateMachinePure_AnimationState' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose, CallFunc_ConvertToAnimationStateMachinePure_Result) == 0x000030, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose::CallFunc_ConvertToAnimationStateMachinePure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_SM_ContextPose::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.OnBecomeRelevant_HoldingHands
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands");
static_assert(sizeof(ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands) == 0x000020, "Wrong size on ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands, Context) == 0x000000, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands, Node) == 0x000010, "Member 'ABP_Player_HandHolding_C_OnBecomeRelevant_HoldingHands::Node' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.IsValidLinkPoint
// 0x0002 (0x0002 - 0x0000)
struct ABP_Player_HandHolding_C_IsValidLinkPoint final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_IsValidLinkPoint) == 0x000001, "Wrong alignment on ABP_Player_HandHolding_C_IsValidLinkPoint");
static_assert(sizeof(ABP_Player_HandHolding_C_IsValidLinkPoint) == 0x000002, "Wrong size on ABP_Player_HandHolding_C_IsValidLinkPoint");
static_assert(offsetof(ABP_Player_HandHolding_C_IsValidLinkPoint, Valid) == 0x000000, "Member 'ABP_Player_HandHolding_C_IsValidLinkPoint::Valid' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsValidLinkPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'ABP_Player_HandHolding_C_IsValidLinkPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.IsPrepare
// 0x0008 (0x0008 - 0x0000)
struct ABP_Player_HandHolding_C_IsPrepare final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_IsPrepare) == 0x000001, "Wrong alignment on ABP_Player_HandHolding_C_IsPrepare");
static_assert(sizeof(ABP_Player_HandHolding_C_IsPrepare) == 0x000008, "Wrong size on ABP_Player_HandHolding_C_IsPrepare");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, Ret) == 0x000000, "Member 'ABP_Player_HandHolding_C_IsPrepare::Ret' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_IsValid_ReturnValue_3) == 0x000004, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_BooleanAND_ReturnValue_1) == 0x000006, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsPrepare, CallFunc_BooleanAND_ReturnValue_2) == 0x000007, "Member 'ABP_Player_HandHolding_C_IsPrepare::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.IsNHHDebug
// 0x0002 (0x0002 - 0x0000)
struct ABP_Player_HandHolding_C_IsNHHDebug final
{
public:
	bool                                          DrawDebug;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_IsNHHDebug) == 0x000001, "Wrong alignment on ABP_Player_HandHolding_C_IsNHHDebug");
static_assert(sizeof(ABP_Player_HandHolding_C_IsNHHDebug) == 0x000002, "Wrong size on ABP_Player_HandHolding_C_IsNHHDebug");
static_assert(offsetof(ABP_Player_HandHolding_C_IsNHHDebug, DrawDebug) == 0x000000, "Member 'ABP_Player_HandHolding_C_IsNHHDebug::DrawDebug' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_IsNHHDebug, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'ABP_Player_HandHolding_C_IsNHHDebug::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.GetNikkiDeltaHeight
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_HandHolding_C_GetNikkiDeltaHeight final
{
public:
	double                                        Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_GetNikkiDeltaHeight) == 0x000008, "Wrong alignment on ABP_Player_HandHolding_C_GetNikkiDeltaHeight");
static_assert(sizeof(ABP_Player_HandHolding_C_GetNikkiDeltaHeight) == 0x000010, "Wrong size on ABP_Player_HandHolding_C_GetNikkiDeltaHeight");
static_assert(offsetof(ABP_Player_HandHolding_C_GetNikkiDeltaHeight, Result) == 0x000000, "Member 'ABP_Player_HandHolding_C_GetNikkiDeltaHeight::Result' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetNikkiDeltaHeight, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_Player_HandHolding_C_GetNikkiDeltaHeight::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABP_Player_HandHolding.ABP_Player_HandHolding_C.GetHoldingHandTargetPositionV3
// 0x0280 (0x0280 - 0x0000)
struct ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3 final
{
public:
	struct FVector                                HoldingHandTargetPosition;                         // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Ret;                                               // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_SelectName_ReturnValue;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_2;         // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3) == 0x000010, "Wrong alignment on ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3");
static_assert(sizeof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3) == 0x000280, "Wrong size on ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, HoldingHandTargetPosition) == 0x000000, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::HoldingHandTargetPosition' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, Ret) == 0x000018, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::Ret' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_SelectName_ReturnValue) == 0x000034, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_SelectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_GetSocketTransform_ReturnValue) == 0x000040, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_GetSocketTransform_ReturnValue_1) == 0x0000F0, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Location_1) == 0x000150, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Rotation_1) == 0x000168, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_BreakTransform_Scale_1) == 0x000180, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000198, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_GetSocketTransform_ReturnValue_2) == 0x0001A0, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_GetSocketTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000200, "Member 'ABP_Player_HandHolding_C_GetHoldingHandTargetPositionV3::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
