#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_RegularMovement

#include "Basic.hpp"

#include "EInputDeviceKeyType_structs.hpp"
#include "Engine_structs.hpp"
#include "EPlayerAdditiveMovementMode_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EMantleType_structs.hpp"
#include "X6Animation_structs.hpp"
#include "X6Game_structs.hpp"
#include "Struct_NikkiContextualAnimation_structs.hpp"
#include "EPlayerMovementScenarios_structs.hpp"
#include "EPlayerGamePlayMovementMode_structs.hpp"
#include "EPawnAnimStateTypes_structs.hpp"


namespace SDK::Params
{

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AllowGaitChanged
// 0x0002 (0x0002 - 0x0000)
struct ABP_Player_RegularMovement_C_AllowGaitChanged final
{
public:
	ERegularLocomotionType                        NewGait;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        OldGait;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AllowGaitChanged) == 0x000001, "Wrong alignment on ABP_Player_RegularMovement_C_AllowGaitChanged");
static_assert(sizeof(ABP_Player_RegularMovement_C_AllowGaitChanged) == 0x000002, "Wrong size on ABP_Player_RegularMovement_C_AllowGaitChanged");
static_assert(offsetof(ABP_Player_RegularMovement_C_AllowGaitChanged, NewGait) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AllowGaitChanged::NewGait' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AllowGaitChanged, OldGait) == 0x000001, "Member 'ABP_Player_RegularMovement_C_AllowGaitChanged::OldGait' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimGraph");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimGraph) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimGraph");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_AimOffset
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_AimOffset final
{
public:
	struct FPoseLink                              InPoseForAimOffset;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_AimOffset_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_AimOffset) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_AimOffset");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_AimOffset) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_AimOffset");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_AimOffset, InPoseForAimOffset) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_AimOffset::InPoseForAimOffset' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_AimOffset, AnimLayer_AimOffset_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_AimOffset::AnimLayer_AimOffset_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_BehaviorAdditiveMode
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode final
{
public:
	struct FPoseLink                              InPoseForPlayerBehavior;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_BehaviorAdditiveMode_0;                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode, InPoseForPlayerBehavior) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode::InPoseForPlayerBehavior' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode, AnimLayer_BehaviorAdditiveMode_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_BehaviorAdditiveMode::AnimLayer_BehaviorAdditiveMode_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_BehaviorConnectionMode
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode final
{
public:
	struct FPoseLink                              InPoseToConnectionMode;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_BehaviorConnectionMode_0;                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode, InPoseToConnectionMode) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode::InPoseToConnectionMode' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode, AnimLayer_BehaviorConnectionMode_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_BehaviorConnectionMode::AnimLayer_BehaviorConnectionMode_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_CombatMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_CombatMovement final
{
public:
	struct FPoseLink                              AnimLayer_CombatMovement_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_CombatMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_CombatMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_CombatMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_CombatMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_CombatMovement, AnimLayer_CombatMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_CombatMovement::AnimLayer_CombatMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_EquipmentAdditiveMode
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode final
{
public:
	struct FPoseLink                              InPoseForEquipment;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_EquipmentAdditiveMode_0;                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode, InPoseForEquipment) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode::InPoseForEquipment' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode, AnimLayer_EquipmentAdditiveMode_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_EquipmentAdditiveMode::AnimLayer_EquipmentAdditiveMode_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_Jump
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_Jump final
{
public:
	struct FPoseLink                              AnimLayer_Jump_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_Jump) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_Jump");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_Jump) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_Jump");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_Jump, AnimLayer_Jump_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_Jump::AnimLayer_Jump_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_Land
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_Land final
{
public:
	struct FPoseLink                              AnimLayer_Land_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_Land) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_Land");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_Land) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_Land");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_Land, AnimLayer_Land_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_Land::AnimLayer_Land_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_MovementDependObject
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject final
{
public:
	struct FPoseLink                              AnimLayer_MovementDependObject_0;                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject, AnimLayer_MovementDependObject_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_MovementDependObject::AnimLayer_MovementDependObject_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_NPCAdditiveBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_NPCAdditiveBehavior_0;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior, InPose) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior, AnimLayer_NPCAdditiveBehavior_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_NPCAdditiveBehavior::AnimLayer_NPCAdditiveBehavior_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_NPCBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_NPCBehavior_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior) == 0x000020, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior, InPose_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior::InPose_0' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior, AnimLayer_NPCBehavior_0) == 0x000010, "Member 'ABP_Player_RegularMovement_C_AnimLayer_NPCBehavior::AnimLayer_NPCBehavior_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_PlayerControllingTool
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool final
{
public:
	struct FPoseLink                              AnimLayer_PlayerControllingTool_0;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool, AnimLayer_PlayerControllingTool_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_PlayerControllingTool::AnimLayer_PlayerControllingTool_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_PlayerRegularMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement final
{
public:
	struct FPoseLink                              AnimLayer_PlayerRegularMovement_0;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement, AnimLayer_PlayerRegularMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_PlayerRegularMovement::AnimLayer_PlayerRegularMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_SpecialSurfaceMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement final
{
public:
	struct FPoseLink                              AnimLayer_SpecialSurfaceMovement_0;                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement, AnimLayer_SpecialSurfaceMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_SpecialSurfaceMovement::AnimLayer_SpecialSurfaceMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_StrafeMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement final
{
public:
	struct FPoseLink                              AnimLayer_StrafeMovement_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement, AnimLayer_StrafeMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_StrafeMovement::AnimLayer_StrafeMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_UsingCarrierMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement final
{
public:
	struct FPoseLink                              AnimLayer_UsingCarrierMovement_0;                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement, AnimLayer_UsingCarrierMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_UsingCarrierMovement::AnimLayer_UsingCarrierMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.AnimLayer_WhiteBoxMovement
// 0x0010 (0x0010 - 0x0000)
struct ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement final
{
public:
	struct FPoseLink                              AnimLayer_WhiteBoxMovement_0;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement");
static_assert(sizeof(ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement) == 0x000010, "Wrong size on ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement");
static_assert(offsetof(ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement, AnimLayer_WhiteBoxMovement_0) == 0x000000, "Member 'ABP_Player_RegularMovement_C_AnimLayer_WhiteBoxMovement::AnimLayer_WhiteBoxMovement_0' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.BlueprintCustomLateUpdate
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate) == 0x000004, "Wrong alignment on ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate");
static_assert(sizeof(ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate) == 0x000004, "Wrong size on ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate");
static_assert(offsetof(ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate, DeltaSeconds) == 0x000000, "Member 'ABP_Player_RegularMovement_C_BlueprintCustomLateUpdate::DeltaSeconds' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.BlueprintCustomPreUpdate
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate) == 0x000004, "Wrong alignment on ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate");
static_assert(sizeof(ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate) == 0x000004, "Wrong size on ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate");
static_assert(offsetof(ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate, DeltaSeconds) == 0x000000, "Member 'ABP_Player_RegularMovement_C_BlueprintCustomPreUpdate::DeltaSeconds' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.BlueprintCustomUpdate
// 0x0004 (0x0004 - 0x0000)
struct ABP_Player_RegularMovement_C_BlueprintCustomUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_BlueprintCustomUpdate) == 0x000004, "Wrong alignment on ABP_Player_RegularMovement_C_BlueprintCustomUpdate");
static_assert(sizeof(ABP_Player_RegularMovement_C_BlueprintCustomUpdate) == 0x000004, "Wrong size on ABP_Player_RegularMovement_C_BlueprintCustomUpdate");
static_assert(offsetof(ABP_Player_RegularMovement_C_BlueprintCustomUpdate, DeltaSeconds) == 0x000000, "Member 'ABP_Player_RegularMovement_C_BlueprintCustomUpdate::DeltaSeconds' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.BP_CanBlueprintUpdate
// 0x0002 (0x0002 - 0x0000)
struct ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate final
{
public:
	bool                                          CanUpdate;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate) == 0x000001, "Wrong alignment on ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate");
static_assert(sizeof(ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate) == 0x000002, "Wrong size on ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate");
static_assert(offsetof(ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate, CanUpdate) == 0x000000, "Member 'ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate::CanUpdate' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'ABP_Player_RegularMovement_C_BP_CanBlueprintUpdate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.BP_ForceSetDefaultIdleMirror
// 0x0001 (0x0001 - 0x0000)
struct ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror final
{
public:
	bool                                          bMirror;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror) == 0x000001, "Wrong alignment on ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror");
static_assert(sizeof(ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror) == 0x000001, "Wrong size on ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror");
static_assert(offsetof(ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror, bMirror) == 0x000000, "Member 'ABP_Player_RegularMovement_C_BP_ForceSetDefaultIdleMirror::bMirror' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.ClearStopFlag
// 0x0003 (0x0003 - 0x0000)
struct ABP_Player_RegularMovement_C_ClearStopFlag final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsSkipStopStage_SkipStopStage;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsForceStopStage_ForceStopFlag;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_ClearStopFlag) == 0x000001, "Wrong alignment on ABP_Player_RegularMovement_C_ClearStopFlag");
static_assert(sizeof(ABP_Player_RegularMovement_C_ClearStopFlag) == 0x000003, "Wrong size on ABP_Player_RegularMovement_C_ClearStopFlag");
static_assert(offsetof(ABP_Player_RegularMovement_C_ClearStopFlag, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ABP_Player_RegularMovement_C_ClearStopFlag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ClearStopFlag, CallFunc_BP_IsSkipStopStage_SkipStopStage) == 0x000001, "Member 'ABP_Player_RegularMovement_C_ClearStopFlag::CallFunc_BP_IsSkipStopStage_SkipStopStage' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ClearStopFlag, CallFunc_BP_IsForceStopStage_ForceStopFlag) == 0x000002, "Member 'ABP_Player_RegularMovement_C_ClearStopFlag::CallFunc_BP_IsForceStopStage_ForceStopFlag' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.ContextChanged
// 0x0002 (0x0002 - 0x0000)
struct ABP_Player_RegularMovement_C_ContextChanged final
{
public:
	ECharacterSituationType                       CharacterSituationType;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddOrRemove;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_ContextChanged) == 0x000001, "Wrong alignment on ABP_Player_RegularMovement_C_ContextChanged");
static_assert(sizeof(ABP_Player_RegularMovement_C_ContextChanged) == 0x000002, "Wrong size on ABP_Player_RegularMovement_C_ContextChanged");
static_assert(offsetof(ABP_Player_RegularMovement_C_ContextChanged, CharacterSituationType) == 0x000000, "Member 'ABP_Player_RegularMovement_C_ContextChanged::CharacterSituationType' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ContextChanged, AddOrRemove) == 0x000001, "Member 'ABP_Player_RegularMovement_C_ContextChanged::AddOrRemove' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.ConvertBoolsToFloat
// 0x0058 (0x0058 - 0x0000)
struct ABP_Player_RegularMovement_C_ConvertBoolsToFloat final
{
public:
	TArray<bool>                                  ArrayOfBool;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        Ret;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_ConvertBoolsToFloat");
static_assert(sizeof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat) == 0x000058, "Wrong size on ABP_Player_RegularMovement_C_ConvertBoolsToFloat");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, ArrayOfBool) == 0x000000, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::ArrayOfBool' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, Ret) == 0x000010, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::Ret' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, Result) == 0x000018, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::Result' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, Temp_int_Array_Index_Variable) == 0x000024, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Array_Get_Item) == 0x00002C, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000040, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_ConvertBoolsToFloat, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_Player_RegularMovement_C_ConvertBoolsToFloat::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.Determine Cycle Stop
// 0x0040 (0x0040 - 0x0000)
struct ABP_Player_RegularMovement_C_Determine_Cycle_Stop final
{
public:
	ELocomotionGait                               Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELocomotionGait                               Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_Determine_Cycle_Stop");
static_assert(sizeof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop) == 0x000040, "Wrong size on ABP_Player_RegularMovement_C_Determine_Cycle_Stop");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_byte_Variable) == 0x000000, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_byte_Variable_1) == 0x000001, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_object_Variable) == 0x000008, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_object_Variable_1) == 0x000010, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_object_Variable_2) == 0x000018, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_object_Variable_3) == 0x000020, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, Temp_object_Variable_4) == 0x000028, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, K2Node_Select_Default) == 0x000030, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Cycle_Stop, K2Node_Select_Default_1) == 0x000038, "Member 'ABP_Player_RegularMovement_C_Determine_Cycle_Stop::K2Node_Select_Default_1' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.Determine Pivot Anim
// 0x00F0 (0x00F0 - 0x0000)
struct ABP_Player_RegularMovement_C_Determine_Pivot_Anim final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_5;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_6;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_7;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_8;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_9;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_10;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_11;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELocomotionGait                               Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_2;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_3;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_4;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_5;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_6;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim) == 0x000008, "Wrong alignment on ABP_Player_RegularMovement_C_Determine_Pivot_Anim");
static_assert(sizeof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim) == 0x0000F0, "Wrong size on ABP_Player_RegularMovement_C_Determine_Pivot_Anim");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Context) == 0x000000, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Context' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Node) == 0x000010, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Node' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable) == 0x000020, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable) == 0x000028, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_1) == 0x000030, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable_1) == 0x000038, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_2) == 0x000040, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_3) == 0x000048, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable_2) == 0x000050, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_4) == 0x000058, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_5) == 0x000060, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable_3) == 0x000068, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_6) == 0x000070, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_7) == 0x000078, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable_4) == 0x000080, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_8) == 0x000088, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_9) == 0x000090, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_bool_Variable_5) == 0x000098, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_10) == 0x0000A0, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_object_Variable_11) == 0x0000A8, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, Temp_byte_Variable) == 0x0000B0, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default) == 0x0000B8, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_1) == 0x0000C0, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_2) == 0x0000C8, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_3) == 0x0000D0, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_4) == 0x0000D8, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_5) == 0x0000E0, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_RegularMovement_C_Determine_Pivot_Anim, K2Node_Select_Default_6) == 0x0000E8, "Member 'ABP_Player_RegularMovement_C_Determine_Pivot_Anim::K2Node_Select_Default_6' has a wrong offset!");

// Function ABP_Player_RegularMovement.ABP_Player_RegularMovement_C.DetermineLandingAnimInfo
// 0x0180 (0x0180 - 0x0000)
struct ABP_Player_RegularMovement_C_DetermineLandingAnimInfo final
{
public:
	bool                                          IsHeavy;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_4;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_6;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_7;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_8;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_9;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_10;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_11;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_12;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable_13;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_1;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_2;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default_3;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default_4;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace1D*                          Temp_object_Variable_14;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
