#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Animal_ControlBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Animal_ControlBase.ABP_Animal_ControlBase_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

// ScriptStruct ABP_Animal_ControlBase.ABP_Animal_ControlBase_C.AnimBlueprintGeneratedConstantData
// 0x0367 (0x0368 - 0x0001)
struct ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_63;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_64;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_65;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_66;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_67;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_68;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_69;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_70;                                  // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_71;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_72;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_73;                               // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_74;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_75;                                 // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_76;                                 // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_77;                                 // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_78;                                 // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_79;                                 // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_81;                                  // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_82;                               // 0x00A0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0140(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x01E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x0218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x02A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x02D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0338(0x0030)()
};
static_assert(alignof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData) == 0x000368, "Wrong size on ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __NameProperty_63) == 0x000004, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__NameProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __BlendProfile_64) == 0x000010, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__BlendProfile_64' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __CurveFloat_65) == 0x000018, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__CurveFloat_65' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_66) == 0x000020, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_66' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_67) == 0x000021, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_68) == 0x000028, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __NameProperty_69) == 0x000038, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__NameProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __IntProperty_70) == 0x000040, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__IntProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_71) == 0x000044, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_72) == 0x000048, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __StructProperty_73) == 0x00004C, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__StructProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_74) == 0x000078, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_75) == 0x00007C, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_75' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_76) == 0x00007D, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_76' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __ByteProperty_77) == 0x00007E, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__ByteProperty_77' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000080, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __NameProperty_79) == 0x000088, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__NameProperty_79' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000090, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __IntProperty_81) == 0x000098, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__IntProperty_81' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, __StructProperty_82) == 0x0000A0, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::__StructProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C0, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000140, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000158, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000188, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0001B8, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0001E8, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000218, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000248, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000278, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0002A8, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0002D8, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000308, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000338, "Member 'ABP_Animal_ControlBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");

}

