#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CheckpointBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CheckpointBase.ABP_CheckpointBase_C.AnimBlueprintGeneratedConstantData
// 0x042F (0x0430 - 0x0001)
struct ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_97;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_98;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_99;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_100;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_101;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_102;                               // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_103;                              // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_104;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_105;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_106;                                // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_107;                                // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_108;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_109;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_110;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_111;                                 // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_112;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_113;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0400(0x0030)()
};
static_assert(alignof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData) == 0x000430, "Wrong size on ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x00000C, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x000014, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000018, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __IntProperty_98) == 0x000020, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__IntProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000024, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __IntProperty_100) == 0x00002C, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__IntProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_101) == 0x000030, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000034, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __StructProperty_103) == 0x000038, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__StructProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_104) == 0x000064, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_105) == 0x000068, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_106) == 0x000069, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __ByteProperty_107) == 0x00006A, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__ByteProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x00006C, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x000074, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x00007C, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __IntProperty_111) == 0x000084, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__IntProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __StructProperty_112) == 0x000088, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__StructProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, __StructProperty_113) == 0x0000A8, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::__StructProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000160, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000190, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0001C0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001F0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000220, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000250, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000280, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0002B0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0002E0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000310, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000340, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000370, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0003A0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0003D0, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000400, "Member 'ABP_CheckpointBase::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

