#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DaMiaoDefaulGameplayMode

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_DaMiaoDefaulGameplayMode.ABP_DaMiaoDefaulGameplayMode_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_DaMiaoDefaulGameplayMode_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_DaMiaoDefaulGameplayMode_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_DaMiaoDefaulGameplayMode_C_AnimGraph");
static_assert(sizeof(ABP_DaMiaoDefaulGameplayMode_C_AnimGraph) == 0x000010, "Wrong size on ABP_DaMiaoDefaulGameplayMode_C_AnimGraph");
static_assert(offsetof(ABP_DaMiaoDefaulGameplayMode_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_DaMiaoDefaulGameplayMode_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_DaMiaoDefaulGameplayMode.ABP_DaMiaoDefaulGameplayMode_C.AnimLayer_BehaviorExtraMode
// 0x0020 (0x0020 - 0x0000)
struct ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_BehaviorExtraMode_0;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode) == 0x000008, "Wrong alignment on ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode");
static_assert(sizeof(ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode) == 0x000020, "Wrong size on ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode");
static_assert(offsetof(ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode, InPose) == 0x000000, "Member 'ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode::InPose' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode, AnimLayer_BehaviorExtraMode_0) == 0x000010, "Member 'ABP_DaMiaoDefaulGameplayMode_C_AnimLayer_BehaviorExtraMode::AnimLayer_BehaviorExtraMode_0' has a wrong offset!");

// Function ABP_DaMiaoDefaulGameplayMode.ABP_DaMiaoDefaulGameplayMode_C.ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode
// 0x0004 (0x0004 - 0x0000)
struct ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode) == 0x000004, "Wrong alignment on ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode");
static_assert(sizeof(ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode) == 0x000004, "Wrong size on ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode");
static_assert(offsetof(ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode, EntryPoint) == 0x000000, "Member 'ABP_DaMiaoDefaulGameplayMode_C_ExecuteUbergraph_ABP_DaMiaoDefaulGameplayMode::EntryPoint' has a wrong offset!");

}

