#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Multiplayer_Moonboat_Paddle

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Multiplayer_Moonboat_Paddle.ABP_Multiplayer_Moonboat_Paddle_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph");
static_assert(sizeof(ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph) == 0x000010, "Wrong size on ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph");
static_assert(offsetof(ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Multiplayer_Moonboat_Paddle_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Multiplayer_Moonboat_Paddle.ABP_Multiplayer_Moonboat_Paddle_C.ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle
// 0x0004 (0x0004 - 0x0000)
struct ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle) == 0x000004, "Wrong alignment on ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle");
static_assert(sizeof(ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle) == 0x000004, "Wrong size on ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle");
static_assert(offsetof(ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle, EntryPoint) == 0x000000, "Member 'ABP_Multiplayer_Moonboat_Paddle_C_ExecuteUbergraph_ABP_Multiplayer_Moonboat_Paddle::EntryPoint' has a wrong offset!");

}

