#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDialogEmotion_Template

#include "Basic.hpp"

#include "X6Animation_structs.hpp"
#include "ABP_PlayerDialogEmotion_Template_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PlayerDialogEmotion_Template.ABP_PlayerDialogEmotion_Template_C
// 0x1540 (0x1910 - 0x03D0)
class UABP_PlayerDialogEmotion_Template_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PlayerDialogEmotion_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x03D8(0x0030)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0418(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0438(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x04F0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0538(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0580(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x05A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x05F0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0670(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x06B8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x06E0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x0728(0x0010)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0738(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x0800(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0880(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x08C8(0x0010)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x08D8(0x0080)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x0958(0x00D8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0A30(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0A70(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0B38(0x0028)()
	struct FAnimNode_X6LayeredBoneBlend           AnimGraphNode_X6LayeredBoneBlend_4;                // 0x0B60(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0C68(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0CE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0D10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0D38(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0D60(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0DA8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0E70(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0E98(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0F18(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0F40(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0F80(0x0028)()
	struct FAnimNode_X6LayeredBoneBlend           AnimGraphNode_X6LayeredBoneBlend_3;                // 0x0FA8(0x0108)()
	struct FAnimNode_X6PoseBlendNode              AnimGraphNode_X6PoseBlendNode_3;                   // 0x10B0(0x0120)()
	struct FAnimNode_X6PoseBlendNode              AnimGraphNode_X6PoseBlendNode_2;                   // 0x11D0(0x0120)()
	struct FAnimNode_X6PoseBlendNode              AnimGraphNode_X6PoseBlendNode_1;                   // 0x12F0(0x0120)()
	struct FAnimNode_X6PoseBlendNode              AnimGraphNode_X6PoseBlendNode;                     // 0x1410(0x0120)()
	struct FAnimNode_X6LayeredBoneBlend           AnimGraphNode_X6LayeredBoneBlend_2;                // 0x1530(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1638(0x0028)()
	struct FAnimNode_X6LayeredBoneBlend           AnimGraphNode_X6LayeredBoneBlend_1;                // 0x1660(0x0108)()
	struct FAnimNode_X6LayeredBoneBlend           AnimGraphNode_X6LayeredBoneBlend;                  // 0x1768(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1870(0x0048)()
	bool                                          bHasBegunPlay;                                     // 0x18B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableEmotionPerformance;                         // 0x18B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDialogFreezePose;                                 // 0x18BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18BB[0x1];                                     // 0x18BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DialogFreezePoseName;                              // 0x18BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseDialogEmotionBlendBranch;                      // 0x18C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C5[0x3];                                     // 0x18C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerAnimStatesComponent_C*        PlayerAnimStatesComponent;                         // 0x18C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             AIFacialPoseAsset;                                 // 0x18D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          PauseAnim;                                         // 0x18D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SnapAbsoluteTime;                                  // 0x18E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendInTime;                                       // 0x18E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendOutTime;                                      // 0x18F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          BasicFacialAnim;                                   // 0x18F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        FullBodyAndUpperFaceWeight;                        // 0x1900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BP_FreePose();
	void BP_SnapPose(class UAnimSequence* PauseAnim_0, double SnapAbsoluteTime_0, double BlendInTime_0, double BlendOutTime_0);
	void CanUseDialogPerformance(bool* bRet);
	void ExecuteUbergraph_ABP_PlayerDialogEmotion_Template(int32 EntryPoint);
	void InitDialogueEmotionParams();
	void OnEmotionPerformanceChanged(bool EnableEmotionPerformance);
	void UpdateState();
	void UpdateUseDialogEmotionBlendBranch();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PlayerDialogEmotion_Template_C">();
	}
	static class UABP_PlayerDialogEmotion_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PlayerDialogEmotion_Template_C>();
	}
};
static_assert(alignof(UABP_PlayerDialogEmotion_Template_C) == 0x000010, "Wrong alignment on UABP_PlayerDialogEmotion_Template_C");
static_assert(sizeof(UABP_PlayerDialogEmotion_Template_C) == 0x001910, "Wrong size on UABP_PlayerDialogEmotion_Template_C");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, UberGraphFrame) == 0x0003D0, "Member 'UABP_PlayerDialogEmotion_Template_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, __AnimBlueprintMutables) == 0x0003D8, "Member 'UABP_PlayerDialogEmotion_Template_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimBlueprintExtension_PropertyAccess) == 0x000408, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimBlueprintExtension_Base) == 0x000410, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Root) == 0x000418, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_LinkedInputPose) == 0x000438, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_6) == 0x0004F0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_6' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_5) == 0x000538, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_9) == 0x000580, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_4) == 0x0005A8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SaveCachedPose_4) == 0x0005F0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_BlendListByBool) == 0x000670, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_8) == 0x0006B8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_3) == 0x0006E0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_IdentityPose_1) == 0x000728, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_IdentityPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_ApplyAdditive_2) == 0x000738, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SaveCachedPose_3) == 0x000800, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_2) == 0x000880, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_IdentityPose) == 0x0008C8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SaveCachedPose_2) == 0x0008D8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_PoseBlendNode) == 0x000958, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_PoseBlendNode' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SequenceEvaluator_1) == 0x000A30, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_ApplyAdditive_1) == 0x000A70, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_7) == 0x000B38, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6LayeredBoneBlend_4) == 0x000B60, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SaveCachedPose_1) == 0x000C68, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_6) == 0x000CE8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_5) == 0x000D10, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_4) == 0x000D38, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot_1) == 0x000D60, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_ApplyAdditive) == 0x000DA8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_3) == 0x000E70, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SaveCachedPose) == 0x000E98, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_2) == 0x000F18, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_SequenceEvaluator) == 0x000F40, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose_1) == 0x000F80, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6LayeredBoneBlend_3) == 0x000FA8, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6PoseBlendNode_3) == 0x0010B0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6PoseBlendNode_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6PoseBlendNode_2) == 0x0011D0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6PoseBlendNode_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6PoseBlendNode_1) == 0x0012F0, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6PoseBlendNode_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6PoseBlendNode) == 0x001410, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6PoseBlendNode' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6LayeredBoneBlend_2) == 0x001530, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_UseCachedPose) == 0x001638, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6LayeredBoneBlend_1) == 0x001660, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_X6LayeredBoneBlend) == 0x001768, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_X6LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AnimGraphNode_Slot) == 0x001870, "Member 'UABP_PlayerDialogEmotion_Template_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, bHasBegunPlay) == 0x0018B8, "Member 'UABP_PlayerDialogEmotion_Template_C::bHasBegunPlay' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, bEnableEmotionPerformance) == 0x0018B9, "Member 'UABP_PlayerDialogEmotion_Template_C::bEnableEmotionPerformance' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, bDialogFreezePose) == 0x0018BA, "Member 'UABP_PlayerDialogEmotion_Template_C::bDialogFreezePose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, DialogFreezePoseName) == 0x0018BC, "Member 'UABP_PlayerDialogEmotion_Template_C::DialogFreezePoseName' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, bUseDialogEmotionBlendBranch) == 0x0018C4, "Member 'UABP_PlayerDialogEmotion_Template_C::bUseDialogEmotionBlendBranch' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, PlayerAnimStatesComponent) == 0x0018C8, "Member 'UABP_PlayerDialogEmotion_Template_C::PlayerAnimStatesComponent' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, AIFacialPoseAsset) == 0x0018D0, "Member 'UABP_PlayerDialogEmotion_Template_C::AIFacialPoseAsset' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, PauseAnim) == 0x0018D8, "Member 'UABP_PlayerDialogEmotion_Template_C::PauseAnim' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, SnapAbsoluteTime) == 0x0018E0, "Member 'UABP_PlayerDialogEmotion_Template_C::SnapAbsoluteTime' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, BlendInTime) == 0x0018E8, "Member 'UABP_PlayerDialogEmotion_Template_C::BlendInTime' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, BlendOutTime) == 0x0018F0, "Member 'UABP_PlayerDialogEmotion_Template_C::BlendOutTime' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, BasicFacialAnim) == 0x0018F8, "Member 'UABP_PlayerDialogEmotion_Template_C::BasicFacialAnim' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDialogEmotion_Template_C, FullBodyAndUpperFaceWeight) == 0x001900, "Member 'UABP_PlayerDialogEmotion_Template_C::FullBodyAndUpperFaceWeight' has a wrong offset!");

}

