#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDefaultBehaviorAdditive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PlayerDefaultBehaviorAdditive.ABP_PlayerDefaultBehaviorAdditive_C
// 0x06D0 (0x0AA0 - 0x03D0)
class UABP_PlayerDefaultBehaviorAdditive_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x03E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0408(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x04C0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x04E0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0500(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0520(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0540(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x05F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0618(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x06D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x06F0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x07A8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x07C8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x07E8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0808(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0828(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0848(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0868(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0888(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x08A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0960(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0980(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A58(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimLayer_AimOffset(const struct FPoseLink& InPoseForAimOffset, struct FPoseLink* AnimLayer_AimOffset_0);
	void AnimLayer_BehaviorAdditiveMode(const struct FPoseLink& InPoseForPlayerBehavior, struct FPoseLink* AnimLayer_BehaviorAdditiveMode_0);
	void AnimLayer_EquipmentAdditiveMode(const struct FPoseLink& InPoseForEquipment, struct FPoseLink* AnimLayer_EquipmentAdditiveMode_0);
	void AnimLayer_Jump(struct FPoseLink* AnimLayer_Jump_0);
	void AnimLayer_Land(struct FPoseLink* AnimLayer_Land_0);
	void AnimLayer_MovementDependObject(struct FPoseLink* AnimLayer_MovementDependObject_0);
	void AnimLayer_NPCAdditiveBehavior(const struct FPoseLink& InPose, struct FPoseLink* AnimLayer_NPCAdditiveBehavior_0);
	void AnimLayer_NPCBehavior(const struct FPoseLink& InPose_0, struct FPoseLink* AnimLayer_NPCBehavior_0);
	void AnimLayer_PlayerControllingTool(struct FPoseLink* AnimLayer_PlayerControllingTool_0);
	void AnimLayer_PlayerRegularMovement(struct FPoseLink* AnimLayer_PlayerRegularMovement_0);
	void AnimLayer_SpecialSurfaceMovement(struct FPoseLink* AnimLayer_SpecialSurfaceMovement_0);
	void AnimLayer_StrafeMovement(struct FPoseLink* AnimLayer_StrafeMovement_0);
	void AnimLayer_UsingCarrierMovement(struct FPoseLink* AnimLayer_UsingCarrierMovement_0);
	void AnimLayer_WhiteBoxMovement(struct FPoseLink* AnimLayer_WhiteBoxMovement_0);
	void ExecuteUbergraph_ABP_PlayerDefaultBehaviorAdditive(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PlayerDefaultBehaviorAdditive_C">();
	}
	static class UABP_PlayerDefaultBehaviorAdditive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PlayerDefaultBehaviorAdditive_C>();
	}
};
static_assert(alignof(UABP_PlayerDefaultBehaviorAdditive_C) == 0x000010, "Wrong alignment on UABP_PlayerDefaultBehaviorAdditive_C");
static_assert(sizeof(UABP_PlayerDefaultBehaviorAdditive_C) == 0x000AA0, "Wrong size on UABP_PlayerDefaultBehaviorAdditive_C");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, UberGraphFrame) == 0x0003D0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimBlueprintExtension_PropertyAccess) == 0x0003D8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimBlueprintExtension_Base) == 0x0003E0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_16) == 0x0003E8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose_5) == 0x000408, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_15) == 0x0004C0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_14) == 0x0004E0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_13) == 0x000500, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_12) == 0x000520, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose_4) == 0x000540, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_11) == 0x0005F8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose_3) == 0x000618, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_10) == 0x0006D0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose_2) == 0x0006F0, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_9) == 0x0007A8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_8) == 0x0007C8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_7) == 0x0007E8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_6) == 0x000808, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_5) == 0x000828, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_4) == 0x000848, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_3) == 0x000868, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_2) == 0x000888, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose_1) == 0x0008A8, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root_1) == 0x000960, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_LinkedInputPose) == 0x000980, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_Root) == 0x000A38, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PlayerDefaultBehaviorAdditive_C, AnimGraphNode_SequencePlayer) == 0x000A58, "Member 'UABP_PlayerDefaultBehaviorAdditive_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

