#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DaMiaoCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "X6Animation_structs.hpp"
#include "ABP_DaMiaoCharacter_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FEmotionPartBlendWeight_structs.hpp"
#include "X6Game_structs.hpp"
#include "X6Game_classes.hpp"
#include "EPlayerGamePlayMovementMode_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_DaMiaoCharacter.ABP_DaMiaoCharacter_C
// 0x2BD0 (0x3050 - 0x0480)
class UABP_DaMiaoCharacter_C final : public UX6DaMiaoMainAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x0488(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x04C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04C8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x04D0(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0578(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0580(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x05A0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0658(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0678(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0730(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0750(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0808(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0828(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x08E0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0900(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x09B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x09D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x09F8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0AB0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0AD0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0B88(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0BA8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0BC8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0BE8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0C08(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0CC0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0CE0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0D98(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0DB8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0E70(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0E90(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0EB0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0ED0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0EF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0F10(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0F30(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0F50(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0F70(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1028(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1048(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1100(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1120(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1140(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1188(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x11D0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x1298(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x1360(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x13E0(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x1428(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x14F0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x15B8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1680(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x16C8(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1790(0x0450)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1BE0(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1CA8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x2178(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x21F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2278(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x22A0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x22E8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2310(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2400(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2448(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2470(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x24F0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2518(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x2560(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2618(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2640(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2668(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x26E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2730(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2758(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2780(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x27A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x27C0(0x0128)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend;                      // 0x28E8(0x0258)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2B40(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2B68(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2C30(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2C78(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2CF8(0x0028)()
	class UAnimSequence*                          __CustomProperty_BasicFacialAnim_A5F2C77A4B6EDBF8AC1C4C92EF703A53; // 0x2D20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bForceInitFootPlacementIKParam_67A206294290F92C62B1FB872A9AA3F1; // 0x2D28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D29[0x7];                                     // 0x2D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_SlopeAngle_67A206294290F92C62B1FB872A9AA3F1; // 0x2D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootRotationWeight_67A206294290F92C62B1FB872A9AA3F1; // 0x2D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootRotationWeight_67A206294290F92C62B1FB872A9AA3F1; // 0x2D40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootTranslationWeight_67A206294290F92C62B1FB872A9AA3F1; // 0x2D48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootTranslationWeight_67A206294290F92C62B1FB872A9AA3F1; // 0x2D50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_PelvisWeight_67A206294290F92C62B1FB872A9AA3F1; // 0x2D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_PelvisOffset_67A206294290F92C62B1FB872A9AA3F1; // 0x2D60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_AnkleRightOffsetRotation_67A206294290F92C62B1FB872A9AA3F1; // 0x2D78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               __CustomProperty_AnkleLeftOffsetRotation_67A206294290F92C62B1FB872A9AA3F1; // 0x2D90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_AnkleRightOffsetLocation_67A206294290F92C62B1FB872A9AA3F1; // 0x2DA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AnkleLeftOffsetLocation_67A206294290F92C62B1FB872A9AA3F1; // 0x2DC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerAnimStatesComponent_C*        PlayerAnimComp;                                    // 0x2DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerRegularMovementCompV3_C*      PlayerRegularComp;                                 // 0x2DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_IsLogicInStateInAir;                            // 0x2DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FreezeFootFront;                                   // 0x2DE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftFootIsFront;                                   // 0x2DEA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        CurrentJumpMovingType;                             // 0x2DEB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFallDangerous;                                   // 0x2DEC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularFloatingJumpStage                     BP_CurrentFloatingJumpStage;                       // 0x2DED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DEE[0x2];                                     // 0x2DEE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            MovementComponent;                                 // 0x2DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        BP_CurLocomotionType;                              // 0x2DF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerGamePlayMovementMode                   BP_CurrentGamePlayMovementMode;                    // 0x2DF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFA[0x6];                                     // 0x2DFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ABP_Link_DialogueBehaviorCls;                      // 0x2E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ABP_Link_AimOffsetCls;                             // 0x2E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBegunPlay;                                     // 0x2E10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E11[0x7];                                     // 0x2E11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFEmotionPartBlendWeight               EmotionBaseBlendInfo;                              // 0x2E18(0x0040)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEmotionPartBlendWeight               One9AIBlendInfo;                                   // 0x2E58(0x0040)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEmotionPartBlendWeight               Five2AIBlendInfo;                                  // 0x2E98(0x0040)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableEmotionPerformance;                         // 0x2ED8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableAllFaicalBlendFlow;                        // 0x2ED9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EDA[0x2];                                     // 0x2EDA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BodyAndUpperFaceSlotName;                          // 0x2EDC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE4[0x4];                                     // 0x2EE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BodyAndUpperFaceSlotBlendAlpha;                    // 0x2EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpperFaceTransitionSlotName;                       // 0x2EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpperFaceTransitionSlotActived;                   // 0x2EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EF9[0x7];                                     // 0x2EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ABP_Link_InteractionPerformance;                   // 0x2F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        FootPlacementIKRigAlpha;                           // 0x2F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableInteractionPerformance;                     // 0x2F10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F11[0x7];                                     // 0x2F11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DialogPerformanceBlendInTime;                      // 0x2F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DialogPerformanceBlendOutTime;                     // 0x2F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UX6NikkiCPPTickHelperComponent*         PlayerCPPTickHelperComponent;                      // 0x2F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      SpringState_FootPlacementIKAlpha;                  // 0x2F30(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          BP_bEnableInteractionIK;                           // 0x2F3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F3D[0x3];                                     // 0x2F3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BP_RootMLocation_WS;                               // 0x2F40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 IKSlotName_RootM_Default;                          // 0x2F58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        FootTargetAlpha;                                   // 0x2F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LastRootMTrasnform_WS;                             // 0x2F70(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultEmotionRatio;                               // 0x2FD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeThisUpdate;                               // 0x2FD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteractionIKLogicAlpha;                           // 0x2FD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FDC[0x4];                                     // 0x2FDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InteractionIKAlpha;                                // 0x2FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InteractionIKAlphaInterpSpeed;                     // 0x2FE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 IKSlotName_RootM_DaMiao;                           // 0x2FF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                IKSlotOffset_RootM_Default;                        // 0x3000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_ForceInitFootPlacementIKParam;                  // 0x3018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3019[0x7];                                     // 0x3019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6OverlayData*                         WeaponOverlayData;                                 // 0x3020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UX6OverlayFrameSettings*                WeaponFrameSettings;                               // 0x3028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_EquipmentAdditiveEnabled;                       // 0x3030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3031[0x7];                                     // 0x3031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BP_EquipmentAdditiveBlendTime;                     // 0x3038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerFeedBackPerformanceComponent_C* PlayerFeedBackPerformanceComponent;              // 0x3040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Anim_Layer_Additive_Behavior(struct FPoseLink* Anim_Layer_Additive_Behavior_0);
	void AnimationLayer_BaseMovement(struct FPoseLink* AnimationLayer_BaseMovement_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimLayer_AimOffset(const struct FPoseLink& InPoseForAimOffset, struct FPoseLink* AnimLayer_AimOffset_0);
	void AnimLayer_AttractorBehavior(const struct FPoseLink& InPose_AttractorBehavior, struct FPoseLink* AnimLayer_AttractorBehavior_0);
	void AnimLayer_BehaviorAdditiveMode(const struct FPoseLink& InPoseForPlayerBehavior, struct FPoseLink* AnimLayer_BehaviorAdditiveMode_0);
	void AnimLayer_BehaviorConnectionMode(const struct FPoseLink& InPoseToConnectionMode, struct FPoseLink* AnimLayer_BehaviorConnectionMode_0);
