#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerCombatMovement

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PlayerCombatMovement.ABP_PlayerCombatMovement_C.AnimBlueprintGeneratedConstantData
// 0x0D2F (0x0D30 - 0x0001)
struct ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_269;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_270;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_271;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_272;                              // 0x0020(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_273;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_274;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_275;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_276;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_277;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_278;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_279;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_280;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_282;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_283;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       __MirrorDataTable_284;                             // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_285;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_286;                              // 0x008C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_287;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_288;                                // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_289;                                // 0x00BD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_290;                                // 0x00BE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_291;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_292;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_293;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_294;                                 // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_295;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_297;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_300;                                // 0x0104(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_301;                                // 0x010C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x0114(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_303;                                // 0x011C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x0124(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_305;                                // 0x012C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_306;                                // 0x0134(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_307;                                // 0x013C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_308;                                // 0x0144(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x014C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_310;                                // 0x0154(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_311;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_312;                                // 0x0164(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_313;                                // 0x016C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_314;                                // 0x0174(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_315;                              // 0x0180(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_316;                                // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_317;                                // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0230(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_16;                        // 0x0248(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_5;                   // 0x0278(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_15;                        // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;            // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;            // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;            // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;            // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;             // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;             // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_1;                     // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone;                       // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StrideWarping;                  // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                 // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror_1;                       // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6SequencePlayer_1;             // 0x0790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x07C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror;                         // 0x07F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6SequencePlayer;               // 0x0820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x08B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x08E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_14;                        // 0x0970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_13;                        // 0x09A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_12;                        // 0x09D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;              // 0x0A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                        // 0x0A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;              // 0x0A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                        // 0x0A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;              // 0x0AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                         // 0x0AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                         // 0x0B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                         // 0x0B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                         // 0x0B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x0C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;              // 0x0C70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0CA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0CD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0D00(0x0030)()
};
static_assert(alignof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData) == 0x000D30, "Wrong size on ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_269) == 0x000004, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_269' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_270) == 0x00000C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_270' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_271) == 0x000014, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_271' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __StructProperty_272) == 0x000020, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__StructProperty_272' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __FloatProperty_273) == 0x000040, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__FloatProperty_273' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_274) == 0x000044, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_274' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_275) == 0x00004C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_275' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __IntProperty_276) == 0x000054, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__IntProperty_276' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_277) == 0x000058, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_277' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __EnumProperty_278) == 0x000060, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__EnumProperty_278' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __ByteProperty_279) == 0x000061, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__ByteProperty_279' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x000064, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x00006C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __IntProperty_282) == 0x000074, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__IntProperty_282' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __BoolProperty_283) == 0x000078, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__BoolProperty_283' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __MirrorDataTable_284) == 0x000080, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__MirrorDataTable_284' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __FloatProperty_285) == 0x000088, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__FloatProperty_285' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __StructProperty_286) == 0x00008C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__StructProperty_286' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __FloatProperty_287) == 0x0000B8, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__FloatProperty_287' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __BoolProperty_288) == 0x0000BC, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__BoolProperty_288' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __EnumProperty_289) == 0x0000BD, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__EnumProperty_289' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __ByteProperty_290) == 0x0000BE, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__ByteProperty_290' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_291) == 0x0000C0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_291' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_292) == 0x0000C8, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_292' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_293) == 0x0000D0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_293' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __IntProperty_294) == 0x0000D8, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__IntProperty_294' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_295) == 0x0000DC, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_295' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x0000E4, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x0000EC, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x0000F4, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x0000FC, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_300) == 0x000104, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_300' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x00010C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x000114, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_303) == 0x00011C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_303' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x000124, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_305) == 0x00012C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_305' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x000134, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x00013C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x000144, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x00014C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_310) == 0x000154, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_310' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_311) == 0x00015C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_311' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000164, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x00016C, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_314) == 0x000174, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_314' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __StructProperty_315) == 0x000180, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__StructProperty_315' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_316) == 0x0001A0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_316' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, __NameProperty_317) == 0x0001A8, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::__NameProperty_317' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001B0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000230, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_16) == 0x000248, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x000278, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_15) == 0x000280, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_13) == 0x0002B0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_12) == 0x0002E0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_11) == 0x000310, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_10) == 0x000340, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_9) == 0x000370, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_8) == 0x0003A0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x0003D0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000400, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000430, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000460, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000490, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_6) == 0x0004C0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_1) == 0x0004F0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone) == 0x000520, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000550, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000580, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StrideWarping) == 0x0005B0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StrideWarping' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0005E0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x000610, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000640, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000670, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_2) == 0x0006A0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0006D0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000700, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000730, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror_1) == 0x000760, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6SequencePlayer_1) == 0x000790, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0007C0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror) == 0x0007F0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6SequencePlayer) == 0x000820, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000850, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000880, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x0008B0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0008E0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000910, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000940, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_14) == 0x000970, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_13) == 0x0009A0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_12) == 0x0009D0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000A00, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_11) == 0x000A30, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x000A60, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_10) == 0x000A90, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000AC0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_9) == 0x000AF0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x000B20, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x000B50, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x000B80, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000BB0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000BE0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000C10, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000C40, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000C70, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000CA0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000CD0, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000D00, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_PlayerCombatMovement.ABP_PlayerCombatMovement_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'ABP_PlayerCombatMovement::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
