#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_AimOffset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Player_AimOffset.ABP_Player_AimOffset_C.AnimBlueprintGeneratedConstantData
// 0x090F (0x0910 - 0x0001)
struct ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_138;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_139;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_140;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_141;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_142;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_143;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_144;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_145;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_146;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_147;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_148;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_149;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_150;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_151;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_152;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_153;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_154;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_155;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_156;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_157;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_158;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_159;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_160;                                // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_161;                               // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_162;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_163;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_164;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_165;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_166;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_167;                                  // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_168;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_169;                                // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_170;                                // 0x00EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_171;                              // 0x00F0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_172;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_173;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0120(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_16;                        // 0x01B8(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_5;                   // 0x01E8(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_15;                        // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_14;                        // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_13;                        // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_12;                        // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                        // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                        // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                         // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                         // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                         // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;              // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                         // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;              // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;              // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;              // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6AimOffsetLookAt;              // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                   // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x07C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x07F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x08B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x08E0(0x0030)()
};
static_assert(alignof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData) == 0x000910, "Wrong size on ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_138) == 0x000004, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_138' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_139) == 0x00000C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_139' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_140) == 0x000014, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_140' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_141) == 0x00001C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_141' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x000024, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_143) == 0x00002C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_143' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_144) == 0x000034, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_144' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_145) == 0x00003C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_145' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_146) == 0x000044, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_146' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_147) == 0x00004C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_147' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x000054, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_149) == 0x00005C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_150) == 0x000064, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_151) == 0x00006C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_151' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_152) == 0x000074, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_152' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_153) == 0x00007C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_154) == 0x000084, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_155) == 0x00008C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_155' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_156) == 0x000094, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_156' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_157) == 0x00009C, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_157' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_158) == 0x0000A4, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_158' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_159) == 0x0000AC, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_159' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __BoolProperty_160) == 0x0000B4, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__BoolProperty_160' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __FloatProperty_161) == 0x0000B8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__FloatProperty_161' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __FloatProperty_162) == 0x0000BC, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__FloatProperty_162' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __EnumProperty_163) == 0x0000C0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__EnumProperty_163' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __ByteProperty_164) == 0x0000C1, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__ByteProperty_164' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __ArrayProperty_165) == 0x0000C8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__ArrayProperty_165' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __BlendProfile_166) == 0x0000D8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__BlendProfile_166' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __CurveFloat_167) == 0x0000E0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__CurveFloat_167' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __BoolProperty_168) == 0x0000E8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__BoolProperty_168' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __EnumProperty_169) == 0x0000E9, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__EnumProperty_169' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __EnumProperty_170) == 0x0000EA, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__EnumProperty_170' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __StructProperty_171) == 0x0000F0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__StructProperty_171' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_172) == 0x000110, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_172' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, __NameProperty_173) == 0x000118, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::__NameProperty_173' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000120, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_16) == 0x0001B8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x0001E8, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_15) == 0x0001F0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_14) == 0x000220, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_13) == 0x000250, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_12) == 0x000280, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_11) == 0x0002B0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_10) == 0x0002E0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_9) == 0x000310, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x000340, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x000370, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x0003A0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x0003D0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x000400, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000430, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000460, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000490, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x0004C0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x0004F0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000520, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000550, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000580, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x0005B0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x0005E0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000610, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6AimOffsetLookAt) == 0x000640, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6AimOffsetLookAt' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000670, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x0006A0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x0006D0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000700, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000730, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000760, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000790, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x0007C0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x0007F0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000820, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000850, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000880, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x0008B0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0008E0, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_Player_AimOffset.ABP_Player_AimOffset_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'ABP_Player_AimOffset::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
