#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_S0048D

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_S0048D.ABP_S0048D_C.AnimBlueprintGeneratedConstantData
// 0x0AFF (0x0B00 - 0x0001)
struct ABP_S0048D::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_246;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_247;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_248;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_249;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_250;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_251;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_252;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_253;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_254;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_255;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_256;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_257;                              // 0x004C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_258;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_259;                                // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_260;                                // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_261;                                // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_262;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_263;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_264;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_265;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_266;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_267;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_268;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_269;                                 // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_270;                              // 0x00B8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;            // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;            // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;            // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;            // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;            // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;             // 0x02C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;             // 0x02F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;             // 0x0320(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;             // 0x0350(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;             // 0x0380(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;             // 0x03B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                 // 0x03E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;             // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                  // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                  // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                 // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                  // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0590(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                  // 0x05C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                 // 0x05F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                  // 0x0620(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0650(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0680(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh_3;             // 0x06B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                  // 0x06E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0710(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0740(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                 // 0x0770(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x07A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                 // 0x07D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0800(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh_2;             // 0x0830(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0860(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0890(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                // 0x08C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh_1;             // 0x08F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiPhysics;                   // 0x0920(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0950(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0980(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;             // 0x09B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x09E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiLiftLegRig;                // 0x0A10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiArmSkirtRig;               // 0x0A40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_NikkiHorizontalRig;             // 0x0A70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0AA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyPoseFromMesh;               // 0x0AD0(0x0030)()
};
static_assert(alignof(ABP_S0048D::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_S0048D::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_S0048D::FAnimBlueprintGeneratedConstantData) == 0x000B00, "Wrong size on ABP_S0048D::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_246) == 0x000004, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_246' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_247) == 0x00000C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_247' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_248) == 0x000014, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_248' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_249) == 0x00001C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_249' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __IntProperty_250) == 0x000024, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__IntProperty_250' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __BoolProperty_251) == 0x000028, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__BoolProperty_251' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_252) == 0x00002C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_252' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_253) == 0x000034, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_253' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __IntProperty_254) == 0x00003C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__IntProperty_254' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_255) == 0x000040, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_255' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __FloatProperty_256) == 0x000048, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__FloatProperty_256' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __StructProperty_257) == 0x00004C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__StructProperty_257' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __FloatProperty_258) == 0x000078, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__FloatProperty_258' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __BoolProperty_259) == 0x00007C, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__BoolProperty_259' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __EnumProperty_260) == 0x00007D, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__EnumProperty_260' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __ByteProperty_261) == 0x00007E, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__ByteProperty_261' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_262) == 0x000080, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_262' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_263) == 0x000088, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_263' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_264) == 0x000090, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_264' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_265) == 0x000098, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_265' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __IntProperty_266) == 0x0000A0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__IntProperty_266' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_267) == 0x0000A4, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_267' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __NameProperty_268) == 0x0000AC, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__NameProperty_268' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __IntProperty_269) == 0x0000B4, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__IntProperty_269' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, __StructProperty_270) == 0x0000B8, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::__StructProperty_270' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000170, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x0001A0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_14) == 0x0001D0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_13) == 0x000200, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_12) == 0x000230, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_11) == 0x000260, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_10) == 0x000290, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_9) == 0x0002C0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_8) == 0x0002F0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x000320, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000350, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000380, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x0003B0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_10) == 0x0003E0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000410, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000440, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000470, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_9) == 0x0004A0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0004D0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_8) == 0x000500, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_4) == 0x000530, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_7) == 0x000560, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000590, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_6) == 0x0005C0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_3) == 0x0005F0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_5) == 0x000620, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000650, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000680, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh_3) == 0x0006B0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh_3' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x0006E0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000710, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000740, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_2) == 0x000770, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0007A0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x0007D0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000800, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh_2) == 0x000830, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh_2' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000860, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000890, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Inertialization) == 0x0008C0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh_1) == 0x0008F0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiPhysics) == 0x000920, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiPhysics' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000950, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000980, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_1) == 0x0009B0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x0009E0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiLiftLegRig) == 0x000A10, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiLiftLegRig' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiArmSkirtRig) == 0x000A40, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiArmSkirtRig' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_NikkiHorizontalRig) == 0x000A70, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_NikkiHorizontalRig' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000AA0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_S0048D::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyPoseFromMesh) == 0x000AD0, "Member 'ABP_S0048D::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

