#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDefaultInteractionPerformance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PlayerDefaultInteractionPerformance.ABP_PlayerDefaultInteractionPerformance_C.AnimBlueprintGeneratedConstantData
// 0x0DC7 (0x0DC8 - 0x0001)
struct ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_312;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_313;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_314;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_315;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_316;                              // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_317;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_318;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_319;                              // 0x0058(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_320;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_321;                                 // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_322;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_323;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_324;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class UMirrorDataTable*                       __MirrorDataTable_325;                             // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_326;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_327;                              // 0x00C8(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_328;                               // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_329;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_330;                                 // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_331;                                // 0x0104(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_332;                                // 0x010C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_333;                              // 0x0118(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_334;                              // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	EAlphaBlendOption                             __EnumProperty_335;                                // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_336;                               // 0x0160(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_337;                               // 0x0170(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_338;                                // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_339;                                  // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_340;                                // 0x0190(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_341;                                // 0x0191(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_342;                               // 0x0198(0x0010)(BlueprintVisible, EditFixedSize)
	ESequenceEvalReinit                           __ByteProperty_343;                                // 0x01A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_344;                                // 0x01A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_345;                                 // 0x01AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_346;                               // 0x01B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_347;                                // 0x01B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_348;                                // 0x01B5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_349;                                // 0x01B6(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B7[0x1];                                      // 0x01B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_350;                              // 0x01B8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_351;                                // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_352;                                // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01E8(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0268(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0270(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;              // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;              // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;              // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;              // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;             // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;             // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;               // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;              // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;                // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_3;             // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror_2;                       // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;               // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                  // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;               // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;              // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;                // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_2;             // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror_1;                       // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;               // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                  // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;              // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;             // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mirror;                         // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;                   // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                         // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x0AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x0BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x0BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;            // 0x0C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;              // 0x0CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                  // 0x0D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MakeDynamicAdditive;            // 0x0D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0D98(0x0030)()
};
static_assert(alignof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData) == 0x000DC8, "Wrong size on ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000004, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x00000C, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_314) == 0x000014, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_314' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_315) == 0x00001C, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_315' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_316) == 0x000028, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_316' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_317) == 0x000048, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_317' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_318) == 0x000050, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_318' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_319) == 0x000058, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_319' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_320) == 0x000078, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_320' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __IntProperty_321) == 0x000080, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__IntProperty_321' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_322) == 0x000084, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_322' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __IntProperty_323) == 0x00008C, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__IntProperty_323' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_324) == 0x000090, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_324' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __MirrorDataTable_325) == 0x0000A0, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__MirrorDataTable_325' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_326) == 0x0000A8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_326' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_327) == 0x0000C8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_327' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __FloatProperty_328) == 0x0000F4, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__FloatProperty_328' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_329) == 0x0000F8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_329' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __IntProperty_330) == 0x000100, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__IntProperty_330' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_331) == 0x000104, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_331' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_332) == 0x00010C, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_332' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_333) == 0x000118, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_333' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_334) == 0x000138, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_334' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __EnumProperty_335) == 0x000158, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__EnumProperty_335' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_336) == 0x000160, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_336' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_337) == 0x000170, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_337' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __BlendProfile_338) == 0x000180, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__BlendProfile_338' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __CurveFloat_339) == 0x000188, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__CurveFloat_339' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __EnumProperty_340) == 0x000190, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__EnumProperty_340' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __EnumProperty_341) == 0x000191, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__EnumProperty_341' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ArrayProperty_342) == 0x000198, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ArrayProperty_342' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ByteProperty_343) == 0x0001A8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ByteProperty_343' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __BoolProperty_344) == 0x0001A9, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__BoolProperty_344' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __IntProperty_345) == 0x0001AC, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__IntProperty_345' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __FloatProperty_346) == 0x0001B0, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__FloatProperty_346' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __BoolProperty_347) == 0x0001B4, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__BoolProperty_347' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __EnumProperty_348) == 0x0001B5, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__EnumProperty_348' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __ByteProperty_349) == 0x0001B6, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__ByteProperty_349' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __StructProperty_350) == 0x0001B8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__StructProperty_350' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_351) == 0x0001D8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_351' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, __NameProperty_352) == 0x0001E0, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::__NameProperty_352' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001E8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000268, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000270, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000288, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x0002B8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x0002E8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x000318, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000348, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000378, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x0003A8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x0003D8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000408, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000438, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000468, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000498, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0004C8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x0004F8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x000528, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_9) == 0x000558, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_3) == 0x000588, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror_2) == 0x0005B8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0005E8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x000618, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000648, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000678, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_8) == 0x0006A8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_2) == 0x0006D8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror_1) == 0x000708, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000738, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000768, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000798, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x0007C8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x0007F8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_1) == 0x000828, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Mirror) == 0x000858, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Mirror' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000888, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0008B8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x0008E8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000918, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000948, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000978, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x0009A8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x0009D8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_PoseSnapshot) == 0x000A08, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_2) == 0x000A38, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000A68, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000A98, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000AC8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x000AF8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000B28, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000B58, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000B88, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000BB8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000BE8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000C18, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000C48, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator_1) == 0x000C78, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequenceEvaluator) == 0x000CA8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000CD8, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000D08, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_MakeDynamicAdditive) == 0x000D38, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_MakeDynamicAdditive' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000D68, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000D98, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct ABP_PlayerDefaultInteractionPerformance.ABP_PlayerDefaultInteractionPerformance_C.AnimBlueprintGeneratedMutableData
// 0x0027 (0x0028 - 0x0001)
struct ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0016(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_10;                             // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_11;                             // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData) == 0x000028, "Wrong size on ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_PlayerDefaultInteractionPerformance::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
