#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DaMiaoCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_DaMiaoCharacter.ABP_DaMiaoCharacter_C.AnimBlueprintGeneratedConstantData
// 0x1187 (0x1188 - 0x0001)
struct ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_280;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_281;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_282;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_283;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_284;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_285;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_286;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_287;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_288;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_289;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_290;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_291;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_292;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_293;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_294;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_295;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_297;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_300;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_301;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_303;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x00C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_305;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_306;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_307;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_308;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_310;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_311;                                // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_312;                                // 0x0104(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_313;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_314;                               // 0x0120(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_315;                              // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_316;                                // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_317;                               // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_318;                              // 0x0158(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_319;                               // 0x0184(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_320;                                // 0x0188(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_321;                                // 0x0189(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_322;                                // 0x018C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_323;                               // 0x0198(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_324;                               // 0x01A8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_325;                              // 0x01B8(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_326;                                // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_327;                                  // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_328;                                // 0x01E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_329;                                // 0x01E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_330;                                // 0x01EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x5];                                      // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_331;                              // 0x01F0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0210(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0270(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x02F0(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02F8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_24;                        // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_11;             // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_23;                        // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_10;             // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_22;                        // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_9;              // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_21;                        // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_8;              // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_20;                        // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_7;              // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_19;                        // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_18;                        // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;              // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_17;                        // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_5;                   // 0x05B0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_16;                        // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_15;                        // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_14;                        // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_13;                        // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;              // 0x0678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_12;                        // 0x06A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;              // 0x06D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                        // 0x0708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;              // 0x0738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                        // 0x0768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                         // 0x0798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                         // 0x07C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                         // 0x07F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                         // 0x0828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                         // 0x0858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x08B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;              // 0x08E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x0918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x09A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                // 0x09D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_7;              // 0x0A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_6;              // 0x0A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_5;               // 0x0A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x0AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_5;              // 0x0AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_4;              // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_3;              // 0x0B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_2;              // 0x0BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                // 0x0BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_1;              // 0x0C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;                     // 0x0C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;               // 0x0C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;                // 0x0CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;              // 0x0D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;                // 0x0D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0D98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;                // 0x0DC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x0DF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;                // 0x0E28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;              // 0x0E58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimGraph;                // 0x0E88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;                // 0x0EB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                // 0x0EE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0F18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0F48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                // 0x0F78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x0FA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0FD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x1008(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x1038(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_X6OverlayBlend;                 // 0x1068(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x1098(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;                // 0x10C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x10F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x1128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x1158(0x0030)()
};
static_assert(alignof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData) == 0x001188, "Wrong size on ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_280) == 0x000004, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_280' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_281) == 0x00000C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_281' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_282) == 0x000014, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_282' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_283) == 0x00001C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_283' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_284) == 0x000024, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_284' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_285) == 0x00002C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_285' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_286) == 0x000034, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_286' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_287) == 0x00003C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_287' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_288) == 0x000044, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_288' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_289) == 0x00004C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_289' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_290) == 0x000054, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_290' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_291) == 0x00005C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_291' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_292) == 0x000064, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_292' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_293) == 0x00006C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_293' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_294) == 0x000074, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_294' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_295) == 0x00007C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_295' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x000084, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x00008C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x000094, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x00009C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_300) == 0x0000A4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_300' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x0000AC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x0000B4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_303) == 0x0000BC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_303' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x0000C4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_305) == 0x0000CC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_305' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x0000D4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x0000DC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x0000E4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x0000EC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_310) == 0x0000F4, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_310' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_311) == 0x0000FC, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_311' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000104, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __ArrayProperty_313) == 0x000110, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__ArrayProperty_313' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __ArrayProperty_314) == 0x000120, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__ArrayProperty_314' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __StructProperty_315) == 0x000130, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__StructProperty_315' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __BoolProperty_316) == 0x000150, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__BoolProperty_316' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __FloatProperty_317) == 0x000154, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__FloatProperty_317' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __StructProperty_318) == 0x000158, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__StructProperty_318' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __FloatProperty_319) == 0x000184, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__FloatProperty_319' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __EnumProperty_320) == 0x000188, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__EnumProperty_320' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __ByteProperty_321) == 0x000189, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__ByteProperty_321' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __NameProperty_322) == 0x00018C, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__NameProperty_322' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __ArrayProperty_323) == 0x000198, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__ArrayProperty_323' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __ArrayProperty_324) == 0x0001A8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__ArrayProperty_324' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __StructProperty_325) == 0x0001B8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__StructProperty_325' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __BlendProfile_326) == 0x0001D8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__BlendProfile_326' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __CurveFloat_327) == 0x0001E0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__CurveFloat_327' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __BoolProperty_328) == 0x0001E8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__BoolProperty_328' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __EnumProperty_329) == 0x0001E9, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__EnumProperty_329' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __EnumProperty_330) == 0x0001EA, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__EnumProperty_330' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, __StructProperty_331) == 0x0001F0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::__StructProperty_331' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000210, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000270, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x0002F0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002F8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_24) == 0x000310, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_11) == 0x000340, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_23) == 0x000370, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_10) == 0x0003A0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_22) == 0x0003D0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_9) == 0x000400, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_21) == 0x000430, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_8) == 0x000460, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_20) == 0x000490, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_7) == 0x0004C0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_19) == 0x0004F0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_18) == 0x000520, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x000550, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_17) == 0x000580, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x0005B0, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_16) == 0x0005B8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_15) == 0x0005E8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_14) == 0x000618, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_13) == 0x000648, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000678, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_12) == 0x0006A8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x0006D8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_11) == 0x000708, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000738, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_10) == 0x000768, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_9) == 0x000798, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x0007C8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x0007F8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x000828, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000858, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000888, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x0008B8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x0008E8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000918, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000948, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000978, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0009A8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum) == 0x0009D8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000A08, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_7) == 0x000A38, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_7' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_6) == 0x000A68, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_6' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_5) == 0x000A98, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x000AC8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_5) == 0x000AF8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_5' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_4) == 0x000B28, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_4' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_3) == 0x000B58, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000B88, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_2) == 0x000BB8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Inertialization) == 0x000BE8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer_1) == 0x000C18, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ControlRig) == 0x000C48, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_4) == 0x000C78, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x000CA8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_9) == 0x000CD8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000D08, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_8) == 0x000D38, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000D68, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000D98, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_7) == 0x000DC8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_2) == 0x000DF8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_6) == 0x000E28, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000E58, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimGraph) == 0x000E88, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_5) == 0x000EB8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_4) == 0x000EE8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000F18, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000F48, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_3) == 0x000F78, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000FA8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000FD8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x001008, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x001038, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_X6OverlayBlend) == 0x001068, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_X6OverlayBlend' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x001098, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedAnimLayer) == 0x0010C8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0010F8, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x001128, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x001158, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");

// ScriptStruct ABP_DaMiaoCharacter.ABP_DaMiaoCharacter_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_0;                                 // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_4;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_5;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData, __ArrayProperty_0) == 0x000008, "Member 'ABP_DaMiaoCharacter::FAnimBlueprintGeneratedMutableData::__ArrayProperty_0' has a wrong offset!");
