#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_WhaleGameplayContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_WhaleGameplayContainer.ABP_WhaleGameplayContainer_C.AnimBlueprintGeneratedConstantData
// 0x019F (0x01A0 - 0x0001)
struct ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_11;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_12;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_13;                               // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_14;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_17;                                 // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_18;                                 // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_19;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0078(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0110(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0170(0x0030)()
};
static_assert(alignof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData) == 0x0001A0, "Wrong size on ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x00000C, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __StructProperty_12) == 0x000018, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__StructProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __StructProperty_13) == 0x000038, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__StructProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __FloatProperty_14) == 0x000064, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __FloatProperty_15) == 0x000068, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __BoolProperty_16) == 0x00006C, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __EnumProperty_17) == 0x00006D, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__EnumProperty_17' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __ByteProperty_18) == 0x00006E, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__ByteProperty_18' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000070, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000078, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F8, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000110, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000140, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000170, "Member 'ABP_WhaleGameplayContainer::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

