#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_damiao

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_damiao.ABP_damiao_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_damiao_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_damiao_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_damiao_C_AnimGraph");
static_assert(sizeof(ABP_damiao_C_AnimGraph) == 0x000020, "Wrong size on ABP_damiao_C_AnimGraph");
static_assert(offsetof(ABP_damiao_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_damiao_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_damiao_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_damiao.ABP_damiao_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_damiao_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_damiao_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_damiao_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_damiao_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_damiao_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_damiao_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_damiao_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_damiao.ABP_damiao_C.ExecuteUbergraph_ABP_damiao
// 0x0028 (0x0028 - 0x0000)
struct ABP_damiao_C_ExecuteUbergraph_ABP_damiao final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerAnimStatesComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao) == 0x000008, "Wrong alignment on ABP_damiao_C_ExecuteUbergraph_ABP_damiao");
static_assert(sizeof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao) == 0x000028, "Wrong size on ABP_damiao_C_ExecuteUbergraph_ABP_damiao");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, EntryPoint) == 0x000000, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, CallFunc_IsValid_ReturnValue_2) == 0x000019, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_damiao_C_ExecuteUbergraph_ABP_damiao, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'ABP_damiao_C_ExecuteUbergraph_ABP_damiao::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

