#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_S0045D

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NikkiPhysics_structs.hpp"
#include "X6Animation_structs.hpp"


namespace SDK::Params
{

// Function ABP_S0045D.ABP_S0045D_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_S0045D_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_S0045D_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_S0045D_C_AnimGraph");
static_assert(sizeof(ABP_S0045D_C_AnimGraph) == 0x000010, "Wrong size on ABP_S0045D_C_AnimGraph");
static_assert(offsetof(ABP_S0045D_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_S0045D_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_S0045D.ABP_S0045D_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_S0045D_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_S0045D_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_S0045D_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_S0045D_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_S0045D_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_S0045D_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_S0045D_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_S0045D.ABP_S0045D_C.ExecuteUbergraph_ABP_S0045D
// 0x00B0 (0x00B0 - 0x0000)
struct ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENikki_HeightFieldMethod                      K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClothExternalData                     CallFunc_ConsumeClothExternalAcc_OutClothExternalData; // 0x0038(0x0020)(NoDestructor)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerDressUp_C*                    K2Node_DynamicCast_AsBP_Player_Dress_Up;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_NikkiPhysicsAlpha_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Skill_Time_Var_ImplicitCast;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D) == 0x000008, "Wrong alignment on ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D");
static_assert(sizeof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D) == 0x0000B0, "Wrong size on ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, EntryPoint) == 0x000000, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, Temp_bool_Variable) == 0x000021, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000028, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_Select_Default) == 0x000030, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_ConsumeClothExternalAcc_OutClothExternalData) == 0x000038, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_ConsumeClothExternalAcc_OutClothExternalData' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_DynamicCast_AsBP_Player_Dress_Up) == 0x000060, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_DynamicCast_AsBP_Player_Dress_Up' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_SelectFloat_B_ImplicitCast) == 0x000080, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_VariableSet_NikkiPhysicsAlpha_ImplicitCast) == 0x000090, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_VariableSet_NikkiPhysicsAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000098, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, K2Node_VariableSet_Skill_Time_Var_ImplicitCast) == 0x0000A0, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::K2Node_VariableSet_Skill_Time_Var_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000A8, "Member 'ABP_S0045D_C_ExecuteUbergraph_ABP_S0045D::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

