#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPI_CustomBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABPI_CustomBehavior.ABPI_CustomBehavior_C.AnimLayer_AttractorBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior final
{
public:
	struct FPoseLink                              InPose_AttractorBehavior;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_AttractorBehavior_0;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior) == 0x000008, "Wrong alignment on ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior");
static_assert(sizeof(ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior) == 0x000020, "Wrong size on ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior, InPose_AttractorBehavior) == 0x000000, "Member 'ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior::InPose_AttractorBehavior' has a wrong offset!");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior, AnimLayer_AttractorBehavior_0) == 0x000010, "Member 'ABPI_CustomBehavior_C_AnimLayer_AttractorBehavior::AnimLayer_AttractorBehavior_0' has a wrong offset!");

// Function ABPI_CustomBehavior.ABPI_CustomBehavior_C.AnimLayer_CustomBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABPI_CustomBehavior_C_AnimLayer_CustomBehavior final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_CustomBehavior_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_CustomBehavior_C_AnimLayer_CustomBehavior) == 0x000008, "Wrong alignment on ABPI_CustomBehavior_C_AnimLayer_CustomBehavior");
static_assert(sizeof(ABPI_CustomBehavior_C_AnimLayer_CustomBehavior) == 0x000020, "Wrong size on ABPI_CustomBehavior_C_AnimLayer_CustomBehavior");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_CustomBehavior, InPose) == 0x000000, "Member 'ABPI_CustomBehavior_C_AnimLayer_CustomBehavior::InPose' has a wrong offset!");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_CustomBehavior, AnimLayer_CustomBehavior_0) == 0x000010, "Member 'ABPI_CustomBehavior_C_AnimLayer_CustomBehavior::AnimLayer_CustomBehavior_0' has a wrong offset!");

// Function ABPI_CustomBehavior.ABPI_CustomBehavior_C.AnimLayer_DialogueBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior final
{
public:
	struct FPoseLink                              InPose_DIalogueBehavior;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_DialogueBehavior_0;                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior) == 0x000008, "Wrong alignment on ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior");
static_assert(sizeof(ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior) == 0x000020, "Wrong size on ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior, InPose_DIalogueBehavior) == 0x000000, "Member 'ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior::InPose_DIalogueBehavior' has a wrong offset!");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior, AnimLayer_DialogueBehavior_0) == 0x000010, "Member 'ABPI_CustomBehavior_C_AnimLayer_DialogueBehavior::AnimLayer_DialogueBehavior_0' has a wrong offset!");

// Function ABPI_CustomBehavior.ABPI_CustomBehavior_C.AnimLayer_InteractionPerformanceBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior final
{
public:
	struct FPoseLink                              InPose_InterationPerformance;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_InteractionPerformanceBehavior_0;        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior) == 0x000008, "Wrong alignment on ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior");
static_assert(sizeof(ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior) == 0x000020, "Wrong size on ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior, InPose_InterationPerformance) == 0x000000, "Member 'ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior::InPose_InterationPerformance' has a wrong offset!");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior, AnimLayer_InteractionPerformanceBehavior_0) == 0x000010, "Member 'ABPI_CustomBehavior_C_AnimLayer_InteractionPerformanceBehavior::AnimLayer_InteractionPerformanceBehavior_0' has a wrong offset!");

// Function ABPI_CustomBehavior.ABPI_CustomBehavior_C.AnimLayer_SituationFeedbackBehavior
// 0x0020 (0x0020 - 0x0000)
struct ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior final
{
public:
	struct FPoseLink                              InPose_SituationFeedback;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_SituationFeedbackBehavior_0;             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior) == 0x000008, "Wrong alignment on ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior");
static_assert(sizeof(ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior) == 0x000020, "Wrong size on ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior, InPose_SituationFeedback) == 0x000000, "Member 'ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior::InPose_SituationFeedback' has a wrong offset!");
static_assert(offsetof(ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior, AnimLayer_SituationFeedbackBehavior_0) == 0x000010, "Member 'ABPI_CustomBehavior_C_AnimLayer_SituationFeedbackBehavior::AnimLayer_SituationFeedbackBehavior_0' has a wrong offset!");

}

