#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AdjustSittingPosture_CtrlRig

#include "Basic.hpp"

#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass AdjustSittingPosture_CtrlRig.AdjustSittingPosture_CtrlRig_C
// 0x0238 (0x0CE0 - 0x0AA8)
class UAdjustSittingPosture_CtrlRig_C final : public UControlRig
{
public:
	double                                        RootM_Alpha;                                       // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RootMCompTransform;                                // 0x0AB0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AnkleLeftCompTransform;                            // 0x0B10(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AnkleRightCompTransform;                           // 0x0B70(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Curve_IKAlpha;                                     // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKAlpha;                                           // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteraction;                                      // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AnkleL_LandLocation;                               // 0x0BE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AnkleR_LandLocation;                               // 0x0C00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceLength;                                       // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Clothes_Thickness_RootM;                           // 0x0C20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Clothes_Thickness_WristL;                          // 0x0C38(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Clothes_Thickness_WristR;                          // 0x0C50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighHeelHeight;                                    // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnkleRotaionYawOffset;                             // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ToesRotaionYawOffset;                              // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KneeMaxXDelta;                                     // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KneeMinXDelta;                                     // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAnkleRotateAngle;                               // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeftToeTraceDeltaHeight;                           // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightToeTraceDeltaHeight;                          // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isLeftToeTraceHit;                                 // 0x0CA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isRightToeTraceHit;                                // 0x0CA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isLeftToeUnderFloor;                               // 0x0CAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isRightToeUnderFloor;                              // 0x0CAB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HighHeelToeHeight;                                 // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KneeL_Height;                                      // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KneeR_Height;                                      // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeftHandPercent;                                   // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightHandPercent;                                  // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceHeightThreshold;                              // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AdjustSittingPosture_CtrlRig_C">();
	}
	static class UAdjustSittingPosture_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdjustSittingPosture_CtrlRig_C>();
	}
};
static_assert(alignof(UAdjustSittingPosture_CtrlRig_C) == 0x000010, "Wrong alignment on UAdjustSittingPosture_CtrlRig_C");
static_assert(sizeof(UAdjustSittingPosture_CtrlRig_C) == 0x000CE0, "Wrong size on UAdjustSittingPosture_CtrlRig_C");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, RootM_Alpha) == 0x000AA8, "Member 'UAdjustSittingPosture_CtrlRig_C::RootM_Alpha' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, RootMCompTransform) == 0x000AB0, "Member 'UAdjustSittingPosture_CtrlRig_C::RootMCompTransform' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, AnkleLeftCompTransform) == 0x000B10, "Member 'UAdjustSittingPosture_CtrlRig_C::AnkleLeftCompTransform' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, AnkleRightCompTransform) == 0x000B70, "Member 'UAdjustSittingPosture_CtrlRig_C::AnkleRightCompTransform' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, Curve_IKAlpha) == 0x000BD0, "Member 'UAdjustSittingPosture_CtrlRig_C::Curve_IKAlpha' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, IKAlpha) == 0x000BD8, "Member 'UAdjustSittingPosture_CtrlRig_C::IKAlpha' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, bInteraction) == 0x000BE0, "Member 'UAdjustSittingPosture_CtrlRig_C::bInteraction' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, AnkleL_LandLocation) == 0x000BE8, "Member 'UAdjustSittingPosture_CtrlRig_C::AnkleL_LandLocation' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, AnkleR_LandLocation) == 0x000C00, "Member 'UAdjustSittingPosture_CtrlRig_C::AnkleR_LandLocation' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, TraceLength) == 0x000C18, "Member 'UAdjustSittingPosture_CtrlRig_C::TraceLength' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, Clothes_Thickness_RootM) == 0x000C20, "Member 'UAdjustSittingPosture_CtrlRig_C::Clothes_Thickness_RootM' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, Clothes_Thickness_WristL) == 0x000C38, "Member 'UAdjustSittingPosture_CtrlRig_C::Clothes_Thickness_WristL' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, Clothes_Thickness_WristR) == 0x000C50, "Member 'UAdjustSittingPosture_CtrlRig_C::Clothes_Thickness_WristR' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, HighHeelHeight) == 0x000C68, "Member 'UAdjustSittingPosture_CtrlRig_C::HighHeelHeight' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, AnkleRotaionYawOffset) == 0x000C70, "Member 'UAdjustSittingPosture_CtrlRig_C::AnkleRotaionYawOffset' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, ToesRotaionYawOffset) == 0x000C78, "Member 'UAdjustSittingPosture_CtrlRig_C::ToesRotaionYawOffset' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, KneeMaxXDelta) == 0x000C80, "Member 'UAdjustSittingPosture_CtrlRig_C::KneeMaxXDelta' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, KneeMinXDelta) == 0x000C88, "Member 'UAdjustSittingPosture_CtrlRig_C::KneeMinXDelta' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, MaxAnkleRotateAngle) == 0x000C90, "Member 'UAdjustSittingPosture_CtrlRig_C::MaxAnkleRotateAngle' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, LeftToeTraceDeltaHeight) == 0x000C98, "Member 'UAdjustSittingPosture_CtrlRig_C::LeftToeTraceDeltaHeight' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, RightToeTraceDeltaHeight) == 0x000CA0, "Member 'UAdjustSittingPosture_CtrlRig_C::RightToeTraceDeltaHeight' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, isLeftToeTraceHit) == 0x000CA8, "Member 'UAdjustSittingPosture_CtrlRig_C::isLeftToeTraceHit' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, isRightToeTraceHit) == 0x000CA9, "Member 'UAdjustSittingPosture_CtrlRig_C::isRightToeTraceHit' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, isLeftToeUnderFloor) == 0x000CAA, "Member 'UAdjustSittingPosture_CtrlRig_C::isLeftToeUnderFloor' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, isRightToeUnderFloor) == 0x000CAB, "Member 'UAdjustSittingPosture_CtrlRig_C::isRightToeUnderFloor' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, HighHeelToeHeight) == 0x000CB0, "Member 'UAdjustSittingPosture_CtrlRig_C::HighHeelToeHeight' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, KneeL_Height) == 0x000CB8, "Member 'UAdjustSittingPosture_CtrlRig_C::KneeL_Height' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, KneeR_Height) == 0x000CC0, "Member 'UAdjustSittingPosture_CtrlRig_C::KneeR_Height' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, LeftHandPercent) == 0x000CC8, "Member 'UAdjustSittingPosture_CtrlRig_C::LeftHandPercent' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, RightHandPercent) == 0x000CD0, "Member 'UAdjustSittingPosture_CtrlRig_C::RightHandPercent' has a wrong offset!");
static_assert(offsetof(UAdjustSittingPosture_CtrlRig_C, TraceHeightThreshold) == 0x000CD8, "Member 'UAdjustSittingPosture_CtrlRig_C::TraceHeightThreshold' has a wrong offset!");

}

