#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_CameraShake

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AN_CameraShake.AN_CameraShake_C
// 0x0018 (0x0050 - 0x0038)
class UAN_CameraShake_C final : public UAnimNotify
{
public:
	class UClass*                                 Shake;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ShakeScale;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShakeInWorldSpace;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AN_CameraShake_C">();
	}
	static class UAN_CameraShake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_CameraShake_C>();
	}
};
static_assert(alignof(UAN_CameraShake_C) == 0x000008, "Wrong alignment on UAN_CameraShake_C");
static_assert(sizeof(UAN_CameraShake_C) == 0x000050, "Wrong size on UAN_CameraShake_C");
static_assert(offsetof(UAN_CameraShake_C, Shake) == 0x000038, "Member 'UAN_CameraShake_C::Shake' has a wrong offset!");
static_assert(offsetof(UAN_CameraShake_C, ShakeScale) == 0x000040, "Member 'UAN_CameraShake_C::ShakeScale' has a wrong offset!");
static_assert(offsetof(UAN_CameraShake_C, ShakeInWorldSpace) == 0x000048, "Member 'UAN_CameraShake_C::ShakeInWorldSpace' has a wrong offset!");

}

