#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_PlayWoolenHeartNiagaraEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_PlayWoolenHeartNiagaraEffect.AN_PlayWoolenHeartNiagaraEffect_C.Received_Notify
// 0x0100 (0x0100 - 0x0000)
struct AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_wildcard_Variable;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Received_Notify_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WoolenHeart_LSeq_C*                 K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_wildcard_Variable_1;                          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorByX6Tag_ReturnValue;              // 0x0080(0x0010)(ReferenceParm)
	class ABP_WoolenHeart_SimulatedLSeq_C*        K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorByX6Tag_ReturnValue_1;            // 0x00C8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify) == 0x000008, "Wrong alignment on AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify");
static_assert(sizeof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify) == 0x000100, "Wrong size on AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, Animation) == 0x000008, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, Temp_wildcard_Variable) == 0x000048, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_Received_Notify_ReturnValue) == 0x000050, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_Received_Notify_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq) == 0x000058, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_ActorHasTag_ReturnValue) == 0x000070, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, Temp_wildcard_Variable_1) == 0x000078, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_GetActorByX6Tag_ReturnValue) == 0x000080, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_GetActorByX6Tag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq) == 0x000090, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_GetSpawnedEffect_ReturnValue) == 0x0000B0, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_GetSpawnedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x0000B8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_GetActorByX6Tag_ReturnValue_1) == 0x0000C8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_GetActorByX6Tag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000E0, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, CallFunc_GetSpawnedEffect_ReturnValue_1) == 0x0000E8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::CallFunc_GetSpawnedEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_AsNiagara_Particle_System_Component_1) == 0x0000F0, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_AsNiagara_Particle_System_Component_1' has a wrong offset!");
static_assert(offsetof(AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'AN_PlayWoolenHeartNiagaraEffect_C_Received_Notify::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

