#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_RunStepSoundV2

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_RunStepSoundV2.AnimNotify_RunStepSoundV2_C.Received_Notify
// 0x0048 (0x0048 - 0x0000)
struct AnimNotify_RunStepSoundV2_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_RunStepSoundV2_C_Received_Notify) == 0x000008, "Wrong alignment on AnimNotify_RunStepSoundV2_C_Received_Notify");
static_assert(sizeof(AnimNotify_RunStepSoundV2_C_Received_Notify) == 0x000048, "Wrong size on AnimNotify_RunStepSoundV2_C_Received_Notify");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_Received_Notify, MeshComp) == 0x000000, "Member 'AnimNotify_RunStepSoundV2_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_Received_Notify, Animation) == 0x000008, "Member 'AnimNotify_RunStepSoundV2_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_Received_Notify, EventReference) == 0x000010, "Member 'AnimNotify_RunStepSoundV2_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_Received_Notify, ReturnValue) == 0x000040, "Member 'AnimNotify_RunStepSoundV2_C_Received_Notify::ReturnValue' has a wrong offset!");

// Function AnimNotify_RunStepSoundV2.AnimNotify_RunStepSoundV2_C.PreviewPostAkEvent
// 0x0060 (0x0060 - 0x0000)
struct AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent final
{
public:
	class USceneComponent*                        Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_X6GetAkComponent_ComponentCreated;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_X6GetAkComponent_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent) == 0x000008, "Wrong alignment on AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent");
static_assert(sizeof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent) == 0x000060, "Wrong size on AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, Comp) == 0x000000, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::Comp' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, AttachToComponent) == 0x000008, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::AttachToComponent' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, Temp_bool_Variable) == 0x000010, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, Temp_bool_Variable_1) == 0x000020, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, Temp_name_Variable) == 0x000030, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, K2Node_Select_Default) == 0x000038, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, K2Node_Select_Default_1) == 0x000048, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, CallFunc_X6GetAkComponent_ComponentCreated) == 0x000050, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::CallFunc_X6GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent, CallFunc_X6GetAkComponent_ReturnValue) == 0x000058, "Member 'AnimNotify_RunStepSoundV2_C_PreviewPostAkEvent::CallFunc_X6GetAkComponent_ReturnValue' has a wrong offset!");

// Function AnimNotify_RunStepSoundV2.AnimNotify_RunStepSoundV2_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct AnimNotify_RunStepSoundV2_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_RunStepSoundV2_C_GetModuleName) == 0x000008, "Wrong alignment on AnimNotify_RunStepSoundV2_C_GetModuleName");
static_assert(sizeof(AnimNotify_RunStepSoundV2_C_GetModuleName) == 0x000010, "Wrong size on AnimNotify_RunStepSoundV2_C_GetModuleName");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_GetModuleName, ReturnValue) == 0x000000, "Member 'AnimNotify_RunStepSoundV2_C_GetModuleName::ReturnValue' has a wrong offset!");

// Function AnimNotify_RunStepSoundV2.AnimNotify_RunStepSoundV2_C.GetDefaultTriggerWeightThreshold
// 0x0004 (0x0004 - 0x0000)
struct AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold) == 0x000004, "Wrong alignment on AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold");
static_assert(sizeof(AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold) == 0x000004, "Wrong size on AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold");
static_assert(offsetof(AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold, ReturnValue) == 0x000000, "Member 'AnimNotify_RunStepSoundV2_C_GetDefaultTriggerWeightThreshold::ReturnValue' has a wrong offset!");

}

