#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_X6AkEvent

#include "Basic.hpp"

#include "WwiseExtension_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_X6AkEvent.AnimNotify_X6AkEvent_C
// 0x0038 (0x0070 - 0x0038)
class UAnimNotify_X6AkEvent_C final : public UAnimNotify
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           Event;                                             // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Attach;                                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachName;                                        // 0x0064(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoDestory;                                       // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EX6AkAudioContext                             AudioContext;                                      // 0x006D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_X6AkEvent_C">();
	}
	static class UAnimNotify_X6AkEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_X6AkEvent_C>();
	}
};
static_assert(alignof(UAnimNotify_X6AkEvent_C) == 0x000008, "Wrong alignment on UAnimNotify_X6AkEvent_C");
static_assert(sizeof(UAnimNotify_X6AkEvent_C) == 0x000070, "Wrong size on UAnimNotify_X6AkEvent_C");
static_assert(offsetof(UAnimNotify_X6AkEvent_C, Event) == 0x000038, "Member 'UAnimNotify_X6AkEvent_C::Event' has a wrong offset!");
static_assert(offsetof(UAnimNotify_X6AkEvent_C, Attach) == 0x000060, "Member 'UAnimNotify_X6AkEvent_C::Attach' has a wrong offset!");
static_assert(offsetof(UAnimNotify_X6AkEvent_C, AttachName) == 0x000064, "Member 'UAnimNotify_X6AkEvent_C::AttachName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_X6AkEvent_C, AutoDestory) == 0x00006C, "Member 'UAnimNotify_X6AkEvent_C::AutoDestory' has a wrong offset!");
static_assert(offsetof(UAnimNotify_X6AkEvent_C, AudioContext) == 0x00006D, "Member 'UAnimNotify_X6AkEvent_C::AudioContext' has a wrong offset!");

}

