#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_RunStepSoundV2

#include "Basic.hpp"

#include "Enum_FootstepSoundType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_RunStepSoundV2.AnimNotify_RunStepSoundV2_C
// 0x0048 (0x0080 - 0x0038)
class UAnimNotify_RunStepSoundV2_C final : public UAnimNotify
{
public:
	bool                                          bAttachMesh;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AttachName;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	Enum_FootstepSoundType                        FootstepType;                                      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsScuf;                                           // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAkAudioEvent>           PreviewEvent;                                      // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;
	void PreviewPostAkEvent(class USceneComponent* Comp) const;
	class FString GetModuleName() const;
	float GetDefaultTriggerWeightThreshold() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_RunStepSoundV2_C">();
	}
	static class UAnimNotify_RunStepSoundV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_RunStepSoundV2_C>();
	}
};
static_assert(alignof(UAnimNotify_RunStepSoundV2_C) == 0x000008, "Wrong alignment on UAnimNotify_RunStepSoundV2_C");
static_assert(sizeof(UAnimNotify_RunStepSoundV2_C) == 0x000080, "Wrong size on UAnimNotify_RunStepSoundV2_C");
static_assert(offsetof(UAnimNotify_RunStepSoundV2_C, bAttachMesh) == 0x000038, "Member 'UAnimNotify_RunStepSoundV2_C::bAttachMesh' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSoundV2_C, AttachName) == 0x000040, "Member 'UAnimNotify_RunStepSoundV2_C::AttachName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSoundV2_C, FootstepType) == 0x000050, "Member 'UAnimNotify_RunStepSoundV2_C::FootstepType' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSoundV2_C, bIsScuf) == 0x000051, "Member 'UAnimNotify_RunStepSoundV2_C::bIsScuf' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSoundV2_C, PreviewEvent) == 0x000058, "Member 'UAnimNotify_RunStepSoundV2_C::PreviewEvent' has a wrong offset!");

}

