#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_TimedCharacterMaterialEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_TimedCharacterMaterialEffect.AnimNotifyState_TimedCharacterMaterialEffect_C.GetNotifyName
// 0x0038 (0x0038 - 0x0000)
struct AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName) == 0x000008, "Wrong alignment on AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName");
static_assert(sizeof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName) == 0x000038, "Wrong size on AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName, CallFunc_GetTagName_ReturnValue) == 0x000010, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_GetNotifyName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function AnimNotifyState_TimedCharacterMaterialEffect.AnimNotifyState_TimedCharacterMaterialEffect_C.Received_NotifyBegin
// 0x0078 (0x0078 - 0x0000)
struct AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SoundAndParticleComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BPAnimNotify_OnPlayMaterialEffect_TotalDuration_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin");
static_assert(sizeof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin) == 0x000078, "Wrong size on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, ReturnValue) == 0x000048, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin, CallFunc_BPAnimNotify_OnPlayMaterialEffect_TotalDuration_ImplicitCast) == 0x000070, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyBegin::CallFunc_BPAnimNotify_OnPlayMaterialEffect_TotalDuration_ImplicitCast' has a wrong offset!");

// Function AnimNotifyState_TimedCharacterMaterialEffect.AnimNotifyState_TimedCharacterMaterialEffect_C.Received_NotifyEnd
// 0x0068 (0x0068 - 0x0000)
struct AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SoundAndParticleComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd");
static_assert(sizeof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd) == 0x000068, "Wrong size on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, ReturnValue) == 0x000040, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AnimNotifyState_TimedCharacterMaterialEffect.AnimNotifyState_TimedCharacterMaterialEffect_C.Received_NotifyTick
// 0x0078 (0x0078 - 0x0000)
struct AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SoundAndParticleComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BPAnimNotify_OnUpdateMaterialEffect_FrameDeltaTime_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick) == 0x000008, "Wrong alignment on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick");
static_assert(sizeof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick) == 0x000078, "Wrong size on AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, Animation) == 0x000008, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, EventReference) == 0x000018, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, ReturnValue) == 0x000048, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick, CallFunc_BPAnimNotify_OnUpdateMaterialEffect_FrameDeltaTime_ImplicitCast) == 0x000070, "Member 'AnimNotifyState_TimedCharacterMaterialEffect_C_Received_NotifyTick::CallFunc_BPAnimNotify_OnUpdateMaterialEffect_FrameDeltaTime_ImplicitCast' has a wrong offset!");

}

