#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimStruct_CardinalDirections

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimStruct_CardinalDirections.AnimStruct_CardinalDirections
// 0x0020 (0x0020 - 0x0000)
struct FAnimStruct_CardinalDirections final
{
public:
	class UAnimSequence*                          Forward_3_4ECB36484D02DEE9548F1FA17D9144A5;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Backward_5_218E95414BB84FBA35016592B8325E07;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Left_8_111D1B5F4FDD96A4F18FF3B54AEE62CC;           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Right_9_8F2C477F46D0B9AEBB8C35866B5837E2;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimStruct_CardinalDirections) == 0x000008, "Wrong alignment on FAnimStruct_CardinalDirections");
static_assert(sizeof(FAnimStruct_CardinalDirections) == 0x000020, "Wrong size on FAnimStruct_CardinalDirections");
static_assert(offsetof(FAnimStruct_CardinalDirections, Forward_3_4ECB36484D02DEE9548F1FA17D9144A5) == 0x000000, "Member 'FAnimStruct_CardinalDirections::Forward_3_4ECB36484D02DEE9548F1FA17D9144A5' has a wrong offset!");
static_assert(offsetof(FAnimStruct_CardinalDirections, Backward_5_218E95414BB84FBA35016592B8325E07) == 0x000008, "Member 'FAnimStruct_CardinalDirections::Backward_5_218E95414BB84FBA35016592B8325E07' has a wrong offset!");
static_assert(offsetof(FAnimStruct_CardinalDirections, Left_8_111D1B5F4FDD96A4F18FF3B54AEE62CC) == 0x000010, "Member 'FAnimStruct_CardinalDirections::Left_8_111D1B5F4FDD96A4F18FF3B54AEE62CC' has a wrong offset!");
static_assert(offsetof(FAnimStruct_CardinalDirections, Right_9_8F2C477F46D0B9AEBB8C35866B5837E2) == 0x000018, "Member 'FAnimStruct_CardinalDirections::Right_9_8F2C477F46D0B9AEBB8C35866B5837E2' has a wrong offset!");

}

