#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_RunStepSound

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimNotify_RunStepSound.AnimNotify_RunStepSound_C
// 0x0040 (0x0078 - 0x0038)
class UAnimNotify_RunStepSound_C final : public UAnimNotify
{
public:
	bool                                          bAttachMesh;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Attach_Name;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           AkEvent;                                           // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	float GetDefaultTriggerWeightThreshold() const;
	void PreviewPostAkEvent(class USceneComponent* Comp) const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimNotify_RunStepSound_C">();
	}
	static class UAnimNotify_RunStepSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_RunStepSound_C>();
	}
};
static_assert(alignof(UAnimNotify_RunStepSound_C) == 0x000008, "Wrong alignment on UAnimNotify_RunStepSound_C");
static_assert(sizeof(UAnimNotify_RunStepSound_C) == 0x000078, "Wrong size on UAnimNotify_RunStepSound_C");
static_assert(offsetof(UAnimNotify_RunStepSound_C, bAttachMesh) == 0x000038, "Member 'UAnimNotify_RunStepSound_C::bAttachMesh' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSound_C, Attach_Name) == 0x000040, "Member 'UAnimNotify_RunStepSound_C::Attach_Name' has a wrong offset!");
static_assert(offsetof(UAnimNotify_RunStepSound_C, AkEvent) == 0x000050, "Member 'UAnimNotify_RunStepSound_C::AkEvent' has a wrong offset!");

}

