#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_HitFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ANS_HitFrame.ANS_HitFrame_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct ANS_HitFrame_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ANS_HitFrame_C_GetModuleName) == 0x000008, "Wrong alignment on ANS_HitFrame_C_GetModuleName");
static_assert(sizeof(ANS_HitFrame_C_GetModuleName) == 0x000010, "Wrong size on ANS_HitFrame_C_GetModuleName");
static_assert(offsetof(ANS_HitFrame_C_GetModuleName, ReturnValue) == 0x000000, "Member 'ANS_HitFrame_C_GetModuleName::ReturnValue' has a wrong offset!");

// Function ANS_HitFrame.ANS_HitFrame_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct ANS_HitFrame_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ANS_HitFrame_C_GetNotifyName) == 0x000008, "Wrong alignment on ANS_HitFrame_C_GetNotifyName");
static_assert(sizeof(ANS_HitFrame_C_GetNotifyName) == 0x000010, "Wrong size on ANS_HitFrame_C_GetNotifyName");
static_assert(offsetof(ANS_HitFrame_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'ANS_HitFrame_C_GetNotifyName::ReturnValue' has a wrong offset!");

// Function ANS_HitFrame.ANS_HitFrame_C.Received_NotifyTick
// 0x0058 (0x0058 - 0x0000)
struct ANS_HitFrame_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ANS_HitFrame_C_Received_NotifyTick) == 0x000008, "Wrong alignment on ANS_HitFrame_C_Received_NotifyTick");
static_assert(sizeof(ANS_HitFrame_C_Received_NotifyTick) == 0x000058, "Wrong size on ANS_HitFrame_C_Received_NotifyTick");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'ANS_HitFrame_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, Animation) == 0x000008, "Member 'ANS_HitFrame_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'ANS_HitFrame_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, EventReference) == 0x000018, "Member 'ANS_HitFrame_C_Received_NotifyTick::EventReference' has a wrong offset!");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, ReturnValue) == 0x000048, "Member 'ANS_HitFrame_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_HitFrame_C_Received_NotifyTick, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'ANS_HitFrame_C_Received_NotifyTick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

}

