#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_ForceFeedback

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_ForceFeedback.ANS_ForceFeedback_C
// 0x0020 (0x0050 - 0x0030)
class UANS_ForceFeedback_C final : public UAnimNotifyState
{
public:
	bool                                          BP_UseTaskTime;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BP_ForceFeedBackKey;                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   BP_ForceFeedBackEffect;                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;
	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANS_ForceFeedback_C">();
	}
	static class UANS_ForceFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_ForceFeedback_C>();
	}
};
static_assert(alignof(UANS_ForceFeedback_C) == 0x000008, "Wrong alignment on UANS_ForceFeedback_C");
static_assert(sizeof(UANS_ForceFeedback_C) == 0x000050, "Wrong size on UANS_ForceFeedback_C");
static_assert(offsetof(UANS_ForceFeedback_C, BP_UseTaskTime) == 0x000030, "Member 'UANS_ForceFeedback_C::BP_UseTaskTime' has a wrong offset!");
static_assert(offsetof(UANS_ForceFeedback_C, BP_ForceFeedBackKey) == 0x000038, "Member 'UANS_ForceFeedback_C::BP_ForceFeedBackKey' has a wrong offset!");
static_assert(offsetof(UANS_ForceFeedback_C, BP_ForceFeedBackEffect) == 0x000048, "Member 'UANS_ForceFeedback_C::BP_ForceFeedBackEffect' has a wrong offset!");

}

