#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_ModifyBuff

#include "Basic.hpp"


namespace SDK::Params
{

// Function ANS_ModifyBuff.ANS_ModifyBuff_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct ANS_ModifyBuff_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(ANS_ModifyBuff_C_GetModuleName) == 0x000008, "Wrong alignment on ANS_ModifyBuff_C_GetModuleName");
static_assert(sizeof(ANS_ModifyBuff_C_GetModuleName) == 0x000010, "Wrong size on ANS_ModifyBuff_C_GetModuleName");
static_assert(offsetof(ANS_ModifyBuff_C_GetModuleName, ReturnValue) == 0x000000, "Member 'ANS_ModifyBuff_C_GetModuleName::ReturnValue' has a wrong offset!");

// Function ANS_ModifyBuff.ANS_ModifyBuff_C.GetNotifyName
// 0x0060 (0x0060 - 0x0000)
struct ANS_ModifyBuff_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 Prefix;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_BuffConfig_C*                       Temp_wildcard_Variable;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_BuffConfig_C*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ANS_ModifyBuff_C_GetNotifyName) == 0x000008, "Wrong alignment on ANS_ModifyBuff_C_GetNotifyName");
static_assert(sizeof(ANS_ModifyBuff_C_GetNotifyName) == 0x000060, "Wrong size on ANS_ModifyBuff_C_GetNotifyName");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'ANS_ModifyBuff_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, Prefix) == 0x000010, "Member 'ANS_ModifyBuff_C_GetNotifyName::Prefix' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, Temp_wildcard_Variable) == 0x000020, "Member 'ANS_ModifyBuff_C_GetNotifyName::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'ANS_ModifyBuff_C_GetNotifyName::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, CallFunc_Array_Get_Item) == 0x000038, "Member 'ANS_ModifyBuff_C_GetNotifyName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'ANS_ModifyBuff_C_GetNotifyName::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'ANS_ModifyBuff_C_GetNotifyName::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ModifyBuff_C_GetNotifyName, CallFunc_BuildString_Name_ReturnValue) == 0x000050, "Member 'ANS_ModifyBuff_C_GetNotifyName::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");

}

