#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_SlomoFrame

#include "Basic.hpp"

#include "F_SlomoFrameBossSet_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_SlomoFrame.ANS_SlomoFrame_C
// 0x0040 (0x0070 - 0x0030)
class UANS_SlomoFrame_C final : public UAnimNotifyState
{
public:
	double                                        SlomoRate;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGrowByHitTarget;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AdjustmentCoefficient;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CorrectionFactor;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseTimeCurve;                                    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            StrenthOverTimeCurve;                              // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_SlomoFrameBossSet>           BossGlobalSlomoSet;                                // 0x0060(0x0010)(Edit, BlueprintVisible)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANS_SlomoFrame_C">();
	}
	static class UANS_SlomoFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_SlomoFrame_C>();
	}
};
static_assert(alignof(UANS_SlomoFrame_C) == 0x000008, "Wrong alignment on UANS_SlomoFrame_C");
static_assert(sizeof(UANS_SlomoFrame_C) == 0x000070, "Wrong size on UANS_SlomoFrame_C");
static_assert(offsetof(UANS_SlomoFrame_C, SlomoRate) == 0x000030, "Member 'UANS_SlomoFrame_C::SlomoRate' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, IsGrowByHitTarget) == 0x000038, "Member 'UANS_SlomoFrame_C::IsGrowByHitTarget' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, AdjustmentCoefficient) == 0x000040, "Member 'UANS_SlomoFrame_C::AdjustmentCoefficient' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, CorrectionFactor) == 0x000048, "Member 'UANS_SlomoFrame_C::CorrectionFactor' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, IsUseTimeCurve) == 0x000050, "Member 'UANS_SlomoFrame_C::IsUseTimeCurve' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, StrenthOverTimeCurve) == 0x000058, "Member 'UANS_SlomoFrame_C::StrenthOverTimeCurve' has a wrong offset!");
static_assert(offsetof(UANS_SlomoFrame_C, BossGlobalSlomoSet) == 0x000060, "Member 'UANS_SlomoFrame_C::BossGlobalSlomoSet' has a wrong offset!");

}

