#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_ShowDeathDissolve

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ECharacterDissolveType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_ShowDeathDissolve.ANS_ShowDeathDissolve_C
// 0x0128 (0x0158 - 0x0030)
class UANS_ShowDeathDissolve_C final : public UAnimNotifyState
{
public:
	bool                                          IsRelive;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DissolveCurve;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NSObj;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   NSSocket;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NSDelayTime;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DisappearCurve;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterDissolveType                        DissolveType;                                      // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DissolveEdgeEmissiveIntensity;                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DissolveEdgeWidth;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CommonMaterialVariableSwitch;                      // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DissolveEdgeSoftness;                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DissolveNoiseIntensity;                            // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DissolveNoiseSize;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisEmissoveColor;                                  // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     Debug_ScalarParams;                                // 0x00A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FVector>             Debug_VectorParams;                                // 0x00F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraComponent*>              Debug_NSComps;                                     // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	class FString GetModuleName() const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANS_ShowDeathDissolve_C">();
	}
	static class UANS_ShowDeathDissolve_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_ShowDeathDissolve_C>();
	}
};
static_assert(alignof(UANS_ShowDeathDissolve_C) == 0x000008, "Wrong alignment on UANS_ShowDeathDissolve_C");
static_assert(sizeof(UANS_ShowDeathDissolve_C) == 0x000158, "Wrong size on UANS_ShowDeathDissolve_C");
static_assert(offsetof(UANS_ShowDeathDissolve_C, IsRelive) == 0x000030, "Member 'UANS_ShowDeathDissolve_C::IsRelive' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveCurve) == 0x000038, "Member 'UANS_ShowDeathDissolve_C::DissolveCurve' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, NSObj) == 0x000040, "Member 'UANS_ShowDeathDissolve_C::NSObj' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, NSSocket) == 0x000048, "Member 'UANS_ShowDeathDissolve_C::NSSocket' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, NSDelayTime) == 0x000050, "Member 'UANS_ShowDeathDissolve_C::NSDelayTime' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DisappearCurve) == 0x000058, "Member 'UANS_ShowDeathDissolve_C::DisappearCurve' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveType) == 0x000060, "Member 'UANS_ShowDeathDissolve_C::DissolveType' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveEdgeEmissiveIntensity) == 0x000068, "Member 'UANS_ShowDeathDissolve_C::DissolveEdgeEmissiveIntensity' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveEdgeWidth) == 0x000070, "Member 'UANS_ShowDeathDissolve_C::DissolveEdgeWidth' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, CommonMaterialVariableSwitch) == 0x000078, "Member 'UANS_ShowDeathDissolve_C::CommonMaterialVariableSwitch' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveEdgeSoftness) == 0x000080, "Member 'UANS_ShowDeathDissolve_C::DissolveEdgeSoftness' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveNoiseIntensity) == 0x000088, "Member 'UANS_ShowDeathDissolve_C::DissolveNoiseIntensity' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DissolveNoiseSize) == 0x000090, "Member 'UANS_ShowDeathDissolve_C::DissolveNoiseSize' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, DisEmissoveColor) == 0x000098, "Member 'UANS_ShowDeathDissolve_C::DisEmissoveColor' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, Debug_ScalarParams) == 0x0000A8, "Member 'UANS_ShowDeathDissolve_C::Debug_ScalarParams' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, Debug_VectorParams) == 0x0000F8, "Member 'UANS_ShowDeathDissolve_C::Debug_VectorParams' has a wrong offset!");
static_assert(offsetof(UANS_ShowDeathDissolve_C, Debug_NSComps) == 0x000148, "Member 'UANS_ShowDeathDissolve_C::Debug_NSComps' has a wrong offset!");

}

