#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_T2NPC_TimedNiagaraEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ANS_T2NPC_TimedNiagaraEffect.ANS_T2NPC_TimedNiagaraEffect_C.Received_NotifyBegin
// 0x0058 (0x0058 - 0x0000)
struct ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin");
static_assert(sizeof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin) == 0x000058, "Wrong size on ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, ReturnValue) == 0x000048, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin, CallFunc_GetSpawnedEffect_ReturnValue) == 0x000050, "Member 'ANS_T2NPC_TimedNiagaraEffect_C_Received_NotifyBegin::CallFunc_GetSpawnedEffect_ReturnValue' has a wrong offset!");

}

