#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BKMediaSection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6CustomizableSequencerTracks_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BKMediaSection.BKMediaSection_C
// 0x0028 (0x0168 - 0x0140)
class UBKMediaSection_C final : public UX6SequencerSectionBP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bUseMultiSkin;                                     // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartLoad(const class FString& LevelSequenceName);
	void ExecuteUbergraph_BKMediaSection(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BKMediaSection_C">();
	}
	static class UBKMediaSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBKMediaSection_C>();
	}
};
static_assert(alignof(UBKMediaSection_C) == 0x000008, "Wrong alignment on UBKMediaSection_C");
static_assert(sizeof(UBKMediaSection_C) == 0x000168, "Wrong size on UBKMediaSection_C");
static_assert(offsetof(UBKMediaSection_C, UberGraphFrame) == 0x000140, "Member 'UBKMediaSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBKMediaSection_C, BinkMediaPlayer) == 0x000148, "Member 'UBKMediaSection_C::BinkMediaPlayer' has a wrong offset!");
static_assert(offsetof(UBKMediaSection_C, URL) == 0x000150, "Member 'UBKMediaSection_C::URL' has a wrong offset!");
static_assert(offsetof(UBKMediaSection_C, bUseMultiSkin) == 0x000160, "Member 'UBKMediaSection_C::bUseMultiSkin' has a wrong offset!");

}

