#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BKMediaTrackInstance

#include "Basic.hpp"

#include "X6CustomizableSequencerTracks_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.UnluaLog
// 0x0010 (0x0010 - 0x0000)
struct BKMediaTrackInstance_C_UnluaLog final
{
public:
	class FString                                 LogString;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_UnluaLog) == 0x000008, "Wrong alignment on BKMediaTrackInstance_C_UnluaLog");
static_assert(sizeof(BKMediaTrackInstance_C_UnluaLog) == 0x000010, "Wrong size on BKMediaTrackInstance_C_UnluaLog");
static_assert(offsetof(BKMediaTrackInstance_C_UnluaLog, LogString) == 0x000000, "Member 'BKMediaTrackInstance_C_UnluaLog::LogString' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.SetEnableWorldRendering
// 0x0001 (0x0001 - 0x0000)
struct BKMediaTrackInstance_C_SetEnableWorldRendering final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_SetEnableWorldRendering) == 0x000001, "Wrong alignment on BKMediaTrackInstance_C_SetEnableWorldRendering");
static_assert(sizeof(BKMediaTrackInstance_C_SetEnableWorldRendering) == 0x000001, "Wrong size on BKMediaTrackInstance_C_SetEnableWorldRendering");
static_assert(offsetof(BKMediaTrackInstance_C_SetEnableWorldRendering, bEnable) == 0x000000, "Member 'BKMediaTrackInstance_C_SetEnableWorldRendering::bEnable' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.SetBinkMediaPlayer
// 0x0010 (0x0010 - 0x0000)
struct BKMediaTrackInstance_C_SetBinkMediaPlayer final
{
public:
	class UBinkMediaPlayer*                       BinkMediaPlayer_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_SetBinkMediaPlayer) == 0x000008, "Wrong alignment on BKMediaTrackInstance_C_SetBinkMediaPlayer");
static_assert(sizeof(BKMediaTrackInstance_C_SetBinkMediaPlayer) == 0x000010, "Wrong size on BKMediaTrackInstance_C_SetBinkMediaPlayer");
static_assert(offsetof(BKMediaTrackInstance_C_SetBinkMediaPlayer, BinkMediaPlayer_0) == 0x000000, "Member 'BKMediaTrackInstance_C_SetBinkMediaPlayer::BinkMediaPlayer_0' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_SetBinkMediaPlayer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BKMediaTrackInstance_C_SetBinkMediaPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_SetBinkMediaPlayer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'BKMediaTrackInstance_C_SetBinkMediaPlayer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.K2_OnInputAdded
// 0x0070 (0x0070 - 0x0000)
struct BKMediaTrackInstance_C_K2_OnInputAdded final
{
public:
	struct FX6SequencerTrackInstanceInput         Input;                                             // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BKMediaTrackInstance_C_K2_OnInputAdded) == 0x000008, "Wrong alignment on BKMediaTrackInstance_C_K2_OnInputAdded");
static_assert(sizeof(BKMediaTrackInstance_C_K2_OnInputAdded) == 0x000070, "Wrong size on BKMediaTrackInstance_C_K2_OnInputAdded");
static_assert(offsetof(BKMediaTrackInstance_C_K2_OnInputAdded, Input) == 0x000000, "Member 'BKMediaTrackInstance_C_K2_OnInputAdded::Input' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.GetNikkiSkin
// 0x0004 (0x0004 - 0x0000)
struct BKMediaTrackInstance_C_GetNikkiSkin final
{
public:
	int32                                         Skin;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_GetNikkiSkin) == 0x000004, "Wrong alignment on BKMediaTrackInstance_C_GetNikkiSkin");
static_assert(sizeof(BKMediaTrackInstance_C_GetNikkiSkin) == 0x000004, "Wrong size on BKMediaTrackInstance_C_GetNikkiSkin");
static_assert(offsetof(BKMediaTrackInstance_C_GetNikkiSkin, Skin) == 0x000000, "Member 'BKMediaTrackInstance_C_GetNikkiSkin::Skin' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.ExecuteUbergraph_BKMediaTrackInstance
// 0x0270 (0x0270 - 0x0000)
struct BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FX6SequencerTrackInstanceInput         K2Node_Event_Input;                                // 0x0020(0x0070)(ContainsInstancedReference)
	class UBKMediaSection_C*                      K2Node_DynamicCast_AsBKMedia_Section;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUrl_ReturnValue;                       // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0xE];                                      // 0x0112(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APostProcessHelpBlackActor_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class APostProcessHelpBlackActor_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0190(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNikkiSkin_Skin;                        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance) == 0x000010, "Wrong alignment on BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance");
static_assert(sizeof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance) == 0x000270, "Wrong size on BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, EntryPoint) == 0x000000, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_Event_Input) == 0x000020, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_Event_Input' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_DynamicCast_AsBKMedia_Section) == 0x000090, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_DynamicCast_AsBKMedia_Section' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Play_ReturnValue) == 0x000099, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Len_ReturnValue) == 0x00009C, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_GetSubstring_ReturnValue) == 0x0000A8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_GetUrl_ReturnValue) == 0x0000C8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_GetUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Rewind_ReturnValue) == 0x0000D8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Rewind_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_CanPlay_ReturnValue) == 0x0000D9, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000E0, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000F0, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_DynamicCast_AsActor) == 0x000108, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_IsValid_ReturnValue) == 0x000111, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000190, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001C8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001D8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_OpenUrl_ReturnValue) == 0x0001D9, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x0001E0, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_BooleanAND_ReturnValue) == 0x0001F0, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001F8, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000208, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000218, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000228, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_GetNikkiSkin_Skin) == 0x000238, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_GetNikkiSkin_Skin' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Conv_IntToString_ReturnValue) == 0x000240, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000250, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000260, "Member 'BKMediaTrackInstance_C_ExecuteUbergraph_BKMediaTrackInstance::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function BKMediaTrackInstance.BKMediaTrackInstance_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BKMediaTrackInstance_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BKMediaTrackInstance_C_GetModuleName) == 0x000008, "Wrong alignment on BKMediaTrackInstance_C_GetModuleName");
static_assert(sizeof(BKMediaTrackInstance_C_GetModuleName) == 0x000010, "Wrong size on BKMediaTrackInstance_C_GetModuleName");
static_assert(offsetof(BKMediaTrackInstance_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BKMediaTrackInstance_C_GetModuleName::ReturnValue' has a wrong offset!");

}

