#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackScreenSection

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "X6CustomizableSequencerTracks_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BlackScreenSection.BlackScreenSection_C
// 0x0028 (0x0168 - 0x0140)
class UBlackScreenSection_C final : public UX6SequencerSectionBP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bCancelHandle;                                     // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DurationSeconds;                                   // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNoFadeOut;                                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           FadeColor;                                         // 0x0154(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNoFadeIn;                                         // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovieSceneNetPolicy                          FadeNetPolicy;                                     // 0x0165(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BlackScreenSection(int32 EntryPoint);
	void K2_OnSectionBegin();
	void K2_OnSectionEnd();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlackScreenSection_C">();
	}
	static class UBlackScreenSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackScreenSection_C>();
	}
};
static_assert(alignof(UBlackScreenSection_C) == 0x000008, "Wrong alignment on UBlackScreenSection_C");
static_assert(sizeof(UBlackScreenSection_C) == 0x000168, "Wrong size on UBlackScreenSection_C");
static_assert(offsetof(UBlackScreenSection_C, UberGraphFrame) == 0x000140, "Member 'UBlackScreenSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, bCancelHandle) == 0x000148, "Member 'UBlackScreenSection_C::bCancelHandle' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, DurationSeconds) == 0x00014C, "Member 'UBlackScreenSection_C::DurationSeconds' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, bNoFadeOut) == 0x000150, "Member 'UBlackScreenSection_C::bNoFadeOut' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, FadeColor) == 0x000154, "Member 'UBlackScreenSection_C::FadeColor' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, bNoFadeIn) == 0x000164, "Member 'UBlackScreenSection_C::bNoFadeIn' has a wrong offset!");
static_assert(offsetof(UBlackScreenSection_C, FadeNetPolicy) == 0x000165, "Member 'UBlackScreenSection_C::FadeNetPolicy' has a wrong offset!");

}

