#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackScreenSection

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BlackScreenSection.BlackScreenSection_C.ExecuteUbergraph_BlackScreenSection
// 0x0080 (0x0080 - 0x0000)
struct BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APostProcessHelpBlackActor_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection) == 0x000010, "Wrong alignment on BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection");
static_assert(sizeof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection) == 0x000080, "Wrong size on BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection");
static_assert(offsetof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection, EntryPoint) == 0x000000, "Member 'BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'BlackScreenSection_C_ExecuteUbergraph_BlackScreenSection::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BlackScreenSection.BlackScreenSection_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BlackScreenSection_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BlackScreenSection_C_GetModuleName) == 0x000008, "Wrong alignment on BlackScreenSection_C_GetModuleName");
static_assert(sizeof(BlackScreenSection_C_GetModuleName) == 0x000010, "Wrong size on BlackScreenSection_C_GetModuleName");
static_assert(offsetof(BlackScreenSection_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BlackScreenSection_C_GetModuleName::ReturnValue' has a wrong offset!");

}

