#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AgentTaskTickComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.AddTickableTask
// 0x0010 (0x0010 - 0x0000)
struct BP_AgentTaskTickComponent_C_AddTickableTask final
{
public:
	class UBP_AgentTaskBase_C*                    Task;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_AddTickableTask) == 0x000008, "Wrong alignment on BP_AgentTaskTickComponent_C_AddTickableTask");
static_assert(sizeof(BP_AgentTaskTickComponent_C_AddTickableTask) == 0x000010, "Wrong size on BP_AgentTaskTickComponent_C_AddTickableTask");
static_assert(offsetof(BP_AgentTaskTickComponent_C_AddTickableTask, Task) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_AddTickableTask::Task' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_AddTickableTask, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_AgentTaskTickComponent_C_AddTickableTask::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.ExecuteUbergraph_BP_AgentTaskTickComponent
// 0x0050 (0x0050 - 0x0000)
struct BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AgentTaskBase_C*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ReceiveTickUncheck_DeltaTime_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent) == 0x000008, "Wrong alignment on BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent");
static_assert(sizeof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent) == 0x000050, "Wrong size on BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, EntryPoint) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000014, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, K2Node_DynamicCast_AsPawn) == 0x000030, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, K2Node_Event_EndPlayReason) == 0x000039, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_ReceiveTickUncheck_DeltaTime_ImplicitCast) == 0x000040, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_ReceiveTickUncheck_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'BP_AgentTaskTickComponent_C_ExecuteUbergraph_BP_AgentTaskTickComponent::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AgentTaskTickComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AgentTaskTickComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_AgentTaskTickComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AgentTaskTickComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AgentTaskTickComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AgentTaskTickComponent_C_ReceiveTick");
static_assert(sizeof(BP_AgentTaskTickComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AgentTaskTickComponent_C_ReceiveTick");
static_assert(offsetof(BP_AgentTaskTickComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.RejectRecycle
// 0x0001 (0x0001 - 0x0000)
struct BP_AgentTaskTickComponent_C_RejectRecycle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_RejectRecycle) == 0x000001, "Wrong alignment on BP_AgentTaskTickComponent_C_RejectRecycle");
static_assert(sizeof(BP_AgentTaskTickComponent_C_RejectRecycle) == 0x000001, "Wrong size on BP_AgentTaskTickComponent_C_RejectRecycle");
static_assert(offsetof(BP_AgentTaskTickComponent_C_RejectRecycle, ReturnValue) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_RejectRecycle::ReturnValue' has a wrong offset!");

// Function BP_AgentTaskTickComponent.BP_AgentTaskTickComponent_C.RemoveTickableTask
// 0x0010 (0x0010 - 0x0000)
struct BP_AgentTaskTickComponent_C_RemoveTickableTask final
{
public:
	class UBP_AgentTaskBase_C*                    Task;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AgentTaskTickComponent_C_RemoveTickableTask) == 0x000008, "Wrong alignment on BP_AgentTaskTickComponent_C_RemoveTickableTask");
static_assert(sizeof(BP_AgentTaskTickComponent_C_RemoveTickableTask) == 0x000010, "Wrong size on BP_AgentTaskTickComponent_C_RemoveTickableTask");
static_assert(offsetof(BP_AgentTaskTickComponent_C_RemoveTickableTask, Task) == 0x000000, "Member 'BP_AgentTaskTickComponent_C_RemoveTickableTask::Task' has a wrong offset!");
static_assert(offsetof(BP_AgentTaskTickComponent_C_RemoveTickableTask, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'BP_AgentTaskTickComponent_C_RemoveTickableTask::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

