#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AvatarConfigDataV3

#include "Basic.hpp"

#include "PartClothMeshInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ENPC_BodyType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AvatarConfigDataV3.BP_AvatarConfigDataV3_C
// 0x00B8 (0x00E8 - 0x0030)
class UBP_AvatarConfigDataV3_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class USkeletalMesh>           main_skeletal_mesh;                                // 0x0030(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   anim_blueprint;                                    // 0x0058(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           copy_from_character;                               // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UCharacterGenAsset>      character_gen_asset;                               // 0x0088(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         suit_id;                                           // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPartClothMeshInfo>             part_cloth_mesh_list;                              // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 makeup_list;                                       // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        avatar_height;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPC_BodyType                                 body_type;                                         // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AvatarConfigDataV3_C">();
	}
	static class UBP_AvatarConfigDataV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AvatarConfigDataV3_C>();
	}
};
static_assert(alignof(UBP_AvatarConfigDataV3_C) == 0x000008, "Wrong alignment on UBP_AvatarConfigDataV3_C");
static_assert(sizeof(UBP_AvatarConfigDataV3_C) == 0x0000E8, "Wrong size on UBP_AvatarConfigDataV3_C");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, main_skeletal_mesh) == 0x000030, "Member 'UBP_AvatarConfigDataV3_C::main_skeletal_mesh' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, anim_blueprint) == 0x000058, "Member 'UBP_AvatarConfigDataV3_C::anim_blueprint' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, copy_from_character) == 0x000080, "Member 'UBP_AvatarConfigDataV3_C::copy_from_character' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, character_gen_asset) == 0x000088, "Member 'UBP_AvatarConfigDataV3_C::character_gen_asset' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, suit_id) == 0x0000B0, "Member 'UBP_AvatarConfigDataV3_C::suit_id' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, part_cloth_mesh_list) == 0x0000B8, "Member 'UBP_AvatarConfigDataV3_C::part_cloth_mesh_list' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, makeup_list) == 0x0000C8, "Member 'UBP_AvatarConfigDataV3_C::makeup_list' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, avatar_height) == 0x0000D8, "Member 'UBP_AvatarConfigDataV3_C::avatar_height' has a wrong offset!");
static_assert(offsetof(UBP_AvatarConfigDataV3_C, body_type) == 0x0000E0, "Member 'UBP_AvatarConfigDataV3_C::body_type' has a wrong offset!");

}

