#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimalBase_Complete

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"
#include "ECharacterType_structs.hpp"
#include "E_Platform_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimalBase_Complete.BP_AnimalBase_Complete_C
// 0x0080 (0x0930 - 0x08B0)
class ABP_AnimalBase_Complete_C final : public AX6CharacterBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        FakeShadowDecal;                                   // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractTipWidget;                                 // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_InsectVerticalShadow;                           // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CatchingInsectFeedBackComponent_C*  BP_CatchingInsectFeedBackComponent;                // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Foliage_Interactor_Component_C*     BP_Foliage_Interactor_Component;                   // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterBaseInfoComponent_C*       BP_CharacterBaseInfoComponent;                     // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      InteractionCollision;                              // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HandleInteractionLogic_C*           BP_HandleInteractionLogic;                         // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractiveActorComponent_C*        BP_InteractiveActorComponent;                      // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AIAgentComponent_C*                 BP_AIAgentComponent;                               // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UX6CustomRootMotionComponent*           X6CustomRootMotion;                                // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerAnimStatesComponent_C*        BP_PlayerAnimStatesComponent;                      // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SoundAndParticleComponent_C*        BP_SoundAndParticleComponent;                      // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerRegularMovementCompV3_C*      BP_PlayerRegularMovementCompV3;                    // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AnimalTickManager_C*                AnimalTickManager;                                 // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ShouldRejectTickManagement(bool* bReject);
	void SetAnimalTickEnabled(bool bEnabled, bool* bSuccess);
	void OnUnbindEntity();
	void OnBindEntity();
	void GetCurrentPlatformActorMeshScale(int64 ConfigID, double* Scale);
	void GetAnimalTickManager(class UBP_AnimalTickManager_C** AnimalTickManager_0);
	void GetAIObjectClass(class FString* LuaClassPath);
	void ExecuteUbergraph_BP_AnimalBase_Complete(int32 EntryPoint);
	void CreateAnimalTickManager();
	void BP_AnimalTickManagerStopAI();
	void BP_AnimalTickManagerResumeAI();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimalBase_Complete_C">();
	}
	static class ABP_AnimalBase_Complete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AnimalBase_Complete_C>();
	}
};
static_assert(alignof(ABP_AnimalBase_Complete_C) == 0x000010, "Wrong alignment on ABP_AnimalBase_Complete_C");
static_assert(sizeof(ABP_AnimalBase_Complete_C) == 0x000930, "Wrong size on ABP_AnimalBase_Complete_C");
static_assert(offsetof(ABP_AnimalBase_Complete_C, UberGraphFrame) == 0x0008B0, "Member 'ABP_AnimalBase_Complete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, FakeShadowDecal) == 0x0008B8, "Member 'ABP_AnimalBase_Complete_C::FakeShadowDecal' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, InteractTipWidget) == 0x0008C0, "Member 'ABP_AnimalBase_Complete_C::InteractTipWidget' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_InsectVerticalShadow) == 0x0008C8, "Member 'ABP_AnimalBase_Complete_C::BP_InsectVerticalShadow' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_CatchingInsectFeedBackComponent) == 0x0008D0, "Member 'ABP_AnimalBase_Complete_C::BP_CatchingInsectFeedBackComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_Foliage_Interactor_Component) == 0x0008D8, "Member 'ABP_AnimalBase_Complete_C::BP_Foliage_Interactor_Component' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_CharacterBaseInfoComponent) == 0x0008E0, "Member 'ABP_AnimalBase_Complete_C::BP_CharacterBaseInfoComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, InteractionCollision) == 0x0008E8, "Member 'ABP_AnimalBase_Complete_C::InteractionCollision' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_HandleInteractionLogic) == 0x0008F0, "Member 'ABP_AnimalBase_Complete_C::BP_HandleInteractionLogic' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_InteractiveActorComponent) == 0x0008F8, "Member 'ABP_AnimalBase_Complete_C::BP_InteractiveActorComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_AIAgentComponent) == 0x000900, "Member 'ABP_AnimalBase_Complete_C::BP_AIAgentComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, X6CustomRootMotion) == 0x000908, "Member 'ABP_AnimalBase_Complete_C::X6CustomRootMotion' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_PlayerAnimStatesComponent) == 0x000910, "Member 'ABP_AnimalBase_Complete_C::BP_PlayerAnimStatesComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_SoundAndParticleComponent) == 0x000918, "Member 'ABP_AnimalBase_Complete_C::BP_SoundAndParticleComponent' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, BP_PlayerRegularMovementCompV3) == 0x000920, "Member 'ABP_AnimalBase_Complete_C::BP_PlayerRegularMovementCompV3' has a wrong offset!");
static_assert(offsetof(ABP_AnimalBase_Complete_C, AnimalTickManager) == 0x000928, "Member 'ABP_AnimalBase_Complete_C::AnimalTickManager' has a wrong offset!");

}

