#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIAgentComponent

#include "Basic.hpp"

#include "Enum_AgentAvoidanceSetting_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIAgentComponent.BP_AIAgentComponent_C
// 0x0008 (0x00B0 - 0x00A8)
class UBP_AIAgentComponent_C final : public UBP_X6ActorComponent_C
{
public:
	bool                                          bUsePathfinding;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverridePathfindingSignificance;                  // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESignificanceLevel                            PathfindingSignificanceLevel;                      // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_AgentAvoidanceSetting                    AvoidanceSetting;                                  // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_EnableNotifyEarlyReachGoal;                     // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_GetAgentSpawnAndEnterBattlePosition(struct FTransform* SpawnLocation, struct FTransform* EnterBattleLocation);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIAgentComponent_C">();
	}
	static class UBP_AIAgentComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIAgentComponent_C>();
	}
};
static_assert(alignof(UBP_AIAgentComponent_C) == 0x000008, "Wrong alignment on UBP_AIAgentComponent_C");
static_assert(sizeof(UBP_AIAgentComponent_C) == 0x0000B0, "Wrong size on UBP_AIAgentComponent_C");
static_assert(offsetof(UBP_AIAgentComponent_C, bUsePathfinding) == 0x0000A8, "Member 'UBP_AIAgentComponent_C::bUsePathfinding' has a wrong offset!");
static_assert(offsetof(UBP_AIAgentComponent_C, bOverridePathfindingSignificance) == 0x0000A9, "Member 'UBP_AIAgentComponent_C::bOverridePathfindingSignificance' has a wrong offset!");
static_assert(offsetof(UBP_AIAgentComponent_C, PathfindingSignificanceLevel) == 0x0000AA, "Member 'UBP_AIAgentComponent_C::PathfindingSignificanceLevel' has a wrong offset!");
static_assert(offsetof(UBP_AIAgentComponent_C, AvoidanceSetting) == 0x0000AB, "Member 'UBP_AIAgentComponent_C::AvoidanceSetting' has a wrong offset!");
static_assert(offsetof(UBP_AIAgentComponent_C, BP_EnableNotifyEarlyReachGoal) == 0x0000AC, "Member 'UBP_AIAgentComponent_C::BP_EnableNotifyEarlyReachGoal' has a wrong offset!");

}

