#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AdjustTransformComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AdjustTransformComponent.BP_AdjustTransformComponent_C.BP_DebugGetBase
// 0x0030 (0x0030 - 0x0000)
struct BP_AdjustTransformComponent_C_BP_DebugGetBase final
{
public:
	class AActor*                                 base;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdjustTransformComponent_C_BP_DebugGetBase) == 0x000008, "Wrong alignment on BP_AdjustTransformComponent_C_BP_DebugGetBase");
static_assert(sizeof(BP_AdjustTransformComponent_C_BP_DebugGetBase) == 0x000030, "Wrong size on BP_AdjustTransformComponent_C_BP_DebugGetBase");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugGetBase, base) == 0x000000, "Member 'BP_AdjustTransformComponent_C_BP_DebugGetBase::base' has a wrong offset!");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugGetBase, Temp_wildcard_Variable) == 0x000008, "Member 'BP_AdjustTransformComponent_C_BP_DebugGetBase::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugGetBase, CallFunc_GetAllActorsWithTag_OutActors) == 0x000010, "Member 'BP_AdjustTransformComponent_C_BP_DebugGetBase::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugGetBase, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AdjustTransformComponent_C_BP_DebugGetBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugGetBase, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'BP_AdjustTransformComponent_C_BP_DebugGetBase::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function BP_AdjustTransformComponent.BP_AdjustTransformComponent_C.BP_DebugRotation
// 0x0008 (0x0008 - 0x0000)
struct BP_AdjustTransformComponent_C_BP_DebugRotation final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdjustTransformComponent_C_BP_DebugRotation) == 0x000008, "Wrong alignment on BP_AdjustTransformComponent_C_BP_DebugRotation");
static_assert(sizeof(BP_AdjustTransformComponent_C_BP_DebugRotation) == 0x000008, "Wrong size on BP_AdjustTransformComponent_C_BP_DebugRotation");
static_assert(offsetof(BP_AdjustTransformComponent_C_BP_DebugRotation, Angle) == 0x000000, "Member 'BP_AdjustTransformComponent_C_BP_DebugRotation::Angle' has a wrong offset!");

// Function BP_AdjustTransformComponent.BP_AdjustTransformComponent_C.ExecuteUbergraph_BP_AdjustTransformComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent) == 0x000004, "Wrong alignment on BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent");
static_assert(sizeof(BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent) == 0x000008, "Wrong size on BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent");
static_assert(offsetof(BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent, EntryPoint) == 0x000000, "Member 'BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AdjustTransformComponent_C_ExecuteUbergraph_BP_AdjustTransformComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_AdjustTransformComponent.BP_AdjustTransformComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AdjustTransformComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdjustTransformComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AdjustTransformComponent_C_ReceiveTick");
static_assert(sizeof(BP_AdjustTransformComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_AdjustTransformComponent_C_ReceiveTick");
static_assert(offsetof(BP_AdjustTransformComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AdjustTransformComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AdjustTransformComponent.BP_AdjustTransformComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_AdjustTransformComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdjustTransformComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_AdjustTransformComponent_C_GetModuleName");
static_assert(sizeof(BP_AdjustTransformComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_AdjustTransformComponent_C_GetModuleName");
static_assert(offsetof(BP_AdjustTransformComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_AdjustTransformComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

