#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AdvancedCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AdvancedCamera.BP_AdvancedCamera_C
// 0x0020 (0x2D30 - 0x2D10)
class UBP_AdvancedCamera_C final : public UX6CameraComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2D10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BP_LerpDuration;                                   // 0x2D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_LerpTimeStep;                                   // 0x2D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_AddZoomedTargetOffsetZByReason(const class FString& ReasonName, double TargetOffsetZ);
	void BP_RemoveZoomedTargetOffsetZByReason(const class FString& ReasonName);
	void ExecuteUbergraph_BP_AdvancedCamera(int32 EntryPoint);
	void OnLookAtTargetBecomeViewTargetEvent();
	void OnLookAtTargetEndViewTargetEvent();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveUpdateLookAtTarget(const class AActor* OldLookAtTarget, const class AActor* NewLookAtTarget);
	void SetTargetPitch(double NewParam);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AdvancedCamera_C">();
	}
	static class UBP_AdvancedCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AdvancedCamera_C>();
	}
};
static_assert(alignof(UBP_AdvancedCamera_C) == 0x000010, "Wrong alignment on UBP_AdvancedCamera_C");
static_assert(sizeof(UBP_AdvancedCamera_C) == 0x002D30, "Wrong size on UBP_AdvancedCamera_C");
static_assert(offsetof(UBP_AdvancedCamera_C, UberGraphFrame) == 0x002D10, "Member 'UBP_AdvancedCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AdvancedCamera_C, BP_LerpDuration) == 0x002D18, "Member 'UBP_AdvancedCamera_C::BP_LerpDuration' has a wrong offset!");
static_assert(offsetof(UBP_AdvancedCamera_C, BP_LerpTimeStep) == 0x002D20, "Member 'UBP_AdvancedCamera_C::BP_LerpTimeStep' has a wrong offset!");

}

