#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimalBase_Complete

#include "Basic.hpp"

#include "F_AnimalKeeper_AnimalStatus_structs.hpp"
#include "ECharacterType_structs.hpp"
#include "E_Platform_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_MultiplatformMeshScale_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_AnimalBase_Complete_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterType                                CallFunc_BP_GetCharacterType_Type;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InsectVerticalShadow_C*             K2Node_DynamicCast_AsBP_Insect_Vertical_Shadow;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_UserConstructionScript");
static_assert(sizeof(BP_AnimalBase_Complete_C_UserConstructionScript) == 0x000038, "Wrong size on BP_AnimalBase_Complete_C_UserConstructionScript");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000000, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000010, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000014, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000015, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000016, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000017, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000018, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000019, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x00001A, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x00001B, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x00001C, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x00001D, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x00001E, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_BP_GetCharacterType_Type) == 0x00001F, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_BP_GetCharacterType_Type' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000021, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, K2Node_DynamicCast_AsBP_Insect_Vertical_Shadow) == 0x000028, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::K2Node_DynamicCast_AsBP_Insect_Vertical_Shadow' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_AnimalBase_Complete_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.ShouldRejectTickManagement
// 0x0001 (0x0001 - 0x0000)
struct BP_AnimalBase_Complete_C_ShouldRejectTickManagement final
{
public:
	bool                                          bReject;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_ShouldRejectTickManagement) == 0x000001, "Wrong alignment on BP_AnimalBase_Complete_C_ShouldRejectTickManagement");
static_assert(sizeof(BP_AnimalBase_Complete_C_ShouldRejectTickManagement) == 0x000001, "Wrong size on BP_AnimalBase_Complete_C_ShouldRejectTickManagement");
static_assert(offsetof(BP_AnimalBase_Complete_C_ShouldRejectTickManagement, bReject) == 0x000000, "Member 'BP_AnimalBase_Complete_C_ShouldRejectTickManagement::bReject' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.SetAnimalTickEnabled
// 0x0018 (0x0018 - 0x0000)
struct BP_AnimalBase_Complete_C_SetAnimalTickEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6CharacterMovementComponent*          K2Node_DynamicCast_AsX6Character_Movement_Component; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_X6_SetComponentTickEnabled_ReturnValue;   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_SetAnimalTickEnabled");
static_assert(sizeof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled) == 0x000018, "Wrong size on BP_AnimalBase_Complete_C_SetAnimalTickEnabled");
static_assert(offsetof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled, bEnabled) == 0x000000, "Member 'BP_AnimalBase_Complete_C_SetAnimalTickEnabled::bEnabled' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled, bSuccess) == 0x000001, "Member 'BP_AnimalBase_Complete_C_SetAnimalTickEnabled::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled, K2Node_DynamicCast_AsX6Character_Movement_Component) == 0x000008, "Member 'BP_AnimalBase_Complete_C_SetAnimalTickEnabled::K2Node_DynamicCast_AsX6Character_Movement_Component' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_AnimalBase_Complete_C_SetAnimalTickEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_SetAnimalTickEnabled, CallFunc_X6_SetComponentTickEnabled_ReturnValue) == 0x000011, "Member 'BP_AnimalBase_Complete_C_SetAnimalTickEnabled::CallFunc_X6_SetComponentTickEnabled_ReturnValue' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.GetCurrentPlatformActorMeshScale
// 0x0118 (0x0118 - 0x0000)
struct BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale final
{
public:
	int64                                         ConfigID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Platform                                    Temp_byte_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_MultiplatformMeshScale         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_MultiplatformMeshScale         CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0088(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Platform                                    Temp_byte_Variable_1;                              // 0x00E9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale");
static_assert(sizeof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale) == 0x000118, "Wrong size on BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, ConfigID) == 0x000000, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::ConfigID' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, Scale) == 0x000008, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::Scale' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, Temp_byte_Variable) == 0x000010, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000018, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000088, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000D8, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Map_Find_Value) == 0x0000E0, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Map_Find_ReturnValue) == 0x0000E8, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, Temp_byte_Variable_1) == 0x0000E9, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x0000F0, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000100, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Map_Find_Value_1) == 0x000108, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_Map_Find_ReturnValue_1) == 0x000110, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000111, "Member 'BP_AnimalBase_Complete_C_GetCurrentPlatformActorMeshScale::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.GetAnimalTickManager
// 0x0008 (0x0008 - 0x0000)
struct BP_AnimalBase_Complete_C_GetAnimalTickManager final
{
public:
	class UBP_AnimalTickManager_C*                AnimalTickManager_0;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_GetAnimalTickManager) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_GetAnimalTickManager");
static_assert(sizeof(BP_AnimalBase_Complete_C_GetAnimalTickManager) == 0x000008, "Wrong size on BP_AnimalBase_Complete_C_GetAnimalTickManager");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetAnimalTickManager, AnimalTickManager_0) == 0x000000, "Member 'BP_AnimalBase_Complete_C_GetAnimalTickManager::AnimalTickManager_0' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.GetAIObjectClass
// 0x0018 (0x0018 - 0x0000)
struct BP_AnimalBase_Complete_C_GetAIObjectClass final
{
public:
	class FString                                 LuaClassPath;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	ECharacterType                                CallFunc_BP_GetCharacterType_Type;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_GetAIObjectClass) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_GetAIObjectClass");
static_assert(sizeof(BP_AnimalBase_Complete_C_GetAIObjectClass) == 0x000018, "Wrong size on BP_AnimalBase_Complete_C_GetAIObjectClass");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetAIObjectClass, LuaClassPath) == 0x000000, "Member 'BP_AnimalBase_Complete_C_GetAIObjectClass::LuaClassPath' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetAIObjectClass, CallFunc_BP_GetCharacterType_Type) == 0x000010, "Member 'BP_AnimalBase_Complete_C_GetAIObjectClass::CallFunc_BP_GetCharacterType_Type' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetAIObjectClass, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_AnimalBase_Complete_C_GetAIObjectClass::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.ExecuteUbergraph_BP_AnimalBase_Complete
// 0x0140 (0x0140 - 0x0000)
struct BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetInteractiveActorConfigID_ConfigID;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterType                                CallFunc_BP_GetCharacterType_Type;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_AnimalKeeper_AnimalStatus           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x00D8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_BP_GetCharacterID_ID;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentPlatformActorMeshScale_Scale;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete");
static_assert(sizeof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete) == 0x000140, "Wrong size on BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, EntryPoint) == 0x000000, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_GetInteractiveActorConfigID_ConfigID) == 0x000008, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_GetInteractiveActorConfigID_ConfigID' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_BP_GetCharacterType_Type) == 0x000010, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_BP_GetCharacterType_Type' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000018, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_Conv_StringToName_ReturnValue) == 0x00002C, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000111, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_BP_GetCharacterID_ID) == 0x000118, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_BP_GetCharacterID_ID' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_GetCurrentPlatformActorMeshScale_Scale) == 0x000120, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_GetCurrentPlatformActorMeshScale_Scale' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000128, "Member 'BP_AnimalBase_Complete_C_ExecuteUbergraph_BP_AnimalBase_Complete::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.CreateAnimalTickManager
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimalBase_Complete_C_CreateAnimalTickManager final
{
public:
	class UBP_AnimalTickManager_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_CreateAnimalTickManager) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_CreateAnimalTickManager");
static_assert(sizeof(BP_AnimalBase_Complete_C_CreateAnimalTickManager) == 0x000010, "Wrong size on BP_AnimalBase_Complete_C_CreateAnimalTickManager");
static_assert(offsetof(BP_AnimalBase_Complete_C_CreateAnimalTickManager, CallFunc_SpawnObject_ReturnValue) == 0x000000, "Member 'BP_AnimalBase_Complete_C_CreateAnimalTickManager::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimalBase_Complete_C_CreateAnimalTickManager, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AnimalBase_Complete_C_CreateAnimalTickManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AnimalBase_Complete.BP_AnimalBase_Complete_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimalBase_Complete_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimalBase_Complete_C_GetModuleName) == 0x000008, "Wrong alignment on BP_AnimalBase_Complete_C_GetModuleName");
static_assert(sizeof(BP_AnimalBase_Complete_C_GetModuleName) == 0x000010, "Wrong size on BP_AnimalBase_Complete_C_GetModuleName");
static_assert(offsetof(BP_AnimalBase_Complete_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_AnimalBase_Complete_C_GetModuleName::ReturnValue' has a wrong offset!");

}

