#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimationSet_Nikki_InteractTemplate

#include "Basic.hpp"

#include "F_PerformanceTransitionInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "F_PerformanceStanceInfo_structs.hpp"
#include "F_PerformanceGestureInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimationSet_Nikki_InteractTemplate.BP_AnimationSet_Nikki_InteractTemplate_C
// 0x00F0 (0x0120 - 0x0030)
class UBP_AnimationSet_Nikki_InteractTemplate_C final : public UPrimaryDataAsset
{
public:
	TMap<struct FGameplayTag, struct FF_PerformanceStanceInfo> TagToStance;                          // 0x0030(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FF_PerformanceGestureInfo> TagToGesture;                        // 0x0080(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FF_PerformanceTransitionInfo> TagToTransition;                  // 0x00D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimationSet_Nikki_InteractTemplate_C">();
	}
	static class UBP_AnimationSet_Nikki_InteractTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimationSet_Nikki_InteractTemplate_C>();
	}
};
static_assert(alignof(UBP_AnimationSet_Nikki_InteractTemplate_C) == 0x000008, "Wrong alignment on UBP_AnimationSet_Nikki_InteractTemplate_C");
static_assert(sizeof(UBP_AnimationSet_Nikki_InteractTemplate_C) == 0x000120, "Wrong size on UBP_AnimationSet_Nikki_InteractTemplate_C");
static_assert(offsetof(UBP_AnimationSet_Nikki_InteractTemplate_C, TagToStance) == 0x000030, "Member 'UBP_AnimationSet_Nikki_InteractTemplate_C::TagToStance' has a wrong offset!");
static_assert(offsetof(UBP_AnimationSet_Nikki_InteractTemplate_C, TagToGesture) == 0x000080, "Member 'UBP_AnimationSet_Nikki_InteractTemplate_C::TagToGesture' has a wrong offset!");
static_assert(offsetof(UBP_AnimationSet_Nikki_InteractTemplate_C, TagToTransition) == 0x0000D0, "Member 'UBP_AnimationSet_Nikki_InteractTemplate_C::TagToTransition' has a wrong offset!");

}

