#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIAgentComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AIAgentComponent.BP_AIAgentComponent_C.BP_GetAgentSpawnAndEnterBattlePosition
// 0x00C0 (0x00C0 - 0x0000)
struct BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition final
{
public:
	struct FTransform                             SpawnLocation;                                     // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             EnterBattleLocation;                               // 0x0060(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition) == 0x000010, "Wrong alignment on BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition");
static_assert(sizeof(BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition) == 0x0000C0, "Wrong size on BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition");
static_assert(offsetof(BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition, SpawnLocation) == 0x000000, "Member 'BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition, EnterBattleLocation) == 0x000060, "Member 'BP_AIAgentComponent_C_BP_GetAgentSpawnAndEnterBattlePosition::EnterBattleLocation' has a wrong offset!");

// Function BP_AIAgentComponent.BP_AIAgentComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_AIAgentComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIAgentComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_AIAgentComponent_C_GetModuleName");
static_assert(sizeof(BP_AIAgentComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_AIAgentComponent_C_GetModuleName");
static_assert(offsetof(BP_AIAgentComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_AIAgentComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

