#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientConfigCameraVolumeActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.OnTargetActorEndOverlap
// 0x0048 (0x0048 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAdvancedCamera*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAdvancedCamera*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap) == 0x000048, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, InActor) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::InActor' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Map_Remove_ReturnValue) == 0x00002C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Map_Find_ReturnValue) == 0x000034, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorEndOverlap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.OnTargetActorBeginOverlap
// 0x0090 (0x0090 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAdvancedCamera*                        AdvancedCamera;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAdvancedCamera*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachedActorWithCollisionTag_ChildActor; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsComponentTickEnabled_ReturnValue;       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAdvancedCamera*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value;                           // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PushBaseCameraConfig_ReturnValue;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PushBaseCameraConfig_ReturnValue_1;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap) == 0x000090, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, InActor) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::InActor' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, AdvancedCamera) == 0x000008, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::AdvancedCamera' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_GetAttachedActorWithCollisionTag_ChildActor) == 0x000038, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_GetAttachedActorWithCollisionTag_ChildActor' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_GetCameraRotation_ReturnValue) == 0x000050, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_IsComponentTickEnabled_ReturnValue) == 0x00006C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_IsComponentTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_IsValid_ReturnValue_2) == 0x000079, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Map_Find_Value) == 0x00007C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_Map_Find_ReturnValue) == 0x000084, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_PushBaseCameraConfig_ReturnValue) == 0x000088, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_PushBaseCameraConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap, CallFunc_PushBaseCameraConfig_ReturnValue_1) == 0x00008C, "Member 'BP_AmbientConfigCameraVolumeActor_C_OnTargetActorBeginOverlap::CallFunc_PushBaseCameraConfig_ReturnValue_1' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor
// 0x0004 (0x0004 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor) == 0x000004, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor) == 0x000004, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor, EntryPoint) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_ExecuteUbergraph_BP_AmbientConfigCameraVolumeActor::EntryPoint' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.BP_RemoveCameraConfig
// 0x0010 (0x0010 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig final
{
public:
	class UAdvancedCamera*                        AdvancedCamera;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig) == 0x000010, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig, AdvancedCamera) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig::AdvancedCamera' has a wrong offset!");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig, Index_0) == 0x000008, "Member 'BP_AmbientConfigCameraVolumeActor_C_BP_RemoveCameraConfig::Index_0' has a wrong offset!");

// Function BP_AmbientConfigCameraVolumeActor.BP_AmbientConfigCameraVolumeActor_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_AmbientConfigCameraVolumeActor_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmbientConfigCameraVolumeActor_C_GetModuleName) == 0x000008, "Wrong alignment on BP_AmbientConfigCameraVolumeActor_C_GetModuleName");
static_assert(sizeof(BP_AmbientConfigCameraVolumeActor_C_GetModuleName) == 0x000010, "Wrong size on BP_AmbientConfigCameraVolumeActor_C_GetModuleName");
static_assert(offsetof(BP_AmbientConfigCameraVolumeActor_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_AmbientConfigCameraVolumeActor_C_GetModuleName::ReturnValue' has a wrong offset!");

}

