#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionPoint_TaskAnime_Template

#include "Basic.hpp"

#include "EActionPointPlaybackRule_structs.hpp"
#include "FActionPointStanceData_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionPoint_TaskAnime_Template.BP_ActionPoint_TaskAnime_Template_C
// 0x0020 (0x0050 - 0x0030)
class UBP_ActionPoint_TaskAnime_Template_C final : public UPrimaryDataAsset
{
public:
	EActionPointPlaybackRule                      AnimationPlaybackRule;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFActionPointStanceData>        List;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Duration;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActionPoint_TaskAnime_Template_C">();
	}
	static class UBP_ActionPoint_TaskAnime_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActionPoint_TaskAnime_Template_C>();
	}
};
static_assert(alignof(UBP_ActionPoint_TaskAnime_Template_C) == 0x000008, "Wrong alignment on UBP_ActionPoint_TaskAnime_Template_C");
static_assert(sizeof(UBP_ActionPoint_TaskAnime_Template_C) == 0x000050, "Wrong size on UBP_ActionPoint_TaskAnime_Template_C");
static_assert(offsetof(UBP_ActionPoint_TaskAnime_Template_C, AnimationPlaybackRule) == 0x000030, "Member 'UBP_ActionPoint_TaskAnime_Template_C::AnimationPlaybackRule' has a wrong offset!");
static_assert(offsetof(UBP_ActionPoint_TaskAnime_Template_C, List) == 0x000038, "Member 'UBP_ActionPoint_TaskAnime_Template_C::List' has a wrong offset!");
static_assert(offsetof(UBP_ActionPoint_TaskAnime_Template_C, Duration) == 0x000048, "Member 'UBP_ActionPoint_TaskAnime_Template_C::Duration' has a wrong offset!");

}

