#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BikeCantGetOffVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BikeCantGetOffVolume.BP_BikeCantGetOffVolume_C.ExecuteUbergraph_BP_BikeCantGetOffVolume
// 0x0008 (0x0008 - 0x0000)
struct BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume) == 0x000004, "Wrong alignment on BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume");
static_assert(sizeof(BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume) == 0x000008, "Wrong size on BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume");
static_assert(offsetof(BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume, EntryPoint) == 0x000000, "Member 'BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_BikeCantGetOffVolume_C_ExecuteUbergraph_BP_BikeCantGetOffVolume::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_BikeCantGetOffVolume.BP_BikeCantGetOffVolume_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BikeCantGetOffVolume_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BikeCantGetOffVolume_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BikeCantGetOffVolume_C_ReceiveEndPlay");
static_assert(sizeof(BP_BikeCantGetOffVolume_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BikeCantGetOffVolume_C_ReceiveEndPlay");
static_assert(offsetof(BP_BikeCantGetOffVolume_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BikeCantGetOffVolume_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BikeCantGetOffVolume.BP_BikeCantGetOffVolume_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_BikeCantGetOffVolume_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BikeCantGetOffVolume_C_GetModuleName) == 0x000008, "Wrong alignment on BP_BikeCantGetOffVolume_C_GetModuleName");
static_assert(sizeof(BP_BikeCantGetOffVolume_C_GetModuleName) == 0x000010, "Wrong size on BP_BikeCantGetOffVolume_C_GetModuleName");
static_assert(offsetof(BP_BikeCantGetOffVolume_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_BikeCantGetOffVolume_C_GetModuleName::ReturnValue' has a wrong offset!");

}

