#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuoyancyNoWaterComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BS_FluxBuoyancyPontoon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.DebugPontoons
// 0x01F0 (0x01F0 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_DebugPontoons final
{
public:
	struct FVector                                Sphere;                                            // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                Data;                                              // 0x0018(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x0080(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetOwnerMesh_Output_Get;                  // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0100(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                CallFunc_Array_Get_Item;                           // 0x0178(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast;      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_DebugPontoons) == 0x000010, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_DebugPontoons");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_DebugPontoons) == 0x0001F0, "Wrong size on BP_BuoyancyNoWaterComponent_C_DebugPontoons");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, Sphere) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::Sphere' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, Data) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::Data' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, Transform) == 0x000080, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::Transform' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, Temp_int_Array_Index_Variable) == 0x0000E0, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_GetOwnerMesh_Output_Get) == 0x0000F0, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_GetOwnerMesh_Output_Get' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000100, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_TransformLocation_ReturnValue) == 0x000160, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_Array_Get_Item) == 0x000178, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_DebugPontoons, CallFunc_DrawDebugSphere_Radius_ImplicitCast) == 0x0001E8, "Member 'BP_BuoyancyNoWaterComponent_C_DebugPontoons::CallFunc_DrawDebugSphere_Radius_ImplicitCast' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.ExecuteUbergraph_BP_BuoyancyNoWaterComponent
// 0x0238 (0x0238 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetOwnerMesh_Output_Get;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                CallFunc_Array_Get_Item;                           // 0x0050(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_FluxBuoyancyPontoon                CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                K2Node_MakeStruct_BS_FluxBuoyancyPontoon;          // 0x01D0(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent) == 0x000008, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent) == 0x000238, "Wrong size on BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, EntryPoint) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_GetOwnerMesh_Output_Get) == 0x000020, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_GetOwnerMesh_Output_Get' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_IsActive_ReturnValue) == 0x000028, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_BreakVector_X) == 0x0000D0, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x00015C, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, K2Node_Event_EndPlayReason) == 0x000170, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000180, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000188, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Sin_ReturnValue) == 0x000190, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000198, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_MakeVector_ReturnValue) == 0x0001A0, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B8, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent, K2Node_MakeStruct_BS_FluxBuoyancyPontoon) == 0x0001D0, "Member 'BP_BuoyancyNoWaterComponent_C_ExecuteUbergraph_BP_BuoyancyNoWaterComponent::K2Node_MakeStruct_BS_FluxBuoyancyPontoon' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.GetCapVolume
// 0x0048 (0x0048 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_GetCapVolume final
{
public:
	double                                        H;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        R;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        V;                                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPI_ReturnValue;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_GetCapVolume) == 0x000008, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_GetCapVolume");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_GetCapVolume) == 0x000048, "Wrong size on BP_BuoyancyNoWaterComponent_C_GetCapVolume");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, H) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::H' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, R) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::R' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, V) == 0x000010, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::V' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_GetPI_ReturnValue) == 0x000030, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetCapVolume, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000040, "Member 'BP_BuoyancyNoWaterComponent_C_GetCapVolume::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.GetSpghereUnderPlaneVolume
// 0x0068 (0x0068 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume final
{
public:
	double                                        Distance;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        V;                                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCapVolume_v;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCapVolume_v_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSphereVolume_v;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSphereVolume_v_1;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume) == 0x000008, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume) == 0x000068, "Wrong size on BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, Distance) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::Distance' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, Radius) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::Radius' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, V) == 0x000010, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::V' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_GetCapVolume_v) == 0x000020, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_GetCapVolume_v' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_GetCapVolume_v_1) == 0x000030, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_GetCapVolume_v_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_GetSphereVolume_v) == 0x000038, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_GetSphereVolume_v' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000049, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_GetSphereVolume_v_1) == 0x000058, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_GetSphereVolume_v_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'BP_BuoyancyNoWaterComponent_C_GetSpghereUnderPlaneVolume::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.GetSphereVolume
// 0x0020 (0x0020 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_GetSphereVolume final
{
public:
	double                                        R;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        V;                                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume) == 0x000008, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_GetSphereVolume");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume) == 0x000020, "Wrong size on BP_BuoyancyNoWaterComponent_C_GetSphereVolume");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume, R) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_GetSphereVolume::R' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume, V) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_GetSphereVolume::V' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_BuoyancyNoWaterComponent_C_GetSphereVolume::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetSphereVolume, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_GetSphereVolume::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_ReceiveTick");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_BuoyancyNoWaterComponent_C_ReceiveTick");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.UpdateBuoyancy
// 0x03B0 (0x03B0 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                BuoyancyData;                                      // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitPos;                                           // 0x0070(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForceDirection;                                    // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FluxBuoyancyPontoon                Data;                                              // 0x00A0(0x0068)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x0110(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VolumeInFluid;                                     // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue; // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsLinearVelocityAtPoint_ReturnValue; // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSpghereUnderPlaneVolume_v;             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0340(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawDebugSphere_Radius_ImplicitCast;      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy) == 0x000010, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy) == 0x0003B0, "Wrong size on BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, DeltaTime) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, BuoyancyData) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::BuoyancyData' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, InitPos) == 0x000070, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::InitPos' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, ForceDirection) == 0x000088, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::ForceDirection' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, Data) == 0x0000A0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::Data' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, Distance) == 0x000108, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::Distance' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, Transform) == 0x000110, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::Transform' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, VolumeInFluid) == 0x000170, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::VolumeInFluid' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, Location) == 0x000178, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::Location' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_NotEqual_NameName_ReturnValue) == 0x000190, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_IsValid_ReturnValue) == 0x000191, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue) == 0x000198, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_IsValid_ReturnValue_1) == 0x0001B1, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001B8, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001D0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0001D8, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_GetSocketTransform_ReturnValue) == 0x0001E0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_TransformLocation_ReturnValue) == 0x000240, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000258, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_GetPhysicsLinearVelocityAtPoint_ReturnValue) == 0x000260, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_GetPhysicsLinearVelocityAtPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_GetSpghereUnderPlaneVolume_v) == 0x000278, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_GetSpghereUnderPlaneVolume_v' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000280, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_TransformLocation_ReturnValue_1) == 0x000298, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0002B0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0002B8, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_X) == 0x0002D0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_Y) == 0x0002D8, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_Z) == 0x0002E0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_MakeVector_ReturnValue) == 0x0002E8, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_X_1) == 0x000300, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_Y_1) == 0x000308, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_BreakVector_Z_1) == 0x000310, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000318, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000330, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000340, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy, CallFunc_DrawDebugSphere_Radius_ImplicitCast) == 0x0003A0, "Member 'BP_BuoyancyNoWaterComponent_C_UpdateBuoyancy::CallFunc_DrawDebugSphere_Radius_ImplicitCast' has a wrong offset!");

// Function BP_BuoyancyNoWaterComponent.BP_BuoyancyNoWaterComponent_C.GetOwnerMesh
// 0x0050 (0x0050 - 0x0000)
struct BP_BuoyancyNoWaterComponent_C_GetOwnerMesh final
{
public:
	class UPrimitiveComponent*                    Output_Get;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    LocalMesh;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_GetComponentsByTag_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh) == 0x000008, "Wrong alignment on BP_BuoyancyNoWaterComponent_C_GetOwnerMesh");
static_assert(sizeof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh) == 0x000050, "Wrong size on BP_BuoyancyNoWaterComponent_C_GetOwnerMesh");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, Output_Get) == 0x000000, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::Output_Get' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, LocalMesh) == 0x000008, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::LocalMesh' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, CallFunc_GetComponentsByTag_ReturnValue) == 0x000018, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuoyancyNoWaterComponent_C_GetOwnerMesh, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_BuoyancyNoWaterComponent_C_GetOwnerMesh::CallFunc_Array_Get_Item' has a wrong offset!");
