#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BulletCollisionModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BulletCollisionModifier.BP_BulletCollisionModifier_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_BulletCollisionModifier_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BulletCollisionModifier_C_GetModuleName) == 0x000008, "Wrong alignment on BP_BulletCollisionModifier_C_GetModuleName");
static_assert(sizeof(BP_BulletCollisionModifier_C_GetModuleName) == 0x000010, "Wrong size on BP_BulletCollisionModifier_C_GetModuleName");
static_assert(offsetof(BP_BulletCollisionModifier_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_BulletCollisionModifier_C_GetModuleName::ReturnValue' has a wrong offset!");

// Function BP_BulletCollisionModifier.BP_BulletCollisionModifier_C.K2_ShouldDestroyByActor
// 0x0108 (0x0108 - 0x0000)
struct BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor) == 0x000008, "Wrong alignment on BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor");
static_assert(sizeof(BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor) == 0x000108, "Wrong size on BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor");
static_assert(offsetof(BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor, HitActor) == 0x000000, "Member 'BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor::HitActor' has a wrong offset!");
static_assert(offsetof(BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor, HitResult) == 0x000008, "Member 'BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor::HitResult' has a wrong offset!");
static_assert(offsetof(BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor, ReturnValue) == 0x000100, "Member 'BP_BulletCollisionModifier_C_K2_ShouldDestroyByActor::ReturnValue' has a wrong offset!");

}

