#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BulletCollisionModifier

#include "Basic.hpp"

#include "EnumBulletCompositionType_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BulletCollisionModifier.BP_BulletCollisionModifier_C
// 0x0010 (0x00E8 - 0x00D8)
class UBP_BulletCollisionModifier_C final : public UX6BulletCollisionModifier
{
public:
	class UBP_ShapeTraceDataAsset_C*              CollisionShape;                                    // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EnumBulletCompositionType                     CompositionType;                                   // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCollisionWaterDestroy;                            // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;
	void K2_AsyncLoadComplete() const;
	void K2_Destroy() const;
	void K2_Init() const;
	bool K2_ShouldDestroyByActor(class AActor* HitActor, const struct FHitResult& HitResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BulletCollisionModifier_C">();
	}
	static class UBP_BulletCollisionModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BulletCollisionModifier_C>();
	}
};
static_assert(alignof(UBP_BulletCollisionModifier_C) == 0x000008, "Wrong alignment on UBP_BulletCollisionModifier_C");
static_assert(sizeof(UBP_BulletCollisionModifier_C) == 0x0000E8, "Wrong size on UBP_BulletCollisionModifier_C");
static_assert(offsetof(UBP_BulletCollisionModifier_C, CollisionShape) == 0x0000D8, "Member 'UBP_BulletCollisionModifier_C::CollisionShape' has a wrong offset!");
static_assert(offsetof(UBP_BulletCollisionModifier_C, CompositionType) == 0x0000E0, "Member 'UBP_BulletCollisionModifier_C::CompositionType' has a wrong offset!");
static_assert(offsetof(UBP_BulletCollisionModifier_C, bCollisionWaterDestroy) == 0x0000E4, "Member 'UBP_BulletCollisionModifier_C::bCollisionWaterDestroy' has a wrong offset!");

}

