#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CheckpointObject_StarSea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CheckPointActorBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CheckpointObject_StarSea.BP_CheckpointObject_StarSea_C
// 0x00D8 (0x0598 - 0x04C0)
class ABP_CheckpointObject_StarSea_C final : public ABP_CheckPointActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CheckpointObject_StarSea_C;      // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NikkiStandSpherePreview;                           // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       RingBellSphere;                                    // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_FunengArea;                                     // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CommonActiveIdleEffect;                            // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LastActiveIdleEffect;                              // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NoActiveIdleEffect;                                // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   INT_Bldg_Column_11;                                // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   INT_Bldg_Column_11a;                               // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AudioTrigger;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      InteractionVolume;                                 // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 mesh;                                              // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RecoveryEffect;                                    // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PollutedIdleEffect;                                // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        RingBellRange;                                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          BP_LSEmpower;                                      // 0x0548(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           BP_ActiveSoundLp;                                  // 0x0570(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetIsLastActivate(bool opt);
	void SetIsActivate(bool opt);
	void ServerInit(bool bServer);
	void ExecuteUbergraph_BP_CheckpointObject_StarSea(int32 EntryPoint);
	void BP_UpdateEnergized(bool bEnergized);
	void BP_TestUnlock();
	void BP_TestLock();
	void BP_GetNiagaraPosition(double* Position);
	void BP_Empower(bool bDisplayFinal);
	void BndEvt__BP_CheckpointObject_SeaSnail_AudioTrigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CheckpointObject_StarSea_C">();
	}
	static class ABP_CheckpointObject_StarSea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CheckpointObject_StarSea_C>();
	}
};
static_assert(alignof(ABP_CheckpointObject_StarSea_C) == 0x000008, "Wrong alignment on ABP_CheckpointObject_StarSea_C");
static_assert(sizeof(ABP_CheckpointObject_StarSea_C) == 0x000598, "Wrong size on ABP_CheckpointObject_StarSea_C");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, UberGraphFrame_BP_CheckpointObject_StarSea_C) == 0x0004C0, "Member 'ABP_CheckpointObject_StarSea_C::UberGraphFrame_BP_CheckpointObject_StarSea_C' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, Arrow1) == 0x0004C8, "Member 'ABP_CheckpointObject_StarSea_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, Arrow) == 0x0004D0, "Member 'ABP_CheckpointObject_StarSea_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, NikkiStandSpherePreview) == 0x0004D8, "Member 'ABP_CheckpointObject_StarSea_C::NikkiStandSpherePreview' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, RingBellSphere) == 0x0004E0, "Member 'ABP_CheckpointObject_StarSea_C::RingBellSphere' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, NS_FunengArea) == 0x0004E8, "Member 'ABP_CheckpointObject_StarSea_C::NS_FunengArea' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, CommonActiveIdleEffect) == 0x0004F0, "Member 'ABP_CheckpointObject_StarSea_C::CommonActiveIdleEffect' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, LastActiveIdleEffect) == 0x0004F8, "Member 'ABP_CheckpointObject_StarSea_C::LastActiveIdleEffect' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, NoActiveIdleEffect) == 0x000500, "Member 'ABP_CheckpointObject_StarSea_C::NoActiveIdleEffect' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, INT_Bldg_Column_11) == 0x000508, "Member 'ABP_CheckpointObject_StarSea_C::INT_Bldg_Column_11' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, INT_Bldg_Column_11a) == 0x000510, "Member 'ABP_CheckpointObject_StarSea_C::INT_Bldg_Column_11a' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, AudioTrigger) == 0x000518, "Member 'ABP_CheckpointObject_StarSea_C::AudioTrigger' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, InteractionVolume) == 0x000520, "Member 'ABP_CheckpointObject_StarSea_C::InteractionVolume' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, mesh) == 0x000528, "Member 'ABP_CheckpointObject_StarSea_C::mesh' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, RecoveryEffect) == 0x000530, "Member 'ABP_CheckpointObject_StarSea_C::RecoveryEffect' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, PollutedIdleEffect) == 0x000538, "Member 'ABP_CheckpointObject_StarSea_C::PollutedIdleEffect' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, RingBellRange) == 0x000540, "Member 'ABP_CheckpointObject_StarSea_C::RingBellRange' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, BP_LSEmpower) == 0x000548, "Member 'ABP_CheckpointObject_StarSea_C::BP_LSEmpower' has a wrong offset!");
static_assert(offsetof(ABP_CheckpointObject_StarSea_C, BP_ActiveSoundLp) == 0x000570, "Member 'ABP_CheckpointObject_StarSea_C::BP_ActiveSoundLp' has a wrong offset!");

}

