#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombatCameraSynchronizer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CombatCameraSynchronizer.BP_CombatCameraSynchronizer_C.ExecuteUbergraph_BP_CombatCameraSynchronizer
// 0x0010 (0x0010 - 0x0000)
struct BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAdvancedCamera*                        K2Node_Event_InOwnerAdvancedCamera;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer) == 0x000008, "Wrong alignment on BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer");
static_assert(sizeof(BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer) == 0x000010, "Wrong size on BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer");
static_assert(offsetof(BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer, EntryPoint) == 0x000000, "Member 'BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer, K2Node_Event_InOwnerAdvancedCamera) == 0x000008, "Member 'BP_CombatCameraSynchronizer_C_ExecuteUbergraph_BP_CombatCameraSynchronizer::K2Node_Event_InOwnerAdvancedCamera' has a wrong offset!");

// Function BP_CombatCameraSynchronizer.BP_CombatCameraSynchronizer_C.ReceiveInit
// 0x0008 (0x0008 - 0x0000)
struct BP_CombatCameraSynchronizer_C_ReceiveInit final
{
public:
	class UAdvancedCamera*                        InOwnerAdvancedCamera;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatCameraSynchronizer_C_ReceiveInit) == 0x000008, "Wrong alignment on BP_CombatCameraSynchronizer_C_ReceiveInit");
static_assert(sizeof(BP_CombatCameraSynchronizer_C_ReceiveInit) == 0x000008, "Wrong size on BP_CombatCameraSynchronizer_C_ReceiveInit");
static_assert(offsetof(BP_CombatCameraSynchronizer_C_ReceiveInit, InOwnerAdvancedCamera) == 0x000000, "Member 'BP_CombatCameraSynchronizer_C_ReceiveInit::InOwnerAdvancedCamera' has a wrong offset!");

// Function BP_CombatCameraSynchronizer.BP_CombatCameraSynchronizer_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_CombatCameraSynchronizer_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatCameraSynchronizer_C_GetModuleName) == 0x000008, "Wrong alignment on BP_CombatCameraSynchronizer_C_GetModuleName");
static_assert(sizeof(BP_CombatCameraSynchronizer_C_GetModuleName) == 0x000010, "Wrong size on BP_CombatCameraSynchronizer_C_GetModuleName");
static_assert(offsetof(BP_CombatCameraSynchronizer_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_CombatCameraSynchronizer_C_GetModuleName::ReturnValue' has a wrong offset!");

}

