#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombatPartHitComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CombatPartHitComponent.BP_CombatPartHitComponent_C.ExecuteUbergraph_BP_CombatPartHitComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent) == 0x000004, "Wrong alignment on BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent");
static_assert(sizeof(BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent) == 0x000004, "Wrong size on BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent");
static_assert(offsetof(BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent, EntryPoint) == 0x000000, "Member 'BP_CombatPartHitComponent_C_ExecuteUbergraph_BP_CombatPartHitComponent::EntryPoint' has a wrong offset!");

// Function BP_CombatPartHitComponent.BP_CombatPartHitComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_CombatPartHitComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPartHitComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_CombatPartHitComponent_C_GetModuleName");
static_assert(sizeof(BP_CombatPartHitComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_CombatPartHitComponent_C_GetModuleName");
static_assert(offsetof(BP_CombatPartHitComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_CombatPartHitComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

