#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraAndForceShakeConfigTemplate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraAndForceShakeConfigTemplate.BP_CameraAndForceShakeConfigTemplate_C
// 0x0058 (0x0088 - 0x0030)
class UBP_CameraAndForceShakeConfigTemplate_C final : public UPrimaryDataAsset
{
public:
	class UClass*                                 CameraConfig;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ECameraShakeAttenuation                       CameraAttenuation;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackAttenuation*              ForceAttenuationSettings;                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedBackEffectConfig;                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAttenuationDistanceModel                     ForceAttenuation;                                  // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraInnerRadius;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraOuterRadius;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraModifier;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceInnerRadius;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceOuterRadius;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceModifier;                                     // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CameraAndForceShakeConfigTemplate_C">();
	}
	static class UBP_CameraAndForceShakeConfigTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraAndForceShakeConfigTemplate_C>();
	}
};
static_assert(alignof(UBP_CameraAndForceShakeConfigTemplate_C) == 0x000008, "Wrong alignment on UBP_CameraAndForceShakeConfigTemplate_C");
static_assert(sizeof(UBP_CameraAndForceShakeConfigTemplate_C) == 0x000088, "Wrong size on UBP_CameraAndForceShakeConfigTemplate_C");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, CameraConfig) == 0x000030, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::CameraConfig' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, CameraAttenuation) == 0x000038, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::CameraAttenuation' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceAttenuationSettings) == 0x000040, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceAttenuationSettings' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceFeedBackEffectConfig) == 0x000048, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceFeedBackEffectConfig' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceAttenuation) == 0x000050, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceAttenuation' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, CameraInnerRadius) == 0x000058, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::CameraInnerRadius' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, CameraOuterRadius) == 0x000060, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::CameraOuterRadius' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, CameraModifier) == 0x000068, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::CameraModifier' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceInnerRadius) == 0x000070, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceInnerRadius' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceOuterRadius) == 0x000078, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceOuterRadius' has a wrong offset!");
static_assert(offsetof(UBP_CameraAndForceShakeConfigTemplate_C, ForceModifier) == 0x000080, "Member 'UBP_CameraAndForceShakeConfigTemplate_C::ForceModifier' has a wrong offset!");

}

