#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudMask_Object

#include "Basic.hpp"

#include "CloudNoiseSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "CloudObjectType0_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloudMask_Object.BP_CloudMask_Object_C
// 0x0090 (0x0438 - 0x03A8)
class ABP_CloudMask_Object_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SpriteIron;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PrviewMesh;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Static_Mesh;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Cloud_Material;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Cloud_Mask;                                        // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Density;                                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mip_Level;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCloudNoiseSettings                    Noise_Settings;                                    // 0x03E8(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RGBHeightMask;                                     // 0x03F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        alpha;                                             // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Debug_Plane;                                  // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CloudMaskGenerator_C*               Generator;                                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ECloudObjectType0                             Draw_Type;                                         // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construction_Cloud();
	void Delete_Cloud();
	void Initialize();
	void Update_Mask_Generator();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CloudMask_Object_C">();
	}
	static class ABP_CloudMask_Object_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloudMask_Object_C>();
	}
};
static_assert(alignof(ABP_CloudMask_Object_C) == 0x000008, "Wrong alignment on ABP_CloudMask_Object_C");
static_assert(sizeof(ABP_CloudMask_Object_C) == 0x000438, "Wrong size on ABP_CloudMask_Object_C");
static_assert(offsetof(ABP_CloudMask_Object_C, SpriteIron) == 0x0003A8, "Member 'ABP_CloudMask_Object_C::SpriteIron' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, PrviewMesh) == 0x0003B0, "Member 'ABP_CloudMask_Object_C::PrviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, DefaultSceneRoot) == 0x0003B8, "Member 'ABP_CloudMask_Object_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Static_Mesh) == 0x0003C0, "Member 'ABP_CloudMask_Object_C::Static_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Cloud_Material) == 0x0003C8, "Member 'ABP_CloudMask_Object_C::Cloud_Material' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Cloud_Mask) == 0x0003D0, "Member 'ABP_CloudMask_Object_C::Cloud_Mask' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Density) == 0x0003D8, "Member 'ABP_CloudMask_Object_C::Density' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Mip_Level) == 0x0003E0, "Member 'ABP_CloudMask_Object_C::Mip_Level' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Noise_Settings) == 0x0003E8, "Member 'ABP_CloudMask_Object_C::Noise_Settings' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, RGBHeightMask) == 0x0003F8, "Member 'ABP_CloudMask_Object_C::RGBHeightMask' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, alpha) == 0x000410, "Member 'ABP_CloudMask_Object_C::alpha' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Show_Debug_Plane) == 0x000418, "Member 'ABP_CloudMask_Object_C::Show_Debug_Plane' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Mid) == 0x000420, "Member 'ABP_CloudMask_Object_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Generator) == 0x000428, "Member 'ABP_CloudMask_Object_C::Generator' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Draw_Type) == 0x000430, "Member 'ABP_CloudMask_Object_C::Draw_Type' has a wrong offset!");
static_assert(offsetof(ABP_CloudMask_Object_C, Index_0) == 0x000434, "Member 'ABP_CloudMask_Object_C::Index_0' has a wrong offset!");

}

