#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudMaskGenerator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.Add Cloud Into Control
// 0x0030 (0x0030 - 0x0000)
struct BP_CloudMaskGenerator_C_Add_Cloud_Into_Control final
{
public:
	class ABP_CloudMask_Object_C*                 Cloud_Mask;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CloudMask_Object_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_Add_Cloud_Into_Control");
static_assert(sizeof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control) == 0x000030, "Wrong size on BP_CloudMaskGenerator_C_Add_Cloud_Into_Control");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, Cloud_Mask) == 0x000000, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::Cloud_Mask' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Add_Cloud_Into_Control, CallFunc_Min_ReturnValue) == 0x00002C, "Member 'BP_CloudMaskGenerator_C_Add_Cloud_Into_Control::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.Cloud Layer Top and Bottom World Height
// 0x0060 (0x0060 - 0x0000)
struct BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height final
{
public:
	double                                        Bottom_World_Height;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Top_World_Height;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height");
static_assert(sizeof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height) == 0x000060, "Wrong size on BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, Bottom_World_Height) == 0x000000, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::Bottom_World_Height' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, Top_World_Height) == 0x000008, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::Top_World_Height' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_CloudMaskGenerator_C_Cloud_Layer_Top_and_Bottom_World_Height::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.Delete All
// 0x0030 (0x0030 - 0x0000)
struct BP_CloudMaskGenerator_C_Delete_All final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CloudMask_Object_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class ABP_CloudMask_Object_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_Delete_All) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_Delete_All");
static_assert(sizeof(BP_CloudMaskGenerator_C_Delete_All) == 0x000030, "Wrong size on BP_CloudMaskGenerator_C_Delete_All");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CloudMaskGenerator_C_Delete_All::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CloudMaskGenerator_C_Delete_All::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CloudMaskGenerator_C_Delete_All::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_CloudMaskGenerator_C_Delete_All::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_CloudMaskGenerator_C_Delete_All::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_CloudMaskGenerator_C_Delete_All::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Delete_All, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_CloudMaskGenerator_C_Delete_All::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.ExecuteUbergraph_BP_CloudMaskGenerator
// 0x0020 (0x0020 - 0x0000)
struct BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator");
static_assert(sizeof(BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator) == 0x000020, "Wrong size on BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator");
static_assert(offsetof(BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator, EntryPoint) == 0x000000, "Member 'BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator, CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue) == 0x000018, "Member 'BP_CloudMaskGenerator_C_ExecuteUbergraph_BP_CloudMaskGenerator::CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.IniVolumetricCloudAndSkyAtmosphere
// 0x0030 (0x0030 - 0x0000)
struct BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere final
{
public:
	double                                        CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Bottom_World_Height; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Top_World_Height; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Base_Cloud_Height_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere");
static_assert(sizeof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere) == 0x000030, "Wrong size on BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Bottom_World_Height) == 0x000000, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Bottom_World_Height' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Top_World_Height) == 0x000008, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::CallFunc_Cloud_Layer_Top_and_Bottom_World_Height_Top_World_Height' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000018, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere, K2Node_VariableSet_Base_Cloud_Height_ImplicitCast) == 0x000028, "Member 'BP_CloudMaskGenerator_C_IniVolumetricCloudAndSkyAtmosphere::K2Node_VariableSet_Base_Cloud_Height_ImplicitCast' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.Remove Cloud
// 0x0018 (0x0018 - 0x0000)
struct BP_CloudMaskGenerator_C_Remove_Cloud final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CloudMask_Object_C*                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CloudMask_Object_C*                 CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_Remove_Cloud) == 0x000008, "Wrong alignment on BP_CloudMaskGenerator_C_Remove_Cloud");
static_assert(sizeof(BP_CloudMaskGenerator_C_Remove_Cloud) == 0x000018, "Wrong size on BP_CloudMaskGenerator_C_Remove_Cloud");
static_assert(offsetof(BP_CloudMaskGenerator_C_Remove_Cloud, Index_0) == 0x000000, "Member 'BP_CloudMaskGenerator_C_Remove_Cloud::Index_0' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Remove_Cloud, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'BP_CloudMaskGenerator_C_Remove_Cloud::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Remove_Cloud, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_CloudMaskGenerator_C_Remove_Cloud::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Remove_Cloud, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'BP_CloudMaskGenerator_C_Remove_Cloud::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BP_CloudMaskGenerator.BP_CloudMaskGenerator_C.Render Clouds
// 0x0540 (0x0540 - 0x0000)
struct BP_CloudMaskGenerator_C_Render_Clouds final
{
public:
	TArray<struct FVector2D>                      Offsets;                                           // 0x0000(0x0010)(Edit, BlueprintVisible)
	double                                        Yaw;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RT_Screen_Size;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RT_Screen_Pos;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Normalized_Location;                               // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_3;      // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue_1;    // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_2;  // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default;                             // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default_1;                           // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_Select_Default_2;                           // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_5;           // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_3;  // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_6;           // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_7;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0448(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0460(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0470(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_4;  // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1;   // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_1;     // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_1;  // 0x04C0(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D3[0x5];                                      // 0x04D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CloudMask_Object_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x04D8(0x0010)(ReferenceParm)
	class ABP_CloudMask_Object_C*                 CallFunc_Array_Get_Item_1;                         // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2[0x2];                                      // 0x04F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Yaw_ImplicitCast;               // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_DrawMaterial_Rotation_ImplicitCast;    // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_DrawMaterial_Rotation_ImplicitCast_1;  // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CloudMaskGenerator_C_Render_Clouds) == 0x000010, "Wrong alignment on BP_CloudMaskGenerator_C_Render_Clouds");
static_assert(sizeof(BP_CloudMaskGenerator_C_Render_Clouds) == 0x000540, "Wrong size on BP_CloudMaskGenerator_C_Render_Clouds");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Offsets) == 0x000000, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Offsets' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Yaw) == 0x000010, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Yaw' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, RT_Screen_Size) == 0x000018, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::RT_Screen_Size' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, RT_Screen_Pos) == 0x000028, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::RT_Screen_Pos' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Size) == 0x000038, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Size' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Normalized_Location) == 0x000048, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Normalized_Location' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, idx) == 0x000058, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::idx' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, K2Node_MakeArray_Array) == 0x000060, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_bool_Variable) == 0x000088, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_int_Array_Index_Variable) == 0x000094, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_bool_Variable_1) == 0x000098, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_GetActorScale3D_ReturnValue) == 0x000100, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakTransform_Location) == 0x000118, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakTransform_Rotation) == 0x000130, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakTransform_Scale) == 0x000148, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000160, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0001E0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_InverseTransformLocation_ReturnValue) == 0x000208, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000220, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000228, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000240, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000250, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000258, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000268, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000270, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_MakeVector2D_ReturnValue) == 0x000280, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000290, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x0002A8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Add_VectorFloat_ReturnValue) == 0x0002B8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x0002D0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0002E0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0002E8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_MakeVector2D_ReturnValue_1) == 0x0002F0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DVector2D_ReturnValue_1) == 0x000300, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000310, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000328, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000338, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_VectorToVector2D_ReturnValue_3) == 0x000350, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_VectorToVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Divide_Vector2DVector2D_ReturnValue_1) == 0x000360, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Divide_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000370, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DVector2D_ReturnValue_2) == 0x000388, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakRotator_Roll) == 0x000398, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakRotator_Pitch) == 0x00039C, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BreakRotator_Yaw) == 0x0003A0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_bool_Variable_2) == 0x0003A4, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, Temp_int_Array_Index_Variable_1) == 0x0003A8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue) == 0x0003AC, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Percent_IntInt_ReturnValue) == 0x0003B0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0003B4, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, K2Node_Select_Default) == 0x0003B8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0003C0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003C4, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, K2Node_Select_Default_1) == 0x0003C8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, K2Node_Select_Default_2) == 0x0003D0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Array_Get_Item) == 0x0003D8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0003E8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_5) == 0x0003F0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Array_Length_ReturnValue) == 0x0003F8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_MakeVector2D_ReturnValue_2) == 0x000400, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Less_IntInt_ReturnValue) == 0x000410, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DVector2D_ReturnValue_3) == 0x000418, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000428, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_6) == 0x000438, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Conv_IntToDouble_ReturnValue_7) == 0x000440, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Conv_IntToDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_MakeVector2D_ReturnValue_3) == 0x000448, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000458, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000460, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000470, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Multiply_Vector2DVector2D_ReturnValue_4) == 0x000480, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Multiply_Vector2DVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000490, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue_1) == 0x0004A0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue_2) == 0x0004A1, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1) == 0x0004A8, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Size_1) == 0x0004B0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Size_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_BeginDrawCanvasToRenderTarget_Context_1) == 0x0004C0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_BeginDrawCanvasToRenderTarget_Context_1' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue_3) == 0x0004D0, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue_4) == 0x0004D1, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CloudMaskGenerator_C_Render_Clouds, CallFunc_IsValid_ReturnValue_5) == 0x0004D2, "Member 'BP_CloudMaskGenerator_C_Render_Clouds::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
