#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombatPerformanceProcessorComponent

#include "Basic.hpp"

#include "EHitReason_structs.hpp"
#include "EFeedBackReason_structs.hpp"


namespace SDK::Params
{

// Function BP_CombatPerformanceProcessorComponent.BP_CombatPerformanceProcessorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CombatPerformanceProcessorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPerformanceProcessorComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CombatPerformanceProcessorComponent_C_ReceiveTick");
static_assert(sizeof(BP_CombatPerformanceProcessorComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_CombatPerformanceProcessorComponent_C_ReceiveTick");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CombatPerformanceProcessorComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CombatPerformanceProcessorComponent.BP_CombatPerformanceProcessorComponent_C.ExecuteUbergraph_BP_CombatPerformanceProcessorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent) == 0x000004, "Wrong alignment on BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent");
static_assert(sizeof(BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent) == 0x000008, "Wrong size on BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent, EntryPoint) == 0x000000, "Member 'BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CombatPerformanceProcessorComponent_C_ExecuteUbergraph_BP_CombatPerformanceProcessorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_CombatPerformanceProcessorComponent.BP_CombatPerformanceProcessorComponent_C.BP_PreEnterBattleInLS
// 0x0002 (0x0002 - 0x0000)
struct BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS final
{
public:
	bool                                          bAddBattleTag;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddBattleState;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS) == 0x000001, "Wrong alignment on BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS");
static_assert(sizeof(BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS) == 0x000002, "Wrong size on BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS, bAddBattleTag) == 0x000000, "Member 'BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS::bAddBattleTag' has a wrong offset!");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS, bAddBattleState) == 0x000001, "Member 'BP_CombatPerformanceProcessorComponent_C_BP_PreEnterBattleInLS::bAddBattleState' has a wrong offset!");

// Function BP_CombatPerformanceProcessorComponent.BP_CombatPerformanceProcessorComponent_C.K2_GetABPConfigs
// 0x0008 (0x0008 - 0x0000)
struct BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs final
{
public:
	class UDataAsset*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs) == 0x000008, "Wrong alignment on BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs");
static_assert(sizeof(BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs) == 0x000008, "Wrong size on BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs, ReturnValue) == 0x000000, "Member 'BP_CombatPerformanceProcessorComponent_C_K2_GetABPConfigs::ReturnValue' has a wrong offset!");

// Function BP_CombatPerformanceProcessorComponent.BP_CombatPerformanceProcessorComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_CombatPerformanceProcessorComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CombatPerformanceProcessorComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_CombatPerformanceProcessorComponent_C_GetModuleName");
static_assert(sizeof(BP_CombatPerformanceProcessorComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_CombatPerformanceProcessorComponent_C_GetModuleName");
static_assert(offsetof(BP_CombatPerformanceProcessorComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_CombatPerformanceProcessorComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

