#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_EffectConfig_Template

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "F_Character_MaterialEffectBySuitMap_structs.hpp"
#include "F_Character_ParticleEffectBySuitMap_structs.hpp"
#include "F_CharacterEffectList_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Character_EffectConfig_Template.BP_Character_EffectConfig_Template_C
// 0x00F0 (0x0120 - 0x0030)
class UBP_Character_EffectConfig_Template_C final : public UPrimaryDataAsset
{
public:
	TMap<struct FGameplayTag, struct FF_Character_ParticleEffectBySuitMap> CharacterParticleEffectConfigMap; // 0x0030(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMap<struct FGameplayTag, struct FF_Character_MaterialEffectBySuitMap> CharacterMaterialEffectConfigMap; // 0x0080(0x0050)(Edit, BlueprintVisible)
	TMap<int32, struct FF_CharacterEffectList>    CharacterEffectPreLoadPerSuit;                     // 0x00D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Character_EffectConfig_Template_C">();
	}
	static class UBP_Character_EffectConfig_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Character_EffectConfig_Template_C>();
	}
};
static_assert(alignof(UBP_Character_EffectConfig_Template_C) == 0x000008, "Wrong alignment on UBP_Character_EffectConfig_Template_C");
static_assert(sizeof(UBP_Character_EffectConfig_Template_C) == 0x000120, "Wrong size on UBP_Character_EffectConfig_Template_C");
static_assert(offsetof(UBP_Character_EffectConfig_Template_C, CharacterParticleEffectConfigMap) == 0x000030, "Member 'UBP_Character_EffectConfig_Template_C::CharacterParticleEffectConfigMap' has a wrong offset!");
static_assert(offsetof(UBP_Character_EffectConfig_Template_C, CharacterMaterialEffectConfigMap) == 0x000080, "Member 'UBP_Character_EffectConfig_Template_C::CharacterMaterialEffectConfigMap' has a wrong offset!");
static_assert(offsetof(UBP_Character_EffectConfig_Template_C, CharacterEffectPreLoadPerSuit) == 0x0000D0, "Member 'UBP_Character_EffectConfig_Template_C::CharacterEffectPreLoadPerSuit' has a wrong offset!");

}

