#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombatCharSkillOpComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ESkillInputType_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CombatCharSkillOpComp.BP_CombatCharSkillOpComp_C
// 0x00D0 (0x0188 - 0x00B8)
class UBP_CombatCharSkillOpComp_C final : public UX6CombatComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UX6AbilitySet>           BP_AbilitySet;                                     // 0x00C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<ESkillInputType, int32>                  BP_InputToSkillMap;                                // 0x00E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ESkillInputType, struct FGameplayTag>    BP_InputTagMap;                                    // 0x0138(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_CombatCharSkillOpComp(int32 EntryPoint);
	void BP_ResetOverrideInputTagByInputType(ESkillInputType InSkillInputType);
	void BP_ResetOverrideInputTag();
	void BP_OverrideSkillIDByInputType(ESkillInputType InSkillInputType, int32 InSkillID);
	void BP_OverrideInputTagByInputType(ESkillInputType InSkillInputType, const struct FGameplayTag& InputTag);
	void BP_OverrideAbilityClassByInputType(ESkillInputType InSkillInputType, class UClass* AbilityClass);
	void BP_EnableSkillIDOverride(bool Enable);
	void BP_EnableInputTagOverride();
	void BP_ClearAbilityHandle();
	void BP_CastSkillByAbilityCls(TSoftClassPtr<class UClass> AbilityCls);
	void BP_CastSkill(int32 skillID, const struct FVector& HitDir, int64 TargetId);
	void BP_CancelSkill();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CombatCharSkillOpComp_C">();
	}
	static class UBP_CombatCharSkillOpComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CombatCharSkillOpComp_C>();
	}
};
static_assert(alignof(UBP_CombatCharSkillOpComp_C) == 0x000008, "Wrong alignment on UBP_CombatCharSkillOpComp_C");
static_assert(sizeof(UBP_CombatCharSkillOpComp_C) == 0x000188, "Wrong size on UBP_CombatCharSkillOpComp_C");
static_assert(offsetof(UBP_CombatCharSkillOpComp_C, UberGraphFrame) == 0x0000B8, "Member 'UBP_CombatCharSkillOpComp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CombatCharSkillOpComp_C, BP_AbilitySet) == 0x0000C0, "Member 'UBP_CombatCharSkillOpComp_C::BP_AbilitySet' has a wrong offset!");
static_assert(offsetof(UBP_CombatCharSkillOpComp_C, BP_InputToSkillMap) == 0x0000E8, "Member 'UBP_CombatCharSkillOpComp_C::BP_InputToSkillMap' has a wrong offset!");
static_assert(offsetof(UBP_CombatCharSkillOpComp_C, BP_InputTagMap) == 0x000138, "Member 'UBP_CombatCharSkillOpComp_C::BP_InputTagMap' has a wrong offset!");

}

