#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CLFS_Mgr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_FaculaBrush_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_Lighter_structs.hpp"


namespace SDK::Params
{

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.ConstructDirMaterial
// 0x00C0 (0x00C0 - 0x0000)
struct BP_CLFS_Mgr_C_ConstructDirMaterial final
{
public:
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 Temp_softobject_Variable;                          // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 Temp_softobject_Variable_1;                        // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0080(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_ConstructDirMaterial) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_ConstructDirMaterial");
static_assert(sizeof(BP_CLFS_Mgr_C_ConstructDirMaterial) == 0x0000C0, "Wrong size on BP_CLFS_Mgr_C_ConstructDirMaterial");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000000, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000011, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000012, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, Temp_softobject_Variable) == 0x000018, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, Temp_softobject_Variable_1) == 0x000048, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, Temp_bool_Variable) == 0x000070, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, K2Node_Select_Default) == 0x000080, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000A8, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x0000B0, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ConstructDirMaterial, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_CLFS_Mgr_C_ConstructDirMaterial::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.DrawLighter
// 0x01F0 (0x01F0 - 0x0000)
struct BP_CLFS_Mgr_C_DrawLighter final
{
public:
	class UTextureRenderTarget2D*                 TextureRenderTarget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_Lighter                             S_Lighter;                                         // 0x0008(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	double                                        RTSize;                                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SquareWidth;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BrushIntensity;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0070(0x0010)(NoDestructor)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_LinearColorFloat_B_ImplicitCast; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_DrawLighter) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_DrawLighter");
static_assert(sizeof(BP_CLFS_Mgr_C_DrawLighter) == 0x0001F0, "Wrong size on BP_CLFS_Mgr_C_DrawLighter");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, TextureRenderTarget) == 0x000000, "Member 'BP_CLFS_Mgr_C_DrawLighter::TextureRenderTarget' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, S_Lighter) == 0x000008, "Member 'BP_CLFS_Mgr_C_DrawLighter::S_Lighter' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, RTSize) == 0x000040, "Member 'BP_CLFS_Mgr_C_DrawLighter::RTSize' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, SquareWidth) == 0x000048, "Member 'BP_CLFS_Mgr_C_DrawLighter::SquareWidth' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, BrushIntensity) == 0x000050, "Member 'BP_CLFS_Mgr_C_DrawLighter::BrushIntensity' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000058, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000060, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000070, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000080, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector2D_X) == 0x000090, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, K2Node_MakeStruct_LinearColor) == 0x0000A0, "Member 'BP_CLFS_Mgr_C_DrawLighter::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x0000B8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, Temp_bool_Variable) == 0x0000D0, "Member 'BP_CLFS_Mgr_C_DrawLighter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x0000F0, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000100, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000118, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000120, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000138, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000140, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BooleanOR_ReturnValue) == 0x000158, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector_X) == 0x000160, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector_Y) == 0x000168, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector_Z) == 0x000170, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_MakeVector2D_ReturnValue) == 0x000178, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, K2Node_Select_Default) == 0x000188, "Member 'BP_CLFS_Mgr_C_DrawLighter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector2D_X_1) == 0x000198, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_BreakVector2D_Y_1) == 0x0001A0, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001A8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001B0, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001C0, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_MakeVector2D_ReturnValue_1) == 0x0001C8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0001D8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_DrawLighter, CallFunc_Multiply_LinearColorFloat_B_ImplicitCast) == 0x0001E8, "Member 'BP_CLFS_Mgr_C_DrawLighter::CallFunc_Multiply_LinearColorFloat_B_ImplicitCast' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.ExecuteUbergraph_BP_CLFS_Mgr
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Lighter                             K2Node_CustomEvent_S_Lighter;                      // 0x0058(0x0038)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LightenSwitch;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Intensity;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_2;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_3;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1; // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default_1;                           // 0x0118(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2; // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Select_Default_2;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CLFS_LightBrushArray_C*             K2Node_DynamicCast_AsBP_CLFS_Light_Brush_Array;    // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_FaculaBrush>                 K2Node_Select_Default_3;                           // 0x01A0(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr");
static_assert(sizeof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr) == 0x0001B0, "Wrong size on BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, EntryPoint) == 0x000000, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000018, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000029, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00002A, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_object_Variable) == 0x000030, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1) == 0x000038, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000050, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000051, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_BooleanOR_ReturnValue_1) == 0x000052, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsEditor_Mode_inEditor) == 0x000053, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_bool_Variable) == 0x000054, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsEditor_Mode_inEditor_1) == 0x000055, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsEditor_Mode_inEditor_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CustomEvent_S_Lighter) == 0x000058, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CustomEvent_S_Lighter' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CustomEvent_LightenSwitch) == 0x000090, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CustomEvent_LightenSwitch' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CustomEvent_Intensity) == 0x000098, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CustomEvent_Intensity' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_object_Variable_1) == 0x0000A0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_SignOfFloat_ReturnValue) == 0x0000A8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_bool_Variable_1) == 0x0000B8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_FTrunc_ReturnValue) == 0x0000BC, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000C0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsEditor_Mode_inEditor_2) == 0x0000C1, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsEditor_Mode_inEditor_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_real_Variable) == 0x0000D8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CustomEvent_Loaded_1) == 0x0000E0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_int_Variable) == 0x0000E8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_Select_Default) == 0x0000F0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsEditor_Mode_inEditor_3) == 0x000111, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsEditor_Mode_inEditor_3' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, Temp_bool_Variable_2) == 0x000112, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x000113, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1) == 0x000114, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_SoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000115, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000116, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_Select_Default_1) == 0x000118, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000140, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2) == 0x000148, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_Select_Default_2) == 0x000158, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000160, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_IsValid_ReturnValue_2) == 0x000161, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000162, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_SelectObject_ReturnValue) == 0x000168, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_BooleanOR_ReturnValue_2) == 0x000170, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_GetDisplayName_ReturnValue) == 0x000178, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, CallFunc_SelectFloat_ReturnValue) == 0x000188, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_DynamicCast_AsBP_CLFS_Light_Brush_Array) == 0x000190, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_DynamicCast_AsBP_CLFS_Light_Brush_Array' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr, K2Node_Select_Default_3) == 0x0001A0, "Member 'BP_CLFS_Mgr_C_ExecuteUbergraph_BP_CLFS_Mgr::K2Node_Select_Default_3' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.OnLoaded_D62BB00D43951F9144E545B36705EC6E
// 0x0008 (0x0008 - 0x0000)
struct BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E");
static_assert(sizeof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E) == 0x000008, "Wrong size on BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E");
static_assert(offsetof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E, Loaded) == 0x000000, "Member 'BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B36705EC6E::Loaded' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.OnLoaded_D62BB00D43951F9144E545B3C52C8DED
// 0x0008 (0x0008 - 0x0000)
struct BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED");
static_assert(sizeof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED) == 0x000008, "Wrong size on BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED");
static_assert(offsetof(BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED, Loaded) == 0x000000, "Member 'BP_CLFS_Mgr_C_OnLoaded_D62BB00D43951F9144E545B3C52C8DED::Loaded' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.Paint
// 0x0048 (0x0048 - 0x0000)
struct BP_CLFS_Mgr_C_Paint final
{
public:
	struct FS_Lighter                             S_Lighter;                                         // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          LightenSwitch;                                     // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Intensity;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_Paint) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_Paint");
static_assert(sizeof(BP_CLFS_Mgr_C_Paint) == 0x000048, "Wrong size on BP_CLFS_Mgr_C_Paint");
static_assert(offsetof(BP_CLFS_Mgr_C_Paint, S_Lighter) == 0x000000, "Member 'BP_CLFS_Mgr_C_Paint::S_Lighter' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_Paint, LightenSwitch) == 0x000038, "Member 'BP_CLFS_Mgr_C_Paint::LightenSwitch' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_Paint, Intensity) == 0x000040, "Member 'BP_CLFS_Mgr_C_Paint::Intensity' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.PaintBrushs
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CLFS_Mgr_C_PaintBrushs final
{
public:
	TArray<struct FS_FaculaBrush>                 InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_FaculaBrush                         CallFunc_Array_Get_Item;                           // 0x0030(0x0080)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_PaintBrushs) == 0x000010, "Wrong alignment on BP_CLFS_Mgr_C_PaintBrushs");
static_assert(sizeof(BP_CLFS_Mgr_C_PaintBrushs) == 0x0001B0, "Wrong size on BP_CLFS_Mgr_C_PaintBrushs");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, InputPin) == 0x000000, "Member 'BP_CLFS_Mgr_C_PaintBrushs::InputPin' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_CLFS_Mgr_C_PaintBrushs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_CLFS_Mgr_C_PaintBrushs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000B0, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001A8, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_PaintBrushs, CallFunc_IsValid_ReturnValue) == 0x0001A9, "Member 'BP_CLFS_Mgr_C_PaintBrushs::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CLFS_Mgr.BP_CLFS_Mgr_C.SetMIDParam
// 0x0158 (0x0158 - 0x0000)
struct BP_CLFS_Mgr_C_SetMIDParam final
{
public:
	class UMaterialInstanceDynamic*               InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0028(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BoxExtent_ImplicitCast;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CLFS_Mgr_C_SetMIDParam) == 0x000008, "Wrong alignment on BP_CLFS_Mgr_C_SetMIDParam");
static_assert(sizeof(BP_CLFS_Mgr_C_SetMIDParam) == 0x000158, "Wrong size on BP_CLFS_Mgr_C_SetMIDParam");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, InputPin) == 0x000000, "Member 'BP_CLFS_Mgr_C_SetMIDParam::InputPin' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000018, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000020, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000028, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000120, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CLFS_Mgr_C_SetMIDParam, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000124, "Member 'BP_CLFS_Mgr_C_SetMIDParam::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
