#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Combat_AIConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "F_DynamicSenseConfig_structs.hpp"
#include "EWorldAITokenType_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Combat_AIConfig.BP_Combat_AIConfig_C
// 0x0088 (0x00B8 - 0x0030)
class UBP_Combat_AIConfig_C final : public UPrimaryDataAsset
{
public:
	class UBP_CombatAIBTConfig_C*                 behavior_tree_config;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 state_machine;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class UBehaviorTree*> state_tree_map;                                  // 0x0040(0x0050)(Edit, BlueprintVisible)
	bool                                          Freeze;                                            // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          use_default_state_begin_anim;                      // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Combat_AIHatredConfig_C*            hatred_config;                                     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWorldAITokenType                             token_type;                                        // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_DynamicSenseConfig>          dynamic_hatred_config;                             // 0x00A8(0x0010)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Combat_AIConfig_C">();
	}
	static class UBP_Combat_AIConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Combat_AIConfig_C>();
	}
};
static_assert(alignof(UBP_Combat_AIConfig_C) == 0x000008, "Wrong alignment on UBP_Combat_AIConfig_C");
static_assert(sizeof(UBP_Combat_AIConfig_C) == 0x0000B8, "Wrong size on UBP_Combat_AIConfig_C");
static_assert(offsetof(UBP_Combat_AIConfig_C, behavior_tree_config) == 0x000030, "Member 'UBP_Combat_AIConfig_C::behavior_tree_config' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, state_machine) == 0x000038, "Member 'UBP_Combat_AIConfig_C::state_machine' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, state_tree_map) == 0x000040, "Member 'UBP_Combat_AIConfig_C::state_tree_map' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, Freeze) == 0x000090, "Member 'UBP_Combat_AIConfig_C::Freeze' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, use_default_state_begin_anim) == 0x000091, "Member 'UBP_Combat_AIConfig_C::use_default_state_begin_anim' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, hatred_config) == 0x000098, "Member 'UBP_Combat_AIConfig_C::hatred_config' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, token_type) == 0x0000A0, "Member 'UBP_Combat_AIConfig_C::token_type' has a wrong offset!");
static_assert(offsetof(UBP_Combat_AIConfig_C, dynamic_hatred_config) == 0x0000A8, "Member 'UBP_Combat_AIConfig_C::dynamic_hatred_config' has a wrong offset!");

}

