#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaMiaoCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6PlayerCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DaMiaoCharacter.BP_DaMiaoCharacter_C
// 0x0090 (0x0A50 - 0x09C0)
class ABP_DaMiaoCharacter_C final : public ABP_X6PlayerCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DaMiaoCharacter_C;               // 0x09C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_BasedMovementReplicateHelperComponent_C* BP_BasedMovementReplicateHelperComponent;     // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DaMiaoRPCHelperComponent_C*         BP_MainCharacterRPCHelperComponent;                // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MainCharacterInAirMovementComp_C*   BP_MainCharacterInAirMovementComp;                 // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNikkiPhysicsManagerComponent*          NikkiPhysicsManager;                               // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MainCharacterRegularMovementComp_C* BP_MainCharacterRegularMovementComp;               // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_UIWS_Interactor_C*                  BP_UIWS_Interactor;                                // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHeightfieldReadbackComponent*          HeightfieldReadback;                               // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Cloak;                                             // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CombatPartHitComponent_C*           BP_CombatPartHitComponent;                         // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AdjustTransformComponent_C*         BP_AdjustTransformComponent;                       // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DaMiaoRollingSwitchComp_C*          BP_DaMiaoRollingSwitchComp;                        // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Foliage_Interactor_Component_C*     BP_Foliage_Interactor_Component;                   // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DamiaoFootBlobShadow;                              // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AIAgentComponent_C*                 BP_AIAgentComponent;                               // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneralLocoRequestHandler_C*        GeneralLocoRequestObj;                             // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_SetPlayerToControlActor(class AActor* ActorToControl, bool* Controlled);
	void CreateAndBindLocoRequestObj();
	void ExecuteUbergraph_BP_DaMiaoCharacter(int32 EntryPoint);
	void GetAIObjectClass(class FString* LuaClassPath);
	void ReceiveBeginPlay();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DaMiaoCharacter_C">();
	}
	static class ABP_DaMiaoCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DaMiaoCharacter_C>();
	}
};
static_assert(alignof(ABP_DaMiaoCharacter_C) == 0x000010, "Wrong alignment on ABP_DaMiaoCharacter_C");
static_assert(sizeof(ABP_DaMiaoCharacter_C) == 0x000A50, "Wrong size on ABP_DaMiaoCharacter_C");
static_assert(offsetof(ABP_DaMiaoCharacter_C, UberGraphFrame_BP_DaMiaoCharacter_C) == 0x0009C0, "Member 'ABP_DaMiaoCharacter_C::UberGraphFrame_BP_DaMiaoCharacter_C' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_BasedMovementReplicateHelperComponent) == 0x0009C8, "Member 'ABP_DaMiaoCharacter_C::BP_BasedMovementReplicateHelperComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_MainCharacterRPCHelperComponent) == 0x0009D0, "Member 'ABP_DaMiaoCharacter_C::BP_MainCharacterRPCHelperComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_MainCharacterInAirMovementComp) == 0x0009D8, "Member 'ABP_DaMiaoCharacter_C::BP_MainCharacterInAirMovementComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, NikkiPhysicsManager) == 0x0009E0, "Member 'ABP_DaMiaoCharacter_C::NikkiPhysicsManager' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_MainCharacterRegularMovementComp) == 0x0009E8, "Member 'ABP_DaMiaoCharacter_C::BP_MainCharacterRegularMovementComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_UIWS_Interactor) == 0x0009F0, "Member 'ABP_DaMiaoCharacter_C::BP_UIWS_Interactor' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, HeightfieldReadback) == 0x0009F8, "Member 'ABP_DaMiaoCharacter_C::HeightfieldReadback' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, Cloak) == 0x000A00, "Member 'ABP_DaMiaoCharacter_C::Cloak' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_CombatPartHitComponent) == 0x000A08, "Member 'ABP_DaMiaoCharacter_C::BP_CombatPartHitComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, Ak) == 0x000A10, "Member 'ABP_DaMiaoCharacter_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_AdjustTransformComponent) == 0x000A18, "Member 'ABP_DaMiaoCharacter_C::BP_AdjustTransformComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_DaMiaoRollingSwitchComp) == 0x000A20, "Member 'ABP_DaMiaoCharacter_C::BP_DaMiaoRollingSwitchComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_Foliage_Interactor_Component) == 0x000A28, "Member 'ABP_DaMiaoCharacter_C::BP_Foliage_Interactor_Component' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, MotionWarping) == 0x000A30, "Member 'ABP_DaMiaoCharacter_C::MotionWarping' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, DamiaoFootBlobShadow) == 0x000A38, "Member 'ABP_DaMiaoCharacter_C::DamiaoFootBlobShadow' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, BP_AIAgentComponent) == 0x000A40, "Member 'ABP_DaMiaoCharacter_C::BP_AIAgentComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoCharacter_C, GeneralLocoRequestObj) == 0x000A48, "Member 'ABP_DaMiaoCharacter_C::GeneralLocoRequestObj' has a wrong offset!");

}

