#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvWeatehrComp_SeaOfStars

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DyEnvWeatehrComp_SeaOfStars.BP_DyEnvWeatehrComp_SeaOfStars_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick");
static_assert(sizeof(BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SeaOfStars.BP_DyEnvWeatehrComp_SeaOfStars_C.OnFadeOut
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut");
static_assert(sizeof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut, Progress) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeOut::Progress' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SeaOfStars.BP_DyEnvWeatehrComp_SeaOfStars_C.OnFadeIn
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn");
static_assert(sizeof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn, Progress) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_OnFadeIn::Progress' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SeaOfStars.BP_DyEnvWeatehrComp_SeaOfStars_C.ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Progress_1;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Progress;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSky_C*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Ease_ReturnValue;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Target_ImplicitCast;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars) == 0x000008, "Wrong alignment on BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars");
static_assert(sizeof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars) == 0x0000B0, "Wrong size on BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, EntryPoint) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, K2Node_Event_Progress_1) == 0x000008, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::K2Node_Event_Progress_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, K2Node_Event_Progress) == 0x00000C, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::K2Node_Event_Progress' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_GetStreamingLevel_ReturnValue) == 0x000018, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_IsLevelLoaded_ReturnValue) == 0x000020, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_IsEditor_Mode_inEditor) == 0x000021, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_IsEditor_Mode_inEditor_1) == 0x000022, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_IsEditor_Mode_inEditor_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_LoadLevelInstance_bOutSuccess) == 0x000038, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_LoadLevelInstance_ReturnValue) == 0x000040, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_GetActorOfClass_ReturnValue) == 0x000048, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_FInterpTo_ReturnValue) == 0x000058, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000070, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000074, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000075, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000076, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_Ease_ReturnValue) == 0x000078, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000088, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_FInterpTo_Target_ImplicitCast) == 0x000090, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_FInterpTo_Target_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x0000A0, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0000A8, "Member 'BP_DyEnvWeatehrComp_SeaOfStars_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

}

