#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvWeathers

#include "Basic.hpp"

#include "E_WeatherTable_structs.hpp"
#include "DynamicEnvironmentSystem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_WeatherState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.WeatherRaining
// 0x0310 (0x0310 - 0x0000)
struct BP_DyEnvWeathers_C_WeatherRaining final
{
public:
	struct FWeatherBaseLerpConfig                 WeatherSettings;                                   // 0x0000(0x0310)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_DyEnvWeathers_C_WeatherRaining) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_WeatherRaining");
static_assert(sizeof(BP_DyEnvWeathers_C_WeatherRaining) == 0x000310, "Wrong size on BP_DyEnvWeathers_C_WeatherRaining");
static_assert(offsetof(BP_DyEnvWeathers_C_WeatherRaining, WeatherSettings) == 0x000000, "Member 'BP_DyEnvWeathers_C_WeatherRaining::WeatherSettings' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.WeatherChangeEvent
// 0x0030 (0x0030 - 0x0000)
struct BP_DyEnvWeathers_C_WeatherChangeEvent final
{
public:
	struct FS_WeatherState                        packedParams;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_WeatherChangeEvent) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_WeatherChangeEvent");
static_assert(sizeof(BP_DyEnvWeathers_C_WeatherChangeEvent) == 0x000030, "Wrong size on BP_DyEnvWeathers_C_WeatherChangeEvent");
static_assert(offsetof(BP_DyEnvWeathers_C_WeatherChangeEvent, packedParams) == 0x000000, "Member 'BP_DyEnvWeathers_C_WeatherChangeEvent::packedParams' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.Weather Rain
// 0x0330 (0x0330 - 0x0000)
struct BP_DyEnvWeathers_C_Weather_Rain final
{
public:
	struct FWeatherBaseLerpConfig                 WeatherBaseLerpConfig;                             // 0x0000(0x0310)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_313[0x1];                                      // 0x0313(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Rain_ToRain;                        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Check_Rain_Wetness_Factor_ImplicitCast;   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_Weather_Rain) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_Weather_Rain");
static_assert(sizeof(BP_DyEnvWeathers_C_Weather_Rain) == 0x000330, "Wrong size on BP_DyEnvWeathers_C_Weather_Rain");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, WeatherBaseLerpConfig) == 0x000000, "Member 'BP_DyEnvWeathers_C_Weather_Rain::WeatherBaseLerpConfig' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_IsValid_ReturnValue) == 0x000310, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000311, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_IsEditor_Mode_inEditor) == 0x000312, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000314, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_Check_Rain_ToRain) == 0x000318, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_Check_Rain_ToRain' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_IsValid_ReturnValue_1) == 0x000319, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000320, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_Rain, CallFunc_Check_Rain_Wetness_Factor_ImplicitCast) == 0x000328, "Member 'BP_DyEnvWeathers_C_Weather_Rain::CallFunc_Check_Rain_Wetness_Factor_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.Weather NoRain
// 0x0002 (0x0002 - 0x0000)
struct BP_DyEnvWeathers_C_Weather_NoRain final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_Weather_NoRain) == 0x000001, "Wrong alignment on BP_DyEnvWeathers_C_Weather_NoRain");
static_assert(sizeof(BP_DyEnvWeathers_C_Weather_NoRain) == 0x000002, "Wrong size on BP_DyEnvWeathers_C_Weather_NoRain");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_NoRain, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_DyEnvWeathers_C_Weather_NoRain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Weather_NoRain, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_DyEnvWeathers_C_Weather_NoRain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_DyEnvWeathers_C_UserConstructionScript final
{
public:
	TArray<class UDynamicWeatherComponent*>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_DyEnvWeathers_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_UserConstructionScript");
static_assert(sizeof(BP_DyEnvWeathers_C_UserConstructionScript) == 0x000010, "Wrong size on BP_DyEnvWeathers_C_UserConstructionScript");
static_assert(offsetof(BP_DyEnvWeathers_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_DyEnvWeathers_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.UpdateNightParam
// 0x11B0 (0x11B0 - 0x0000)
struct BP_DyEnvWeathers_C_UpdateNightParam final
{
public:
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADynamicWeatherVolume*                  CallFunc_TargetWeatherVolume_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFinalWeatherSettings                  CallFunc_GetFinalWeatherSettings_ReturnValue;      // 0x0030(0x0E08)(ConstParm)
	float                                         CallFunc_GetSwapCurveFactorRemapped0_1_ReturnValue; // 0x0E38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3C[0x4];                                      // 0x0E3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherBaseLerpConfig                 K2Node_Select_Default;                             // 0x0E40(0x0310)(ConstParm)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x1150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x1158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x1160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x1168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x1170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x1178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1179[0x7];                                     // 0x1179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x1180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x1188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x1190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x1198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x11A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BlendWeight_ImplicitCast;       // 0x11A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_UpdateNightParam) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_UpdateNightParam");
static_assert(sizeof(BP_DyEnvWeathers_C_UpdateNightParam) == 0x0011B0, "Wrong size on BP_DyEnvWeathers_C_UpdateNightParam");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_IsEditor_Mode_inEditor) == 0x000000, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FMax_ReturnValue) == 0x000008, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_TargetWeatherVolume_ReturnValue) == 0x000018, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_TargetWeatherVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, Temp_bool_Variable) == 0x000022, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000024, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_IsEditor_Mode_inEditor_1) == 0x000028, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_IsEditor_Mode_inEditor_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_GetFinalWeatherSettings_ReturnValue) == 0x000030, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_GetFinalWeatherSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_GetSwapCurveFactorRemapped0_1_ReturnValue) == 0x000E38, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_GetSwapCurveFactorRemapped0_1_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, K2Node_Select_Default) == 0x000E40, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FMax_ReturnValue_1) == 0x001150, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FClamp_ReturnValue) == 0x001158, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x001160, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FMin_ReturnValue) == 0x001168, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_SelectFloat_ReturnValue) == 0x001170, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x001178, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x001180, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x001188, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FMin_A_ImplicitCast) == 0x001190, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_FMax_A_ImplicitCast) == 0x001198, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0011A0, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_UpdateNightParam, K2Node_VariableSet_BlendWeight_ImplicitCast) == 0x0011A8, "Member 'BP_DyEnvWeathers_C_UpdateNightParam::K2Node_VariableSet_BlendWeight_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.TargetWeatherVolume
// 0x0018 (0x0018 - 0x0000)
struct BP_DyEnvWeathers_C_TargetWeatherVolume final
{
public:
	class ADynamicWeatherVolume*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADynamicWeatherVolume*                  K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_TargetWeatherVolume) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_TargetWeatherVolume");
static_assert(sizeof(BP_DyEnvWeathers_C_TargetWeatherVolume) == 0x000018, "Wrong size on BP_DyEnvWeathers_C_TargetWeatherVolume");
static_assert(offsetof(BP_DyEnvWeathers_C_TargetWeatherVolume, ReturnValue) == 0x000000, "Member 'BP_DyEnvWeathers_C_TargetWeatherVolume::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_TargetWeatherVolume, Temp_bool_Variable) == 0x000008, "Member 'BP_DyEnvWeathers_C_TargetWeatherVolume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_TargetWeatherVolume, K2Node_Select_Default) == 0x000010, "Member 'BP_DyEnvWeathers_C_TargetWeatherVolume::K2Node_Select_Default' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.SetVolumetricFog
// 0x0001 (0x0001 - 0x0000)
struct BP_DyEnvWeathers_C_SetVolumetricFog final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_SetVolumetricFog) == 0x000001, "Wrong alignment on BP_DyEnvWeathers_C_SetVolumetricFog");
static_assert(sizeof(BP_DyEnvWeathers_C_SetVolumetricFog) == 0x000001, "Wrong size on BP_DyEnvWeathers_C_SetVolumetricFog");
static_assert(offsetof(BP_DyEnvWeathers_C_SetVolumetricFog, bNewValue) == 0x000000, "Member 'BP_DyEnvWeathers_C_SetVolumetricFog::bNewValue' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.SetSceneWeatherBlendWeight
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight final
{
public:
	double                                        Weight;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight");
static_assert(sizeof(BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight");
static_assert(offsetof(BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight, Weight) == 0x000000, "Member 'BP_DyEnvWeathers_C_SetSceneWeatherBlendWeight::Weight' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.SetPause
// 0x0001 (0x0001 - 0x0000)
struct BP_DyEnvWeathers_C_SetPause final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_SetPause) == 0x000001, "Wrong alignment on BP_DyEnvWeathers_C_SetPause");
static_assert(sizeof(BP_DyEnvWeathers_C_SetPause) == 0x000001, "Wrong size on BP_DyEnvWeathers_C_SetPause");
static_assert(offsetof(BP_DyEnvWeathers_C_SetPause, bPause) == 0x000000, "Member 'BP_DyEnvWeathers_C_SetPause::bPause' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.SendPresetToObject
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DyEnvWeathers_C_SendPresetToObject final
{
public:
	class ADynamicWeatherVolume*                  Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureCube*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_3;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeatherTexturesConfig                 K2Node_MakeStruct_WeatherTexturesConfig;           // 0x0048(0x0068)()
};
static_assert(alignof(BP_DyEnvWeathers_C_SendPresetToObject) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_SendPresetToObject");
static_assert(sizeof(BP_DyEnvWeathers_C_SendPresetToObject) == 0x0000B0, "Wrong size on BP_DyEnvWeathers_C_SendPresetToObject");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, Volume) == 0x000000, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::Volume' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, Temp_object_Variable) == 0x000008, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, Temp_bool_Variable) == 0x000011, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, Temp_object_Variable_1) == 0x000018, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, Temp_bool_Variable_1) == 0x000020, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValidClass_ReturnValue) == 0x000021, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValidClass_ReturnValue_1) == 0x000022, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValidClass_ReturnValue_2) == 0x000023, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValidClass_ReturnValue_3) == 0x000024, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValidClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_IsValid_ReturnValue_1) == 0x000027, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_BooleanAND_ReturnValue_2) == 0x000028, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_BooleanAND_ReturnValue_3) == 0x000029, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, K2Node_Select_Default) == 0x000030, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, K2Node_Select_Default_1) == 0x000040, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_SendPresetToObject, K2Node_MakeStruct_WeatherTexturesConfig) == 0x000048, "Member 'BP_DyEnvWeathers_C_SendPresetToObject::K2Node_MakeStruct_WeatherTexturesConfig' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.Send DataTable to Volume
// 0x0010 (0x0010 - 0x0000)
struct BP_DyEnvWeathers_C_Send_DataTable_to_Volume final
{
public:
	class UDataTable*                             CallFunc_Map_Find_Value;                           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_Send_DataTable_to_Volume) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_Send_DataTable_to_Volume");
static_assert(sizeof(BP_DyEnvWeathers_C_Send_DataTable_to_Volume) == 0x000010, "Wrong size on BP_DyEnvWeathers_C_Send_DataTable_to_Volume");
static_assert(offsetof(BP_DyEnvWeathers_C_Send_DataTable_to_Volume, CallFunc_Map_Find_Value) == 0x000000, "Member 'BP_DyEnvWeathers_C_Send_DataTable_to_Volume::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Send_DataTable_to_Volume, CallFunc_Map_Find_ReturnValue) == 0x000008, "Member 'BP_DyEnvWeathers_C_Send_DataTable_to_Volume::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_Send_DataTable_to_Volume, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_DyEnvWeathers_C_Send_DataTable_to_Volume::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.RemoveSwapWeatherVolume
// 0x0018 (0x0018 - 0x0000)
struct BP_DyEnvWeathers_C_RemoveSwapWeatherVolume final
{
public:
	class ADynamicWeatherVolume*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADynamicWeatherVolume*                  K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_RemoveSwapWeatherVolume");
static_assert(sizeof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume) == 0x000018, "Wrong size on BP_DyEnvWeathers_C_RemoveSwapWeatherVolume");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume, ReturnValue) == 0x000000, "Member 'BP_DyEnvWeathers_C_RemoveSwapWeatherVolume::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume, Temp_bool_Variable) == 0x000008, "Member 'BP_DyEnvWeathers_C_RemoveSwapWeatherVolume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_DyEnvWeathers_C_RemoveSwapWeatherVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveSwapWeatherVolume, K2Node_Select_Default) == 0x000010, "Member 'BP_DyEnvWeathers_C_RemoveSwapWeatherVolume::K2Node_Select_Default' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.RemoveBlendWeight
// 0x0028 (0x0028 - 0x0000)
struct BP_DyEnvWeathers_C_RemoveBlendWeight final
{
public:
	class ADynamicWeatherVolume*                  Vol;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_RemoveBlendWeight) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_RemoveBlendWeight");
static_assert(sizeof(BP_DyEnvWeathers_C_RemoveBlendWeight) == 0x000028, "Wrong size on BP_DyEnvWeathers_C_RemoveBlendWeight");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveBlendWeight, Vol) == 0x000000, "Member 'BP_DyEnvWeathers_C_RemoveBlendWeight::Vol' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveBlendWeight, ReturnValue) == 0x000008, "Member 'BP_DyEnvWeathers_C_RemoveBlendWeight::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveBlendWeight, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_DyEnvWeathers_C_RemoveBlendWeight::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveBlendWeight, CallFunc_FMin_ReturnValue) == 0x000018, "Member 'BP_DyEnvWeathers_C_RemoveBlendWeight::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_RemoveBlendWeight, CallFunc_FMin_A_ImplicitCast) == 0x000020, "Member 'BP_DyEnvWeathers_C_RemoveBlendWeight::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeathers_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DyEnvWeathers_C_ReceiveTick");
static_assert(sizeof(BP_DyEnvWeathers_C_ReceiveTick) == 0x000004, "Wrong size on BP_DyEnvWeathers_C_ReceiveTick");
static_assert(offsetof(BP_DyEnvWeathers_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DyEnvWeathers_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.OnLoaded_20BA12BD41768EB729615B9BCDF12002
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002");
static_assert(sizeof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002");
static_assert(offsetof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002, Loaded) == 0x000000, "Member 'BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9BCDF12002::Loaded' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.OnLoaded_20BA12BD41768EB729615B9B502C925E
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E");
static_assert(sizeof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E");
static_assert(offsetof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E, Loaded) == 0x000000, "Member 'BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B502C925E::Loaded' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.OnLoaded_20BA12BD41768EB729615B9B4C505C9A
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A");
static_assert(sizeof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A");
static_assert(offsetof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A, Loaded) == 0x000000, "Member 'BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B4C505C9A::Loaded' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.OnLoaded_20BA12BD41768EB729615B9B437923C1
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1");
static_assert(sizeof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1");
static_assert(offsetof(BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1, Loaded) == 0x000000, "Member 'BP_DyEnvWeathers_C_OnLoaded_20BA12BD41768EB729615B9B437923C1::Loaded' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.Manual Operation TOD
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvWeathers_C_Manual_Operation_TOD final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_Manual_Operation_TOD) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_Manual_Operation_TOD");
static_assert(sizeof(BP_DyEnvWeathers_C_Manual_Operation_TOD) == 0x000008, "Wrong size on BP_DyEnvWeathers_C_Manual_Operation_TOD");
static_assert(offsetof(BP_DyEnvWeathers_C_Manual_Operation_TOD, Time) == 0x000000, "Member 'BP_DyEnvWeathers_C_Manual_Operation_TOD::Time' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.LimitTODSunRotator
// 0x01D8 (0x01D8 - 0x0000)
struct BP_DyEnvWeathers_C_LimitTODSunRotator final
{
public:
	struct FSunLightLerpConfig                    FinalSunLightSetting;                              // 0x0000(0x0128)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class AActor*                                 SkySphere;                                         // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      SunLight;                                          // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      MoonLight;                                         // 0x0138(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         NowTime;                                           // 0x0140(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SunExtraIntensity;                                 // 0x0144(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoonExtraIntensity;                                // 0x0148(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Final_Sun_Rotator_Value_Final;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSky_C*                         K2Node_DynamicCast_AsDES_Sky;                      // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_SunExtraIntensity_ImplicitCast; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_MoonExtraIntensity_ImplicitCast; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_SingleTrackSunMoonSwapFactor_ImplicitCast; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_LimitTODSunRotator) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_LimitTODSunRotator");
static_assert(sizeof(BP_DyEnvWeathers_C_LimitTODSunRotator) == 0x0001D8, "Wrong size on BP_DyEnvWeathers_C_LimitTODSunRotator");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, FinalSunLightSetting) == 0x000000, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::FinalSunLightSetting' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, SkySphere) == 0x000128, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::SkySphere' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, SunLight) == 0x000130, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::SunLight' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, MoonLight) == 0x000138, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::MoonLight' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, NowTime) == 0x000140, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::NowTime' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, SunExtraIntensity) == 0x000144, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::SunExtraIntensity' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, MoonExtraIntensity) == 0x000148, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::MoonExtraIntensity' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_Get_Final_Sun_Rotator_Value_Final) == 0x000150, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_Get_Final_Sun_Rotator_Value_Final' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, K2Node_DynamicCast_AsDES_Sky) == 0x000168, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::K2Node_DynamicCast_AsDES_Sky' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_BreakVector_X) == 0x000178, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_BreakVector_Y) == 0x000180, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_BreakVector_Z) == 0x000188, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000190, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000198, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_SelectFloat_ReturnValue) == 0x0001A8, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_SelectFloat_ReturnValue_1) == 0x0001B0, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_Abs_ReturnValue) == 0x0001B8, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, CallFunc_SelectFloat_ReturnValue_2) == 0x0001C0, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, K2Node_FunctionResult_SunExtraIntensity_ImplicitCast) == 0x0001C8, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::K2Node_FunctionResult_SunExtraIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, K2Node_FunctionResult_MoonExtraIntensity_ImplicitCast) == 0x0001CC, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::K2Node_FunctionResult_MoonExtraIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_LimitTODSunRotator, K2Node_VariableSet_SingleTrackSunMoonSwapFactor_ImplicitCast) == 0x0001D0, "Member 'BP_DyEnvWeathers_C_LimitTODSunRotator::K2Node_VariableSet_SingleTrackSunMoonSwapFactor_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.InitiWeather
// 0x0080 (0x0080 - 0x0000)
struct BP_DyEnvWeathers_C_InitiWeather final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeathers_C_InitiWeather) == 0x000008, "Wrong alignment on BP_DyEnvWeathers_C_InitiWeather");
static_assert(sizeof(BP_DyEnvWeathers_C_InitiWeather) == 0x000080, "Wrong size on BP_DyEnvWeathers_C_InitiWeather");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Not_PreBool_ReturnValue_1) == 0x000001, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Split_LeftS) == 0x000020, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Split_RightS) == 0x000030, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Split_ReturnValue) == 0x000040, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000041, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, K2Node_SwitchString_CmpSuccess) == 0x000042, "Member 'BP_DyEnvWeathers_C_InitiWeather::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Conv_BoolToString_ReturnValue) == 0x000048, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000058, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeathers_C_InitiWeather, CallFunc_Contains_ReturnValue) == 0x000078, "Member 'BP_DyEnvWeathers_C_InitiWeather::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_DyEnvWeathers.BP_DyEnvWeathers_C.GetWeatherCurrentTable
// 0x0060 (0x0060 - 0x0000)
struct BP_DyEnvWeathers_C_GetWeatherCurrentTable final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
