#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DissolveActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DissolveActorComponent.BP_DissolveActorComponent_C
// 0x0040 (0x00E8 - 0x00A8)
class UBP_DissolveActorComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Time;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForward;                                         // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 Meshes;                                            // 0x00C0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	double                                        Speed;                                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DissolveCurve;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PaperDissolveManager_C*             DissolveManager;                                   // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetDissolveProgress(double Progress);
	void SetDissolve(bool Toggle);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Opacity(bool On);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_DissolveActorComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DissolveActorComponent_C">();
	}
	static class UBP_DissolveActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DissolveActorComponent_C>();
	}
};
static_assert(alignof(UBP_DissolveActorComponent_C) == 0x000008, "Wrong alignment on UBP_DissolveActorComponent_C");
static_assert(sizeof(UBP_DissolveActorComponent_C) == 0x0000E8, "Wrong size on UBP_DissolveActorComponent_C");
static_assert(offsetof(UBP_DissolveActorComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_DissolveActorComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, Time) == 0x0000B0, "Member 'UBP_DissolveActorComponent_C::Time' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, IsForward) == 0x0000B8, "Member 'UBP_DissolveActorComponent_C::IsForward' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, Meshes) == 0x0000C0, "Member 'UBP_DissolveActorComponent_C::Meshes' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, Speed) == 0x0000D0, "Member 'UBP_DissolveActorComponent_C::Speed' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, DissolveCurve) == 0x0000D8, "Member 'UBP_DissolveActorComponent_C::DissolveCurve' has a wrong offset!");
static_assert(offsetof(UBP_DissolveActorComponent_C, DissolveManager) == 0x0000E0, "Member 'UBP_DissolveActorComponent_C::DissolveManager' has a wrong offset!");

}

