#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvWeatehrComp_SeaOfStars

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPC_Weather_Master_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DyEnvWeatehrComp_SeaOfStars.BP_DyEnvWeatehrComp_SeaOfStars_C
// 0x0060 (0x02F0 - 0x0290)
class UBP_DyEnvWeatehrComp_SeaOfStars_C final : public UBPC_Weather_Master_C
{
public:
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DyEnvWeatehrComp_SeaOfStars_C;   // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_SeaOfStars_C*                       Ref_SeaOfStars;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCheck;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSky_C*                         Ref_DESSky;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginScale;                                       // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentAlpha;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpSpeed;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Update;                                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void OnFadeOutComplete();
	void OnFadeOut(float Progress);
	void OnFadeIn(float Progress);
	void OnDestroyed();
	void OnCreated();
	void ExecuteUbergraph_BP_DyEnvWeatehrComp_SeaOfStars(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DyEnvWeatehrComp_SeaOfStars_C">();
	}
	static class UBP_DyEnvWeatehrComp_SeaOfStars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DyEnvWeatehrComp_SeaOfStars_C>();
	}
};
static_assert(alignof(UBP_DyEnvWeatehrComp_SeaOfStars_C) == 0x000010, "Wrong alignment on UBP_DyEnvWeatehrComp_SeaOfStars_C");
static_assert(sizeof(UBP_DyEnvWeatehrComp_SeaOfStars_C) == 0x0002F0, "Wrong size on UBP_DyEnvWeatehrComp_SeaOfStars_C");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, UberGraphFrame_BP_DyEnvWeatehrComp_SeaOfStars_C) == 0x000288, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::UberGraphFrame_BP_DyEnvWeatehrComp_SeaOfStars_C' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, Ref_SeaOfStars) == 0x000290, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::Ref_SeaOfStars' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, CanCheck) == 0x000298, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::CanCheck' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, LevelInstance) == 0x0002A0, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::LevelInstance' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, LevelName) == 0x0002A8, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::LevelName' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, Ref_DESSky) == 0x0002B0, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::Ref_DESSky' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, OriginScale) == 0x0002B8, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::OriginScale' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, CurrentAlpha) == 0x0002D0, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::CurrentAlpha' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, InterpSpeed) == 0x0002D8, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SeaOfStars_C, Update) == 0x0002E0, "Member 'UBP_DyEnvWeatehrComp_SeaOfStars_C::Update' has a wrong offset!");

}

