#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvWeatehrComp_SuperMoon01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPC_Weather_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DyEnvWeatehrComp_SuperMoon01.BP_DyEnvWeatehrComp_SuperMoon01_C
// 0x0020 (0x02B0 - 0x0290)
class UBP_DyEnvWeatehrComp_SuperMoon01_C final : public UBPC_Weather_Master_C
{
public:
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DyEnvWeatehrComp_SuperMoon01_C;  // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_SuperMoon01_C*                      Ref_SuperMoon01;                                   // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCheck;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   LevelName;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void OnFadeOutComplete();
	void OnFadeOut(float Progress);
	void OnFadeIn(float Progress);
	void OnDestroyed();
	void OnCreated();
	void ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DyEnvWeatehrComp_SuperMoon01_C">();
	}
	static class UBP_DyEnvWeatehrComp_SuperMoon01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DyEnvWeatehrComp_SuperMoon01_C>();
	}
};
static_assert(alignof(UBP_DyEnvWeatehrComp_SuperMoon01_C) == 0x000010, "Wrong alignment on UBP_DyEnvWeatehrComp_SuperMoon01_C");
static_assert(sizeof(UBP_DyEnvWeatehrComp_SuperMoon01_C) == 0x0002B0, "Wrong size on UBP_DyEnvWeatehrComp_SuperMoon01_C");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SuperMoon01_C, UberGraphFrame_BP_DyEnvWeatehrComp_SuperMoon01_C) == 0x000288, "Member 'UBP_DyEnvWeatehrComp_SuperMoon01_C::UberGraphFrame_BP_DyEnvWeatehrComp_SuperMoon01_C' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SuperMoon01_C, Ref_SuperMoon01) == 0x000290, "Member 'UBP_DyEnvWeatehrComp_SuperMoon01_C::Ref_SuperMoon01' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SuperMoon01_C, CanCheck) == 0x000298, "Member 'UBP_DyEnvWeatehrComp_SuperMoon01_C::CanCheck' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SuperMoon01_C, LevelInstance) == 0x0002A0, "Member 'UBP_DyEnvWeatehrComp_SuperMoon01_C::LevelInstance' has a wrong offset!");
static_assert(offsetof(UBP_DyEnvWeatehrComp_SuperMoon01_C, LevelName) == 0x0002A8, "Member 'UBP_DyEnvWeatehrComp_SuperMoon01_C::LevelName' has a wrong offset!");

}

