#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvCamMgr

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_DyEnvCamMgr_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DyEnvCamMgr_C_UserConstructionScript");
static_assert(sizeof(BP_DyEnvCamMgr_C_UserConstructionScript) == 0x000028, "Wrong size on BP_DyEnvCamMgr_C_UserConstructionScript");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000000, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000010, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000011, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000018, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_UserConstructionScript, CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast) == 0x000020, "Member 'BP_DyEnvCamMgr_C_UserConstructionScript::CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.SyncCamMgrLocRot
// 0x0140 (0x0140 - 0x0000)
struct BP_DyEnvCamMgr_C_SyncCamMgrLocRot final
{
public:
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0040(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot) == 0x000008, "Wrong alignment on BP_DyEnvCamMgr_C_SyncCamMgrLocRot");
static_assert(sizeof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot) == 0x000140, "Wrong size on BP_DyEnvCamMgr_C_SyncCamMgrLocRot");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000000, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_GetCameraLocation_ReturnValue) == 0x000008, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000040, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SyncCamMgrLocRot, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000138, "Member 'BP_DyEnvCamMgr_C_SyncCamMgrLocRot::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.SoftShadowDecal
// 0x0128 (0x0128 - 0x0000)
struct BP_DyEnvCamMgr_C_SoftShadowDecal final
{
public:
	class ACharacter*                             CallFunc_GetX6GameNikkiPawn_NikkiPawn;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCharacterBoneLocation_ReturnValue;     // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCharacterBoneLocation_ReturnValue_1;   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_3;   // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_SoftShadowDecal) == 0x000008, "Wrong alignment on BP_DyEnvCamMgr_C_SoftShadowDecal");
static_assert(sizeof(BP_DyEnvCamMgr_C_SoftShadowDecal) == 0x000128, "Wrong size on BP_DyEnvCamMgr_C_SoftShadowDecal");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_GetX6GameNikkiPawn_NikkiPawn) == 0x000000, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_GetX6GameNikkiPawn_NikkiPawn' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_GetSocketLocation_ReturnValue) == 0x000010, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_GetCharacterBoneLocation_ReturnValue) == 0x000028, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_GetCharacterBoneLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_GetCharacterBoneLocation_ReturnValue_1) == 0x000040, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_GetCharacterBoneLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000058, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000068, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000078, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0000D8, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x0000F0, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x000108, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SoftShadowDecal, CallFunc_Conv_VectorToLinearColor_ReturnValue_3) == 0x000118, "Member 'BP_DyEnvCamMgr_C_SoftShadowDecal::CallFunc_Conv_VectorToLinearColor_ReturnValue_3' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.SetPlayerRimLight
// 0x0010 (0x0010 - 0x0000)
struct BP_DyEnvCamMgr_C_SetPlayerRimLight final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_SetPlayerRimLight) == 0x000004, "Wrong alignment on BP_DyEnvCamMgr_C_SetPlayerRimLight");
static_assert(sizeof(BP_DyEnvCamMgr_C_SetPlayerRimLight) == 0x000010, "Wrong size on BP_DyEnvCamMgr_C_SetPlayerRimLight");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerRimLight, Color) == 0x000000, "Member 'BP_DyEnvCamMgr_C_SetPlayerRimLight::Color' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.SetPlayerLigthtColor
// 0x0080 (0x0080 - 0x0000)
struct BP_DyEnvCamMgr_C_SetPlayerLigthtColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_10;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_11;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSpecularScale_NewValue_ImplicitCast;   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor) == 0x000008, "Wrong alignment on BP_DyEnvCamMgr_C_SetPlayerLigthtColor");
static_assert(sizeof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor) == 0x000080, "Wrong size on BP_DyEnvCamMgr_C_SetPlayerLigthtColor");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, Color) == 0x000000, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::Color' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000010, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000021, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000022, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000023, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000024, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000025, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x000026, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x000027, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000028, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000029, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x00002C, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1) == 0x000030, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000040, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_10) == 0x000041, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_EqualEqual_StrStr_ReturnValue_11) == 0x000042, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_EqualEqual_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000048, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000050, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_IsEditor_Mode_inEditor) == 0x000060, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_SetSpecularScale_NewValue_ImplicitCast) == 0x000070, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_SetSpecularScale_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast) == 0x000074, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_SetInverseExposureBlend_NewInverseExposureBlend_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_SetPlayerLigthtColor, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000078, "Member 'BP_DyEnvCamMgr_C_SetPlayerLigthtColor::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvCamMgr_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DyEnvCamMgr_C_ReceiveTick");
static_assert(sizeof(BP_DyEnvCamMgr_C_ReceiveTick) == 0x000004, "Wrong size on BP_DyEnvCamMgr_C_ReceiveTick");
static_assert(offsetof(BP_DyEnvCamMgr_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DyEnvCamMgr_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DyEnvCamMgr.BP_DyEnvCamMgr_C.ExecuteUbergraph_BP_DyEnvCamMgr
// 0x0220 (0x0220 - 0x0000)
struct BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x0110(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr) == 0x000010, "Wrong alignment on BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr");
static_assert(sizeof(BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr) == 0x000220, "Wrong size on BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr");
static_assert(offsetof(BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr, EntryPoint) == 0x000000, "Member 'BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_DyEnvCamMgr_C_ExecuteUbergraph_BP_DyEnvCamMgr::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
