#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaMiaoVisitorCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6PlayerCharacterVisitor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DaMiaoVisitorCharacter.BP_DaMiaoVisitorCharacter_C
// 0x0080 (0x0A00 - 0x0980)
class ABP_DaMiaoVisitorCharacter_C final : public ABP_X6PlayerCharacterVisitor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractiveActorComponent_C*        BP_InteractiveActorComponent;                      // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AdvancedCamera_C*                   AdvancedCamera;                                    // 0x0990(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UX6AIStimuliSourceComponent*            X6AIStimuliSource;                                 // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DaMiaoRPCHelperComponent_C*         BP_MainCharacterRPCHelperComponent;                // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MainCharacterInAirMovementComp_C*   BP_MainCharacterInAirMovementComp;                 // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNikkiPhysicsManagerComponent*          NikkiPhysicsManager;                               // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MainCharacterRegularMovementComp_C* BP_MainCharacterRegularMovementComp;               // 0x09B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Cloak;                                             // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CombatPartHitComponent_C*           BP_CombatPartHitComponent;                         // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AdjustTransformComponent_C*         BP_AdjustTransformComponent;                       // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DaMiaoRollingSwitchComp_C*          BP_DaMiaoRollingSwitchComp;                        // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DamiaoFootBlobShadow;                              // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_SetPlayerToControlActor(class AActor* ActorToControl, bool* Controlled);
	void ExecuteUbergraph_BP_DaMiaoVisitorCharacter(int32 EntryPoint);
	void GetAIObjectClass(class FString* LuaClassPath);
	void ReceiveBeginPlay();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DaMiaoVisitorCharacter_C">();
	}
	static class ABP_DaMiaoVisitorCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DaMiaoVisitorCharacter_C>();
	}
};
static_assert(alignof(ABP_DaMiaoVisitorCharacter_C) == 0x000010, "Wrong alignment on ABP_DaMiaoVisitorCharacter_C");
static_assert(sizeof(ABP_DaMiaoVisitorCharacter_C) == 0x000A00, "Wrong size on ABP_DaMiaoVisitorCharacter_C");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, UberGraphFrame) == 0x000980, "Member 'ABP_DaMiaoVisitorCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_InteractiveActorComponent) == 0x000988, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_InteractiveActorComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, AdvancedCamera) == 0x000990, "Member 'ABP_DaMiaoVisitorCharacter_C::AdvancedCamera' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, X6AIStimuliSource) == 0x000998, "Member 'ABP_DaMiaoVisitorCharacter_C::X6AIStimuliSource' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_MainCharacterRPCHelperComponent) == 0x0009A0, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_MainCharacterRPCHelperComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_MainCharacterInAirMovementComp) == 0x0009A8, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_MainCharacterInAirMovementComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, NikkiPhysicsManager) == 0x0009B0, "Member 'ABP_DaMiaoVisitorCharacter_C::NikkiPhysicsManager' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_MainCharacterRegularMovementComp) == 0x0009B8, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_MainCharacterRegularMovementComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, Cloak) == 0x0009C0, "Member 'ABP_DaMiaoVisitorCharacter_C::Cloak' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_CombatPartHitComponent) == 0x0009C8, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_CombatPartHitComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, Ak) == 0x0009D0, "Member 'ABP_DaMiaoVisitorCharacter_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_AdjustTransformComponent) == 0x0009D8, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_AdjustTransformComponent' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, BP_DaMiaoRollingSwitchComp) == 0x0009E0, "Member 'ABP_DaMiaoVisitorCharacter_C::BP_DaMiaoRollingSwitchComp' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, MotionWarping) == 0x0009E8, "Member 'ABP_DaMiaoVisitorCharacter_C::MotionWarping' has a wrong offset!");
static_assert(offsetof(ABP_DaMiaoVisitorCharacter_C, DamiaoFootBlobShadow) == 0x0009F0, "Member 'ABP_DaMiaoVisitorCharacter_C::DamiaoFootBlobShadow' has a wrong offset!");

}

