#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DissolveActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.SetDissolveProgress
// 0x0028 (0x0028 - 0x0000)
struct BP_DissolveActorComponent_C_SetDissolveProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCustomDissolveProgress_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_SetDissolveProgress) == 0x000008, "Wrong alignment on BP_DissolveActorComponent_C_SetDissolveProgress");
static_assert(sizeof(BP_DissolveActorComponent_C_SetDissolveProgress) == 0x000028, "Wrong size on BP_DissolveActorComponent_C_SetDissolveProgress");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, Progress) == 0x000000, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::Progress' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolveProgress, CallFunc_SetCustomDissolveProgress_Value_ImplicitCast) == 0x000024, "Member 'BP_DissolveActorComponent_C_SetDissolveProgress::CallFunc_SetCustomDissolveProgress_Value_ImplicitCast' has a wrong offset!");

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.SetDissolve
// 0x0028 (0x0028 - 0x0000)
struct BP_DissolveActorComponent_C_SetDissolve final
{
public:
	bool                                          Toggle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_SetDissolve) == 0x000008, "Wrong alignment on BP_DissolveActorComponent_C_SetDissolve");
static_assert(sizeof(BP_DissolveActorComponent_C_SetDissolve) == 0x000028, "Wrong size on BP_DissolveActorComponent_C_SetDissolve");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, Toggle) == 0x000000, "Member 'BP_DissolveActorComponent_C_SetDissolve::Toggle' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_DissolveActorComponent_C_SetDissolve::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_DissolveActorComponent_C_SetDissolve::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_DissolveActorComponent_C_SetDissolve::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_DissolveActorComponent_C_SetDissolve::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_DissolveActorComponent_C_SetDissolve::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_SetDissolve, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_DissolveActorComponent_C_SetDissolve::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_DissolveActorComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_DissolveActorComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_DissolveActorComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_DissolveActorComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_DissolveActorComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_DissolveActorComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.Opacity
// 0x0001 (0x0001 - 0x0000)
struct BP_DissolveActorComponent_C_Opacity final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_Opacity) == 0x000001, "Wrong alignment on BP_DissolveActorComponent_C_Opacity");
static_assert(sizeof(BP_DissolveActorComponent_C_Opacity) == 0x000001, "Wrong size on BP_DissolveActorComponent_C_Opacity");
static_assert(offsetof(BP_DissolveActorComponent_C_Opacity, On) == 0x000000, "Member 'BP_DissolveActorComponent_C_Opacity::On' has a wrong offset!");

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DissolveActorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DissolveActorComponent_C_ReceiveTick");
static_assert(sizeof(BP_DissolveActorComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_DissolveActorComponent_C_ReceiveTick");
static_assert(offsetof(BP_DissolveActorComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DissolveActorComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DissolveActorComponent.BP_DissolveActorComponent_C.ExecuteUbergraph_BP_DissolveActorComponent
// 0x0068 (0x0068 - 0x0000)
struct BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetDissolveProgress_progress_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetDissolveProgress_progress_ImplicitCast_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent) == 0x000008, "Wrong alignment on BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent");
static_assert(sizeof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent) == 0x000068, "Wrong size on BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, EntryPoint) == 0x000000, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, K2Node_Event_EndPlayReason) == 0x000018, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_GetFloatValue_ReturnValue) == 0x00001C, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, K2Node_CustomEvent_On) == 0x000020, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_FMin_ReturnValue) == 0x000040, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000048, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_SetDissolveProgress_progress_ImplicitCast) == 0x000050, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_SetDissolveProgress_progress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_SetDissolveProgress_progress_ImplicitCast_1) == 0x000058, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_SetDissolveProgress_progress_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_DissolveActorComponent_C_ExecuteUbergraph_BP_DissolveActorComponent::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

