#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageTypeBase

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DamageTypeBase.BP_DamageTypeBase_C.DoDamage
// 0x0108 (0x0108 - 0x0000)
struct BP_DamageTypeBase_C_DoDamage final
{
public:
	class UObject*                                Instigater;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0010(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DamageTypeBase_C_DoDamage) == 0x000008, "Wrong alignment on BP_DamageTypeBase_C_DoDamage");
static_assert(sizeof(BP_DamageTypeBase_C_DoDamage) == 0x000108, "Wrong size on BP_DamageTypeBase_C_DoDamage");
static_assert(offsetof(BP_DamageTypeBase_C_DoDamage, Instigater) == 0x000000, "Member 'BP_DamageTypeBase_C_DoDamage::Instigater' has a wrong offset!");
static_assert(offsetof(BP_DamageTypeBase_C_DoDamage, OtherActor) == 0x000008, "Member 'BP_DamageTypeBase_C_DoDamage::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DamageTypeBase_C_DoDamage, HitResult) == 0x000010, "Member 'BP_DamageTypeBase_C_DoDamage::HitResult' has a wrong offset!");

// Function BP_DamageTypeBase.BP_DamageTypeBase_C.CanDoDamage
// 0x0010 (0x0010 - 0x0000)
struct BP_DamageTypeBase_C_CanDoDamage final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCan;                                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamageTypeBase_C_CanDoDamage) == 0x000008, "Wrong alignment on BP_DamageTypeBase_C_CanDoDamage");
static_assert(sizeof(BP_DamageTypeBase_C_CanDoDamage) == 0x000010, "Wrong size on BP_DamageTypeBase_C_CanDoDamage");
static_assert(offsetof(BP_DamageTypeBase_C_CanDoDamage, OtherActor) == 0x000000, "Member 'BP_DamageTypeBase_C_CanDoDamage::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DamageTypeBase_C_CanDoDamage, bCan) == 0x000008, "Member 'BP_DamageTypeBase_C_CanDoDamage::bCan' has a wrong offset!");

}

