#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DaMiaoAnimStateComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DaMiaoAnimStateComponent.BP_DaMiaoAnimStateComponent_C.BP_AnimNotify_OnEnableDaMiaoJump
// 0x0002 (0x0002 - 0x0000)
struct BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump final
{
public:
	bool                                          IsLeftOnLand;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableJump;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump) == 0x000001, "Wrong alignment on BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump");
static_assert(sizeof(BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump) == 0x000002, "Wrong size on BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump");
static_assert(offsetof(BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump, IsLeftOnLand) == 0x000000, "Member 'BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump::IsLeftOnLand' has a wrong offset!");
static_assert(offsetof(BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump, EnableJump) == 0x000001, "Member 'BP_DaMiaoAnimStateComponent_C_BP_AnimNotify_OnEnableDaMiaoJump::EnableJump' has a wrong offset!");

// Function BP_DaMiaoAnimStateComponent.BP_DaMiaoAnimStateComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_DaMiaoAnimStateComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_DaMiaoAnimStateComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_DaMiaoAnimStateComponent_C_GetModuleName");
static_assert(sizeof(BP_DaMiaoAnimStateComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_DaMiaoAnimStateComponent_C_GetModuleName");
static_assert(offsetof(BP_DaMiaoAnimStateComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_DaMiaoAnimStateComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

