#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DissolveFoliageActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DissolveFoliageActor.BP_DissolveFoliageActor_C.ExecuteUbergraph_BP_DissolveFoliageActor
// 0x0080 (0x0080 - 0x0000)
struct BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_1;       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor) == 0x000010, "Wrong alignment on BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor");
static_assert(sizeof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor) == 0x000080, "Wrong size on BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, EntryPoint) == 0x000000, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000070, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, K2Node_CustomEvent_On) == 0x000071, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000072, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000078, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor, CallFunc_SetPlayRate_NewRate_ImplicitCast_1) == 0x00007C, "Member 'BP_DissolveFoliageActor_C_ExecuteUbergraph_BP_DissolveFoliageActor::CallFunc_SetPlayRate_NewRate_ImplicitCast_1' has a wrong offset!");

// Function BP_DissolveFoliageActor.BP_DissolveFoliageActor_C.Opacity
// 0x0001 (0x0001 - 0x0000)
struct BP_DissolveFoliageActor_C_Opacity final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveFoliageActor_C_Opacity) == 0x000001, "Wrong alignment on BP_DissolveFoliageActor_C_Opacity");
static_assert(sizeof(BP_DissolveFoliageActor_C_Opacity) == 0x000001, "Wrong size on BP_DissolveFoliageActor_C_Opacity");
static_assert(offsetof(BP_DissolveFoliageActor_C_Opacity, On) == 0x000000, "Member 'BP_DissolveFoliageActor_C_Opacity::On' has a wrong offset!");

// Function BP_DissolveFoliageActor.BP_DissolveFoliageActor_C.SetCollision
// 0x0018 (0x0018 - 0x0000)
struct BP_DissolveFoliageActor_C_SetCollision final
{
public:
	class UStaticMeshComponent*                   Old;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   New;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_1; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_2; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_3; // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_4; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_5; // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_6; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue_7; // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveFoliageActor_C_SetCollision) == 0x000008, "Wrong alignment on BP_DissolveFoliageActor_C_SetCollision");
static_assert(sizeof(BP_DissolveFoliageActor_C_SetCollision) == 0x000018, "Wrong size on BP_DissolveFoliageActor_C_SetCollision");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, Old) == 0x000000, "Member 'BP_DissolveFoliageActor_C_SetCollision::Old' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, New) == 0x000008, "Member 'BP_DissolveFoliageActor_C_SetCollision::New' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue) == 0x000010, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_1) == 0x000011, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_2) == 0x000012, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_3) == 0x000013, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_4) == 0x000014, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_5) == 0x000015, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_6) == 0x000016, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_SetCollision, CallFunc_GetCollisionResponseToChannel_ReturnValue_7) == 0x000017, "Member 'BP_DissolveFoliageActor_C_SetCollision::CallFunc_GetCollisionResponseToChannel_ReturnValue_7' has a wrong offset!");

// Function BP_DissolveFoliageActor.BP_DissolveFoliageActor_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_DissolveFoliageActor_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DissolveFoliageActor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DissolveFoliageActor_C_UserConstructionScript");
static_assert(sizeof(BP_DissolveFoliageActor_C_UserConstructionScript) == 0x000048, "Wrong size on BP_DissolveFoliageActor_C_UserConstructionScript");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000018, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000024, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000044, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DissolveFoliageActor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000046, "Member 'BP_DissolveFoliageActor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

