#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageResConfigs

#include "Basic.hpp"

#include "F_HitAKResSet_structs.hpp"
#include "F_HitNSResSet_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamageResConfigs.BP_DamageResConfigs_C
// 0x0070 (0x00A0 - 0x0030)
class UBP_DamageResConfigs_C final : public UPrimaryDataAsset
{
public:
	TArray<struct FF_HitAKResSet>                 HitAKResList;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FF_HitNSResSet>                 HitNSResList;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class UCurveVector*>      HitBackCurveResList;                               // 0x0050(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamageResConfigs_C">();
	}
	static class UBP_DamageResConfigs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DamageResConfigs_C>();
	}
};
static_assert(alignof(UBP_DamageResConfigs_C) == 0x000008, "Wrong alignment on UBP_DamageResConfigs_C");
static_assert(sizeof(UBP_DamageResConfigs_C) == 0x0000A0, "Wrong size on UBP_DamageResConfigs_C");
static_assert(offsetof(UBP_DamageResConfigs_C, HitAKResList) == 0x000030, "Member 'UBP_DamageResConfigs_C::HitAKResList' has a wrong offset!");
static_assert(offsetof(UBP_DamageResConfigs_C, HitNSResList) == 0x000040, "Member 'UBP_DamageResConfigs_C::HitNSResList' has a wrong offset!");
static_assert(offsetof(UBP_DamageResConfigs_C, HitBackCurveResList) == 0x000050, "Member 'UBP_DamageResConfigs_C::HitBackCurveResList' has a wrong offset!");

}

