#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvSky

#include "Basic.hpp"

#include "DynamicEnvironmentSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DyEnvSky.BP_DyEnvSky_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_DyEnvSky_C_UserConstructionScript final
{
public:
	struct FVector                                Temp_struct_Variable;                              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_4;                            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_5;                            // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_6;                            // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_7;                            // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_UserConstructionScript");
static_assert(sizeof(BP_DyEnvSky_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_DyEnvSky_C_UserConstructionScript");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000018, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_2) == 0x000030, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_3) == 0x000048, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_4) == 0x000060, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_5) == 0x000078, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_6) == 0x000090, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_struct_Variable_7) == 0x0000A8, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, Temp_int_Variable) == 0x0000C0, "Member 'BP_DyEnvSky_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, CallFunc_IsEditor_Mode_inEditor) == 0x0000C4, "Member 'BP_DyEnvSky_C_UserConstructionScript::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, K2Node_Select_Default) == 0x0000C8, "Member 'BP_DyEnvSky_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_UserConstructionScript, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000E0, "Member 'BP_DyEnvSky_C_UserConstructionScript::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.SetupStarfield
// 0x01B8 (0x01B8 - 0x0000)
struct BP_DyEnvSky_C_SetupStarfield final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DyEnvSky_C_SetupStarfield) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_SetupStarfield");
static_assert(sizeof(BP_DyEnvSky_C_SetupStarfield) == 0x0001B8, "Wrong size on BP_DyEnvSky_C_SetupStarfield");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_IsValid_ReturnValue_2) == 0x000011, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_GetActorScale3D_ReturnValue) == 0x000018, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_DegCos_ReturnValue) == 0x000070, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_DegSin_ReturnValue) == 0x000078, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000088, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_MakeVector_ReturnValue_1) == 0x000090, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_MakeVector_ReturnValue_2) == 0x0000A8, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_SetupStarfield, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C0, "Member 'BP_DyEnvSky_C_SetupStarfield::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvSky_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DyEnvSky_C_ReceiveTick");
static_assert(sizeof(BP_DyEnvSky_C_ReceiveTick) == 0x000004, "Wrong size on BP_DyEnvSky_C_ReceiveTick");
static_assert(offsetof(BP_DyEnvSky_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DyEnvSky_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2");
static_assert(sizeof(BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2) == 0x000008, "Wrong size on BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2");
static_assert(offsetof(BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2, Loaded) == 0x000000, "Member 'BP_DyEnvSky_C_OnLoaded_75399A6F4F15C2371B910B86BCB7B2D2::Loaded' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.Manual Operation TOD
// 0x0008 (0x0008 - 0x0000)
struct BP_DyEnvSky_C_Manual_Operation_TOD final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_Manual_Operation_TOD) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_Manual_Operation_TOD");
static_assert(sizeof(BP_DyEnvSky_C_Manual_Operation_TOD) == 0x000008, "Wrong size on BP_DyEnvSky_C_Manual_Operation_TOD");
static_assert(offsetof(BP_DyEnvSky_C_Manual_Operation_TOD, Time) == 0x000000, "Member 'BP_DyEnvSky_C_Manual_Operation_TOD::Time' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.LimitSunRotator
// 0x2208 (0x2208 - 0x0000)
struct BP_DyEnvSky_C_LimitSunRotator final
{
public:
	struct FSunLightLerpConfig                    Final_Sun_Light_Setting;                           // 0x0000(0x0128)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ADirectionalLight*                      Sun_Light;                                         // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      Moon_Light;                                        // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Free;                                              // 0x0138(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Limited;                                           // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Swap_Factor;                                       // 0x0148(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFinalWeatherSettings                  CallFunc_GetFinalWeatherSettings_ReturnValue;      // 0x0150(0x0E08)(ConstParm)
	double                                        CallFunc_BreakVector_X;                            // 0x0F58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0F60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0F68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0F70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0F88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0FA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0FA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0FC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_PC_Platform_Low_ReturnValue;           // 0x0FD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD9[0x3];                                      // 0x0FD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0FDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0FE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE1[0x7];                                      // 0x0FE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0FF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF4[0x4];                                      // 0x0FF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0FF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x1010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x1028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x1038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x103C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x1040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1044[0x4];                                     // 0x1044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x1048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFinalWeatherSettings                  CallFunc_GetFinalWeatherSettings_ReturnValue_1;    // 0x1060(0x0E08)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1E68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E69[0x7];                                     // 0x1E69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x1E70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x1E80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x1E81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x1E82(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E83[0x5];                                     // 0x1E83(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x1E88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x1EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA1[0x7];                                     // 0x1EA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x1EA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x1EC0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x1FB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x1FD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x1FE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x2000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x2008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_4;           // 0x2010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x2028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x2040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x2058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x2070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x2088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_2;                      // 0x20A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x20B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x20D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x20E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x20F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x2108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x2110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x2120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x2128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x2140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_3;                      // 0x2158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x2170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x2188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x21A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A1[0x3];                                     // 0x21A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x21A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x21B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B5[0x3];                                     // 0x21B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component;  // 0x21B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x21C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C1[0x3];                                     // 0x21C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RLerp_Alpha_ImplicitCast;                 // 0x21C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x21C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x21CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x21D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x21D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RLerp_Alpha_ImplicitCast_1;               // 0x21D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DC[0x4];                                     // 0x21DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x21E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x21E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21EC[0x4];                                     // 0x21EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CalculatorFinalDirLitRot_InRotFreeMoon_ImplicitCast; // 0x21F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RLerp_Alpha_ImplicitCast_2;               // 0x21F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x21FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x2200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_LimitSunRotator) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_LimitSunRotator");
static_assert(sizeof(BP_DyEnvSky_C_LimitSunRotator) == 0x002208, "Wrong size on BP_DyEnvSky_C_LimitSunRotator");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Final_Sun_Light_Setting) == 0x000000, "Member 'BP_DyEnvSky_C_LimitSunRotator::Final_Sun_Light_Setting' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Sun_Light) == 0x000128, "Member 'BP_DyEnvSky_C_LimitSunRotator::Sun_Light' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Moon_Light) == 0x000130, "Member 'BP_DyEnvSky_C_LimitSunRotator::Moon_Light' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Free) == 0x000138, "Member 'BP_DyEnvSky_C_LimitSunRotator::Free' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Limited) == 0x000140, "Member 'BP_DyEnvSky_C_LimitSunRotator::Limited' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, Swap_Factor) == 0x000148, "Member 'BP_DyEnvSky_C_LimitSunRotator::Swap_Factor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetFinalWeatherSettings_ReturnValue) == 0x000150, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetFinalWeatherSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakVector_X) == 0x000F58, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakVector_Y) == 0x000F60, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakVector_Z) == 0x000F68, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_ReturnValue) == 0x000F70, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_ReturnValue) == 0x000F88, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000FA0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000FA8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_ReturnValue_1) == 0x000FC0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Is_PC_Platform_Low_ReturnValue) == 0x000FD8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Is_PC_Platform_Low_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000FDC, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000FE0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_SelectFloat_ReturnValue) == 0x000FE8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000FF0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetVectorValue_ReturnValue) == 0x000FF8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x001010, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x001028, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakRotator_Roll) == 0x001038, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakRotator_Pitch) == 0x00103C, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BreakRotator_Yaw) == 0x001040, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_ReturnValue_2) == 0x001048, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetFinalWeatherSettings_ReturnValue_1) == 0x001060, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetFinalWeatherSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_IsValid_ReturnValue) == 0x001E68, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x001E70, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x001E80, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x001E81, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BooleanOR_ReturnValue) == 0x001E82, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_ReturnValue_1) == 0x001E88, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_BooleanOR_ReturnValue_1) == 0x001EA0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetForwardVector_ReturnValue) == 0x001EA8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x001EC0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetForwardVector_ReturnValue_1) == 0x001FB8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetForwardVector_ReturnValue_2) == 0x001FD0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetForwardVector_ReturnValue_3) == 0x001FE8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetForwardVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Add_DoubleDouble_ReturnValue) == 0x002000, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x002008, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GetForwardVector_ReturnValue_4) == 0x002010, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GetForwardVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_VLerp_ReturnValue) == 0x002028, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Multiply_VectorVector_ReturnValue) == 0x002040, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_SelectVector_ReturnValue) == 0x002058, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x002070, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_SelectRotator_ReturnValue) == 0x002088, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_ReturnValue_2) == 0x0020A0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0020B8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0020D0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0020E8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_VLerp_ReturnValue_1) == 0x0020F0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x002108, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x002110, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_FClamp_ReturnValue) == 0x002120, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x002128, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x002140, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_ReturnValue_3) == 0x002158, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_VLerp_ReturnValue_2) == 0x002170, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Normal_ReturnValue) == 0x002188, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_IsValid_ReturnValue_1) == 0x0021A0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x0021A4, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0021B4, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, K2Node_DynamicCast_AsDirectional_Light_Component) == 0x0021B8, "Member 'BP_DyEnvSky_C_LimitSunRotator::K2Node_DynamicCast_AsDirectional_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, K2Node_DynamicCast_bSuccess) == 0x0021C0, "Member 'BP_DyEnvSky_C_LimitSunRotator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_Alpha_ImplicitCast) == 0x0021C4, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0021C8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0021CC, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0021D0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0021D4, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_Alpha_ImplicitCast_1) == 0x0021D8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0021E0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x0021E8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_CalculatorFinalDirLitRot_InRotFreeMoon_ImplicitCast) == 0x0021F0, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_CalculatorFinalDirLitRot_InRotFreeMoon_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_RLerp_Alpha_ImplicitCast_2) == 0x0021F8, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_RLerp_Alpha_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0021FC, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_LimitSunRotator, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x002200, "Member 'BP_DyEnvSky_C_LimitSunRotator::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.Gizmo
// 0x0018 (0x0018 - 0x0000)
struct BP_DyEnvSky_C_Gizmo final
{
public:
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvSky_C_Gizmo) == 0x000008, "Wrong alignment on BP_DyEnvSky_C_Gizmo");
static_assert(sizeof(BP_DyEnvSky_C_Gizmo) == 0x000018, "Wrong size on BP_DyEnvSky_C_Gizmo");
static_assert(offsetof(BP_DyEnvSky_C_Gizmo, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000000, "Member 'BP_DyEnvSky_C_Gizmo::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_Gizmo, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_DyEnvSky_C_Gizmo::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvSky_C_Gizmo, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_DyEnvSky_C_Gizmo::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_DyEnvSky.BP_DyEnvSky_C.ExecuteUbergraph_BP_DyEnvSky
// 0x0270 (0x0270 - 0x0000)
struct BP_DyEnvSky_C_ExecuteUbergraph_BP_DyEnvSky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_RegionName;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_UnloadWeatherName;                    // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_LoadWeatherName;                      // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_LocalLightColor;                      // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_OnlySyncContent;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_OnlyWriteParam;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Event_WeatherPreset;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Time_1;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Time;                                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_PC_Platform_Low_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default;                             // 0x0128(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
