#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DyEnvWeatehrComp_SuperMoon01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DyEnvWeatehrComp_SuperMoon01.BP_DyEnvWeatehrComp_SuperMoon01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick");
static_assert(sizeof(BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SuperMoon01.BP_DyEnvWeatehrComp_SuperMoon01_C.OnFadeOut
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut");
static_assert(sizeof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut, Progress) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeOut::Progress' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SuperMoon01.BP_DyEnvWeatehrComp_SuperMoon01_C.OnFadeIn
// 0x0004 (0x0004 - 0x0000)
struct BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn) == 0x000004, "Wrong alignment on BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn");
static_assert(sizeof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn) == 0x000004, "Wrong size on BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn, Progress) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_OnFadeIn::Progress' has a wrong offset!");

// Function BP_DyEnvWeatehrComp_SuperMoon01.BP_DyEnvWeatehrComp_SuperMoon01_C.ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01
// 0x0048 (0x0048 - 0x0000)
struct BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Progress_1;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Progress;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelLoaded_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01) == 0x000008, "Wrong alignment on BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01");
static_assert(sizeof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01) == 0x000048, "Wrong size on BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, EntryPoint) == 0x000000, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, K2Node_Event_Progress_1) == 0x000004, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::K2Node_Event_Progress_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, K2Node_Event_Progress) == 0x000008, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::K2Node_Event_Progress' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_GetStreamingLevel_ReturnValue) == 0x000018, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_IsLevelLoaded_ReturnValue) == 0x000020, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_IsLevelLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_IsEditor_Mode_inEditor) == 0x000022, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_IsEditor_Mode_inEditor_1) == 0x000023, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_IsEditor_Mode_inEditor_1' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_LoadLevelInstance_bOutSuccess) == 0x000038, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01, CallFunc_LoadLevelInstance_ReturnValue) == 0x000040, "Member 'BP_DyEnvWeatehrComp_SuperMoon01_C_ExecuteUbergraph_BP_DyEnvWeatehrComp_SuperMoon01::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");

}

