#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EasyFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EasyFog.BP_EasyFog_C.ExecuteUbergraph_BP_EasyFog
// 0x0030 (0x0030 - 0x0000)
struct BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog) == 0x000008, "Wrong alignment on BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog");
static_assert(sizeof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog) == 0x000030, "Wrong size on BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, EntryPoint) == 0x000000, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000008, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000019, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00001A, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x00001B, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x00001C, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x00001D, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x00001E, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x00001F, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000020, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000021, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000024, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000028, "Member 'BP_EasyFog_C_ExecuteUbergraph_BP_EasyFog::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");

// Function BP_EasyFog.BP_EasyFog_C.GetFogMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct BP_EasyFog_C_GetFogMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               FogMaterial;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EasyFog_C_GetFogMaterialInstance) == 0x000008, "Wrong alignment on BP_EasyFog_C_GetFogMaterialInstance");
static_assert(sizeof(BP_EasyFog_C_GetFogMaterialInstance) == 0x000008, "Wrong size on BP_EasyFog_C_GetFogMaterialInstance");
static_assert(offsetof(BP_EasyFog_C_GetFogMaterialInstance, FogMaterial) == 0x000000, "Member 'BP_EasyFog_C_GetFogMaterialInstance::FogMaterial' has a wrong offset!");

// Function BP_EasyFog.BP_EasyFog_C.UserConstructionScript
// 0x0118 (0x0118 - 0x0000)
struct BP_EasyFog_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_2;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EasyFog_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_EasyFog_C_UserConstructionScript");
static_assert(sizeof(BP_EasyFog_C_UserConstructionScript) == 0x000118, "Wrong size on BP_EasyFog_C_UserConstructionScript");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_EasyFog_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000008, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000018, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00001C, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x00001D, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00001E, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00001F, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000020, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000021, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000022, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x000023, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x000024, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000025, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000026, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000028, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Conv_BoolToDouble_ReturnValue_1) == 0x000030, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Conv_BoolToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000038, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000050, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000060, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Conv_BoolToDouble_ReturnValue_2) == 0x000068, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Conv_BoolToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Abs_ReturnValue) == 0x000078, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Abs_ReturnValue_1) == 0x000088, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, K2Node_Select_Default) == 0x0000B0, "Member 'BP_EasyFog_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000C8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000D8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000DC, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000E0, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000E8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0000F0, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0000F8, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000100, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000108, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_EasyFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000110, "Member 'BP_EasyFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");

}

