#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectWindZone

#include "Basic.hpp"

#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectWindZone.BP_EffectWindZone_C
// 0x0028 (0x0410 - 0x03E8)
class ABP_EffectWindZone_C final : public AX6EffectWindZone
{
public:
	class UBP_UIWS_Interactor_C*                  BP_UIWS_Interactor;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         AreaActors;                                        // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bApplyClothEffect;                                 // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetIntensity(double Intensity);
	void SetIsStatic(bool bStatic);
	void SetRadius(double Radius_0);
	void SetSize(double Size);
	void SetStaticSpeed(double Speed);
	void SetWaterEffectVelocity(const struct FVector& Velocity);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EffectWindZone_C">();
	}
	static class ABP_EffectWindZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectWindZone_C>();
	}
};
static_assert(alignof(ABP_EffectWindZone_C) == 0x000008, "Wrong alignment on ABP_EffectWindZone_C");
static_assert(sizeof(ABP_EffectWindZone_C) == 0x000410, "Wrong size on ABP_EffectWindZone_C");
static_assert(offsetof(ABP_EffectWindZone_C, BP_UIWS_Interactor) == 0x0003E8, "Member 'ABP_EffectWindZone_C::BP_UIWS_Interactor' has a wrong offset!");
static_assert(offsetof(ABP_EffectWindZone_C, DefaultSceneRoot) == 0x0003F0, "Member 'ABP_EffectWindZone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EffectWindZone_C, AreaActors) == 0x0003F8, "Member 'ABP_EffectWindZone_C::AreaActors' has a wrong offset!");
static_assert(offsetof(ABP_EffectWindZone_C, bApplyClothEffect) == 0x000408, "Member 'ABP_EffectWindZone_C::bApplyClothEffect' has a wrong offset!");

}

