#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageFootstepOverrideActor

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FoliageFootstepOverrideActor.BP_FoliageFootstepOverrideActor_C
// 0x00A8 (0x0450 - 0x03A8)
class ABP_FoliageFootstepOverrideActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset_X;                                          // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset_Y;                                          // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset_Z;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FVector, EPhysicalSurface>        FoliageLocationGroup;                              // 0x03C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UStaticMeshComponent*                   CheckingComponent;                                 // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           FoliageComponents;                                 // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UStaticMesh*                            CheckingMesh;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    GrassMesh;                                         // 0x0438(0x0010)(Edit, BlueprintVisible)
	double                                        Radius;                                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CompressPosition(const struct FVector& InPosition, struct FVector* CompressdPosition);
	void Event_GeneratePointData();
	void ExecuteUbergraph_BP_FoliageFootstepOverrideActor(int32 EntryPoint);
	void ExpandPositionData(const struct FVector& InPosition);
	void GenerateData();
	void GetFoliageInstanceInfo(class UStaticMeshComponent* Component, class UStaticMesh* StaticMesh, struct FVector* Location, double* Radius_0, int32* Trinangle, double* Height);
	void GetFoliageLocationGroup(TMap<struct FVector, EPhysicalSurface>* NewParam);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FoliageFootstepOverrideActor_C">();
	}
	static class ABP_FoliageFootstepOverrideActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FoliageFootstepOverrideActor_C>();
	}
};
static_assert(alignof(ABP_FoliageFootstepOverrideActor_C) == 0x000008, "Wrong alignment on ABP_FoliageFootstepOverrideActor_C");
static_assert(sizeof(ABP_FoliageFootstepOverrideActor_C) == 0x000450, "Wrong size on ABP_FoliageFootstepOverrideActor_C");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_FoliageFootstepOverrideActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_FoliageFootstepOverrideActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, Offset_X) == 0x0003B8, "Member 'ABP_FoliageFootstepOverrideActor_C::Offset_X' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, Offset_Y) == 0x0003BC, "Member 'ABP_FoliageFootstepOverrideActor_C::Offset_Y' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, Offset_Z) == 0x0003C0, "Member 'ABP_FoliageFootstepOverrideActor_C::Offset_Z' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, FoliageLocationGroup) == 0x0003C8, "Member 'ABP_FoliageFootstepOverrideActor_C::FoliageLocationGroup' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, CheckingComponent) == 0x000418, "Member 'ABP_FoliageFootstepOverrideActor_C::CheckingComponent' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, FoliageComponents) == 0x000420, "Member 'ABP_FoliageFootstepOverrideActor_C::FoliageComponents' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, CheckingMesh) == 0x000430, "Member 'ABP_FoliageFootstepOverrideActor_C::CheckingMesh' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, GrassMesh) == 0x000438, "Member 'ABP_FoliageFootstepOverrideActor_C::GrassMesh' has a wrong offset!");
static_assert(offsetof(ABP_FoliageFootstepOverrideActor_C, Radius) == 0x000448, "Member 'ABP_FoliageFootstepOverrideActor_C::Radius' has a wrong offset!");

}

