#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foliage_Interactor_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C
// 0x0028 (0x00D0 - 0x00A8)
class UBP_Foliage_Interactor_Component_C final : public UBP_X6ActorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstance*                      MaterialParent;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      DrawDynamicMaterial;                               // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hardness;                                          // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableInteraction;                                // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESignificanceLevel                            Interac_Level;                                     // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableInPlaying;                                  // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddRegister();
	void Deinitialize();
	void ExecuteUbergraph_BP_Foliage_Interactor_Component(int32 EntryPoint);
	void Initialize();
	void IsEnableInPlaying(bool* NewParam);
	void OnPop();
	void OnPostSignificanceChanged_Event(class AActor* Actor, float Significance, float TickInterval, bool TickPaused, ESignificanceLevel SignificanceLevel);
	void OnPush();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RemoveRegister();
	void SetEnableInPlaying(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Foliage_Interactor_Component_C">();
	}
	static class UBP_Foliage_Interactor_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Foliage_Interactor_Component_C>();
	}
};
static_assert(alignof(UBP_Foliage_Interactor_Component_C) == 0x000008, "Wrong alignment on UBP_Foliage_Interactor_Component_C");
static_assert(sizeof(UBP_Foliage_Interactor_Component_C) == 0x0000D0, "Wrong size on UBP_Foliage_Interactor_Component_C");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_Foliage_Interactor_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, MaterialParent) == 0x0000B0, "Member 'UBP_Foliage_Interactor_Component_C::MaterialParent' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, DrawDynamicMaterial) == 0x0000B8, "Member 'UBP_Foliage_Interactor_Component_C::DrawDynamicMaterial' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, Radius) == 0x0000C0, "Member 'UBP_Foliage_Interactor_Component_C::Radius' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, Hardness) == 0x0000C4, "Member 'UBP_Foliage_Interactor_Component_C::Hardness' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, bEnableInteraction) == 0x0000C8, "Member 'UBP_Foliage_Interactor_Component_C::bEnableInteraction' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, Interac_Level) == 0x0000C9, "Member 'UBP_Foliage_Interactor_Component_C::Interac_Level' has a wrong offset!");
static_assert(offsetof(UBP_Foliage_Interactor_Component_C, bEnableInPlaying) == 0x0000CA, "Member 'UBP_Foliage_Interactor_Component_C::bEnableInPlaying' has a wrong offset!");

}

