#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FocusOnTargetComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FocusOnTargetComponent.BP_FocusOnTargetComponent_C
// 0x0028 (0x00D0 - 0x00A8)
class UBP_FocusOnTargetComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAdvancedCamera*                        AdvancedCamera;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotation;                                    // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_FocusOnTargetComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FocusOnTargetComponent_C">();
	}
	static class UBP_FocusOnTargetComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FocusOnTargetComponent_C>();
	}
};
static_assert(alignof(UBP_FocusOnTargetComponent_C) == 0x000008, "Wrong alignment on UBP_FocusOnTargetComponent_C");
static_assert(sizeof(UBP_FocusOnTargetComponent_C) == 0x0000D0, "Wrong size on UBP_FocusOnTargetComponent_C");
static_assert(offsetof(UBP_FocusOnTargetComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_FocusOnTargetComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FocusOnTargetComponent_C, AdvancedCamera) == 0x0000B0, "Member 'UBP_FocusOnTargetComponent_C::AdvancedCamera' has a wrong offset!");
static_assert(offsetof(UBP_FocusOnTargetComponent_C, CameraRotation) == 0x0000B8, "Member 'UBP_FocusOnTargetComponent_C::CameraRotation' has a wrong offset!");

}

