#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageInteractor_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.BP_SetTickEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_FoliageInteractor_Manager_C_BP_SetTickEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_BP_SetTickEnable) == 0x000001, "Wrong alignment on BP_FoliageInteractor_Manager_C_BP_SetTickEnable");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_BP_SetTickEnable) == 0x000001, "Wrong size on BP_FoliageInteractor_Manager_C_BP_SetTickEnable");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_BP_SetTickEnable, Enable) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_BP_SetTickEnable::Enable' has a wrong offset!");

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.ExecuteUbergraph_BP_FoliageInteractor_Manager
// 0x02C0 (0x02C0 - 0x0000)
struct BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Foliage_Interactor_Component_C*     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_2;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_3;                        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue_2;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_4;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0248(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0288(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager) == 0x000008, "Wrong alignment on BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager) == 0x0002C0, "Wrong size on BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, EntryPoint) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, Temp_struct_Variable) == 0x000008, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, Temp_struct_Variable_1) == 0x000018, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000028, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000038, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00003C, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x00003D, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00003E, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00003F, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000040, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000041, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000042, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x000043, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x000044, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000045, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000046, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000090, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Less_IntInt_ReturnValue) == 0x0000AD, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, K2Node_Event_EndPlayReason) == 0x0000B4, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue_1) == 0x0000B5, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000D0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_SelectVector_ReturnValue) == 0x0000E8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000100, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000118, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_X) == 0x000130, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_Y) == 0x000138, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_Z) == 0x000140, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_X_1) == 0x000148, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_Y_1) == 0x000150, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BreakVector_Z_1) == 0x000158, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Abs_ReturnValue) == 0x000168, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000170, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000171, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Abs_ReturnValue_1) == 0x000178, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Abs_ReturnValue_2) == 0x000180, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000188, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000190, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_SelectFloat_ReturnValue) == 0x000198, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BooleanAND_ReturnValue) == 0x0001A0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x0001A8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Abs_ReturnValue_3) == 0x0001B8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Percent_FloatFloat_ReturnValue_2) == 0x0001C0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Percent_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001C8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x0001D0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_SelectFloat_ReturnValue_1) == 0x0001D8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Abs_ReturnValue_4) == 0x0001E0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Abs_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0001E8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_SelectFloat_ReturnValue_2) == 0x0001F0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_MakeVector_ReturnValue) == 0x0001F8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000210, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000228, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000238, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, K2Node_CreateDelegate_OutputDelegate) == 0x000248, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000258, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue_2) == 0x000268, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue_3) == 0x000269, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BooleanAND_ReturnValue_1) == 0x00026A, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BooleanAND_ReturnValue_2) == 0x00026B, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000270, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000278, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000288, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue_4) == 0x000298, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_IsValid_ReturnValue_5) == 0x000299, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BooleanAND_ReturnValue_3) == 0x00029A, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_BooleanAND_ReturnValue_4) == 0x00029B, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Add_ReturnValue) == 0x00029C, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Add_ReturnValue_1) == 0x0002A0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Add_ReturnValue_2) == 0x0002A4, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_Array_Add_ReturnValue_3) == 0x0002A8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0002B0, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x0002B8, "Member 'BP_FoliageInteractor_Manager_C_ExecuteUbergraph_BP_FoliageInteractor_Manager::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.OnCur_RT_Loaded
// 0x0018 (0x0018 - 0x0000)
struct BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded) == 0x000008, "Wrong alignment on BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded) == 0x000018, "Wrong size on BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded, Loaded) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded::Loaded' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_FoliageInteractor_Manager_C_OnCur_RT_Loaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.OnPre_RT_Loaded
// 0x0018 (0x0018 - 0x0000)
struct BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded) == 0x000008, "Wrong alignment on BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded) == 0x000018, "Wrong size on BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded, Loaded) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded::Loaded' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_FoliageInteractor_Manager_C_OnPre_RT_Loaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FoliageInteractor_Manager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FoliageInteractor_Manager_C_ReceiveEndPlay");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FoliageInteractor_Manager_C_ReceiveEndPlay");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FoliageInteractor_Manager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoliageInteractor_Manager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FoliageInteractor_Manager_C_ReceiveTick");
static_assert(sizeof(BP_FoliageInteractor_Manager_C_ReceiveTick) == 0x000004, "Wrong size on BP_FoliageInteractor_Manager_C_ReceiveTick");
static_assert(offsetof(BP_FoliageInteractor_Manager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FoliageInteractor_Manager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

