#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foliage_Interactor_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.AddRegister
// 0x0038 (0x0038 - 0x0000)
struct BP_Foliage_Interactor_Component_C_AddRegister final
{
public:
	bool                                          CallFunc_IsEnableInPlaying_NewParam;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNikkiGameInstance_BP_C*                K2Node_DynamicCast_AsNikki_Game_Instance_BP;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FoliageInteractor_Manager_C*        K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_AddRegister) == 0x000008, "Wrong alignment on BP_Foliage_Interactor_Component_C_AddRegister");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_AddRegister) == 0x000038, "Wrong size on BP_Foliage_Interactor_Component_C_AddRegister");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, CallFunc_IsEnableInPlaying_NewParam) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::CallFunc_IsEnableInPlaying_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, K2Node_DynamicCast_AsNikki_Game_Instance_BP) == 0x000010, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::K2Node_DynamicCast_AsNikki_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue) == 0x000020, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager) == 0x000028, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_AddRegister, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'BP_Foliage_Interactor_Component_C_AddRegister::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.ExecuteUbergraph_BP_Foliage_Interactor_Component
// 0x0050 (0x0050 - 0x0000)
struct BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Significance;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TickInterval;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_TickPaused;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESignificanceLevel                            K2Node_CustomEvent_SignificanceLevel;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, float Significance, float TickInterval, bool TickPaused, ESignificanceLevel SignificanceLevel)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableInPlaying_NewParam;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableInPlaying_NewParam_1;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component) == 0x000008, "Wrong alignment on BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component) == 0x000050, "Wrong size on BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, EntryPoint) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CustomEvent_Actor) == 0x000008, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CustomEvent_Significance) == 0x000010, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CustomEvent_Significance' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CustomEvent_TickInterval) == 0x000014, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CustomEvent_TickInterval' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CustomEvent_TickPaused) == 0x000018, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CustomEvent_TickPaused' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CustomEvent_SignificanceLevel) == 0x000019, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CustomEvent_SignificanceLevel' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, CallFunc_IsEnableInPlaying_NewParam) == 0x000048, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::CallFunc_IsEnableInPlaying_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component, CallFunc_IsEnableInPlaying_NewParam_1) == 0x000049, "Member 'BP_Foliage_Interactor_Component_C_ExecuteUbergraph_BP_Foliage_Interactor_Component::CallFunc_IsEnableInPlaying_NewParam_1' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.IsEnableInPlaying
// 0x0002 (0x0002 - 0x0000)
struct BP_Foliage_Interactor_Component_C_IsEnableInPlaying final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_IsEnableInPlaying) == 0x000001, "Wrong alignment on BP_Foliage_Interactor_Component_C_IsEnableInPlaying");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_IsEnableInPlaying) == 0x000002, "Wrong size on BP_Foliage_Interactor_Component_C_IsEnableInPlaying");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_IsEnableInPlaying, NewParam) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_IsEnableInPlaying::NewParam' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_IsEnableInPlaying, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_Foliage_Interactor_Component_C_IsEnableInPlaying::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.OnPostSignificanceChanged_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Significance;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickInterval;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TickPaused;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESignificanceLevel                            SignificanceLevel;                                 // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event) == 0x000008, "Wrong alignment on BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event) == 0x000018, "Wrong size on BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event, Actor) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event::Actor' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event, Significance) == 0x000008, "Member 'BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event::Significance' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event, TickInterval) == 0x00000C, "Member 'BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event::TickInterval' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event, TickPaused) == 0x000010, "Member 'BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event::TickPaused' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event, SignificanceLevel) == 0x000011, "Member 'BP_Foliage_Interactor_Component_C_OnPostSignificanceChanged_Event::SignificanceLevel' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Foliage_Interactor_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Foliage_Interactor_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Foliage_Interactor_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.RemoveRegister
// 0x0030 (0x0030 - 0x0000)
struct BP_Foliage_Interactor_Component_C_RemoveRegister final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNikkiGameInstance_BP_C*                K2Node_DynamicCast_AsNikki_Game_Instance_BP;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FoliageInteractor_Manager_C*        K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_RemoveRegister) == 0x000008, "Wrong alignment on BP_Foliage_Interactor_Component_C_RemoveRegister");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_RemoveRegister) == 0x000030, "Wrong size on BP_Foliage_Interactor_Component_C_RemoveRegister");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, K2Node_DynamicCast_AsNikki_Game_Instance_BP) == 0x000008, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::K2Node_DynamicCast_AsNikki_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue) == 0x000018, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::CallFunc_GetUIMultiFoliageInteractionManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager) == 0x000020, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::K2Node_DynamicCast_AsBP_Foliage_Interactor_Manager' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, CallFunc_Array_Contains_ReturnValue) == 0x000029, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_RemoveRegister, CallFunc_Array_RemoveItem_ReturnValue) == 0x00002A, "Member 'BP_Foliage_Interactor_Component_C_RemoveRegister::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_Foliage_Interactor_Component.BP_Foliage_Interactor_Component_C.SetEnableInPlaying
// 0x0001 (0x0001 - 0x0000)
struct BP_Foliage_Interactor_Component_C_SetEnableInPlaying final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foliage_Interactor_Component_C_SetEnableInPlaying) == 0x000001, "Wrong alignment on BP_Foliage_Interactor_Component_C_SetEnableInPlaying");
static_assert(sizeof(BP_Foliage_Interactor_Component_C_SetEnableInPlaying) == 0x000001, "Wrong size on BP_Foliage_Interactor_Component_C_SetEnableInPlaying");
static_assert(offsetof(BP_Foliage_Interactor_Component_C_SetEnableInPlaying, bEnable) == 0x000000, "Member 'BP_Foliage_Interactor_Component_C_SetEnableInPlaying::bEnable' has a wrong offset!");

}

