#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoliageInteractor_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FoliageInteractor_Manager.BP_FoliageInteractor_Manager_C
// 0x0098 (0x0440 - 0x03A8)
class ABP_FoliageInteractor_Manager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MaterialParent;                                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_Foliage_Interactor_Component_C*> InteractorArray;                               // 0x03C0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UMaterialInstance*                      DrawDynamicMaterial;                               // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Cur_RT;                                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Per_RT;                                            // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CopyMaterial;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlatformSupported;                                // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      ScreenPosArray;                                    // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      ScreenSizeArray;                                   // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      CoordinatePosArray;                                // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      CoordinateSizeArray;                               // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_SetTickEnable(bool Enable);
	void ExecuteUbergraph_BP_FoliageInteractor_Manager(int32 EntryPoint);
	void OnCur_RT_Loaded(class UObject* Loaded);
	void OnPre_RT_Loaded(class UObject* Loaded);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FoliageInteractor_Manager_C">();
	}
	static class ABP_FoliageInteractor_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FoliageInteractor_Manager_C>();
	}
};
static_assert(alignof(ABP_FoliageInteractor_Manager_C) == 0x000008, "Wrong alignment on ABP_FoliageInteractor_Manager_C");
static_assert(sizeof(ABP_FoliageInteractor_Manager_C) == 0x000440, "Wrong size on ABP_FoliageInteractor_Manager_C");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_FoliageInteractor_Manager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_FoliageInteractor_Manager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, MaterialParent) == 0x0003B8, "Member 'ABP_FoliageInteractor_Manager_C::MaterialParent' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, InteractorArray) == 0x0003C0, "Member 'ABP_FoliageInteractor_Manager_C::InteractorArray' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, DrawDynamicMaterial) == 0x0003D0, "Member 'ABP_FoliageInteractor_Manager_C::DrawDynamicMaterial' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, Player) == 0x0003D8, "Member 'ABP_FoliageInteractor_Manager_C::Player' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, Cur_RT) == 0x0003E0, "Member 'ABP_FoliageInteractor_Manager_C::Cur_RT' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, Per_RT) == 0x0003E8, "Member 'ABP_FoliageInteractor_Manager_C::Per_RT' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, CopyMaterial) == 0x0003F0, "Member 'ABP_FoliageInteractor_Manager_C::CopyMaterial' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, bPlatformSupported) == 0x0003F8, "Member 'ABP_FoliageInteractor_Manager_C::bPlatformSupported' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, ScreenPosArray) == 0x000400, "Member 'ABP_FoliageInteractor_Manager_C::ScreenPosArray' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, ScreenSizeArray) == 0x000410, "Member 'ABP_FoliageInteractor_Manager_C::ScreenSizeArray' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, CoordinatePosArray) == 0x000420, "Member 'ABP_FoliageInteractor_Manager_C::CoordinatePosArray' has a wrong offset!");
static_assert(offsetof(ABP_FoliageInteractor_Manager_C, CoordinateSizeArray) == 0x000430, "Member 'ABP_FoliageInteractor_Manager_C::CoordinateSizeArray' has a wrong offset!");

}

