#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FXDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FXDecal.BP_FXDecal_C
// 0x0030 (0x02D0 - 0x02A0)
class UBP_FXDecal_C final : public UDecalComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADecalActor*                            Decal;                                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Width;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ColorIntensity;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 Color;                                             // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FXDecal(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FXDecal_C">();
	}
	static class UBP_FXDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FXDecal_C>();
	}
};
static_assert(alignof(UBP_FXDecal_C) == 0x000010, "Wrong alignment on UBP_FXDecal_C");
static_assert(sizeof(UBP_FXDecal_C) == 0x0002D0, "Wrong size on UBP_FXDecal_C");
static_assert(offsetof(UBP_FXDecal_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_FXDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FXDecal_C, Decal) == 0x0002A8, "Member 'UBP_FXDecal_C::Decal' has a wrong offset!");
static_assert(offsetof(UBP_FXDecal_C, Width) == 0x0002B0, "Member 'UBP_FXDecal_C::Width' has a wrong offset!");
static_assert(offsetof(UBP_FXDecal_C, ColorIntensity) == 0x0002B8, "Member 'UBP_FXDecal_C::ColorIntensity' has a wrong offset!");
static_assert(offsetof(UBP_FXDecal_C, Color) == 0x0002C0, "Member 'UBP_FXDecal_C::Color' has a wrong offset!");

}

