#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FocusOnTargetComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FocusOnTargetComponent.BP_FocusOnTargetComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FocusOnTargetComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FocusOnTargetComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FocusOnTargetComponent_C_ReceiveTick");
static_assert(sizeof(BP_FocusOnTargetComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_FocusOnTargetComponent_C_ReceiveTick");
static_assert(offsetof(BP_FocusOnTargetComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FocusOnTargetComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FocusOnTargetComponent.BP_FocusOnTargetComponent_C.ExecuteUbergraph_BP_FocusOnTargetComponent
// 0x0108 (0x0108 - 0x0000)
struct BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0010(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent) == 0x000008, "Wrong alignment on BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent");
static_assert(sizeof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent) == 0x000108, "Wrong size on BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent");
static_assert(offsetof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent, EntryPoint) == 0x000000, "Member 'BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000010, "Member 'BP_FocusOnTargetComponent_C_ExecuteUbergraph_BP_FocusOnTargetComponent::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

}

