#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_HotUpdate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameMode_HotUpdate.BP_GameMode_HotUpdate_C
// 0x0048 (0x0490 - 0x0448)
class ABP_GameMode_HotUpdate_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HotUpdateComplete;                                 // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45A[0x6];                                      // 0x045A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         LevelShowStartTime;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            HotUpdateWidget;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PreloadMaterialFucntions_C*         PreLoadMaterialFunctions;                          // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   ForHardReference;                                  // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ControllerChangeEventHandle;                       // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLoadAndCreateUI();
	void BP_CheckPlatformResIsPCGamePad(bool* IsPCGamePad);
	void BP_OnConnectedControllersChange(int32 Param);
	void ConditionalAddToViewport(class UUserWidget* UserWidget);
	void ExecuteUbergraph_BP_GameMode_HotUpdate(int32 EntryPoint);
	void HotUpdateCompletedDelegate_Event_0(bool IsSuccess, const class FString& StatusString);
	void OnLoaded_9A19A21441BDBD5331CFDE828182456B(TSubclassOf<class UObject> Loaded);
	void OnLoaded_C0656A6549BBAF51854E5B91B277D580(TSubclassOf<class UObject> Loaded);
	void OnLoaded_F6851FDB4F97988F58385E892A51328A(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameMode_HotUpdate_C">();
	}
	static class ABP_GameMode_HotUpdate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameMode_HotUpdate_C>();
	}
};
static_assert(alignof(ABP_GameMode_HotUpdate_C) == 0x000008, "Wrong alignment on ABP_GameMode_HotUpdate_C");
static_assert(sizeof(ABP_GameMode_HotUpdate_C) == 0x000490, "Wrong size on ABP_GameMode_HotUpdate_C");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, UberGraphFrame) == 0x000448, "Member 'ABP_GameMode_HotUpdate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, DefaultSceneRoot) == 0x000450, "Member 'ABP_GameMode_HotUpdate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, Debug) == 0x000458, "Member 'ABP_GameMode_HotUpdate_C::Debug' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, HotUpdateComplete) == 0x000459, "Member 'ABP_GameMode_HotUpdate_C::HotUpdateComplete' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, LevelShowStartTime) == 0x000460, "Member 'ABP_GameMode_HotUpdate_C::LevelShowStartTime' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, HotUpdateWidget) == 0x000468, "Member 'ABP_GameMode_HotUpdate_C::HotUpdateWidget' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, PreLoadMaterialFunctions) == 0x000470, "Member 'ABP_GameMode_HotUpdate_C::PreLoadMaterialFunctions' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, ForHardReference) == 0x000478, "Member 'ABP_GameMode_HotUpdate_C::ForHardReference' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_HotUpdate_C, ControllerChangeEventHandle) == 0x000488, "Member 'ABP_GameMode_HotUpdate_C::ControllerChangeEventHandle' has a wrong offset!");

}

