#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GodRay_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GodRay_01.BP_GodRay_01_C.GetMID
// 0x0008 (0x0008 - 0x0000)
struct BP_GodRay_01_C_GetMID final
{
public:
	class UMaterialInstanceDynamic*               Mid_0;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GodRay_01_C_GetMID) == 0x000008, "Wrong alignment on BP_GodRay_01_C_GetMID");
static_assert(sizeof(BP_GodRay_01_C_GetMID) == 0x000008, "Wrong size on BP_GodRay_01_C_GetMID");
static_assert(offsetof(BP_GodRay_01_C_GetMID, Mid_0) == 0x000000, "Member 'BP_GodRay_01_C_GetMID::Mid_0' has a wrong offset!");

// Function BP_GodRay_01.BP_GodRay_01_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_GodRay_01_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GodRay_01_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_GodRay_01_C_UserConstructionScript");
static_assert(sizeof(BP_GodRay_01_C_UserConstructionScript) == 0x000020, "Wrong size on BP_GodRay_01_C_UserConstructionScript");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000008, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00000C, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000010, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000014, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_GodRay_01_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000018, "Member 'BP_GodRay_01_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");

}

