#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GodRay_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GodRay_01.BP_GodRay_01_C
// 0x0050 (0x03F8 - 0x03A8)
class ABP_GodRay_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   S_GodRay_01;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissiveColor;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Power;                                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PanningSpeed;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleUVs;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeDistance;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetMID(class UMaterialInstanceDynamic** Mid_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GodRay_01_C">();
	}
	static class ABP_GodRay_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GodRay_01_C>();
	}
};
static_assert(alignof(ABP_GodRay_01_C) == 0x000008, "Wrong alignment on ABP_GodRay_01_C");
static_assert(sizeof(ABP_GodRay_01_C) == 0x0003F8, "Wrong size on ABP_GodRay_01_C");
static_assert(offsetof(ABP_GodRay_01_C, S_GodRay_01) == 0x0003A8, "Member 'ABP_GodRay_01_C::S_GodRay_01' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_GodRay_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, Mid) == 0x0003B8, "Member 'ABP_GodRay_01_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, EmissiveColor) == 0x0003C0, "Member 'ABP_GodRay_01_C::EmissiveColor' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, Opacity) == 0x0003D0, "Member 'ABP_GodRay_01_C::Opacity' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, Power) == 0x0003D8, "Member 'ABP_GodRay_01_C::Power' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, PanningSpeed) == 0x0003E0, "Member 'ABP_GodRay_01_C::PanningSpeed' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, ScaleUVs) == 0x0003E8, "Member 'ABP_GodRay_01_C::ScaleUVs' has a wrong offset!");
static_assert(offsetof(ABP_GodRay_01_C, FadeDistance) == 0x0003F0, "Member 'ABP_GodRay_01_C::FadeDistance' has a wrong offset!");

}

