#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoToVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GoToVolume.BP_GoToVolume_C.ShowVolumn
// 0x0002 (0x0002 - 0x0000)
struct BP_GoToVolume_C_ShowVolumn final
{
public:
	bool                                          CanShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_ShowVolumn) == 0x000001, "Wrong alignment on BP_GoToVolume_C_ShowVolumn");
static_assert(sizeof(BP_GoToVolume_C_ShowVolumn) == 0x000002, "Wrong size on BP_GoToVolume_C_ShowVolumn");
static_assert(offsetof(BP_GoToVolume_C_ShowVolumn, CanShow) == 0x000000, "Member 'BP_GoToVolume_C_ShowVolumn::CanShow' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_ShowVolumn, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_GoToVolume_C_ShowVolumn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.SetTransformInfo
// 0x0340 (0x0340 - 0x0000)
struct BP_GoToVolume_C_SetTransformInfo final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0150(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x0248(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GoToVolume_C_SetTransformInfo) == 0x000010, "Wrong alignment on BP_GoToVolume_C_SetTransformInfo");
static_assert(sizeof(BP_GoToVolume_C_SetTransformInfo) == 0x000340, "Wrong size on BP_GoToVolume_C_SetTransformInfo");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, Location) == 0x000000, "Member 'BP_GoToVolume_C_SetTransformInfo::Location' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, Rotation) == 0x000018, "Member 'BP_GoToVolume_C_SetTransformInfo::Rotation' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, Scale) == 0x000030, "Member 'BP_GoToVolume_C_SetTransformInfo::Scale' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_BreakVector_Y) == 0x000050, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_BreakVector_Z) == 0x000058, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_MakeTransform_ReturnValue_1) == 0x0000F0, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000150, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetTransformInfo, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x000248, "Member 'BP_GoToVolume_C_SetTransformInfo::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.SetMeshType
// 0x0008 (0x0008 - 0x0000)
struct BP_GoToVolume_C_SetMeshType final
{
public:
	int32                                         MeshType_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_SetMeshType) == 0x000004, "Wrong alignment on BP_GoToVolume_C_SetMeshType");
static_assert(sizeof(BP_GoToVolume_C_SetMeshType) == 0x000008, "Wrong size on BP_GoToVolume_C_SetMeshType");
static_assert(offsetof(BP_GoToVolume_C_SetMeshType, MeshType_0) == 0x000000, "Member 'BP_GoToVolume_C_SetMeshType::MeshType_0' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetMeshType, CallFunc_SetStaticMesh_ReturnValue) == 0x000004, "Member 'BP_GoToVolume_C_SetMeshType::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetMeshType, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000005, "Member 'BP_GoToVolume_C_SetMeshType::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetMeshType, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000006, "Member 'BP_GoToVolume_C_SetMeshType::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_SetMeshType, K2Node_SwitchInteger_CmpSuccess) == 0x000007, "Member 'BP_GoToVolume_C_SetMeshType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GoToVolume_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_GoToVolume_C_ReceiveTick");
static_assert(sizeof(BP_GoToVolume_C_ReceiveTick) == 0x000004, "Wrong size on BP_GoToVolume_C_ReceiveTick");
static_assert(offsetof(BP_GoToVolume_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_GoToVolume_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_GoToVolume_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_GoToVolume_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_GoToVolume_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_GoToVolume_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_GoToVolume_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_GoToVolume_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_GoToVolume_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_GoToVolume_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_GoToVolume_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_GoToVolume_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_GoToVolume_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_GoToVolume_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.OnOverlapEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_GoToVolume_C_OnOverlapEnd final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_OnOverlapEnd) == 0x000008, "Wrong alignment on BP_GoToVolume_C_OnOverlapEnd");
static_assert(sizeof(BP_GoToVolume_C_OnOverlapEnd) == 0x000008, "Wrong size on BP_GoToVolume_C_OnOverlapEnd");
static_assert(offsetof(BP_GoToVolume_C_OnOverlapEnd, Actor) == 0x000000, "Member 'BP_GoToVolume_C_OnOverlapEnd::Actor' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.OnOverlapBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_GoToVolume_C_OnOverlapBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_OnOverlapBegin) == 0x000008, "Wrong alignment on BP_GoToVolume_C_OnOverlapBegin");
static_assert(sizeof(BP_GoToVolume_C_OnOverlapBegin) == 0x000008, "Wrong size on BP_GoToVolume_C_OnOverlapBegin");
static_assert(offsetof(BP_GoToVolume_C_OnOverlapBegin, Actor) == 0x000000, "Member 'BP_GoToVolume_C_OnOverlapBegin::Actor' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.ExecuteUbergraph_BP_GoToVolume
// 0x0020 (0x0020 - 0x0000)
struct BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume) == 0x000008, "Wrong alignment on BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume");
static_assert(sizeof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume) == 0x000020, "Wrong size on BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume");
static_assert(offsetof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume, EntryPoint) == 0x000000, "Member 'BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume, K2Node_Event_OtherActor_1) == 0x000018, "Member 'BP_GoToVolume_C_ExecuteUbergraph_BP_GoToVolume::K2Node_Event_OtherActor_1' has a wrong offset!");

// Function BP_GoToVolume.BP_GoToVolume_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_GoToVolume_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoToVolume_C_GetModuleName) == 0x000008, "Wrong alignment on BP_GoToVolume_C_GetModuleName");
static_assert(sizeof(BP_GoToVolume_C_GetModuleName) == 0x000010, "Wrong size on BP_GoToVolume_C_GetModuleName");
static_assert(offsetof(BP_GoToVolume_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_GoToVolume_C_GetModuleName::ReturnValue' has a wrong offset!");

}

