#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HandleInteractionLogic

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HandleInteractionLogic.BP_HandleInteractionLogic_C.ExecuteUbergraph_BP_HandleInteractionLogic
// 0x0004 (0x0004 - 0x0000)
struct BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic) == 0x000004, "Wrong alignment on BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic");
static_assert(sizeof(BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic) == 0x000004, "Wrong size on BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic");
static_assert(offsetof(BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic, EntryPoint) == 0x000000, "Member 'BP_HandleInteractionLogic_C_ExecuteUbergraph_BP_HandleInteractionLogic::EntryPoint' has a wrong offset!");

// Function BP_HandleInteractionLogic.BP_HandleInteractionLogic_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_HandleInteractionLogic_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HandleInteractionLogic_C_GetModuleName) == 0x000008, "Wrong alignment on BP_HandleInteractionLogic_C_GetModuleName");
static_assert(sizeof(BP_HandleInteractionLogic_C_GetModuleName) == 0x000010, "Wrong size on BP_HandleInteractionLogic_C_GetModuleName");
static_assert(offsetof(BP_HandleInteractionLogic_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_HandleInteractionLogic_C_GetModuleName::ReturnValue' has a wrong offset!");

}

