#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractivePhantomComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_InteractiveObjPhantomState_structs.hpp"
#include "FInteractivePhantomMaterialConfig_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractivePhantomComponent.BP_InteractivePhantomComponent_C
// 0x0098 (0x0140 - 0x00A8)
class UBP_InteractivePhantomComponent_C final : public UX6ActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(E_InteractiveObjPhantomState NewState, E_InteractiveObjPhantomState OldState)> OnPhantomStateChange; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          BP_HandleFreeze;                                   // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_HandleHiddenInGame;                             // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_HandleMaterial;                                 // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FFInteractivePhantomMaterialConfig> BP_MeshName2MaterialConfig;         // 0x00C8(0x0050)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(E_InteractiveObjPhantomState NewState, E_InteractiveObjPhantomState OldState)> PrePhantomStateChange; // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         BP_GuideTeachingBookItemID;                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BP_TriggerGuideDistSquared;                        // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bDisableStateUpdate;                            // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_CanOtherPlayerShareRewardWithMe(class AActor* OtherPlayer, bool* bCanShare);
	void BP_CanShareRewardWithOtherPlayer(bool* bCanShare);
	void BP_DisableStateUpdate();
	void BP_EnableStateUpdate();
	void BP_ForceSetPhantomState(E_InteractiveObjPhantomState NewState);
	void BP_GetHoldingHandsPlayer(class ACharacter** HoldingHandsPlayer);
	void BP_GetOtherPlayerToShareReward(class ACharacter** OtherPlayer);
	void BP_GetPhantomState(E_InteractiveObjPhantomState* PhantomState);
	void BP_IsHoldingHands(bool* bHoldingHands);
	void ExecuteUbergraph_BP_InteractivePhantomComponent(int32 EntryPoint);
	void ReceiveBeginPlay();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractivePhantomComponent_C">();
	}
	static class UBP_InteractivePhantomComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractivePhantomComponent_C>();
	}
};
static_assert(alignof(UBP_InteractivePhantomComponent_C) == 0x000008, "Wrong alignment on UBP_InteractivePhantomComponent_C");
static_assert(sizeof(UBP_InteractivePhantomComponent_C) == 0x000140, "Wrong size on UBP_InteractivePhantomComponent_C");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_InteractivePhantomComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, OnPhantomStateChange) == 0x0000B0, "Member 'UBP_InteractivePhantomComponent_C::OnPhantomStateChange' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_HandleFreeze) == 0x0000C0, "Member 'UBP_InteractivePhantomComponent_C::BP_HandleFreeze' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_HandleHiddenInGame) == 0x0000C1, "Member 'UBP_InteractivePhantomComponent_C::BP_HandleHiddenInGame' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_HandleMaterial) == 0x0000C2, "Member 'UBP_InteractivePhantomComponent_C::BP_HandleMaterial' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_MeshName2MaterialConfig) == 0x0000C8, "Member 'UBP_InteractivePhantomComponent_C::BP_MeshName2MaterialConfig' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, PrePhantomStateChange) == 0x000118, "Member 'UBP_InteractivePhantomComponent_C::PrePhantomStateChange' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_GuideTeachingBookItemID) == 0x000128, "Member 'UBP_InteractivePhantomComponent_C::BP_GuideTeachingBookItemID' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_TriggerGuideDistSquared) == 0x000130, "Member 'UBP_InteractivePhantomComponent_C::BP_TriggerGuideDistSquared' has a wrong offset!");
static_assert(offsetof(UBP_InteractivePhantomComponent_C, BP_bDisableStateUpdate) == 0x000138, "Member 'UBP_InteractivePhantomComponent_C::BP_bDisableStateUpdate' has a wrong offset!");

}

