#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionWidgetManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractionWidgetManager.BP_InteractionWidgetManager_C
// 0x0018 (0x0450 - 0x0438)
class ABP_InteractionWidgetManager_C final : public AX6Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_AbilityInteractionWidgtComponent_C* BP_AbilityInteractionWidgtComponent;               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractionWidgtComponent_C*        BP_InteractionWidgtComponent;                      // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BP_RotateWithCameraRotation();
	void ExecuteUbergraph_BP_InteractionWidgetManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractionWidgetManager_C">();
	}
	static class ABP_InteractionWidgetManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractionWidgetManager_C>();
	}
};
static_assert(alignof(ABP_InteractionWidgetManager_C) == 0x000008, "Wrong alignment on ABP_InteractionWidgetManager_C");
static_assert(sizeof(ABP_InteractionWidgetManager_C) == 0x000450, "Wrong size on ABP_InteractionWidgetManager_C");
static_assert(offsetof(ABP_InteractionWidgetManager_C, UberGraphFrame) == 0x000438, "Member 'ABP_InteractionWidgetManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteractionWidgetManager_C, BP_AbilityInteractionWidgtComponent) == 0x000440, "Member 'ABP_InteractionWidgetManager_C::BP_AbilityInteractionWidgtComponent' has a wrong offset!");
static_assert(offsetof(ABP_InteractionWidgetManager_C, BP_InteractionWidgtComponent) == 0x000448, "Member 'ABP_InteractionWidgetManager_C::BP_InteractionWidgtComponent' has a wrong offset!");

}

