#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveWhitePointWidgetComponent

#include "Basic.hpp"

#include "E_InteractiveActorType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractiveWhitePointWidgetComponent.BP_InteractiveWhitePointWidgetComponent_C
// 0x0030 (0x07B0 - 0x0780)
class UBP_InteractiveWhitePointWidgetComponent_C final : public UWidgetComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractiveActorComponent_C*        BP_InteractiveActorComponent;                      // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            InsectMark;                                        // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            BP_Widget;                                         // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Interaction_Dot_C*              InteractiveDotWidget;                              // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_InteractiveWhitePointWidgetComponent(int32 EntryPoint);
	void BP_Init(E_InteractiveActorType Type);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractiveWhitePointWidgetComponent_C">();
	}
	static class UBP_InteractiveWhitePointWidgetComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractiveWhitePointWidgetComponent_C>();
	}
};
static_assert(alignof(UBP_InteractiveWhitePointWidgetComponent_C) == 0x000010, "Wrong alignment on UBP_InteractiveWhitePointWidgetComponent_C");
static_assert(sizeof(UBP_InteractiveWhitePointWidgetComponent_C) == 0x0007B0, "Wrong size on UBP_InteractiveWhitePointWidgetComponent_C");
static_assert(offsetof(UBP_InteractiveWhitePointWidgetComponent_C, UberGraphFrame) == 0x000780, "Member 'UBP_InteractiveWhitePointWidgetComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveWhitePointWidgetComponent_C, BP_InteractiveActorComponent) == 0x000788, "Member 'UBP_InteractiveWhitePointWidgetComponent_C::BP_InteractiveActorComponent' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveWhitePointWidgetComponent_C, InsectMark) == 0x000790, "Member 'UBP_InteractiveWhitePointWidgetComponent_C::InsectMark' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveWhitePointWidgetComponent_C, BP_Widget) == 0x000798, "Member 'UBP_InteractiveWhitePointWidgetComponent_C::BP_Widget' has a wrong offset!");
static_assert(offsetof(UBP_InteractiveWhitePointWidgetComponent_C, InteractiveDotWidget) == 0x0007A0, "Member 'UBP_InteractiveWhitePointWidgetComponent_C::InteractiveDotWidget' has a wrong offset!");

}

