#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InsectVerticalShadow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InsectVerticalShadow.BP_InsectVerticalShadow_C.ServerInit
// 0x0001 (0x0001 - 0x0000)
struct BP_InsectVerticalShadow_C_ServerInit final
{
public:
	bool                                          bServer;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InsectVerticalShadow_C_ServerInit) == 0x000001, "Wrong alignment on BP_InsectVerticalShadow_C_ServerInit");
static_assert(sizeof(BP_InsectVerticalShadow_C_ServerInit) == 0x000001, "Wrong size on BP_InsectVerticalShadow_C_ServerInit");
static_assert(offsetof(BP_InsectVerticalShadow_C_ServerInit, bServer) == 0x000000, "Member 'BP_InsectVerticalShadow_C_ServerInit::bServer' has a wrong offset!");

// Function BP_InsectVerticalShadow.BP_InsectVerticalShadow_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InsectVerticalShadow_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InsectVerticalShadow_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InsectVerticalShadow_C_ReceiveTick");
static_assert(sizeof(BP_InsectVerticalShadow_C_ReceiveTick) == 0x000004, "Wrong size on BP_InsectVerticalShadow_C_ReceiveTick");
static_assert(offsetof(BP_InsectVerticalShadow_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InsectVerticalShadow_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InsectVerticalShadow.BP_InsectVerticalShadow_C.ExecuteUbergraph_BP_InsectVerticalShadow
// 0x0090 (0x0090 - 0x0000)
struct BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bServer;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow) == 0x000008, "Wrong alignment on BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow");
static_assert(sizeof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow) == 0x000090, "Wrong size on BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, EntryPoint) == 0x000000, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, K2Node_Event_bServer) == 0x000004, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::K2Node_Event_bServer' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_GetComponentBounds_Origin) == 0x000008, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_GetComponentBounds_BoxExtent) == 0x000020, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_GetComponentBounds_SphereRadius) == 0x000038, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000080, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000088, "Member 'BP_InsectVerticalShadow_C_ExecuteUbergraph_BP_InsectVerticalShadow::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

