#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JumpStage_ConfigTemplate

#include "Basic.hpp"

#include "F_FloatingJump_CT_General_structs.hpp"
#include "F_FloatingJump_CT_Jump_structs.hpp"
#include "F_FloatingJump_CT_ModularFunctionality_structs.hpp"
#include "F_FloatingJump_CT_Fall_structs.hpp"
#include "Engine_classes.hpp"
#include "F_FloatingJump_CT_Float_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JumpStage_ConfigTemplate.BP_JumpStage_ConfigTemplate_C
// 0x0210 (0x0240 - 0x0030)
class UBP_JumpStage_ConfigTemplate_C final : public UPrimaryDataAsset
{
public:
	struct FF_FloatingJump_CT_General             General;                                           // 0x0030(0x0088)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_FloatingJump_CT_Jump                Jump;                                              // 0x00B8(0x0048)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_FloatingJump_CT_Fall                Fall;                                              // 0x0100(0x0048)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FF_FloatingJump_CT_Float               float_0;                                           // 0x0148(0x0060)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_FloatingJump_CT_ModularFunctionality ModularFunctionality;                             // 0x01A8(0x0098)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JumpStage_ConfigTemplate_C">();
	}
	static class UBP_JumpStage_ConfigTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_JumpStage_ConfigTemplate_C>();
	}
};
static_assert(alignof(UBP_JumpStage_ConfigTemplate_C) == 0x000008, "Wrong alignment on UBP_JumpStage_ConfigTemplate_C");
static_assert(sizeof(UBP_JumpStage_ConfigTemplate_C) == 0x000240, "Wrong size on UBP_JumpStage_ConfigTemplate_C");
static_assert(offsetof(UBP_JumpStage_ConfigTemplate_C, General) == 0x000030, "Member 'UBP_JumpStage_ConfigTemplate_C::General' has a wrong offset!");
static_assert(offsetof(UBP_JumpStage_ConfigTemplate_C, Jump) == 0x0000B8, "Member 'UBP_JumpStage_ConfigTemplate_C::Jump' has a wrong offset!");
static_assert(offsetof(UBP_JumpStage_ConfigTemplate_C, Fall) == 0x000100, "Member 'UBP_JumpStage_ConfigTemplate_C::Fall' has a wrong offset!");
static_assert(offsetof(UBP_JumpStage_ConfigTemplate_C, float_0) == 0x000148, "Member 'UBP_JumpStage_ConfigTemplate_C::float_0' has a wrong offset!");
static_assert(offsetof(UBP_JumpStage_ConfigTemplate_C, ModularFunctionality) == 0x0001A8, "Member 'UBP_JumpStage_ConfigTemplate_C::ModularFunctionality' has a wrong offset!");

}

