#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LoadDataAsset

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LoadDataAsset.BP_LoadDataAsset_C
// 0x0040 (0x0068 - 0x0028)
class UBP_LoadDataAsset_C final : public UObject
{
public:
	class UBP_BoxTraceDataAsset_C*                BP_BoxTraceDataAsset;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CompsDataAsset_C*                   BP_CompsDataAsset;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_DamageDataAsset_C*                  BP_DamageDataAsset;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_LimitShotDataAsset_C*               BP_LimitShotDataAsset;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_LineTraceDataAsset_C*               BP_LineTraceDataAsset;                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_ShapeTraceDataAsset_C*              BP_ShapeTraceDataAsset;                            // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_SphereTraceDataAsset_C*             BP_SphereTraceDataAsset;                           // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_StimuliSourceDataAsset_C*           BP_StimuliSourceDataAsset;                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LoadDataAsset_C">();
	}
	static class UBP_LoadDataAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LoadDataAsset_C>();
	}
};
static_assert(alignof(UBP_LoadDataAsset_C) == 0x000008, "Wrong alignment on UBP_LoadDataAsset_C");
static_assert(sizeof(UBP_LoadDataAsset_C) == 0x000068, "Wrong size on UBP_LoadDataAsset_C");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_BoxTraceDataAsset) == 0x000028, "Member 'UBP_LoadDataAsset_C::BP_BoxTraceDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_CompsDataAsset) == 0x000030, "Member 'UBP_LoadDataAsset_C::BP_CompsDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_DamageDataAsset) == 0x000038, "Member 'UBP_LoadDataAsset_C::BP_DamageDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_LimitShotDataAsset) == 0x000040, "Member 'UBP_LoadDataAsset_C::BP_LimitShotDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_LineTraceDataAsset) == 0x000048, "Member 'UBP_LoadDataAsset_C::BP_LineTraceDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_ShapeTraceDataAsset) == 0x000050, "Member 'UBP_LoadDataAsset_C::BP_ShapeTraceDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_SphereTraceDataAsset) == 0x000058, "Member 'UBP_LoadDataAsset_C::BP_SphereTraceDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_LoadDataAsset_C, BP_StimuliSourceDataAsset) == 0x000060, "Member 'UBP_LoadDataAsset_C::BP_StimuliSourceDataAsset' has a wrong offset!");

}

