#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelConfigMgr

#include "Basic.hpp"

#include "F_Level_LightConsoleVar_structs.hpp"
#include "S_LevelConfigScalability_structs.hpp"
#include "S_ScalabilityValue_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.ExecuteUbergraph_BP_LevelConfigMgr
// 0x01A0 (0x01A0 - 0x0000)
struct BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LevelConfigActor_Master_C*          K2Node_DynamicCast_AsBP_Level_Config_Actor_Master; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0040(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelConfigActor_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvWeathers_C*                    K2Node_DynamicCast_AsBP_Dy_Env_Weathers;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvSky_C*                         K2Node_DynamicCast_AsDES_Sky;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, double>                   K2Node_Select_Default;                             // 0x0100(0x0050)()
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvSys_C*                         K2Node_DynamicCast_AsBP_Dy_Env_Sys;                // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast; // 0x019C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr) == 0x000010, "Wrong alignment on BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr");
static_assert(sizeof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr) == 0x0001A0, "Wrong size on BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, EntryPoint) == 0x000000, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000008, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_bool_Variable) == 0x000009, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_AsBP_Level_Config_Actor_Master) == 0x000010, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_AsBP_Level_Config_Actor_Master' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_string_Variable) == 0x000040, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_GetGameUserSettings_ReturnValue) == 0x000050, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Map_Contains_ReturnValue) == 0x00005C, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_AsBP_Dy_Env_Weathers) == 0x0000D8, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_AsBP_Dy_Env_Weathers' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_IsValid_ReturnValue_2) == 0x0000E1, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_AsDES_Sky) == 0x0000E8, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_AsDES_Sky' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, Temp_int_Loop_Counter_Variable) == 0x0000F4, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_Select_Default) == 0x000100, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Map_Keys_Keys) == 0x000150, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Map_IsNotEmpty_ReturnValue) == 0x000160, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Map_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Array_Get_Item) == 0x000168, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Map_Find_Value) == 0x000178, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Map_Find_ReturnValue) == 0x000180, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Array_Length_ReturnValue) == 0x000184, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_Less_IntInt_ReturnValue) == 0x000188, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BooleanAND_ReturnValue) == 0x000189, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_BooleanAND_ReturnValue_1) == 0x00018A, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_IsValid_ReturnValue_3) == 0x00018B, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_AsBP_Dy_Env_Sys) == 0x000190, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_AsBP_Dy_Env_Sys' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr, CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast) == 0x00019C, "Member 'BP_LevelConfigMgr_C_ExecuteUbergraph_BP_LevelConfigMgr::CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.Get Other Quality
// 0x0048 (0x0048 - 0x0000)
struct BP_LevelConfigMgr_C_Get_Other_Quality final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Add_Value_ImplicitCast;               // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_Get_Other_Quality) == 0x000008, "Wrong alignment on BP_LevelConfigMgr_C_Get_Other_Quality");
static_assert(sizeof(BP_LevelConfigMgr_C_Get_Other_Quality) == 0x000048, "Wrong size on BP_LevelConfigMgr_C_Get_Other_Quality");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x00003C, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Get_Other_Quality, CallFunc_Map_Add_Value_ImplicitCast) == 0x000040, "Member 'BP_LevelConfigMgr_C_Get_Other_Quality::CallFunc_Map_Add_Value_ImplicitCast' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LevelConfigMgr_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LevelConfigMgr_C_ReceiveTick");
static_assert(sizeof(BP_LevelConfigMgr_C_ReceiveTick) == 0x000004, "Wrong size on BP_LevelConfigMgr_C_ReceiveTick");
static_assert(offsetof(BP_LevelConfigMgr_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LevelConfigMgr_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.Restore All Scalability
// 0x0070 (0x0070 - 0x0000)
struct BP_LevelConfigMgr_C_Restore_All_Scalability final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast; // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_Restore_All_Scalability) == 0x000008, "Wrong alignment on BP_LevelConfigMgr_C_Restore_All_Scalability");
static_assert(sizeof(BP_LevelConfigMgr_C_Restore_All_Scalability) == 0x000070, "Wrong size on BP_LevelConfigMgr_C_Restore_All_Scalability");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000020, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x000038, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Map_Find_Value) == 0x000040, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000054, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_GetConsoleVariableIntValue_ReturnValue_2) == 0x000058, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_GetConsoleVariableIntValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_All_Scalability, CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast) == 0x000068, "Member 'BP_LevelConfigMgr_C_Restore_All_Scalability::CallFunc_SetConsoleVariableFromFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.Restore Mobile Light CVars
// 0x0060 (0x0060 - 0x0000)
struct BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_Level_LightConsoleVar               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars) == 0x000008, "Wrong alignment on BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars");
static_assert(sizeof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars) == 0x000060, "Wrong size on BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_LevelConfigMgr_C_Restore_Mobile_Light_CVars::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.Restore Scalability
// 0x00D0 (0x00D0 - 0x0000)
struct BP_LevelConfigMgr_C_Restore_Scalability final
{
public:
	TArray<struct FS_LevelConfigScalability>      Quality;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Level;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_LevelConfigScalability              CallFunc_Array_Get_Item;                           // 0x0028(0x0050)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetConsoleVariableFloatValue_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ScalabilityValue                    K2Node_Select_Default;                             // 0x0088(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_0_ImplicitCast;               // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_1_ImplicitCast;               // 0x00BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_2_ImplicitCast;               // 0x00C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_3_ImplicitCast;               // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_Restore_Scalability) == 0x000008, "Wrong alignment on BP_LevelConfigMgr_C_Restore_Scalability");
static_assert(sizeof(BP_LevelConfigMgr_C_Restore_Scalability) == 0x0000D0, "Wrong size on BP_LevelConfigMgr_C_Restore_Scalability");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Quality) == 0x000000, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Quality' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Level) == 0x000010, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Level' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Temp_int_Variable) == 0x000014, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_GetConsoleVariableFloatValue_ReturnValue) == 0x00007C, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_GetConsoleVariableFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, Temp_bool_Variable) == 0x000084, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Default) == 0x000088, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Default_1) == 0x0000A8, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0000B0, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Option_0_ImplicitCast) == 0x0000B8, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Option_1_ImplicitCast) == 0x0000BC, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Option_2_ImplicitCast) == 0x0000C0, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Option_2_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, K2Node_Select_Option_3_ImplicitCast) == 0x0000C4, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::K2Node_Select_Option_3_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Restore_Scalability, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x0000C8, "Member 'BP_LevelConfigMgr_C_Restore_Scalability::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_LevelConfigMgr.BP_LevelConfigMgr_C.Set Mobile Light CVars
// 0x0140 (0x0140 - 0x0000)
struct BP_LevelConfigMgr_C_Set_Mobile_Light_CVars final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_Level_LightConsoleVar               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetLevel_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLevelPackageName_ReturnValue;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars) == 0x000008, "Wrong alignment on BP_LevelConfigMgr_C_Set_Mobile_Light_CVars");
static_assert(sizeof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars) == 0x000140, "Wrong size on BP_LevelConfigMgr_C_Set_Mobile_Light_CVars");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_BreakSoftObjectPath_PathString) == 0x000060, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Split_LeftS) == 0x000078, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Split_RightS) == 0x000088, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Split_ReturnValue) == 0x000098, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, Temp_bool_Variable) == 0x000099, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelConfigMgr_C_Set_Mobile_Light_CVars, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_LevelConfigMgr_C_Set_Mobile_Light_CVars::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
