#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LookAtLogicHandler

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LookAtLogicHandler.BP_LookAtLogicHandler_C.CanOwnerActorDoLookAt
// 0x0001 (0x0001 - 0x0000)
struct BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt) == 0x000001, "Wrong alignment on BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt");
static_assert(sizeof(BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt) == 0x000001, "Wrong size on BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt");
static_assert(offsetof(BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt, ReturnValue) == 0x000000, "Member 'BP_LookAtLogicHandler_C_CanOwnerActorDoLookAt::ReturnValue' has a wrong offset!");

// Function BP_LookAtLogicHandler.BP_LookAtLogicHandler_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_LookAtLogicHandler_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_LookAtLogicHandler_C_GetModuleName) == 0x000008, "Wrong alignment on BP_LookAtLogicHandler_C_GetModuleName");
static_assert(sizeof(BP_LookAtLogicHandler_C_GetModuleName) == 0x000010, "Wrong size on BP_LookAtLogicHandler_C_GetModuleName");
static_assert(offsetof(BP_LookAtLogicHandler_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_LookAtLogicHandler_C_GetModuleName::ReturnValue' has a wrong offset!");

}

