#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightningControl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LightningControl.BP_LightningControl_C.ExecuteUbergraph_BP_LightningControl
// 0x0288 (0x0288 - 0x0000)
struct BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvWeathers_C*                    K2Node_DynamicCast_AsBP_Dy_Env_Weathers;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvSky_C*                         K2Node_DynamicCast_AsDES_Sky;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSys_C*                         CallFunc_StorageTodsysActor_ref_TodSys;            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_AddLightning_ImplicitCast;      // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl) == 0x000008, "Wrong alignment on BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl");
static_assert(sizeof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl) == 0x000288, "Wrong size on BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, EntryPoint) == 0x000000, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_DynamicCast_AsBP_Dy_Env_Weathers) == 0x000030, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_DynamicCast_AsBP_Dy_Env_Weathers' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_DynamicCast_AsDES_Sky) == 0x000040, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_DynamicCast_AsDES_Sky' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_RandomFloatInRange_ReturnValue) == 0x000058, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000060, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000068, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetCameraRotation_ReturnValue) == 0x000070, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakRotator_Roll) == 0x0000A0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakRotator_Pitch) == 0x0000A4, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakRotator_Yaw) == 0x0000A8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000B0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_MakeRotator_ReturnValue) == 0x0000C0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000D8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetTimeRange_MinTime) == 0x0000E8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetTimeRange_MaxTime) == 0x0000EC, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000F0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetCameraLocation_ReturnValue) == 0x0000F8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000110, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000118, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Normal_ReturnValue) == 0x000130, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakVector_X) == 0x000148, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakVector_Y) == 0x000150, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakVector_Z) == 0x000158, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_IsValid_ReturnValue_2) == 0x000168, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_MakeVector2D_ReturnValue) == 0x000170, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000180, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakVector2D_X) == 0x000190, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_BreakVector2D_Y) == 0x000198, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001A0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_MakeStruct_LinearColor) == 0x0001A8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_StorageTodsysActor_ref_TodSys) == 0x0001B8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_StorageTodsysActor_ref_TodSys' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_Event_DeltaSeconds) == 0x0001C0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0001C8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_MakeVector_ReturnValue) == 0x0001D0, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001E8, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Add_VectorVector_ReturnValue) == 0x000200, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000218, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00021C, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000220, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000228, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000230, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000238, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000240, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000248, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x00024C, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Delay_Duration_ImplicitCast) == 0x000250, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_MakeStruct_R_ImplicitCast) == 0x000254, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_MakeStruct_G_ImplicitCast) == 0x000258, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_MakeStruct_B_ImplicitCast) == 0x00025C, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_SetPlayRate_NewRate_ImplicitCast) == 0x000260, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_SetPlayRate_NewRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000264, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000268, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000278, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000280, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl, K2Node_VariableSet_AddLightning_ImplicitCast) == 0x000284, "Member 'BP_LightningControl_C_ExecuteUbergraph_BP_LightningControl::K2Node_VariableSet_AddLightning_ImplicitCast' has a wrong offset!");

// Function BP_LightningControl.BP_LightningControl_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LightningControl_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightningControl_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LightningControl_C_ReceiveTick");
static_assert(sizeof(BP_LightningControl_C_ReceiveTick) == 0x000004, "Wrong size on BP_LightningControl_C_ReceiveTick");
static_assert(offsetof(BP_LightningControl_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LightningControl_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

