#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LookAtCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LookAtCamera.BP_LookAtCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LookAtCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LookAtCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LookAtCamera_C_ReceiveTick");
static_assert(sizeof(BP_LookAtCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_LookAtCamera_C_ReceiveTick");
static_assert(offsetof(BP_LookAtCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LookAtCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LookAtCamera.BP_LookAtCamera_C.ExecuteUbergraph_BP_LookAtCamera
// 0x0178 (0x0178 - 0x0000)
struct BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0078(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera) == 0x000008, "Wrong alignment on BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera");
static_assert(sizeof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera) == 0x000178, "Wrong size on BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, EntryPoint) == 0x000000, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_GetCameraRotation_ReturnValue) == 0x000010, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_GetCameraLocation_ReturnValue) == 0x000028, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_FindLookAtRotation_ReturnValue) == 0x000060, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000078, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000170, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'BP_LookAtCamera_C_ExecuteUbergraph_BP_LookAtCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

