#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MultiplayerMoonBoatCameraActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MultiplayerMoonBoatCameraActor.BP_MultiplayerMoonBoatCameraActor_C
// 0x0028 (0x03D0 - 0x03A8)
class ABP_MultiplayerMoonBoatCameraActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAdvancedCamera*                        AdvancedCamera;                                    // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BP_CameraDeadZoneAngle;                            // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_CameraRotationSpeed;                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_SetCameraRotationConfig(double BP_CameraDeadZoneAngle_0, double BP_CameraRotationSpeed_0);
	void ExecuteUbergraph_BP_MultiplayerMoonBoatCameraActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MultiplayerMoonBoatCameraActor_C">();
	}
	static class ABP_MultiplayerMoonBoatCameraActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MultiplayerMoonBoatCameraActor_C>();
	}
};
static_assert(alignof(ABP_MultiplayerMoonBoatCameraActor_C) == 0x000008, "Wrong alignment on ABP_MultiplayerMoonBoatCameraActor_C");
static_assert(sizeof(ABP_MultiplayerMoonBoatCameraActor_C) == 0x0003D0, "Wrong size on ABP_MultiplayerMoonBoatCameraActor_C");
static_assert(offsetof(ABP_MultiplayerMoonBoatCameraActor_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_MultiplayerMoonBoatCameraActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MultiplayerMoonBoatCameraActor_C, AdvancedCamera) == 0x0003B0, "Member 'ABP_MultiplayerMoonBoatCameraActor_C::AdvancedCamera' has a wrong offset!");
static_assert(offsetof(ABP_MultiplayerMoonBoatCameraActor_C, DefaultSceneRoot) == 0x0003B8, "Member 'ABP_MultiplayerMoonBoatCameraActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MultiplayerMoonBoatCameraActor_C, BP_CameraDeadZoneAngle) == 0x0003C0, "Member 'ABP_MultiplayerMoonBoatCameraActor_C::BP_CameraDeadZoneAngle' has a wrong offset!");
static_assert(offsetof(ABP_MultiplayerMoonBoatCameraActor_C, BP_CameraRotationSpeed) == 0x0003C8, "Member 'ABP_MultiplayerMoonBoatCameraActor_C::BP_CameraRotationSpeed' has a wrong offset!");

}

