#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainCharacterRPCHelperComponent

#include "Basic.hpp"

#include "EAthenaShowState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EPowerFrogStage_structs.hpp"
#include "EShepherdessAnimState_structs.hpp"
#include "F_MulticastDamageContext_structs.hpp"
#include "F_CameraParamsForRpc_structs.hpp"
#include "ECastPhantomStage_structs.hpp"
#include "F_MulticastTriggerContext_structs.hpp"
#include "ECastGuardStage_structs.hpp"
#include "EImaginationFireworkAnimState_structs.hpp"
#include "FInteractionIkSlots_structs.hpp"
#include "EAbilityMultiPlayerHelperType_structs.hpp"
#include "F_MulticastHitFrameContext_structs.hpp"
#include "Enum_InstrumentType_structs.hpp"
#include "F_WoolenHeartInfoCache_structs.hpp"
#include "F_AdjustTransformRPCParam_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_Multi_InterObjActive
// 0x0020 (0x0020 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive final
{
public:
	int64                                         EntityID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         playerEntityID;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive) == 0x000020, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive, EntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive::EntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive, Data) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive::Data' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive, playerEntityID) == 0x000018, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_Multi_InterObjActive::playerEntityID' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulti_SitOnBubbleCableCar
// 0x0028 (0x0028 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar final
{
public:
	int64                                         EntityID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         playerEntityID;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Action;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         extraInfo;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         extraInfo2;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar) == 0x000028, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar, EntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar::EntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar, playerEntityID) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar::playerEntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar, Action) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar::Action' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar, extraInfo) == 0x000018, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar::extraInfo' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar, extraInfo2) == 0x000020, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulti_SitOnBubbleCableCar::extraInfo2' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityBegin
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin final
{
public:
	uint8                                         HelperType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin, HelperType) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityBegin::HelperType' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityClearActor
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearActor::NewParam5' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityClearNS
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityClearNS::NewParam5' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityDestroyActor
// 0x0018 (0x0018 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewParam;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor) == 0x000018, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor::NewParam5' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor, NewParam) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyActor::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityDestroyNS
// 0x0018 (0x0018 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewParam;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS) == 0x000018, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS::NewParam5' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS, NewParam) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityDestroyNS::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd final
{
public:
	uint8                                         HelperType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd, HelperType) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityEnd::HelperType' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilityPostEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewParam;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent) == 0x000018, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent::NewParam5' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent, NewParam) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilityPostEvent::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilitySetActorMeshLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewParam1;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation) == 0x000020, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation::NewParam' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation, NewParam1) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySetActorMeshLocation::NewParam1' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilitySpawnActor
// 0x0090 (0x0090 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewParam;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewParam1;                                         // 0x0020(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewParam2;                                         // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor) == 0x000010, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor) == 0x000090, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor::NewParam5' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor, NewParam) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor::NewParam' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor, NewParam1) == 0x000020, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor::NewParam1' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor, NewParam2) == 0x000080, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnActor::NewParam2' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AbilitySpawnNS
// 0x00A0 (0x00A0 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS final
{
public:
	EAbilityMultiPlayerHelperType                 NewParam5;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewParam;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewParam1;                                         // 0x0020(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewParam2;                                         // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          NewParam3;                                         // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam4;                                         // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS) == 0x000010, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS) == 0x0000A0, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam5) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam5' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam1) == 0x000020, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam1' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam2) == 0x000080, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam2' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam3) == 0x000090, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam3' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS, NewParam4) == 0x000091, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AbilitySpawnNS::NewParam4' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AdjustTransform
// 0x00D0 (0x00D0 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform final
{
public:
	struct FF_AdjustTransformRPCParam             AdjustParam;                                       // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform) == 0x000010, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform) == 0x0000D0, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform, AdjustParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AdjustTransform::AdjustParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AfkIdle
// 0x0002 (0x0002 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle final
{
public:
	bool                                          inAfk;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bImmediatelyStop;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle) == 0x000002, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle, inAfk) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle::inAfk' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle, bImmediatelyStop) == 0x000001, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AfkIdle::bImmediatelyStop' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AthenaAbilityBegin
// 0x0050 (0x0050 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin final
{
public:
	class FString                                 ABPPath;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SeatAniPath;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                SeatOffset;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SeatRotation;                                      // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin) == 0x000050, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin, ABPPath) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin::ABPPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin, SeatAniPath) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin::SeatAniPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin, SeatOffset) == 0x000020, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin::SeatOffset' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin, SeatRotation) == 0x000038, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaAbilityBegin::SeatRotation' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AthenaSwitchAnimStage
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage final
{
public:
	EAthenaShowState                              AniStage;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage, AniStage) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AthenaSwitchAnimStage::AniStage' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_AttachRibbonFishMesh
// 0x0020 (0x0020 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh final
{
public:
	class FString                                 MeshAssetPath;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CurveAssetPath;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh) == 0x000020, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh, MeshAssetPath) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh::MeshAssetPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh, CurveAssetPath) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_AttachRibbonFishMesh::CurveAssetPath' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BallonDuckAttachToCarrier
// 0x0018 (0x0018 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         NewParam1;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam2;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier) == 0x000018, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier::NewParam' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier, NewParam1) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier::NewParam1' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier, NewParam2) == 0x000014, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckAttachToCarrier::NewParam2' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BallonDuckDetachFromCarrier
// 0x0010 (0x0010 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier) == 0x000010, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckDetachFromCarrier::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BallonDuckRefreshWeapon
// 0x0004 (0x0004 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon) == 0x000004, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon) == 0x000004, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckRefreshWeapon::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BallonDuckTrigger
// 0x0004 (0x0004 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger) == 0x000004, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger) == 0x000004, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BallonDuckTrigger::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BeginCleaningAnimal
// 0x0018 (0x0018 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal final
{
public:
	int64                                         AnimalEntityID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         AbilityEffectID;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LookAtAnimRotYaw;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal) == 0x000018, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal, AnimalEntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal::AnimalEntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal, AbilityEffectID) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal::AbilityEffectID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal, LookAtAnimRotYaw) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginCleaningAnimal::LookAtAnimRotYaw' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BeginFishing
// 0x0020 (0x0020 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing final
{
public:
	struct FVector                                FishFloatLocation;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInPrepare;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing) == 0x000020, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing, FishFloatLocation) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing::FishFloatLocation' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing, IsInPrepare) == 0x000018, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginFishing::IsInPrepare' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BeginGetWoolenHeart
// 0x0050 (0x0050 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart final
{
public:
	int64                                         WoolenHeartEntityID;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_WoolenHeartInfoCache                WoolenHeartInfoCache;                              // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart) == 0x000050, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart, WoolenHeartEntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart::WoolenHeartEntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart, WoolenHeartInfoCache) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BeginGetWoolenHeart::WoolenHeartInfoCache' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BlowBubbleSpawnNS
// 0x0040 (0x0040 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS) == 0x000040, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS, AssetPath) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS::AssetPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS, Location) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS::Location' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS, Rotation) == 0x000028, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlowBubbleSpawnNS::Rotation' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BlueberryPicnicRefreshWeapon
// 0x0010 (0x0010 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon) == 0x000010, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicRefreshWeapon::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BlueberryPicnicTrigger
// 0x0030 (0x0030 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger final
{
public:
	class FString                                 NewParam1;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewParam2;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewParam3;                                         // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger) == 0x000030, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger, NewParam1) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger::NewParam1' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger, NewParam2) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger::NewParam2' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger, NewParam3) == 0x000020, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BlueberryPicnicTrigger::NewParam3' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_BoxStopPhysics
// 0x0070 (0x0070 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics final
{
public:
	int64                                         BoxID;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FinalTrans;                                        // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics) == 0x000010, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics) == 0x000070, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics, BoxID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics::BoxID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics, FinalTrans) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_BoxStopPhysics::FinalTrans' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_Buff
// 0x0020 (0x0020 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff final
{
public:
	int64                                         EntityID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BuffDAPath;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bRemove;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff) == 0x000020, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff, EntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff::EntityID' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff, BuffDAPath) == 0x000008, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff::BuffDAPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff, bRemove) == 0x000018, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Buff::bRemove' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_Bullet
// 0x00F0 (0x00F0 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet final
{
public:
	class FString                                 BulletDAPath;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FF_MulticastTriggerContext             BP_TriggerContext;                                 // 0x0010(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet) == 0x0000F0, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet, BulletDAPath) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet::BulletDAPath' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet, BP_TriggerContext) == 0x000010, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_Bullet::BP_TriggerContext' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_CatchInsectSuccess
// 0x0008 (0x0008 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess final
{
public:
	int64                                         InsectEntityID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess) == 0x000008, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess, InsectEntityID) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CatchInsectSuccess::InsectEntityID' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_CelebrationGuardBegin
// 0x0010 (0x0010 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin) == 0x000010, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardBegin::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_CelebrationGuardSwitchAnimStage
// 0x0003 (0x0003 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage final
{
public:
	ECastGuardStage                               NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam1;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam2;                                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage) == 0x000003, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage::NewParam' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage, NewParam1) == 0x000001, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage::NewParam1' has a wrong offset!");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage, NewParam2) == 0x000002, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationGuardSwitchAnimStage::NewParam2' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_CelebrationPhantomBegin
// 0x0010 (0x0010 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin) == 0x000008, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin) == 0x000010, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomBegin::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_CelebrationPhantomSwitchAnimStage
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage final
{
public:
	ECastPhantomStage                             NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage, NewParam) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_CelebrationPhantomSwitchAnimStage::NewParam' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_ChangeInstArticulation
// 0x0001 (0x0001 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation) == 0x000001, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation");
static_assert(sizeof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation) == 0x000001, "Wrong size on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation");
static_assert(offsetof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation, Value) == 0x000000, "Member 'BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ChangeInstArticulation::Value' has a wrong offset!");

// Function BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C.BP_OnMulticast_ClaretStateChange
// 0x0004 (0x0004 - 0x0000)
struct BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ClaretStateChange final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ClaretStateChange) == 0x000004, "Wrong alignment on BP_MainCharacterRPCHelperComponent_C_BP_OnMulticast_ClaretStateChange");
