#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MonsterShadow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MonsterShadow.BP_MonsterShadow_C.SetRadius
// 0x0030 (0x0030 - 0x0000)
struct BP_MonsterShadow_C_SetRadius final
{
public:
	double                                        InRadius;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterShadow_C_SetRadius) == 0x000008, "Wrong alignment on BP_MonsterShadow_C_SetRadius");
static_assert(sizeof(BP_MonsterShadow_C_SetRadius) == 0x000030, "Wrong size on BP_MonsterShadow_C_SetRadius");
static_assert(offsetof(BP_MonsterShadow_C_SetRadius, InRadius) == 0x000000, "Member 'BP_MonsterShadow_C_SetRadius::InRadius' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_SetRadius, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_MonsterShadow_C_SetRadius::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_SetRadius, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000010, "Member 'BP_MonsterShadow_C_SetRadius::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_SetRadius, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'BP_MonsterShadow_C_SetRadius::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_MonsterShadow.BP_MonsterShadow_C.SetOpacity
// 0x0010 (0x0010 - 0x0000)
struct BP_MonsterShadow_C_SetOpacity final
{
public:
	double                                        InOpacity;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterShadow_C_SetOpacity) == 0x000008, "Wrong alignment on BP_MonsterShadow_C_SetOpacity");
static_assert(sizeof(BP_MonsterShadow_C_SetOpacity) == 0x000010, "Wrong size on BP_MonsterShadow_C_SetOpacity");
static_assert(offsetof(BP_MonsterShadow_C_SetOpacity, InOpacity) == 0x000000, "Member 'BP_MonsterShadow_C_SetOpacity::InOpacity' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_SetOpacity, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_MonsterShadow_C_SetOpacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_SetOpacity, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00000C, "Member 'BP_MonsterShadow_C_SetOpacity::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_MonsterShadow.BP_MonsterShadow_C.ExecuteUbergraph_BP_MonsterShadow
// 0x0010 (0x0010 - 0x0000)
struct BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow) == 0x000008, "Wrong alignment on BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow");
static_assert(sizeof(BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow) == 0x000010, "Wrong size on BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow");
static_assert(offsetof(BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow, EntryPoint) == 0x000000, "Member 'BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_MonsterShadow_C_ExecuteUbergraph_BP_MonsterShadow::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

