#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainCharacterRegularMovementComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerRegularMovementCompV3_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainCharacterRegularMovementComp.BP_MainCharacterRegularMovementComp_C
// 0x0030 (0x04C8 - 0x0498)
class UBP_MainCharacterRegularMovementComp_C final : public UBP_PlayerRegularMovementCompV3_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MainCharacterRegularMovementComp_C; // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 BP_RMBehaviorProxy_PlayerControl;                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BP_RMBehaviorProxy_PlayerDrivedByAI;               // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool IsInDash)> OnCharacterDashStateChanged;                       // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_PlayerAnimStatesComponent_C*        BP_PlayerAnimStatesComp;                           // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_GetMostRecentValidInputInfoByValidDuration(double ValidDuration, bool* bValidInput, struct FFrameInputContext* InputContext);
	void BP_ModifyOwnerMovementConfigByDA(class UBP_MovementAllConfigTemplate_C* NewDataAsset, class UBP_MovementAllConfigTemplate_C** OldDataAsset);
	void BP_SyncAnimStatesWithTickV2();
	void ExecuteUbergraph_BP_MainCharacterRegularMovementComp(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainCharacterRegularMovementComp_C">();
	}
	static class UBP_MainCharacterRegularMovementComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MainCharacterRegularMovementComp_C>();
	}
};
static_assert(alignof(UBP_MainCharacterRegularMovementComp_C) == 0x000008, "Wrong alignment on UBP_MainCharacterRegularMovementComp_C");
static_assert(sizeof(UBP_MainCharacterRegularMovementComp_C) == 0x0004C8, "Wrong size on UBP_MainCharacterRegularMovementComp_C");
static_assert(offsetof(UBP_MainCharacterRegularMovementComp_C, UberGraphFrame_BP_MainCharacterRegularMovementComp_C) == 0x000498, "Member 'UBP_MainCharacterRegularMovementComp_C::UberGraphFrame_BP_MainCharacterRegularMovementComp_C' has a wrong offset!");
static_assert(offsetof(UBP_MainCharacterRegularMovementComp_C, BP_RMBehaviorProxy_PlayerControl) == 0x0004A0, "Member 'UBP_MainCharacterRegularMovementComp_C::BP_RMBehaviorProxy_PlayerControl' has a wrong offset!");
static_assert(offsetof(UBP_MainCharacterRegularMovementComp_C, BP_RMBehaviorProxy_PlayerDrivedByAI) == 0x0004A8, "Member 'UBP_MainCharacterRegularMovementComp_C::BP_RMBehaviorProxy_PlayerDrivedByAI' has a wrong offset!");
static_assert(offsetof(UBP_MainCharacterRegularMovementComp_C, OnCharacterDashStateChanged) == 0x0004B0, "Member 'UBP_MainCharacterRegularMovementComp_C::OnCharacterDashStateChanged' has a wrong offset!");
static_assert(offsetof(UBP_MainCharacterRegularMovementComp_C, BP_PlayerAnimStatesComp) == 0x0004C0, "Member 'UBP_MainCharacterRegularMovementComp_C::BP_PlayerAnimStatesComp' has a wrong offset!");

}

