#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainHudObtainedContainerData

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainHudObtainedContainerData.BP_MainHudObtainedContainerData_C
// 0x0030 (0x0058 - 0x0028)
class UBP_MainHudObtainedContainerData_C final : public UObject
{
public:
	class FString                                 ContainerName;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 ContainerWidgetPath;                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                Icon;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ContainerType;                                     // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainHudObtainedContainerData_C">();
	}
	static class UBP_MainHudObtainedContainerData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MainHudObtainedContainerData_C>();
	}
};
static_assert(alignof(UBP_MainHudObtainedContainerData_C) == 0x000008, "Wrong alignment on UBP_MainHudObtainedContainerData_C");
static_assert(sizeof(UBP_MainHudObtainedContainerData_C) == 0x000058, "Wrong size on UBP_MainHudObtainedContainerData_C");
static_assert(offsetof(UBP_MainHudObtainedContainerData_C, ContainerName) == 0x000028, "Member 'UBP_MainHudObtainedContainerData_C::ContainerName' has a wrong offset!");
static_assert(offsetof(UBP_MainHudObtainedContainerData_C, ContainerWidgetPath) == 0x000038, "Member 'UBP_MainHudObtainedContainerData_C::ContainerWidgetPath' has a wrong offset!");
static_assert(offsetof(UBP_MainHudObtainedContainerData_C, Icon) == 0x000048, "Member 'UBP_MainHudObtainedContainerData_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_MainHudObtainedContainerData_C, ContainerType) == 0x000050, "Member 'UBP_MainHudObtainedContainerData_C::ContainerType' has a wrong offset!");

}

