#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainCharacterRPCHelperComponent

#include "Basic.hpp"

#include "EShepherdessAnimState_structs.hpp"
#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"
#include "EPowerFrogStage_structs.hpp"
#include "EAthenaShowState_structs.hpp"
#include "ECastPhantomStage_structs.hpp"
#include "ECastGuardStage_structs.hpp"
#include "EImaginationFireworkAnimState_structs.hpp"
#include "EAbilityMultiPlayerHelperType_structs.hpp"
#include "Enum_InstrumentType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainCharacterRPCHelperComponent.BP_MainCharacterRPCHelperComponent_C
// 0x0058 (0x0100 - 0x00A8)
class UBP_MainCharacterRPCHelperComponent_C : public UX6ActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          BP_bIsControllingDaMiao;                           // 0x00B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BP_PlaneIndex;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         BP_GlideState;                                     // 0x00C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BP_GlideEnergy;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_GlidePaused;                                    // 0x00D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bIsInMusicBoxClimax;                            // 0x00E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 BP_SeamlessCaveLoadedMap;                          // 0x00E8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	bool                                          BP_bSeamlessCaveLowQuality;                        // 0x00F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bIsCopyMapReady;                                // 0x00F9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Multi_InterObjActive(int64 EntityID, const class FString& Data, int64 playerEntityID);
	void BP_OnMulti_SitOnBubbleCableCar(int64 EntityID, int64 playerEntityID, int32 Action, int64 extraInfo, int64 extraInfo2);
	void BP_OnMulticast_AbilityBegin(uint8 HelperType);
	void BP_OnMulticast_AbilityClearActor(EAbilityMultiPlayerHelperType NewParam5);
	void BP_OnMulticast_AbilityClearNS(EAbilityMultiPlayerHelperType NewParam5);
	void BP_OnMulticast_AbilityDestroyActor(EAbilityMultiPlayerHelperType NewParam5, const class FString& NewParam);
	void BP_OnMulticast_AbilityDestroyNS(EAbilityMultiPlayerHelperType NewParam5, const class FString& NewParam);
	void BP_OnMulticast_AbilityEnd(uint8 HelperType);
	void BP_OnMulticast_AbilityPostEvent(EAbilityMultiPlayerHelperType NewParam5, const class FString& NewParam);
