#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCPhotoReactionCommonConfig_Template

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPCPhotoReactionCommonConfig_Template.BP_NPCPhotoReactionCommonConfig_Template_C
// 0x0040 (0x0070 - 0x0030)
class UBP_NPCPhotoReactionCommonConfig_Template_C final : public UPrimaryDataAsset
{
public:
	class FName                                   ReactionAnimDynamicMontageSlot;                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultLookAtTime;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoolDownSeconds;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_PhotoReactionConfigByCharacterID;               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_PhotoReactionConfigByPlayerPose;                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BackAnimFadeInTime;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BackAnimFadeOutTime;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlockUnhideTraceRate;                              // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPCPhotoReactionCommonConfig_Template_C">();
	}
	static class UBP_NPCPhotoReactionCommonConfig_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NPCPhotoReactionCommonConfig_Template_C>();
	}
};
static_assert(alignof(UBP_NPCPhotoReactionCommonConfig_Template_C) == 0x000008, "Wrong alignment on UBP_NPCPhotoReactionCommonConfig_Template_C");
static_assert(sizeof(UBP_NPCPhotoReactionCommonConfig_Template_C) == 0x000070, "Wrong size on UBP_NPCPhotoReactionCommonConfig_Template_C");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, ReactionAnimDynamicMontageSlot) == 0x000030, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::ReactionAnimDynamicMontageSlot' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, DefaultLookAtTime) == 0x000038, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::DefaultLookAtTime' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, CoolDownSeconds) == 0x000040, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::CoolDownSeconds' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, DT_PhotoReactionConfigByCharacterID) == 0x000048, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::DT_PhotoReactionConfigByCharacterID' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, DT_PhotoReactionConfigByPlayerPose) == 0x000050, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::DT_PhotoReactionConfigByPlayerPose' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, BackAnimFadeInTime) == 0x000058, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::BackAnimFadeInTime' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, BackAnimFadeOutTime) == 0x000060, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::BackAnimFadeOutTime' has a wrong offset!");
static_assert(offsetof(UBP_NPCPhotoReactionCommonConfig_Template_C, BlockUnhideTraceRate) == 0x000068, "Member 'UBP_NPCPhotoReactionCommonConfig_Template_C::BlockUnhideTraceRate' has a wrong offset!");

}

