#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPCAttractorDynamicGameplayContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENPCDynamicGameplayState_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPCAttractorDynamicGameplayContainer.BP_NPCAttractorDynamicGameplayContainer_C
// 0x0038 (0x0470 - 0x0438)
class ABP_NPCAttractorDynamicGameplayContainer_C : public AX6Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ENPCDynamicGameplayState                      GameplayState;                                     // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_NPCAttractorDynamicGameplayData_Template_C* DA_GameplayData;                           // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 npcActor;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* NPC)> OnPlayStop;                                    // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindNPCOnEndPlay(class AActor* InNPCActor);
	void ExecuteUbergraph_BP_NPCAttractorDynamicGameplayContainer(int32 EntryPoint);
	void OnPauseGameplay();
	void OnStartGameplay(class UBP_NPCAttractorDynamicGameplayData_Template_C* InGameplayData, class AActor* InNPCActor);
	void OnStopGameplay();
	void OnUpdateGameplay(double DeltaSeconds);
	void Pause();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveNPCActorEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Start(class UBP_NPCAttractorDynamicGameplayData_Template_C* InDataAsset, class AActor* InNPCActor);
	void Stop();
	void UnbindNPCOnEndPlay(class AActor* InNPCActpr);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPCAttractorDynamicGameplayContainer_C">();
	}
	static class ABP_NPCAttractorDynamicGameplayContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPCAttractorDynamicGameplayContainer_C>();
	}
};
static_assert(alignof(ABP_NPCAttractorDynamicGameplayContainer_C) == 0x000008, "Wrong alignment on ABP_NPCAttractorDynamicGameplayContainer_C");
static_assert(sizeof(ABP_NPCAttractorDynamicGameplayContainer_C) == 0x000470, "Wrong size on ABP_NPCAttractorDynamicGameplayContainer_C");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, UberGraphFrame) == 0x000438, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, DefaultSceneRoot) == 0x000440, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, GameplayState) == 0x000448, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::GameplayState' has a wrong offset!");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, DA_GameplayData) == 0x000450, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::DA_GameplayData' has a wrong offset!");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, npcActor) == 0x000458, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::npcActor' has a wrong offset!");
static_assert(offsetof(ABP_NPCAttractorDynamicGameplayContainer_C, OnPlayStop) == 0x000460, "Member 'ABP_NPCAttractorDynamicGameplayContainer_C::OnPlayStop' has a wrong offset!");

}

