#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerEnvironmentEffectComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerEnvironmentEffectComponent.BP_PlayerEnvironmentEffectComponent_C.GetFloorPhysicsMateria
// 0x0220 (0x0220 - 0x0000)
struct BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria final
{
public:
	EPhysicalSurface                              NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria) == 0x000008, "Wrong alignment on BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria");
static_assert(sizeof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria) == 0x000220, "Wrong size on BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, NewParam) == 0x000000, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::NewParam' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, Temp_object_Variable) == 0x000008, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_Add_VectorVector_ReturnValue) == 0x000038, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_LineTraceSingle_OutHit) == 0x000050, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_LineTraceSingle_ReturnValue) == 0x000148, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_bBlockingHit) == 0x000149, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014A, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_Location) == 0x000158, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_ImpactPoint) == 0x000170, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_Normal) == 0x000188, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A0, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_PhysMat) == 0x0001B8, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_HitActor) == 0x0001C0, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_HitComponent) == 0x0001C8, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_HitBoneName) == 0x0001D0, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_BoneName) == 0x0001D8, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetFloorPhysicsMateria::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function BP_PlayerEnvironmentEffectComponent.BP_PlayerEnvironmentEffectComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerEnvironmentEffectComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerEnvironmentEffectComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_PlayerEnvironmentEffectComponent_C_GetModuleName");
static_assert(sizeof(BP_PlayerEnvironmentEffectComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_PlayerEnvironmentEffectComponent_C_GetModuleName");
static_assert(offsetof(BP_PlayerEnvironmentEffectComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_PlayerEnvironmentEffectComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

