#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerDressUp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerDressUp.BP_PlayerDressUp_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerDressUp_C_CustomEvent final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDressUp_C_CustomEvent) == 0x000001, "Wrong alignment on BP_PlayerDressUp_C_CustomEvent");
static_assert(sizeof(BP_PlayerDressUp_C_CustomEvent) == 0x000001, "Wrong size on BP_PlayerDressUp_C_CustomEvent");
static_assert(offsetof(BP_PlayerDressUp_C_CustomEvent, EndPlayReason) == 0x000000, "Member 'BP_PlayerDressUp_C_CustomEvent::EndPlayReason' has a wrong offset!");

// Function BP_PlayerDressUp.BP_PlayerDressUp_C.ExecuteUbergraph_BP_PlayerDressUp
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetX6GameNikkiPawn_NikkiPawn;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason_1;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANikkiPlayer_BP_C*                      K2Node_DynamicCast_AsNikki_Player_BP;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetX6GameNikkiPawn_NikkiPawn_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANikkiPlayer_BP_C*                      K2Node_DynamicCast_AsNikki_Player_BP_1;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp) == 0x000008, "Wrong alignment on BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp");
static_assert(sizeof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp) == 0x000040, "Wrong size on BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, EntryPoint) == 0x000000, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, CallFunc_GetX6GameNikkiPawn_NikkiPawn) == 0x000008, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::CallFunc_GetX6GameNikkiPawn_NikkiPawn' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_Event_EndPlayReason_1) == 0x000010, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_Event_EndPlayReason_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_DynamicCast_AsNikki_Player_BP) == 0x000018, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_DynamicCast_AsNikki_Player_BP' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_Event_EndPlayReason) == 0x000021, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, CallFunc_GetX6GameNikkiPawn_NikkiPawn_1) == 0x000028, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::CallFunc_GetX6GameNikkiPawn_NikkiPawn_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_DynamicCast_AsNikki_Player_BP_1) == 0x000030, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_DynamicCast_AsNikki_Player_BP_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_PlayerDressUp_C_ExecuteUbergraph_BP_PlayerDressUp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_PlayerDressUp.BP_PlayerDressUp_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerDressUp_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDressUp_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerDressUp_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerDressUp_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerDressUp_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerDressUp_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerDressUp_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerDressUp.BP_PlayerDressUp_C.SetEyeMaterial
// 0x0028 (0x0028 - 0x0000)
struct BP_PlayerDressUp_C_SetEyeMaterial final
{
public:
	double                                        Iris_Brightness_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Static_Rotation__;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDressUp_C_SetEyeMaterial) == 0x000008, "Wrong alignment on BP_PlayerDressUp_C_SetEyeMaterial");
static_assert(sizeof(BP_PlayerDressUp_C_SetEyeMaterial) == 0x000028, "Wrong size on BP_PlayerDressUp_C_SetEyeMaterial");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, Iris_Brightness_0) == 0x000000, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::Iris_Brightness_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, Use_Static_Rotation__) == 0x000008, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::Use_Static_Rotation__' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000010, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerDressUp_C_SetEyeMaterial, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000024, "Member 'BP_PlayerDressUp_C_SetEyeMaterial::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_PlayerDressUp.BP_PlayerDressUp_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerDressUp_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerDressUp_C_GetModuleName) == 0x000008, "Wrong alignment on BP_PlayerDressUp_C_GetModuleName");
static_assert(sizeof(BP_PlayerDressUp_C_GetModuleName) == 0x000010, "Wrong size on BP_PlayerDressUp_C_GetModuleName");
static_assert(offsetof(BP_PlayerDressUp_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_PlayerDressUp_C_GetModuleName::ReturnValue' has a wrong offset!");

}

