#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerWeaponComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerWeaponComponent.BP_PlayerWeaponComponent_C.BP_UpdateIKLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerWeaponComponent_C_BP_UpdateIKLocation final
{
public:
	struct FVector                                HandIKLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerWeaponComponent_C_BP_UpdateIKLocation) == 0x000008, "Wrong alignment on BP_PlayerWeaponComponent_C_BP_UpdateIKLocation");
static_assert(sizeof(BP_PlayerWeaponComponent_C_BP_UpdateIKLocation) == 0x000018, "Wrong size on BP_PlayerWeaponComponent_C_BP_UpdateIKLocation");
static_assert(offsetof(BP_PlayerWeaponComponent_C_BP_UpdateIKLocation, HandIKLocation) == 0x000000, "Member 'BP_PlayerWeaponComponent_C_BP_UpdateIKLocation::HandIKLocation' has a wrong offset!");

// Function BP_PlayerWeaponComponent.BP_PlayerWeaponComponent_C.BP_UpdateWeaponInfo
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo final
{
public:
	class UBP_HandHeldObjTemplate_C*              DA_WeaponInfo;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquip;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKeepDefaultPose;                                  // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReplaceDefaultHandHeld;                           // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo) == 0x000008, "Wrong alignment on BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo");
static_assert(sizeof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo) == 0x000010, "Wrong size on BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo");
static_assert(offsetof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo, DA_WeaponInfo) == 0x000000, "Member 'BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo::DA_WeaponInfo' has a wrong offset!");
static_assert(offsetof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo, bEquip) == 0x000008, "Member 'BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo::bEquip' has a wrong offset!");
static_assert(offsetof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo, bKeepDefaultPose) == 0x000009, "Member 'BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo::bKeepDefaultPose' has a wrong offset!");
static_assert(offsetof(BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo, bReplaceDefaultHandHeld) == 0x00000A, "Member 'BP_PlayerWeaponComponent_C_BP_UpdateWeaponInfo::bReplaceDefaultHandHeld' has a wrong offset!");

// Function BP_PlayerWeaponComponent.BP_PlayerWeaponComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerWeaponComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerWeaponComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_PlayerWeaponComponent_C_GetModuleName");
static_assert(sizeof(BP_PlayerWeaponComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_PlayerWeaponComponent_C_GetModuleName");
static_assert(offsetof(BP_PlayerWeaponComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_PlayerWeaponComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

