#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaperSoloLevelManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PaperSoloLevelManager.BP_PaperSoloLevelManager_C.RemoveFromActorTickWhiteList
// 0x0008 (0x0008 - 0x0000)
struct BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList) == 0x000008, "Wrong alignment on BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList");
static_assert(sizeof(BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList) == 0x000008, "Wrong size on BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList");
static_assert(offsetof(BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList, Actor) == 0x000000, "Member 'BP_PaperSoloLevelManager_C_RemoveFromActorTickWhiteList::Actor' has a wrong offset!");

// Function BP_PaperSoloLevelManager.BP_PaperSoloLevelManager_C.AddToActorTickWhiteList
// 0x0008 (0x0008 - 0x0000)
struct BP_PaperSoloLevelManager_C_AddToActorTickWhiteList final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperSoloLevelManager_C_AddToActorTickWhiteList) == 0x000008, "Wrong alignment on BP_PaperSoloLevelManager_C_AddToActorTickWhiteList");
static_assert(sizeof(BP_PaperSoloLevelManager_C_AddToActorTickWhiteList) == 0x000008, "Wrong size on BP_PaperSoloLevelManager_C_AddToActorTickWhiteList");
static_assert(offsetof(BP_PaperSoloLevelManager_C_AddToActorTickWhiteList, Actor) == 0x000000, "Member 'BP_PaperSoloLevelManager_C_AddToActorTickWhiteList::Actor' has a wrong offset!");

// Function BP_PaperSoloLevelManager.BP_PaperSoloLevelManager_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_PaperSoloLevelManager_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperSoloLevelManager_C_GetModuleName) == 0x000008, "Wrong alignment on BP_PaperSoloLevelManager_C_GetModuleName");
static_assert(sizeof(BP_PaperSoloLevelManager_C_GetModuleName) == 0x000010, "Wrong size on BP_PaperSoloLevelManager_C_GetModuleName");
static_assert(offsetof(BP_PaperSoloLevelManager_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_PaperSoloLevelManager_C_GetModuleName::ReturnValue' has a wrong offset!");

}

