#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PawnPiecemealFeatures

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PawnPiecemealFeatures.BP_PawnPiecemealFeatures_C
// 0x0020 (0x00C8 - 0x00A8)
class UBP_PawnPiecemealFeatures_C final : public UBP_X6ActorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FixShortDistanceLocationBoundary;                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FixShortDistanceLocationSpeed;                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FixSmallRotationSpeed;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEndPlayTinyTaskAnimation();
	void ExecuteUbergraph_BP_PawnPiecemealFeatures(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PawnPiecemealFeatures_C">();
	}
	static class UBP_PawnPiecemealFeatures_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PawnPiecemealFeatures_C>();
	}
};
static_assert(alignof(UBP_PawnPiecemealFeatures_C) == 0x000008, "Wrong alignment on UBP_PawnPiecemealFeatures_C");
static_assert(sizeof(UBP_PawnPiecemealFeatures_C) == 0x0000C8, "Wrong size on UBP_PawnPiecemealFeatures_C");
static_assert(offsetof(UBP_PawnPiecemealFeatures_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_PawnPiecemealFeatures_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PawnPiecemealFeatures_C, FixShortDistanceLocationBoundary) == 0x0000B0, "Member 'UBP_PawnPiecemealFeatures_C::FixShortDistanceLocationBoundary' has a wrong offset!");
static_assert(offsetof(UBP_PawnPiecemealFeatures_C, FixShortDistanceLocationSpeed) == 0x0000B8, "Member 'UBP_PawnPiecemealFeatures_C::FixShortDistanceLocationSpeed' has a wrong offset!");
static_assert(offsetof(UBP_PawnPiecemealFeatures_C, FixSmallRotationSpeed) == 0x0000C0, "Member 'UBP_PawnPiecemealFeatures_C::FixSmallRotationSpeed' has a wrong offset!");

}

