#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerRegularMovementCompV3

#include "Basic.hpp"

#include "EInputDeviceKeyType_structs.hpp"
#include "Engine_structs.hpp"
#include "EPlayerMovementScenarios_structs.hpp"
#include "X6Game_structs.hpp"
#include "EPlayerAdditiveMovementMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.NotifyCurAllowedGaitChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged final
{
public:
	ERegularLocomotionType                        NewGait;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        CurrentGait;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged) == 0x000002, "Wrong size on BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged, NewGait) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged::NewGait' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged, CurrentGait) == 0x000001, "Member 'BP_PlayerRegularMovementCompV3_C_NotifyCurAllowedGaitChanged::CurrentGait' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.NotifyCurActualGaitChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged final
{
public:
	ERegularLocomotionType                        NewGait;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        CurrentGait;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged) == 0x000002, "Wrong size on BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged, NewGait) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged::NewGait' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged, CurrentGait) == 0x000001, "Member 'BP_PlayerRegularMovementCompV3_C_NotifyCurActualGaitChanged::CurrentGait' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.ExecuteUbergraph_BP_PlayerRegularMovementCompV3
// 0x000C (0x000C - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        K2Node_Event_NewGait;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        K2Node_Event_CurrentGait;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        K2Node_Event_NewGait_1;                            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        K2Node_Event_CurrentGait_1;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3) == 0x000004, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3) == 0x00000C, "Wrong size on BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, EntryPoint) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, K2Node_Event_NewGait) == 0x000004, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::K2Node_Event_NewGait' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, K2Node_Event_CurrentGait) == 0x000005, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::K2Node_Event_CurrentGait' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, K2Node_Event_EndPlayReason) == 0x000006, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, K2Node_Event_NewGait_1) == 0x000007, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::K2Node_Event_NewGait_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3, K2Node_Event_CurrentGait_1) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_ExecuteUbergraph_BP_PlayerRegularMovementCompV3::K2Node_Event_CurrentGait_1' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_PlayerStates
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates final
{
public:
	bool                                          IsInState_AimMode;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates) == 0x000001, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates, IsInState_AimMode) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_PlayerStates::IsInState_AimMode' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_MaxSpeedValues
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues final
{
public:
	double                                        CurMinAnalogWalkSpeed;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurConfigMaxSpeed;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurActualMaxSpeed;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurConfigMaxSpeed_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_CurMinAnalogWalkSpeed_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_CurConfigMaxSpeed_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_CurActualMaxSpeed_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues) == 0x000038, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, CurMinAnalogWalkSpeed) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::CurMinAnalogWalkSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, CurConfigMaxSpeed) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::CurConfigMaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, CurActualMaxSpeed) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::CurActualMaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, CallFunc_GetCurConfigMaxSpeed_ReturnValue) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::CallFunc_GetCurConfigMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, K2Node_FunctionResult_CurMinAnalogWalkSpeed_ImplicitCast) == 0x000020, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::K2Node_FunctionResult_CurMinAnalogWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, K2Node_FunctionResult_CurConfigMaxSpeed_ImplicitCast) == 0x000028, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::K2Node_FunctionResult_CurConfigMaxSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues, K2Node_FunctionResult_CurActualMaxSpeed_ImplicitCast) == 0x000030, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_MaxSpeedValues::K2Node_FunctionResult_CurActualMaxSpeed_ImplicitCast' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_EssentialValues
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues final
{
public:
	struct FVector                                InVelocity;                                        // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InCurrentAcceleration;                             // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxAcceleration;                                 // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InTurnAroundAngle;                                 // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InSlopeAngle;                                      // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InStartTurnAroundAngle;                            // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InCurConfigMaxSpeed;                               // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurConfigMaxSpeed_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URMOutputContextInterface*              CallFunc_GetOutputContext_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URMOutputContext_OnGround*              K2Node_DynamicCast_AsRMOutput_Context_on_Ground;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_InMaxAcceleration_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_InTurnAroundAngle_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_InSlopeAngle_ImplicitCast;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_InStartTurnAroundAngle_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_InCurConfigMaxSpeed_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues) == 0x0000C0, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InVelocity) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InVelocity' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InCurrentAcceleration) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InCurrentAcceleration' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InMaxAcceleration) == 0x000030, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InMaxAcceleration' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InTurnAroundAngle) == 0x000038, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InTurnAroundAngle' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InSlopeAngle) == 0x000040, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InSlopeAngle' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InStartTurnAroundAngle) == 0x000048, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InStartTurnAroundAngle' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, InCurConfigMaxSpeed) == 0x000050, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::InCurConfigMaxSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_GetCurConfigMaxSpeed_ReturnValue) == 0x000058, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_GetCurConfigMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000060, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_GetOutputContext_ReturnValue) == 0x000078, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_GetOutputContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_DynamicCast_AsRMOutput_Context_on_Ground) == 0x000088, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_DynamicCast_AsRMOutput_Context_on_Ground' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_IsValid_ReturnValue_2) == 0x000092, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, CallFunc_BooleanAND_ReturnValue_1) == 0x000093, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_FunctionResult_InMaxAcceleration_ImplicitCast) == 0x000098, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_FunctionResult_InMaxAcceleration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_FunctionResult_InTurnAroundAngle_ImplicitCast) == 0x0000A0, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_FunctionResult_InTurnAroundAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_FunctionResult_InSlopeAngle_ImplicitCast) == 0x0000A8, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_FunctionResult_InSlopeAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_FunctionResult_InStartTurnAroundAngle_ImplicitCast) == 0x0000B0, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_FunctionResult_InStartTurnAroundAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues, K2Node_FunctionResult_InCurConfigMaxSpeed_ImplicitCast) == 0x0000B8, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_EssentialValues::K2Node_FunctionResult_InCurConfigMaxSpeed_ImplicitCast' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_CurrentGroundStates
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates final
{
public:
	EMovementMode                                 PawnMovementMode;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        AllowedGait;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerMovementScenarios                      MovementScenario;                                  // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDeviceKeyType                           CurInputDeviceKeyType;                             // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates) == 0x000004, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates, PawnMovementMode) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates::PawnMovementMode' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates, AllowedGait) == 0x000001, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates::AllowedGait' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates, MovementScenario) == 0x000002, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates::MovementScenario' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates, CurInputDeviceKeyType) == 0x000003, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_CurrentGroundStates::CurInputDeviceKeyType' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_ConfigData
// 0x0040 (0x0040 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData final
{
public:
	double                                        WalkSpeed;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunSpeed;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SprintSpeed;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConfigMaxSpeedData_MaxSpeed_Walk;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConfigMaxSpeedData_MaxSpeed_Run;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConfigMaxSpeedData_MaxSpeed_Sprint;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_WalkSpeed_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_RunSpeed_ImplicitCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_SprintSpeed_ImplicitCast;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData) == 0x000040, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, WalkSpeed) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::WalkSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, RunSpeed) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::RunSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, SprintSpeed) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::SprintSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, CallFunc_GetConfigMaxSpeedData_MaxSpeed_Walk) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::CallFunc_GetConfigMaxSpeedData_MaxSpeed_Walk' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, CallFunc_GetConfigMaxSpeedData_MaxSpeed_Run) == 0x00001C, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::CallFunc_GetConfigMaxSpeedData_MaxSpeed_Run' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, CallFunc_GetConfigMaxSpeedData_MaxSpeed_Sprint) == 0x000020, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::CallFunc_GetConfigMaxSpeedData_MaxSpeed_Sprint' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, K2Node_FunctionResult_WalkSpeed_ImplicitCast) == 0x000028, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::K2Node_FunctionResult_WalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, K2Node_FunctionResult_RunSpeed_ImplicitCast) == 0x000030, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::K2Node_FunctionResult_RunSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData, K2Node_FunctionResult_SprintSpeed_ImplicitCast) == 0x000038, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_ConfigData::K2Node_FunctionResult_SprintSpeed_ImplicitCast' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BPI_Get_BalanceBeamStates
// 0x0003 (0x0003 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates final
{
public:
	bool                                          CanMoveOnValidInput;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnterTowardSideOfBeam;                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurInputValid;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates) == 0x000003, "Wrong size on BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates, CanMoveOnValidInput) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates::CanMoveOnValidInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates, IsEnterTowardSideOfBeam) == 0x000001, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates::IsEnterTowardSideOfBeam' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates, IsCurInputValid) == 0x000002, "Member 'BP_PlayerRegularMovementCompV3_C_BPI_Get_BalanceBeamStates::IsCurInputValid' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_VisitorSetAdditiveMovementMode_Aiming
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming final
{
public:
	bool                                          bEnter;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming) == 0x000001, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming, bEnter) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_VisitorSetAdditiveMovementMode_Aiming::bEnter' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_SyncCMCValue
// 0x0048 (0x0048 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue final
{
public:
	class UCharacterMovementComponent*            CMC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWalkSpeed;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinAnalogWalkSpeed;                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAcceleration;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BrakingDecelerationWalking;                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundFriction;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxWalkSpeed_ImplicitCast;      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MinAnalogWalkSpeed_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxAcceleration_ImplicitCast;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_GroundFriction_ImplicitCast;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue) == 0x000048, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, CMC) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::CMC' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, MaxWalkSpeed) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::MaxWalkSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, MinAnalogWalkSpeed) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::MinAnalogWalkSpeed' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, MaxAcceleration) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::MaxAcceleration' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, BrakingDecelerationWalking) == 0x000020, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::BrakingDecelerationWalking' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, GroundFriction) == 0x000028, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::GroundFriction' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, K2Node_VariableSet_MaxWalkSpeed_ImplicitCast) == 0x000030, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::K2Node_VariableSet_MaxWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, K2Node_VariableSet_MinAnalogWalkSpeed_ImplicitCast) == 0x000034, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::K2Node_VariableSet_MinAnalogWalkSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, K2Node_VariableSet_MaxAcceleration_ImplicitCast) == 0x000038, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::K2Node_VariableSet_MaxAcceleration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast) == 0x00003C, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::K2Node_VariableSet_BrakingDecelerationWalking_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue, K2Node_VariableSet_GroundFriction_ImplicitCast) == 0x000040, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncCMCValue::K2Node_VariableSet_GroundFriction_ImplicitCast' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_SyncAnimStatesWithTickV2
// 0x0110 (0x0110 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2 final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URMStateInstructionContext*             CallFunc_GetStateInstructionContext_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URMOutputContextInterface*              CallFunc_GetOutputContext_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URMOutputContext_OnGround*              K2Node_DynamicCast_AsRMOutput_Context_on_Ground;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RMStateInstructionContext_C*        K2Node_DynamicCast_AsBP_RMState_Instruction_Context; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_HasState_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRMInputContext                        CallFunc_GetInputContext_ReturnValue;              // 0x0040(0x00B8)()
	double                                        K2Node_VariableSet_BP_CurTurnInplaceAngle_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BP_CurFloorAngle_ImplicitCast;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BP_CurTurnAroundAngle_ImplicitCast; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2) == 0x000110, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_GetStateInstructionContext_ReturnValue) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_GetStateInstructionContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_GetOutputContext_ReturnValue) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_GetOutputContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_IsValid_ReturnValue_2) == 0x000019, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_DynamicCast_AsRMOutput_Context_on_Ground) == 0x000020, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_DynamicCast_AsRMOutput_Context_on_Ground' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_DynamicCast_AsBP_RMState_Instruction_Context) == 0x000030, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_DynamicCast_AsBP_RMState_Instruction_Context' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_IsValid_ReturnValue_3) == 0x000039, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_BP_HasState_ReturnValue) == 0x00003A, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_BP_HasState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_IsValid_ReturnValue_4) == 0x00003B, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, CallFunc_GetInputContext_ReturnValue) == 0x000040, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::CallFunc_GetInputContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_VariableSet_BP_CurTurnInplaceAngle_ImplicitCast) == 0x0000F8, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_VariableSet_BP_CurTurnInplaceAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_VariableSet_BP_CurFloorAngle_ImplicitCast) == 0x000100, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_VariableSet_BP_CurFloorAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2, K2Node_VariableSet_BP_CurTurnAroundAngle_ImplicitCast) == 0x000108, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTickV2::K2Node_VariableSet_BP_CurTurnAroundAngle_ImplicitCast' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_SyncAnimStatesWithTick
// 0x0018 (0x0018 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick final
{
public:
	double                                        CurFloorAngle_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurTurnAroundAngle;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCurInputValid;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERegularLocomotionType                        CurrentAllowedGait_0;                              // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLogicInStateAiming;                              // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick) == 0x000018, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick, CurFloorAngle_0) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick::CurFloorAngle_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick, CurTurnAroundAngle) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick::CurTurnAroundAngle' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick, IsCurInputValid) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick::IsCurInputValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick, CurrentAllowedGait_0) == 0x000011, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick::CurrentAllowedGait_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick, IsLogicInStateAiming) == 0x000012, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SyncAnimStatesWithTick::IsLogicInStateAiming' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_StopActiveTurnInplace
// 0x0030 (0x0030 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace final
{
public:
	class UX6CharacterMovementComponent*          K2Node_DynamicCast_AsX6Character_Movement_Component; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URMOutputContextInterface*              CallFunc_GetOutputContext_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URMOutputContextInterface*              CallFunc_GetOutputContext_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URMOutputContext_OnGround*              K2Node_DynamicCast_AsRMOutput_Context_on_Ground;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace) == 0x000008, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace) == 0x000030, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, K2Node_DynamicCast_AsX6Character_Movement_Component) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::K2Node_DynamicCast_AsX6Character_Movement_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_GetOutputContext_ReturnValue) == 0x000010, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_GetOutputContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_GetOutputContext_ReturnValue_1) == 0x000018, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_GetOutputContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, K2Node_DynamicCast_AsRMOutput_Context_on_Ground) == 0x000020, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::K2Node_DynamicCast_AsRMOutput_Context_on_Ground' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_IsValid_ReturnValue_2) == 0x00002A, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace, CallFunc_BooleanAND_ReturnValue_1) == 0x00002C, "Member 'BP_PlayerRegularMovementCompV3_C_BP_StopActiveTurnInplace::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_SetRegularMovementEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable) == 0x000001, "Wrong alignment on BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable");
static_assert(sizeof(BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable) == 0x000001, "Wrong size on BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable");
static_assert(offsetof(BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable, bEnable) == 0x000000, "Member 'BP_PlayerRegularMovementCompV3_C_BP_SetRegularMovementEnable::bEnable' has a wrong offset!");

// Function BP_PlayerRegularMovementCompV3.BP_PlayerRegularMovementCompV3_C.BP_SetInplaceTurnAroundAngle
// 0x00E0 (0x00E0 - 0x0000)
struct BP_PlayerRegularMovementCompV3_C_BP_SetInplaceTurnAroundAngle final
{
public:
	double                                        CurTargetTurnAroundAngle;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LowerBoundOfAngleOfTurnInplace;                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreventRotationMovementWhenTurningInPlace;        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URMConfigContextInterface*              CallFunc_GetConfigContext_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URMConfigContext_OnGround*              K2Node_DynamicCast_AsRMConfig_Context_on_Ground;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URMOutputContextInterface*              CallFunc_GetOutputContext_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URMOutputContext_OnGround*              K2Node_DynamicCast_AsRMOutput_Context_on_Ground;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6CharacterMovementComponent*          K2Node_DynamicCast_AsX6Character_Movement_Component; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
