#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaperDebugEntryUIData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PaperDebugEntryUIData.BP_PaperDebugEntryUIData_C
// 0x0038 (0x0060 - 0x0028)
class UBP_PaperDebugEntryUIData_C final : public UObject
{
public:
	TArray<class UBP_PaperDebugEntryUIData_C*>    Children;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Text;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Depth;                                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PaperDebugEntryUIData_C">();
	}
	static class UBP_PaperDebugEntryUIData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PaperDebugEntryUIData_C>();
	}
};
static_assert(alignof(UBP_PaperDebugEntryUIData_C) == 0x000008, "Wrong alignment on UBP_PaperDebugEntryUIData_C");
static_assert(sizeof(UBP_PaperDebugEntryUIData_C) == 0x000060, "Wrong size on UBP_PaperDebugEntryUIData_C");
static_assert(offsetof(UBP_PaperDebugEntryUIData_C, Children) == 0x000028, "Member 'UBP_PaperDebugEntryUIData_C::Children' has a wrong offset!");
static_assert(offsetof(UBP_PaperDebugEntryUIData_C, Text) == 0x000038, "Member 'UBP_PaperDebugEntryUIData_C::Text' has a wrong offset!");
static_assert(offsetof(UBP_PaperDebugEntryUIData_C, Color) == 0x000048, "Member 'UBP_PaperDebugEntryUIData_C::Color' has a wrong offset!");
static_assert(offsetof(UBP_PaperDebugEntryUIData_C, Depth) == 0x000058, "Member 'UBP_PaperDebugEntryUIData_C::Depth' has a wrong offset!");

}

