#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaperDissolveManager

#include "Basic.hpp"

#include "PaperEffects_structs.hpp"


namespace SDK::Params
{

// Function BP_PaperDissolveManager.BP_PaperDissolveManager_C.ExecuteUbergraph_BP_PaperDissolveManager
// 0x0090 (0x0090 - 0x0000)
struct BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_DissolveFoliageActor_C*>     CallFunc_Set_ToArray_Result;                       // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNeedDissolveItemInfo>          K2Node_Event_ISMs;                                 // 0x0030(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DissolveActorComponent_C*>   CallFunc_Set_ToArray_Result_1;                     // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_DissolveActorComponent_C*           CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DissolveActorComponent_C*>   CallFunc_Set_ToArray_Result_2;                     // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ABP_DissolveFoliageActor_C*             CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_1;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager) == 0x000008, "Wrong alignment on BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager");
static_assert(sizeof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager) == 0x000090, "Wrong size on BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, EntryPoint) == 0x000000, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Set_ToArray_Result) == 0x000008, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, K2Node_Event_ISMs) == 0x000030, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::K2Node_Event_ISMs' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Set_ToArray_Result_1) == 0x000048, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Set_ToArray_Result_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_IsValid_ReturnValue) == 0x000065, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_IsValid_ReturnValue_1) == 0x000066, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Set_Contains_ReturnValue) == 0x000067, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Set_ToArray_Result_2) == 0x000070, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Set_ToArray_Result_2' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_Set_Contains_ReturnValue_1) == 0x000089, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_Set_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager, CallFunc_IsValid_ReturnValue_3) == 0x00008A, "Member 'BP_PaperDissolveManager_C_ExecuteUbergraph_BP_PaperDissolveManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_PaperDissolveManager.BP_PaperDissolveManager_C.Is Actor Dissolveable Item
// 0x0040 (0x0040 - 0x0000)
struct BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDissolve;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OutActor;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Dissolving;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DissolveActorComponent_C*           DissolveActor;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DissolveActorComponent_C*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item) == 0x000008, "Wrong alignment on BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item");
static_assert(sizeof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item) == 0x000040, "Wrong size on BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, Actor) == 0x000000, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::Actor' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, CanDissolve) == 0x000008, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::CanDissolve' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, OutActor) == 0x000010, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::OutActor' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, Dissolving) == 0x000018, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::Dissolving' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, DissolveActor) == 0x000020, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::DissolveActor' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, CallFunc_MakeLiteralName_ReturnValue) == 0x000028, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, CallFunc_ActorHasTag_ReturnValue) == 0x000038, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_PaperDissolveManager_C_Is_Actor_Dissolveable_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PaperDissolveManager.BP_PaperDissolveManager_C.Is Actor Instanced Foliage
// 0x0028 (0x0028 - 0x0000)
struct BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CanDissolve;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage) == 0x000008, "Wrong alignment on BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage");
static_assert(sizeof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage) == 0x000028, "Wrong size on BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage, Actor) == 0x000000, "Member 'BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage::Actor' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage, CanDissolve) == 0x000008, "Member 'BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage::CanDissolve' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage, CallFunc_Contains_ReturnValue) == 0x000020, "Member 'BP_PaperDissolveManager_C_Is_Actor_Instanced_Foliage::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BP_PaperDissolveManager.BP_PaperDissolveManager_C.OnInstancedFoliageDissolve
// 0x0010 (0x0010 - 0x0000)
struct BP_PaperDissolveManager_C_OnInstancedFoliageDissolve final
{
public:
	TArray<struct FNeedDissolveItemInfo>          ISMs;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_PaperDissolveManager_C_OnInstancedFoliageDissolve) == 0x000008, "Wrong alignment on BP_PaperDissolveManager_C_OnInstancedFoliageDissolve");
static_assert(sizeof(BP_PaperDissolveManager_C_OnInstancedFoliageDissolve) == 0x000010, "Wrong size on BP_PaperDissolveManager_C_OnInstancedFoliageDissolve");
static_assert(offsetof(BP_PaperDissolveManager_C_OnInstancedFoliageDissolve, ISMs) == 0x000000, "Member 'BP_PaperDissolveManager_C_OnInstancedFoliageDissolve::ISMs' has a wrong offset!");

}

