#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerUTCInputComponent

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "EUTCJoystickMode_structs.hpp"
#include "UTCControlTypeEnum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UTCConfigStruct_structs.hpp"
#include "X6Game_structs.hpp"
#include "F_JoystickCustomConfig_structs.hpp"
#include "EDeviceScreenSizeType_structs.hpp"
#include "F_UTCRatioConfig_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.UTCTouch Input Manager
// 0x01A8 (0x01A8 - 0x0000)
struct BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager final
{
public:
	EX6InputTouchEvent                            X6InputTouchEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCComponent_C*                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Finger_Slots_Available_ReturnValue;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Finger_Location_Exists_Result;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UUTCComponent_C*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUTCComponent_C*                        CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUTCComponent_C*                        CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Finger_Location_Exists_Result_1;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Finger_Location_Exists_Result_2;       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCComponent_C*                        CallFunc_Array_Get_Item_3;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUTCComponent_C*                        CallFunc_Array_Get_Item_4;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUTCComponent_C*>                CallFunc_Filter_By_Active_Active_Components;       // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUTCComponent_C*>                CallFunc_Filter_By_Bounds_In_Bounds;               // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUTCComponent_C*>                CallFunc_Filter_By_Bounds_W_out_Bounds;            // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUTCComponent_C*>                CallFunc_Filter_By_Bounds_Both;                    // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Is_Finger_Location_Exists_Result_3;       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUTCComponent_C*>                CallFunc_Sort_By_Priority_W__Higher_Priority;      // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager) == 0x000008, "Wrong alignment on BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager");
static_assert(sizeof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager) == 0x0001A8, "Wrong size on BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, X6InputTouchEvent) == 0x000000, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::X6InputTouchEvent' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, FingerIndex) == 0x000001, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::FingerIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Location) == 0x000008, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Location' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000060, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Loop_Counter_Variable_2) == 0x000078, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Array_Index_Variable) == 0x000084, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Array_Index_Variable_1) == 0x00008C, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Array_Index_Variable_2) == 0x000090, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Is_Finger_Slots_Available_ReturnValue) == 0x0000A0, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Is_Finger_Slots_Available_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Is_Finger_Location_Exists_Result) == 0x0000A1, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Is_Finger_Location_Exists_Result' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Array_Index_Variable_3) == 0x0000A4, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, Temp_int_Loop_Counter_Variable_3) == 0x0000A8, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B0, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_GetDisplayName_ReturnValue) == 0x0000B8, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F0, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000100, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Get_Item_2) == 0x000118, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Is_Finger_Location_Exists_Result_1) == 0x000120, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Is_Finger_Location_Exists_Result_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Is_Finger_Location_Exists_Result_2) == 0x000121, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Is_Finger_Location_Exists_Result_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Get_Item_3) == 0x000128, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Get_Item_4) == 0x000130, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Filter_By_Active_Active_Components) == 0x000138, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Filter_By_Active_Active_Components' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Filter_By_Bounds_In_Bounds) == 0x000148, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Filter_By_Bounds_In_Bounds' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Filter_By_Bounds_W_out_Bounds) == 0x000158, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Filter_By_Bounds_W_out_Bounds' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Filter_By_Bounds_Both) == 0x000168, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Filter_By_Bounds_Both' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Is_Finger_Location_Exists_Result_3) == 0x000178, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Is_Finger_Location_Exists_Result_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Sort_By_Priority_W__Higher_Priority) == 0x000180, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Sort_By_Priority_W__Higher_Priority' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Length_ReturnValue_1) == 0x000190, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Length_ReturnValue_2) == 0x000194, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Less_IntInt_ReturnValue_1) == 0x000198, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Less_IntInt_ReturnValue_2) == 0x000199, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Length_ReturnValue_3) == 0x00019C, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Array_Length_ReturnValue_4) == 0x0001A0, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001A4, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A5, "Member 'BP_PlayerUTCInputComponent_C_UTCTouch_Input_Manager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.UpdateSwipeToMoveComponent
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent final
{
public:
	class UUTCSwipeToMoveComponent_C*             SwipeToMoveComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUTCControlTypeEnum                           ControlType;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InteractionOrigin;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InteractionSize;                                   // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetVector2DInPercent_OutValue;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2DInPercent_OutValue_1;          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AdjustBoundOrigin_OutOrigin;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent) == 0x000008, "Wrong alignment on BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent");
static_assert(sizeof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent) == 0x000068, "Wrong size on BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, SwipeToMoveComponent) == 0x000000, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::SwipeToMoveComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, ControlType) == 0x000008, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::ControlType' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, InteractionOrigin) == 0x000010, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::InteractionOrigin' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, InteractionSize) == 0x000020, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::InteractionSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, CallFunc_GetVector2DInPercent_OutValue) == 0x000038, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::CallFunc_GetVector2DInPercent_OutValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, CallFunc_GetVector2DInPercent_OutValue_1) == 0x000048, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::CallFunc_GetVector2DInPercent_OutValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent, CallFunc_AdjustBoundOrigin_OutOrigin) == 0x000058, "Member 'BP_PlayerUTCInputComponent_C_UpdateSwipeToMoveComponent::CallFunc_AdjustBoundOrigin_OutOrigin' has a wrong offset!");

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.UpdateJoystickComponent
// 0x0180 (0x0180 - 0x0000)
struct BP_PlayerUTCInputComponent_C_UpdateJoystickComponent final
{
public:
	class UUTCJoystickComponent_C*                joystickComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUTCControlTypeEnum                           ControlType;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CenterPos;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              VisualSize;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ThumbSize;                                         // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InteractionOrigin;                                 // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InteractionSize;                                   // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LockPos;                                           // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFloat;                                          // 0x0061(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EdgeGapSize;                                       // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PosOffset;                                         // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue_1;      // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2dInAbsolute_OutValue;           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2DInPercent_OutValue;            // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2DInPercent_OutValue_1;          // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2dInAbsolute_OutValue_1;         // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AdjustBoundOrigin_OutOrigin;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetVector2dInAbsolute_OutValue_2;         // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateWidgetSize_Is_Initialized;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_AdjustWidgetInitPos_OutVector2D;          // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent) == 0x000008, "Wrong alignment on BP_PlayerUTCInputComponent_C_UpdateJoystickComponent");
static_assert(sizeof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent) == 0x000180, "Wrong size on BP_PlayerUTCInputComponent_C_UpdateJoystickComponent");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, joystickComponent) == 0x000000, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::joystickComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, ControlType) == 0x000008, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::ControlType' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CenterPos) == 0x000010, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CenterPos' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, VisualSize) == 0x000020, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::VisualSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, ThumbSize) == 0x000030, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::ThumbSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, InteractionOrigin) == 0x000040, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::InteractionOrigin' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, InteractionSize) == 0x000050, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::InteractionSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, LockPos) == 0x000060, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::LockPos' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, UseFloat) == 0x000061, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::UseFloat' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, EdgeGapSize) == 0x000068, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::EdgeGapSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, PosOffset) == 0x000078, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::PosOffset' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, Scale) == 0x000088, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::Scale' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000098, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Conv_DoubleToVector2D_ReturnValue_1) == 0x0000A8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Conv_DoubleToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000B8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_GetVector2dInAbsolute_OutValue) == 0x0000C8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_GetVector2dInAbsolute_OutValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_GetVector2DInPercent_OutValue) == 0x0000D8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_GetVector2DInPercent_OutValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_GetVector2DInPercent_OutValue_1) == 0x0000E8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_GetVector2DInPercent_OutValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_GetVector2dInAbsolute_OutValue_1) == 0x0000F8, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_GetVector2dInAbsolute_OutValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_AdjustBoundOrigin_OutOrigin) == 0x000108, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_AdjustBoundOrigin_OutOrigin' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000118, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_GetVector2dInAbsolute_OutValue_2) == 0x000128, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_GetVector2dInAbsolute_OutValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Multiply_Vector2DVector2D_ReturnValue_1) == 0x000138, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Multiply_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_UpdateWidgetSize_Is_Initialized) == 0x000148, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_UpdateWidgetSize_Is_Initialized' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_AdjustWidgetInitPos_OutVector2D) == 0x000150, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_AdjustWidgetInitPos_OutVector2D' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_BreakVector2D_X) == 0x000160, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_BreakVector2D_Y) == 0x000168, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_FMax_ReturnValue) == 0x000170, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateJoystickComponent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000178, "Member 'BP_PlayerUTCInputComponent_C_UpdateJoystickComponent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.UpdateComponentByControlType
// 0x00E0 (0x00E0 - 0x0000)
struct BP_PlayerUTCInputComponent_C_UpdateComponentByControlType final
{
public:
	EUTCControlTypeEnum                           ControlType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EUTCJoystickMode                              JoystickMode_0;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUTCComponent_C*                        CallFunc_GetComponentByControlType_OutComponent;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetComponentByControlType_IsValid;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCSwipeToMoveComponent_C*             K2Node_DynamicCast_AsUTCSwipe_to_Move_Component;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCJoystickComponent_C*                K2Node_DynamicCast_AsUTCJoystick_Component;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetJoystickConfig_CenterPos;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetJoystickConfig_VisualSize;             // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetJoystickConfig_ThumbSize;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetJoystickConfig_InteractionOrigin;      // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetJoystickConfig_InteractionSize;        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetJoystickConfig_LockPos;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetJoystickConfig_UseFloat;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetJoystickConfig_EdgeGapSize;            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BP_GetJoystickOffset_offset;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BP_GetJoystickOffset_scale;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSwipeToMoveConfig_InteractionOrigin;   // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSwipeToMoveConfig_InteractionSize;     // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType) == 0x000008, "Wrong alignment on BP_PlayerUTCInputComponent_C_UpdateComponentByControlType");
static_assert(sizeof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType) == 0x0000E0, "Wrong size on BP_PlayerUTCInputComponent_C_UpdateComponentByControlType");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, ControlType) == 0x000000, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::ControlType' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, JoystickMode_0) == 0x000004, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::JoystickMode_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetComponentByControlType_OutComponent) == 0x000008, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetComponentByControlType_OutComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetComponentByControlType_IsValid) == 0x000010, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetComponentByControlType_IsValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, K2Node_DynamicCast_AsUTCSwipe_to_Move_Component) == 0x000018, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::K2Node_DynamicCast_AsUTCSwipe_to_Move_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, K2Node_DynamicCast_AsUTCJoystick_Component) == 0x000028, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::K2Node_DynamicCast_AsUTCJoystick_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_CenterPos) == 0x000038, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_CenterPos' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_VisualSize) == 0x000048, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_VisualSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_ThumbSize) == 0x000058, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_ThumbSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_InteractionOrigin) == 0x000068, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_InteractionOrigin' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_InteractionSize) == 0x000078, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_InteractionSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_LockPos) == 0x000088, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_LockPos' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_UseFloat) == 0x000089, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_UseFloat' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetJoystickConfig_EdgeGapSize) == 0x000090, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetJoystickConfig_EdgeGapSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_BP_GetJoystickOffset_offset) == 0x0000A0, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_BP_GetJoystickOffset_offset' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_BP_GetJoystickOffset_scale) == 0x0000B0, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_BP_GetJoystickOffset_scale' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetSwipeToMoveConfig_InteractionOrigin) == 0x0000B8, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetSwipeToMoveConfig_InteractionOrigin' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, CallFunc_GetSwipeToMoveConfig_InteractionSize) == 0x0000C8, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::CallFunc_GetSwipeToMoveConfig_InteractionSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_UpdateComponentByControlType, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'BP_PlayerUTCInputComponent_C_UpdateComponentByControlType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.SetTouchEnable
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerUTCInputComponent_C_SetTouchEnable final
{
public:
	EUTCControlTypeEnum                           ControlType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCComponent_C*                        CallFunc_GetComponentByControlType_OutComponent;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetComponentByControlType_IsValid;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCSwipeToMoveComponent_C*             K2Node_DynamicCast_AsUTCSwipe_to_Move_Component;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCJoystickComponent_C*                K2Node_DynamicCast_AsUTCJoystick_Component;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerUTCInputComponent_C_SetTouchEnable) == 0x000008, "Wrong alignment on BP_PlayerUTCInputComponent_C_SetTouchEnable");
static_assert(sizeof(BP_PlayerUTCInputComponent_C_SetTouchEnable) == 0x000038, "Wrong size on BP_PlayerUTCInputComponent_C_SetTouchEnable");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, ControlType) == 0x000000, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::ControlType' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, bEnable) == 0x000001, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::bEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, CallFunc_GetComponentByControlType_OutComponent) == 0x000008, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::CallFunc_GetComponentByControlType_OutComponent' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, CallFunc_GetComponentByControlType_IsValid) == 0x000010, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::CallFunc_GetComponentByControlType_IsValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, K2Node_DynamicCast_AsUTCSwipe_to_Move_Component) == 0x000018, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::K2Node_DynamicCast_AsUTCSwipe_to_Move_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, K2Node_DynamicCast_AsUTCJoystick_Component) == 0x000028, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::K2Node_DynamicCast_AsUTCJoystick_Component' has a wrong offset!");
static_assert(offsetof(BP_PlayerUTCInputComponent_C_SetTouchEnable, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_PlayerUTCInputComponent_C_SetTouchEnable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_PlayerUTCInputComponent.BP_PlayerUTCInputComponent_C.RightToLeft
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerUTCInputComponent_C_RightToLeft final
{
public:
	double                                        InX;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
