#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuadrupedLocomotion_AnimSet

#include "Basic.hpp"

#include "X6Game_structs.hpp"
#include "BP_Locomotion_AnimSetBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuadrupedLocomotion_AnimSet.BP_QuadrupedLocomotion_AnimSet_C
// 0x00B8 (0x00E8 - 0x0030)
class UBP_QuadrupedLocomotion_AnimSet_C final : public UBP_Locomotion_AnimSetBase_C
{
public:
	class UAnimSequence*                          BP_GroundTurnLeftAdditivePose;                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          BP_GroundTurnRightAdditivePose;                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bEnableTurnInplaceAnim;                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          BP_IdleTurnLeftPose;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          BP_IdleTurnRightPose;                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          BP_WalkInplacePose;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBipedalLocomotionAnimSet              Bipedal_Locomotion_Anim_Set;                       // 0x0060(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuadrupedLocomotion_AnimSet_C">();
	}
	static class UBP_QuadrupedLocomotion_AnimSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuadrupedLocomotion_AnimSet_C>();
	}
};
static_assert(alignof(UBP_QuadrupedLocomotion_AnimSet_C) == 0x000008, "Wrong alignment on UBP_QuadrupedLocomotion_AnimSet_C");
static_assert(sizeof(UBP_QuadrupedLocomotion_AnimSet_C) == 0x0000E8, "Wrong size on UBP_QuadrupedLocomotion_AnimSet_C");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_GroundTurnLeftAdditivePose) == 0x000030, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_GroundTurnLeftAdditivePose' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_GroundTurnRightAdditivePose) == 0x000038, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_GroundTurnRightAdditivePose' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_bEnableTurnInplaceAnim) == 0x000040, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_bEnableTurnInplaceAnim' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_IdleTurnLeftPose) == 0x000048, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_IdleTurnLeftPose' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_IdleTurnRightPose) == 0x000050, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_IdleTurnRightPose' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, BP_WalkInplacePose) == 0x000058, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::BP_WalkInplacePose' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedLocomotion_AnimSet_C, Bipedal_Locomotion_Anim_Set) == 0x000060, "Member 'UBP_QuadrupedLocomotion_AnimSet_C::Bipedal_Locomotion_Anim_Set' has a wrong offset!");

}

