#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuadrupedAnimalReactionComponent

#include "Basic.hpp"

#include "EQuadrupedAnimalReactionState_structs.hpp"
#include "E_CleaningAbilityType_structs.hpp"


namespace SDK::Params
{

// Function BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C.OnCleanStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged final
{
public:
	bool                                          bIsClean;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged) == 0x000001, "Wrong alignment on BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged");
static_assert(sizeof(BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged) == 0x000001, "Wrong size on BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged, bIsClean) == 0x000000, "Member 'BP_QuadrupedAnimalReactionComponent_C_OnCleanStateChanged::bIsClean' has a wrong offset!");

// Function BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C.OnCleaningStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted final
{
public:
	class AActor*                                 CleaningPlayer;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CleaningAbilityType                         CleaningAbilityType;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted) == 0x000008, "Wrong alignment on BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted");
static_assert(sizeof(BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted) == 0x000010, "Wrong size on BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted, CleaningPlayer) == 0x000000, "Member 'BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted::CleaningPlayer' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted, CleaningAbilityType) == 0x000008, "Member 'BP_QuadrupedAnimalReactionComponent_C_OnCleaningStarted::CleaningAbilityType' has a wrong offset!");

// Function BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C.ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent
// 0x0068 (0x0068 - 0x0000)
struct BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsClean)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* CleaningPlayer, E_CleaningAbilityType CleaningAbilityType)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            CallFunc_GetInstance_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CleanableAnimalComponent_V2_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsClean;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetIsClean_bClean;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_CleaningPlayer;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_CleaningAbilityType                         K2Node_CustomEvent_CleaningAbilityType;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent) == 0x000008, "Wrong alignment on BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent");
static_assert(sizeof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent) == 0x000068, "Wrong size on BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, EntryPoint) == 0x000000, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_GetInstance_ReturnValue) == 0x000028, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction) == 0x000030, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_CustomEvent_bIsClean) == 0x000050, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_CustomEvent_bIsClean' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_BP_GetIsClean_bClean) == 0x000051, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_BP_GetIsClean_bClean' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, CallFunc_IsValid_ReturnValue_1) == 0x000052, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_CustomEvent_CleaningPlayer) == 0x000058, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_CustomEvent_CleaningPlayer' has a wrong offset!");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent, K2Node_CustomEvent_CleaningAbilityType) == 0x000060, "Member 'BP_QuadrupedAnimalReactionComponent_C_ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent::K2Node_CustomEvent_CleaningAbilityType' has a wrong offset!");

// Function BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C.BP_SetState
// 0x0001 (0x0001 - 0x0000)
struct BP_QuadrupedAnimalReactionComponent_C_BP_SetState final
{
public:
	EQuadrupedAnimalReactionState                 NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuadrupedAnimalReactionComponent_C_BP_SetState) == 0x000001, "Wrong alignment on BP_QuadrupedAnimalReactionComponent_C_BP_SetState");
static_assert(sizeof(BP_QuadrupedAnimalReactionComponent_C_BP_SetState) == 0x000001, "Wrong size on BP_QuadrupedAnimalReactionComponent_C_BP_SetState");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_BP_SetState, NewState) == 0x000000, "Member 'BP_QuadrupedAnimalReactionComponent_C_BP_SetState::NewState' has a wrong offset!");

// Function BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_QuadrupedAnimalReactionComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuadrupedAnimalReactionComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_QuadrupedAnimalReactionComponent_C_GetModuleName");
static_assert(sizeof(BP_QuadrupedAnimalReactionComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_QuadrupedAnimalReactionComponent_C_GetModuleName");
static_assert(offsetof(BP_QuadrupedAnimalReactionComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_QuadrupedAnimalReactionComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

