#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuadrupedAnimalReactionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SMSystem_classes.hpp"
#include "EQuadrupedAnimalReactionState_structs.hpp"
#include "E_CleaningAbilityType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuadrupedAnimalReactionComponent.BP_QuadrupedAnimalReactionComponent_C
// 0x0020 (0x0228 - 0x0208)
class UBP_QuadrupedAnimalReactionComponent_C final : public USMStateMachineComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_QuadrupedAnimalReactionDefinition_C* DataAsset;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CleanableAnimalComponent_V2_C*      CleanableComp;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         FSM;                                               // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ServerInit();
	void OnCleanStateChanged(bool bIsClean);
	void OnCleaningStarted(class AActor* CleaningPlayer, E_CleaningAbilityType CleaningAbilityType);
	void ExecuteUbergraph_BP_QuadrupedAnimalReactionComponent(int32 EntryPoint);
	void BP_SetState(EQuadrupedAnimalReactionState NewState);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_QuadrupedAnimalReactionComponent_C">();
	}
	static class UBP_QuadrupedAnimalReactionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuadrupedAnimalReactionComponent_C>();
	}
};
static_assert(alignof(UBP_QuadrupedAnimalReactionComponent_C) == 0x000008, "Wrong alignment on UBP_QuadrupedAnimalReactionComponent_C");
static_assert(sizeof(UBP_QuadrupedAnimalReactionComponent_C) == 0x000228, "Wrong size on UBP_QuadrupedAnimalReactionComponent_C");
static_assert(offsetof(UBP_QuadrupedAnimalReactionComponent_C, UberGraphFrame) == 0x000208, "Member 'UBP_QuadrupedAnimalReactionComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedAnimalReactionComponent_C, DataAsset) == 0x000210, "Member 'UBP_QuadrupedAnimalReactionComponent_C::DataAsset' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedAnimalReactionComponent_C, CleanableComp) == 0x000218, "Member 'UBP_QuadrupedAnimalReactionComponent_C::CleanableComp' has a wrong offset!");
static_assert(offsetof(UBP_QuadrupedAnimalReactionComponent_C, FSM) == 0x000220, "Member 'UBP_QuadrupedAnimalReactionComponent_C::FSM' has a wrong offset!");

}

