#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_road_line

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_road_line.BP_road_line_C
// 0x0020 (0x03C8 - 0x03A8)
class ABP_road_line_C final : public AActor
{
public:
	class UNiagaraComponent*                      NS_LevelAssistanceMovingPlatform_1;                // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline1;                                           // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline2;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_road_line_C">();
	}
	static class ABP_road_line_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_road_line_C>();
	}
};
static_assert(alignof(ABP_road_line_C) == 0x000008, "Wrong alignment on ABP_road_line_C");
static_assert(sizeof(ABP_road_line_C) == 0x0003C8, "Wrong size on ABP_road_line_C");
static_assert(offsetof(ABP_road_line_C, NS_LevelAssistanceMovingPlatform_1) == 0x0003A8, "Member 'ABP_road_line_C::NS_LevelAssistanceMovingPlatform_1' has a wrong offset!");
static_assert(offsetof(ABP_road_line_C, Spline1) == 0x0003B0, "Member 'ABP_road_line_C::Spline1' has a wrong offset!");
static_assert(offsetof(ABP_road_line_C, Spline2) == 0x0003B8, "Member 'ABP_road_line_C::Spline2' has a wrong offset!");
static_assert(offsetof(ABP_road_line_C, DefaultSceneRoot) == 0x0003C0, "Member 'ABP_road_line_C::DefaultSceneRoot' has a wrong offset!");

}

