#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RMPTickRecord_OnGround

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RMPTickRecord_OnGround.BP_RMPTickRecord_OnGround_C.HasSprintAbility
// 0x0001 (0x0001 - 0x0000)
struct BP_RMPTickRecord_OnGround_C_HasSprintAbility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RMPTickRecord_OnGround_C_HasSprintAbility) == 0x000001, "Wrong alignment on BP_RMPTickRecord_OnGround_C_HasSprintAbility");
static_assert(sizeof(BP_RMPTickRecord_OnGround_C_HasSprintAbility) == 0x000001, "Wrong size on BP_RMPTickRecord_OnGround_C_HasSprintAbility");
static_assert(offsetof(BP_RMPTickRecord_OnGround_C_HasSprintAbility, ReturnValue) == 0x000000, "Member 'BP_RMPTickRecord_OnGround_C_HasSprintAbility::ReturnValue' has a wrong offset!");

// Function BP_RMPTickRecord_OnGround.BP_RMPTickRecord_OnGround_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_RMPTickRecord_OnGround_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_RMPTickRecord_OnGround_C_GetModuleName) == 0x000008, "Wrong alignment on BP_RMPTickRecord_OnGround_C_GetModuleName");
static_assert(sizeof(BP_RMPTickRecord_OnGround_C_GetModuleName) == 0x000010, "Wrong size on BP_RMPTickRecord_OnGround_C_GetModuleName");
static_assert(offsetof(BP_RMPTickRecord_OnGround_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_RMPTickRecord_OnGround_C_GetModuleName::ReturnValue' has a wrong offset!");

}

