#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoleShadowCapture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RoleShadowCapture.BP_RoleShadowCapture_C.BP_GetFloorLocation
// 0x0450 (0x0450 - 0x0000)
struct BP_RoleShadowCapture_C_BP_GetFloorLocation final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lerp;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ResultValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationValue;                                     // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHoldHandOtherActor_OtherActor;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00D8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector_NetQuantize                    CallFunc_MakeVector_NetQuantize_ReturnValue;       // 0x03E8(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoleShadowCapture_C_BP_GetFloorLocation) == 0x000008, "Wrong alignment on BP_RoleShadowCapture_C_BP_GetFloorLocation");
static_assert(sizeof(BP_RoleShadowCapture_C_BP_GetFloorLocation) == 0x000450, "Wrong size on BP_RoleShadowCapture_C_BP_GetFloorLocation");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, Height) == 0x000000, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::Height' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, Lerp) == 0x000008, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::Lerp' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, ResultValue) == 0x000010, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::ResultValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, RotationValue) == 0x000028, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::RotationValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, IgnoreActors) == 0x000040, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::IgnoreActors' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000068, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_Array_AddUnique_ReturnValue) == 0x000080, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000084, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000088, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_GetHoldHandOtherActor_OtherActor) == 0x000098, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_GetHoldHandOtherActor_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_Array_AddUnique_ReturnValue_2) == 0x0000A4, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_SphereTraceSingle_OutHit) == 0x0000D8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001D0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_X) == 0x0001D8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_Z) == 0x0001E8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F1, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Time) == 0x0001F4, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Distance) == 0x0001F8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Location) == 0x000200, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ImpactPoint) == 0x000218, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Normal) == 0x000230, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ImpactNormal) == 0x000248, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_PhysMat) == 0x000260, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitActor) == 0x000268, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitComponent) == 0x000270, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitBoneName) == 0x000278, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_BoneName) == 0x000280, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitItem) == 0x000288, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ElementIndex) == 0x00028C, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_FaceIndex) == 0x000290, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_TraceStart) == 0x000298, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_TraceEnd) == 0x0002B0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002C8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002C9, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Time_1) == 0x0002CC, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Distance_1) == 0x0002D0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Location_1) == 0x0002D8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002F0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_Normal_1) == 0x000308, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000320, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_PhysMat_1) == 0x000338, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitActor_1) == 0x000340, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitComponent_1) == 0x000348, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitBoneName_1) == 0x000350, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_BoneName_1) == 0x000358, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_HitItem_1) == 0x000360, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_ElementIndex_1) == 0x000364, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_FaceIndex_1) == 0x000368, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_TraceStart_1) == 0x000370, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakHitResult_TraceEnd_1) == 0x000388, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_SelectVector_ReturnValue) == 0x0003A0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_X_1) == 0x0003B8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_Y_1) == 0x0003C0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_BreakVector_Z_1) == 0x0003C8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_MakeRotFromZX_ReturnValue) == 0x0003D0, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_MakeVector_NetQuantize_ReturnValue) == 0x0003E8, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_MakeVector_NetQuantize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_RInterpTo_ReturnValue) == 0x000400, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_SelectVector_ReturnValue_1) == 0x000418, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_SelectRotator_ReturnValue) == 0x000430, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_GetFloorLocation, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x000448, "Member 'BP_RoleShadowCapture_C_BP_GetFloorLocation::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_RoleShadowCapture.BP_RoleShadowCapture_C.BP_UpdateFloorRotation
// 0x0020 (0x0020 - 0x0000)
struct BP_RoleShadowCapture_C_BP_UpdateFloorRotation final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoleShadowCapture_C_BP_UpdateFloorRotation) == 0x000008, "Wrong alignment on BP_RoleShadowCapture_C_BP_UpdateFloorRotation");
static_assert(sizeof(BP_RoleShadowCapture_C_BP_UpdateFloorRotation) == 0x000020, "Wrong size on BP_RoleShadowCapture_C_BP_UpdateFloorRotation");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_UpdateFloorRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'BP_RoleShadowCapture_C_BP_UpdateFloorRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_BP_UpdateFloorRotation, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_RoleShadowCapture_C_BP_UpdateFloorRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_RoleShadowCapture.BP_RoleShadowCapture_C.CaculateShadowOpaccity
// 0x0078 (0x0078 - 0x0000)
struct BP_RoleShadowCapture_C_CaculateShadowOpaccity final
{
public:
	double                                        CurrentOpacity;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewOpacity;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLevelSequence_Result;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_2;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue_3;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoleShadowCapture_C_CaculateShadowOpaccity) == 0x000008, "Wrong alignment on BP_RoleShadowCapture_C_CaculateShadowOpaccity");
static_assert(sizeof(BP_RoleShadowCapture_C_CaculateShadowOpaccity) == 0x000078, "Wrong size on BP_RoleShadowCapture_C_CaculateShadowOpaccity");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CurrentOpacity) == 0x000000, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CurrentOpacity' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, NewOpacity) == 0x000008, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::NewOpacity' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_IsInLevelSequence_Result) == 0x000010, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_IsInLevelSequence_Result' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000020, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000030, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x000038, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000048, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_FInterpTo_Constant_ReturnValue_2) == 0x000050, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_FInterpTo_Constant_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x000060, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_FInterpTo_Constant_ReturnValue_3) == 0x000068, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_FInterpTo_Constant_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CaculateShadowOpaccity, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BP_RoleShadowCapture_C_CaculateShadowOpaccity::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_RoleShadowCapture.BP_RoleShadowCapture_C.CheckFloor
// 0x0250 (0x0250 - 0x0000)
struct BP_RoleShadowCapture_C_CheckFloor final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0078(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoleShadowCapture_C_CheckFloor) == 0x000008, "Wrong alignment on BP_RoleShadowCapture_C_CheckFloor");
static_assert(sizeof(BP_RoleShadowCapture_C_CheckFloor) == 0x000250, "Wrong size on BP_RoleShadowCapture_C_CheckFloor");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, Height) == 0x000000, "Member 'BP_RoleShadowCapture_C_CheckFloor::Height' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_RoleShadowCapture_C_CheckFloor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, K2Node_MakeArray_Array_1) == 0x000050, "Member 'BP_RoleShadowCapture_C_CheckFloor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000078, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000170, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_bBlockingHit) == 0x000171, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_bInitialOverlap) == 0x000172, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_Time) == 0x000174, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_Distance) == 0x000178, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_Location) == 0x000180, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_ImpactPoint) == 0x000198, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_Normal) == 0x0001B0, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C8, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_PhysMat) == 0x0001E0, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_HitActor) == 0x0001E8, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_HitComponent) == 0x0001F0, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_HitBoneName) == 0x0001F8, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_BoneName) == 0x000200, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_HitItem) == 0x000208, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_ElementIndex) == 0x00020C, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_FaceIndex) == 0x000210, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_TraceStart) == 0x000218, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_BreakHitResult_TraceEnd) == 0x000230, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_GetSurfaceType_ReturnValue) == 0x000248, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoleShadowCapture_C_CheckFloor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000249, "Member 'BP_RoleShadowCapture_C_CheckFloor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_RoleShadowCapture.BP_RoleShadowCapture_C.ExecuteUbergraph_BP_RoleShadowCapture
// 0x0300 (0x0300 - 0x0000)
struct BP_RoleShadowCapture_C_ExecuteUbergraph_BP_RoleShadowCapture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_10;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_11;         // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_12;         // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_13;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_14;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_15;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_16;         // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_17;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_18;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_19;         // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_20;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_21;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_22;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_23;         // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_24;         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_25;         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_26;         // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_27;         // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_28;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_29;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
