#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RecognizeInteractiveActorComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"
#include "E_InteractiveStageEnum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RecognizeInteractiveActorComp.BP_RecognizeInteractiveActorComp_C
// 0x0070 (0x0118 - 0x00A8)
class UBP_RecognizeInteractiveActorComp_C final : public UBP_X6ActorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 MainSkeletalMeshCompTag;                           // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_InteractionAnim_C>   BP_InteractAnimData;                               // 0x00C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* Initiator, E_InteractiveStageEnum UpdatedStage)> InteractStageUpdate; // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BP_LineTraceRadius;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               BP_DrawDebugType;                                  // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bUseCone;                                       // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BP_OccupyAttractorRadius;                          // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_LogHitActorName;                                // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnEndPlayInteractionMTG();
	void BPOnWaitCertainTimeForInteract();
	void ExecuteUbergraph_BP_RecognizeInteractiveActorComp(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void SafeProtectPreEnterProcessing();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RecognizeInteractiveActorComp_C">();
	}
	static class UBP_RecognizeInteractiveActorComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RecognizeInteractiveActorComp_C>();
	}
};
static_assert(alignof(UBP_RecognizeInteractiveActorComp_C) == 0x000008, "Wrong alignment on UBP_RecognizeInteractiveActorComp_C");
static_assert(sizeof(UBP_RecognizeInteractiveActorComp_C) == 0x000118, "Wrong size on UBP_RecognizeInteractiveActorComp_C");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_RecognizeInteractiveActorComp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, MainSkeletalMeshCompTag) == 0x0000B0, "Member 'UBP_RecognizeInteractiveActorComp_C::MainSkeletalMeshCompTag' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_InteractAnimData) == 0x0000C0, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_InteractAnimData' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, InteractStageUpdate) == 0x0000E8, "Member 'UBP_RecognizeInteractiveActorComp_C::InteractStageUpdate' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_LineTraceRadius) == 0x0000F8, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_LineTraceRadius' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_DrawDebugType) == 0x000100, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_DrawDebugType' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_bUseCone) == 0x000101, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_bUseCone' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_OccupyAttractorRadius) == 0x000108, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_OccupyAttractorRadius' has a wrong offset!");
static_assert(offsetof(UBP_RecognizeInteractiveActorComp_C, BP_LogHitActorName) == 0x000110, "Member 'UBP_RecognizeInteractiveActorComp_C::BP_LogHitActorName' has a wrong offset!");

}

