#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SphereFog

#include "Basic.hpp"

#include "E_ColorSelection_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SphereFog.BP_SphereFog_C.ExecuteUbergraph_BP_SphereFog
// 0x0020 (0x0020 - 0x0000)
struct BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_PC_Platform_Low_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog) == 0x000008, "Wrong alignment on BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog");
static_assert(sizeof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog) == 0x000020, "Wrong size on BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, EntryPoint) == 0x000000, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000008, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_Is_PC_Platform_Low_ReturnValue) == 0x000018, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_Is_PC_Platform_Low_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000019, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00001A, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog, CallFunc_BooleanOR_ReturnValue_2) == 0x00001E, "Member 'BP_SphereFog_C_ExecuteUbergraph_BP_SphereFog::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_SphereFog.BP_SphereFog_C.UpdateParameter
// 0x0020 (0x0020 - 0x0000)
struct BP_SphereFog_C_UpdateParameter final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SphereFog_C_UpdateParameter) == 0x000008, "Wrong alignment on BP_SphereFog_C_UpdateParameter");
static_assert(sizeof(BP_SphereFog_C_UpdateParameter) == 0x000020, "Wrong size on BP_SphereFog_C_UpdateParameter");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000008, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00000C, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000010, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000014, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UpdateParameter, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000018, "Member 'BP_SphereFog_C_UpdateParameter::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");

// Function BP_SphereFog.BP_SphereFog_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SphereFog_C_UserConstructionScript final
{
public:
	E_ColorSelection                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ColorSelection                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_Select_Default_1;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_Select_Default_2;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCullDistance_NewCullDistance_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SphereFog_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SphereFog_C_UserConstructionScript");
static_assert(sizeof(BP_SphereFog_C_UserConstructionScript) == 0x0000A0, "Wrong size on BP_SphereFog_C_UserConstructionScript");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_bool_Variable) == 0x000018, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000019, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_object_Variable_2) == 0x000020, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, Temp_object_Variable_3) == 0x000028, "Member 'BP_SphereFog_C_UserConstructionScript::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000030, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000040, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000044, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000045, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000046, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000047, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000048, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000049, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x00004A, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x00004B, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x00004C, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x00004D, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x00004E, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, K2Node_Select_Default) == 0x000058, "Member 'BP_SphereFog_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000060, "Member 'BP_SphereFog_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, K2Node_Select_Default_2) == 0x000068, "Member 'BP_SphereFog_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000070, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000078, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000090, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000094, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SphereFog_C_UserConstructionScript, CallFunc_SetCullDistance_NewCullDistance_ImplicitCast) == 0x000098, "Member 'BP_SphereFog_C_UserConstructionScript::CallFunc_SetCullDistance_NewCullDistance_ImplicitCast' has a wrong offset!");

}

