#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SyncData

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "F_CorrectionAnim_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SyncData.BP_SyncData_C
// 0x0248 (0x0278 - 0x0030)
class UBP_SyncData_C final : public UPrimaryDataAsset
{
public:
	bool                                          bEnableMirrorTurnAnim;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CorrectionAnim                      IdleStart;                                         // 0x0038(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<double, TSoftObjectPtr<class UAnimMontage>> StepAnims;                                      // 0x0100(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FF_CorrectionAnim                      MoveStart;                                         // 0x0150(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bUseRotateModifier;                                // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotateSpeed;                                       // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            StepF_Lfoot;                                       // 0x0228(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            StepF_Rfoot;                                       // 0x0250(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SyncData_C">();
	}
	static class UBP_SyncData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SyncData_C>();
	}
};
static_assert(alignof(UBP_SyncData_C) == 0x000008, "Wrong alignment on UBP_SyncData_C");
static_assert(sizeof(UBP_SyncData_C) == 0x000278, "Wrong size on UBP_SyncData_C");
static_assert(offsetof(UBP_SyncData_C, bEnableMirrorTurnAnim) == 0x000030, "Member 'UBP_SyncData_C::bEnableMirrorTurnAnim' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, IdleStart) == 0x000038, "Member 'UBP_SyncData_C::IdleStart' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, StepAnims) == 0x000100, "Member 'UBP_SyncData_C::StepAnims' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, MoveStart) == 0x000150, "Member 'UBP_SyncData_C::MoveStart' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, bUseRotateModifier) == 0x000218, "Member 'UBP_SyncData_C::bUseRotateModifier' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, RotateSpeed) == 0x000220, "Member 'UBP_SyncData_C::RotateSpeed' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, StepF_Lfoot) == 0x000228, "Member 'UBP_SyncData_C::StepF_Lfoot' has a wrong offset!");
static_assert(offsetof(UBP_SyncData_C, StepF_Rfoot) == 0x000250, "Member 'UBP_SyncData_C::StepF_Rfoot' has a wrong offset!");

}

