#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShellLamp

#include "Basic.hpp"

#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShellLamp.BP_ShellLamp_C
// 0x0020 (0x0458 - 0x0438)
class ABP_ShellLamp_C final : public AX6Actor
{
public:
	class USceneComponent*                        Scene;                                             // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Prop_Light_21b;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Light;                                             // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShellLamp_C">();
	}
	static class ABP_ShellLamp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShellLamp_C>();
	}
};
static_assert(alignof(ABP_ShellLamp_C) == 0x000008, "Wrong alignment on ABP_ShellLamp_C");
static_assert(sizeof(ABP_ShellLamp_C) == 0x000458, "Wrong size on ABP_ShellLamp_C");
static_assert(offsetof(ABP_ShellLamp_C, Scene) == 0x000438, "Member 'ABP_ShellLamp_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ShellLamp_C, S_Prop_Light_21b) == 0x000440, "Member 'ABP_ShellLamp_C::S_Prop_Light_21b' has a wrong offset!");
static_assert(offsetof(ABP_ShellLamp_C, DefaultSceneRoot) == 0x000448, "Member 'ABP_ShellLamp_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShellLamp_C, Light) == 0x000450, "Member 'ABP_ShellLamp_C::Light' has a wrong offset!");

}

