#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuitDisplayComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_AvatarTag_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SuitDisplayComponent.BP_SuitDisplayComponent_C
// 0x0110 (0x0200 - 0x00F0)
class UBP_SuitDisplayComponent_C final : public UX6SuitDisplayComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FString, class USkeletalMeshComponent*> SuitPartsMap;                                 // 0x00F8(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              SuitChange;                                        // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BP_ShowHandHoldWaitTime;                           // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_IsDebugging;                                    // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BP_InitSuitId;                                     // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_AvatarTag                                PreSetAvatarTag;                                   // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UBP_WeaponAnim_C>        BP_WeaponAnim;                                     // 0x0170(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_WeaponState_C>       BP_WeaponState;                                    // 0x0198(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bEnableRenderCustomDepthPass;                      // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AvatarConfigDataV3_C*               AvatarDA;                                          // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CharacterAppearanceEquipFinished;                  // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UNiagaraSystem*                         NpcChangeClothByAnim_Effect;                       // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_AvatarConfigDataV3_C*               NpcChangeClothByAnim_DA;                           // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    MatchCloth;                                        // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableClothesSimpleNS;                            // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableClothesFollowingNS;                         // 0x01F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableGlintsEffect;                               // 0x01FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceSkipAppearanceEquip;                         // 0x01FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableClothesDIY;                                 // 0x01FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ClearPairCacheExcept();
	void BP_CreatePerformItemsByAnim(class UAnimSequence* InAnim);
	void BP_CreatePerformItemsByAnimData(class UX6AssetUserDataBase* InAnimUserData, bool bVisible);
	void BP_GetAvatarTagString(Enum_AvatarTag InTag, class FString* AvatarTag);
	void BP_MultiThread_ClothMatchV2(TArray<class USkeletalMesh*>& InSkelMeshArray, class UMatchClothObject_C** ResultObject);
	void BP_RemoveAllPerformanceItems();
	void BP_SetPerformItemsVisible(bool bVisible);
	void BP_UpdateCharacterHeight(double InNewHeight);
	void ExecuteUbergraph_BP_SuitDisplayComponent(int32 EntryPoint);
	void GetSuitsIDs(TArray<int32>* SuitsID);
	void InitPartSkeletonMesh();
	void IsClothesDressed(int32 clothesId, bool* bDressed);
	void Lua_ChangeClothesByAvatarDA(class UBP_AvatarConfigDataV3_C* InDataAsset, bool inKeepVisible);
	void Lua_ChangeClothesByAvatarTag(Enum_AvatarTag InTag);
	void Lua_ChangeClothesByAvatarTagStr(const class FString& InTagStr);
	void Lua_ChangeClothesByAvatarTagStrV2(const class FString& InTag);
	void Lua_ChangeClothesBySkMesh(const class FString& ComponentName, class USkeletalMesh* inSkMesh, bool bDress, bool isNPC, class FString* MeshTag);
	void Lua_GetMeshTagBySkMesh(class USkeletalMesh* InMesh, class FString* MeshTag);
	void Lua_SetApplyHighHeelHight(bool Enable);
	void Lua_SetClothPartCastShadow(bool InCastShadowValue);
	void OnAsyncCallFinished(class UObject* AsyncResult);
	void ReceiveBeginPlay();
	void SetEnableClothesFollowingNS(bool NewValue);
	void SetEnableClothesSimpleNS(bool NewValue);
	void SetEnableGlintsEffect(bool InEnable);
	void Tmp_ChangeTargetNpcClothAndEffect();
	void Tmp_SetTargetNpcClothAndEffect(class UBP_AvatarConfigDataV3_C* TargetDA, class UNiagaraSystem* TargetEffect);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SuitDisplayComponent_C">();
	}
	static class UBP_SuitDisplayComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SuitDisplayComponent_C>();
	}
};
static_assert(alignof(UBP_SuitDisplayComponent_C) == 0x000008, "Wrong alignment on UBP_SuitDisplayComponent_C");
static_assert(sizeof(UBP_SuitDisplayComponent_C) == 0x000200, "Wrong size on UBP_SuitDisplayComponent_C");
static_assert(offsetof(UBP_SuitDisplayComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_SuitDisplayComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, SuitPartsMap) == 0x0000F8, "Member 'UBP_SuitDisplayComponent_C::SuitPartsMap' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, SuitChange) == 0x000148, "Member 'UBP_SuitDisplayComponent_C::SuitChange' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, BP_ShowHandHoldWaitTime) == 0x000158, "Member 'UBP_SuitDisplayComponent_C::BP_ShowHandHoldWaitTime' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, BP_IsDebugging) == 0x000160, "Member 'UBP_SuitDisplayComponent_C::BP_IsDebugging' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, BP_InitSuitId) == 0x000164, "Member 'UBP_SuitDisplayComponent_C::BP_InitSuitId' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, PreSetAvatarTag) == 0x000168, "Member 'UBP_SuitDisplayComponent_C::PreSetAvatarTag' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, BP_WeaponAnim) == 0x000170, "Member 'UBP_SuitDisplayComponent_C::BP_WeaponAnim' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, BP_WeaponState) == 0x000198, "Member 'UBP_SuitDisplayComponent_C::BP_WeaponState' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bEnableRenderCustomDepthPass) == 0x0001C0, "Member 'UBP_SuitDisplayComponent_C::bEnableRenderCustomDepthPass' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, AvatarDA) == 0x0001C8, "Member 'UBP_SuitDisplayComponent_C::AvatarDA' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, CharacterAppearanceEquipFinished) == 0x0001D0, "Member 'UBP_SuitDisplayComponent_C::CharacterAppearanceEquipFinished' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, NpcChangeClothByAnim_Effect) == 0x0001E0, "Member 'UBP_SuitDisplayComponent_C::NpcChangeClothByAnim_Effect' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, NpcChangeClothByAnim_DA) == 0x0001E8, "Member 'UBP_SuitDisplayComponent_C::NpcChangeClothByAnim_DA' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, MatchCloth) == 0x0001F0, "Member 'UBP_SuitDisplayComponent_C::MatchCloth' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bEnableClothesSimpleNS) == 0x0001F8, "Member 'UBP_SuitDisplayComponent_C::bEnableClothesSimpleNS' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bEnableClothesFollowingNS) == 0x0001F9, "Member 'UBP_SuitDisplayComponent_C::bEnableClothesFollowingNS' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bEnableGlintsEffect) == 0x0001FA, "Member 'UBP_SuitDisplayComponent_C::bEnableGlintsEffect' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bForceSkipAppearanceEquip) == 0x0001FB, "Member 'UBP_SuitDisplayComponent_C::bForceSkipAppearanceEquip' has a wrong offset!");
static_assert(offsetof(UBP_SuitDisplayComponent_C, bEnableClothesDIY) == 0x0001FC, "Member 'UBP_SuitDisplayComponent_C::bEnableClothesDIY' has a wrong offset!");

}

