#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineTrackComponent

#include "Basic.hpp"

#include "F_SplineTrackKeyFrameData_structs.hpp"
#include "X6Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_SplineTrackState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.AddKeyFrameDataBlend
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SplineTrackComponent_C_AddKeyFrameDataBlend final
{
public:
	struct FF_SplineTrackKeyFrameData             OldData;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSpeed;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendTime;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             NewData;                                           // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             Data;                                              // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             K2Node_MakeStruct_F_SplineTrackKeyFrameData;       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_AddKeyFrameDataBlend");
static_assert(sizeof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend) == 0x0000A0, "Wrong size on BP_SplineTrackComponent_C_AddKeyFrameDataBlend");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, OldData) == 0x000000, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::OldData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, NewSpeed) == 0x000018, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::NewSpeed' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, BlendTime) == 0x000020, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, NewData) == 0x000028, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::NewData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, Data) == 0x000040, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::Data' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataBlend, K2Node_MakeStruct_F_SplineTrackKeyFrameData) == 0x000088, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataBlend::K2Node_MakeStruct_F_SplineTrackKeyFrameData' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.AddKeyFrameDataConst
// 0x0090 (0x0090 - 0x0000)
struct BP_SplineTrackComponent_C_AddKeyFrameDataConst final
{
public:
	struct FF_SplineTrackKeyFrameData             OldData;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndDistance;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             NewData;                                           // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             Data;                                              // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             K2Node_MakeStruct_F_SplineTrackKeyFrameData;       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_AddKeyFrameDataConst) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_AddKeyFrameDataConst");
static_assert(sizeof(BP_SplineTrackComponent_C_AddKeyFrameDataConst) == 0x000090, "Wrong size on BP_SplineTrackComponent_C_AddKeyFrameDataConst");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, OldData) == 0x000000, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::OldData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, EndDistance) == 0x000018, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::EndDistance' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, NewData) == 0x000020, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::NewData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, Data) == 0x000038, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::Data' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, K2Node_MakeStruct_F_SplineTrackKeyFrameData) == 0x000070, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::K2Node_MakeStruct_F_SplineTrackKeyFrameData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataConst, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataConst::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.AddKeyFrameDataStay
// 0x0078 (0x0078 - 0x0000)
struct BP_SplineTrackComponent_C_AddKeyFrameDataStay final
{
public:
	struct FF_SplineTrackKeyFrameData             OldData;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StayTime;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             NewData;                                           // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             Data;                                              // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SplineTrackKeyFrameData             K2Node_MakeStruct_F_SplineTrackKeyFrameData;       // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_AddKeyFrameDataStay) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_AddKeyFrameDataStay");
static_assert(sizeof(BP_SplineTrackComponent_C_AddKeyFrameDataStay) == 0x000078, "Wrong size on BP_SplineTrackComponent_C_AddKeyFrameDataStay");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, OldData) == 0x000000, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::OldData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, StayTime) == 0x000018, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::StayTime' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, NewData) == 0x000020, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::NewData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, Data) == 0x000038, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::Data' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, K2Node_MakeStruct_F_SplineTrackKeyFrameData) == 0x000058, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::K2Node_MakeStruct_F_SplineTrackKeyFrameData' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AddKeyFrameDataStay, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_SplineTrackComponent_C_AddKeyFrameDataStay::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.AlignToInitPosition
// 0x0630 (0x0630 - 0x0000)
struct BP_SplineTrackComponent_C_AlignToInitPosition final
{
public:
	struct FTransform                             TempWorldTransform;                                // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0xE];                                       // 0x0062(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00D0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_GetRotationAtSplineInputKey_ReturnValue;  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0220(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0318(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplineInputKey_ReturnValue;  // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0438(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0530(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_AlignToInitPosition) == 0x000010, "Wrong alignment on BP_SplineTrackComponent_C_AlignToInitPosition");
static_assert(sizeof(BP_SplineTrackComponent_C_AlignToInitPosition) == 0x000630, "Wrong size on BP_SplineTrackComponent_C_AlignToInitPosition");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, TempWorldTransform) == 0x000000, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::TempWorldTransform' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000D0, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetRotationAtSplineInputKey_ReturnValue) == 0x0001C8, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetRotationAtSplineInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x0001E0, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetOwner_ReturnValue) == 0x0001F8, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000200, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetOwner_ReturnValue_1) == 0x000218, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000220, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000318, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000410, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_GetLocationAtSplineInputKey_ReturnValue) == 0x000418, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_GetLocationAtSplineInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, K2Node_SwitchEnum_CmpSuccess) == 0x000430, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000438, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000530, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlignToInitPosition, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000628, "Member 'BP_SplineTrackComponent_C_AlignToInitPosition::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.AlmostArriveNextPoint
// 0x0060 (0x0060 - 0x0000)
struct BP_SplineTrackComponent_C_AlmostArriveNextPoint final
{
public:
	double                                        DeltaTime_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlmostArrive;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_AlmostArriveNextPoint) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_AlmostArriveNextPoint");
static_assert(sizeof(BP_SplineTrackComponent_C_AlmostArriveNextPoint) == 0x000060, "Wrong size on BP_SplineTrackComponent_C_AlmostArriveNextPoint");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, DeltaTime_0) == 0x000000, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::DeltaTime_0' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, bAlmostArrive) == 0x000008, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::bAlmostArrive' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00000C, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_InRange_IntInt_ReturnValue) == 0x000014, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x000018, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1) == 0x000034, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_AlmostArriveNextPoint, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000058, "Member 'BP_SplineTrackComponent_C_AlmostArriveNextPoint::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.BP_ForceSetStartTime
// 0x0008 (0x0008 - 0x0000)
struct BP_SplineTrackComponent_C_BP_ForceSetStartTime final
{
public:
	double                                        NewStartTime;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_BP_ForceSetStartTime) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_BP_ForceSetStartTime");
static_assert(sizeof(BP_SplineTrackComponent_C_BP_ForceSetStartTime) == 0x000008, "Wrong size on BP_SplineTrackComponent_C_BP_ForceSetStartTime");
static_assert(offsetof(BP_SplineTrackComponent_C_BP_ForceSetStartTime, NewStartTime) == 0x000000, "Member 'BP_SplineTrackComponent_C_BP_ForceSetStartTime::NewStartTime' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.BP_IsMultiPlayerModeAndEnableNetSync
// 0x0003 (0x0003 - 0x0000)
struct BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync final
{
public:
	bool                                          bYes;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPlayerMode_ret;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync) == 0x000001, "Wrong alignment on BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync");
static_assert(sizeof(BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync) == 0x000003, "Wrong size on BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync");
static_assert(offsetof(BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync, bYes) == 0x000000, "Member 'BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync::bYes' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync, CallFunc_IsMultiPlayerMode_ret) == 0x000001, "Member 'BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync::CallFunc_IsMultiPlayerMode_ret' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_SplineTrackComponent_C_BP_IsMultiPlayerModeAndEnableNetSync::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.ChangeEffectLineColor
// 0x0090 (0x0090 - 0x0000)
struct BP_SplineTrackComponent_C_ChangeEffectLineColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               endPointRot;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               startPointRot;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                endPointLocation;                                  // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                startPointLocation;                                // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_ChangeEffectLineColor) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_ChangeEffectLineColor");
static_assert(sizeof(BP_SplineTrackComponent_C_ChangeEffectLineColor) == 0x000090, "Wrong size on BP_SplineTrackComponent_C_ChangeEffectLineColor");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, NewColor) == 0x000000, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::NewColor' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, endPointRot) == 0x000010, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::endPointRot' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, startPointRot) == 0x000028, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::startPointRot' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, endPointLocation) == 0x000040, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::endPointLocation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, startPointLocation) == 0x000058, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::startPointLocation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, CallFunc_Less_IntInt_ReturnValue) == 0x000085, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectLineColor, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'BP_SplineTrackComponent_C_ChangeEffectLineColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.ChangeEffectPointColor
// 0x0078 (0x0078 - 0x0000)
struct BP_SplineTrackComponent_C_ChangeEffectPointColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               endPointRot;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               startPointRot;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                endPointLocation;                                  // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                startPointLocation;                                // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_ChangeEffectPointColor) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_ChangeEffectPointColor");
static_assert(sizeof(BP_SplineTrackComponent_C_ChangeEffectPointColor) == 0x000078, "Wrong size on BP_SplineTrackComponent_C_ChangeEffectPointColor");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, NewColor) == 0x000000, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::NewColor' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, endPointRot) == 0x000010, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::endPointRot' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, startPointRot) == 0x000028, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::startPointRot' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, endPointLocation) == 0x000040, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::endPointLocation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, startPointLocation) == 0x000058, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::startPointLocation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_ChangeEffectPointColor, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'BP_SplineTrackComponent_C_ChangeEffectPointColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.CondtionallySetPlatformActorRotation
// 0x0140 (0x0140 - 0x0000)
struct BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation final
{
public:
	struct FRotator                               TargetRotation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_TryConstrainRotationToPitch_OutRotation;  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0038(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation");
static_assert(sizeof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation) == 0x000140, "Wrong size on BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, TargetRotation) == 0x000000, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::TargetRotation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, CallFunc_TryConstrainRotationToPitch_OutRotation) == 0x000018, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::CallFunc_TryConstrainRotationToPitch_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000038, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, CallFunc_GetOwner_ReturnValue) == 0x000130, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000138, "Member 'BP_SplineTrackComponent_C_CondtionallySetPlatformActorRotation::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.DoesSegmentOverrideAnything
// 0x0024 (0x0024 - 0x0000)
struct BP_SplineTrackComponent_C_DoesSegmentOverrideAnything final
{
public:
	struct FTrackSegmentOverride                  Segment;                                           // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bOverrideSomething;                                // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything) == 0x000004, "Wrong alignment on BP_SplineTrackComponent_C_DoesSegmentOverrideAnything");
static_assert(sizeof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything) == 0x000024, "Wrong size on BP_SplineTrackComponent_C_DoesSegmentOverrideAnything");
static_assert(offsetof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything, Segment) == 0x000000, "Member 'BP_SplineTrackComponent_C_DoesSegmentOverrideAnything::Segment' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything, bOverrideSomething) == 0x000020, "Member 'BP_SplineTrackComponent_C_DoesSegmentOverrideAnything::bOverrideSomething' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'BP_SplineTrackComponent_C_DoesSegmentOverrideAnything::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything, CallFunc_BooleanOR_ReturnValue_1) == 0x000022, "Member 'BP_SplineTrackComponent_C_DoesSegmentOverrideAnything::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DoesSegmentOverrideAnything, CallFunc_BooleanOR_ReturnValue_2) == 0x000023, "Member 'BP_SplineTrackComponent_C_DoesSegmentOverrideAnything::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.DrawEffectLine
// 0x0028 (0x0028 - 0x0000)
struct BP_SplineTrackComponent_C_DrawEffectLine final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineMesh;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MyMaterialInstance;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         curNextIndex;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurIndex;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_DrawEffectLine) == 0x000008, "Wrong alignment on BP_SplineTrackComponent_C_DrawEffectLine");
static_assert(sizeof(BP_SplineTrackComponent_C_DrawEffectLine) == 0x000028, "Wrong size on BP_SplineTrackComponent_C_DrawEffectLine");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, Mid) == 0x000000, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::Mid' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, SplineMesh) == 0x000008, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::SplineMesh' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, MyMaterialInstance) == 0x000010, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::MyMaterialInstance' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, curNextIndex) == 0x000018, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::curNextIndex' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, CurIndex) == 0x00001C, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::CurIndex' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineTrackComponent_C_DrawEffectLine, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_SplineTrackComponent_C_DrawEffectLine::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_SplineTrackComponent.BP_SplineTrackComponent_C.DrawEffectLineImpl
// 0x0240 (0x0240 - 0x0000)
struct BP_SplineTrackComponent_C_DrawEffectLineImpl final
{
public:
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   SplineMesh;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MyMaterialInstance;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         curNextIndex;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurIndex;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClosedLoop_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue; // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplinePointType                              CallFunc_GetSplinePointType_ReturnValue;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue_1; // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetArriveTangentAtSplinePoint_ReturnValue; // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_2; // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_2; // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_3; // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_3; // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineTrackComponent_C_DrawEffectLineImpl) == 0x000010, "Wrong alignment on BP_SplineTrackComponent_C_DrawEffectLineImpl");
