#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperMoon01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SuperMoon01.BP_SuperMoon01_C.Set To Component
// 0x0060 (0x0060 - 0x0000)
struct BP_SuperMoon01_C_Set_To_Component final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DyEnvWeathers_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UDynamicWeatherComponent*>       CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicWeatherComponent*               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DyEnvWeatehrComp_SuperMoon01_C*     K2Node_DynamicCast_AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_Set_To_Component) == 0x000008, "Wrong alignment on BP_SuperMoon01_C_Set_To_Component");
static_assert(sizeof(BP_SuperMoon01_C_Set_To_Component) == 0x000060, "Wrong size on BP_SuperMoon01_C_Set_To_Component");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SuperMoon01_C_Set_To_Component::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SuperMoon01_C_Set_To_Component::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_Map_Values_Values) == 0x000018, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, K2Node_DynamicCast_AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01) == 0x000040, "Member 'BP_SuperMoon01_C_Set_To_Component::K2Node_DynamicCast_AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_SuperMoon01_C_Set_To_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_GetObjectClass_ReturnValue) == 0x000050, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Set_To_Component, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000058, "Member 'BP_SuperMoon01_C_Set_To_Component::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_SuperMoon01.BP_SuperMoon01_C.RotAroundAxis
// 0x01B8 (0x01B8 - 0x0000)
struct BP_SuperMoon01_C_RotAroundAxis final
{
public:
	float                                         AngleDeg_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00B8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_RotAroundAxis) == 0x000008, "Wrong alignment on BP_SuperMoon01_C_RotAroundAxis");
static_assert(sizeof(BP_SuperMoon01_C_RotAroundAxis) == 0x0001B8, "Wrong size on BP_SuperMoon01_C_RotAroundAxis");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, AngleDeg_0) == 0x000000, "Member 'BP_SuperMoon01_C_RotAroundAxis::AngleDeg_0' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, Temp_bool_Variable) == 0x000020, "Member 'BP_SuperMoon01_C_RotAroundAxis::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_FindLookAtRotation_ReturnValue) == 0x000058, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, K2Node_Select_Default) == 0x000070, "Member 'BP_SuperMoon01_C_RotAroundAxis::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000088, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000A0, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000B8, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_RotAroundAxis, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001B0, "Member 'BP_SuperMoon01_C_RotAroundAxis::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");

// Function BP_SuperMoon01.BP_SuperMoon01_C.Remapped1015p
// 0x0040 (0x0040 - 0x0000)
struct BP_SuperMoon01_C_Remapped1015p final
{
public:
	float                                         InputPin;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_Remapped1015p) == 0x000008, "Wrong alignment on BP_SuperMoon01_C_Remapped1015p");
static_assert(sizeof(BP_SuperMoon01_C_Remapped1015p) == 0x000040, "Wrong size on BP_SuperMoon01_C_Remapped1015p");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, InputPin) == 0x000000, "Member 'BP_SuperMoon01_C_Remapped1015p::InputPin' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, ReturnValue) == 0x000008, "Member 'BP_SuperMoon01_C_Remapped1015p::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_Remapped1015p, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_SuperMoon01_C_Remapped1015p::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_SuperMoon01.BP_SuperMoon01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SuperMoon01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SuperMoon01_C_ReceiveTick");
static_assert(sizeof(BP_SuperMoon01_C_ReceiveTick) == 0x000004, "Wrong size on BP_SuperMoon01_C_ReceiveTick");
static_assert(offsetof(BP_SuperMoon01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SuperMoon01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SuperMoon01.BP_SuperMoon01_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SuperMoon01_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SuperMoon01_C_ReceiveEndPlay");
static_assert(sizeof(BP_SuperMoon01_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SuperMoon01_C_ReceiveEndPlay");
static_assert(offsetof(BP_SuperMoon01_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SuperMoon01_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SuperMoon01.BP_SuperMoon01_C.ExecuteUbergraph_BP_SuperMoon01
// 0x0520 (0x0520 - 0x0000)
struct BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Remapped1015p_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0048(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_1;                 // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0240(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0250(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor_2;                 // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0370(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningCommandletMode_ReturnValue;      // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DyEnvSky_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0478(0x0010)(ReferenceParm)
	class ABP_DyEnvSky_C*                         CallFunc_Array_Get_Item;                           // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DyEnvSky_C*>                 CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x04E0(0x0010)(ReferenceParm)
	class ABP_DyEnvSky_C*                         CallFunc_Array_Get_Item_1;                         // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_1_ImplicitCast;               // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_0_ImplicitCast;               // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01) == 0x000010, "Wrong alignment on BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01");
static_assert(sizeof(BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01) == 0x000520, "Wrong size on BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01");
static_assert(offsetof(BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01, EntryPoint) == 0x000000, "Member 'BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_SuperMoon01_C_ExecuteUbergraph_BP_SuperMoon01::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
