#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuitDisplayComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_AvatarTag_structs.hpp"


namespace SDK::Params
{

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_CreatePerformItemsByAnim
// 0x0008 (0x0008 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim final
{
public:
	class UAnimSequence*                          InAnim;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim) == 0x000008, "Wrong size on BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim, InAnim) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnim::InAnim' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_CreatePerformItemsByAnimData
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData final
{
public:
	class UX6AssetUserDataBase*                   InAnimUserData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData, InAnimUserData) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData::InAnimUserData' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData, bVisible) == 0x000008, "Member 'BP_SuitDisplayComponent_C_BP_CreatePerformItemsByAnimData::bVisible' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_GetAvatarTagString
// 0x0028 (0x0028 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_GetAvatarTagString final
{
public:
	Enum_AvatarTag                                InTag;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AvatarTag;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInt32EnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_GetAvatarTagString) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_BP_GetAvatarTagString");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_GetAvatarTagString) == 0x000028, "Wrong size on BP_SuitDisplayComponent_C_BP_GetAvatarTagString");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_GetAvatarTagString, InTag) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_GetAvatarTagString::InTag' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_GetAvatarTagString, AvatarTag) == 0x000008, "Member 'BP_SuitDisplayComponent_C_BP_GetAvatarTagString::AvatarTag' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_GetAvatarTagString, CallFunc_GetInt32EnumeratorUserFriendlyName_ReturnValue) == 0x000018, "Member 'BP_SuitDisplayComponent_C_BP_GetAvatarTagString::CallFunc_GetInt32EnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_MultiThread_ClothMatchV2
// 0x0020 (0x0020 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2 final
{
public:
	TArray<class USkeletalMesh*>                  InSkelMeshArray;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMatchClothObject_C*                    ResultObject;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    CallFunc_MultiThread_ClothMatch_ResultObject;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2) == 0x000020, "Wrong size on BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2, InSkelMeshArray) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2::InSkelMeshArray' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2, ResultObject) == 0x000010, "Member 'BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2::ResultObject' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2, CallFunc_MultiThread_ClothMatch_ResultObject) == 0x000018, "Member 'BP_SuitDisplayComponent_C_BP_MultiThread_ClothMatchV2::CallFunc_MultiThread_ClothMatch_ResultObject' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_SetPerformItemsVisible
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible, bVisible) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_SetPerformItemsVisible::bVisible' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.BP_UpdateCharacterHeight
// 0x0168 (0x0168 - 0x0000)
struct BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight final
{
public:
	double                                        InNewHeight;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleRadius_Radius_ImplicitCast;     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight");
static_assert(sizeof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight) == 0x000168, "Wrong size on BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, InNewHeight) == 0x000000, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::InNewHeight' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, K2Node_DynamicCast_AsCharacter) == 0x000030, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000058, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000150, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000154, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast) == 0x000158, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_SetCapsuleRadius_Radius_ImplicitCast) == 0x00015C, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_SetCapsuleRadius_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'BP_SuitDisplayComponent_C_BP_UpdateCharacterHeight::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.ExecuteUbergraph_BP_SuitDisplayComponent
// 0x0020 (0x0020 - 0x0000)
struct BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_AsyncResult;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    K2Node_DynamicCast_AsMatch_Cloth_Object;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent");
static_assert(sizeof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent) == 0x000020, "Wrong size on BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent");
static_assert(offsetof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent, EntryPoint) == 0x000000, "Member 'BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent, K2Node_Event_AsyncResult) == 0x000008, "Member 'BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent::K2Node_Event_AsyncResult' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent, K2Node_DynamicCast_AsMatch_Cloth_Object) == 0x000010, "Member 'BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent::K2Node_DynamicCast_AsMatch_Cloth_Object' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_SuitDisplayComponent_C_ExecuteUbergraph_BP_SuitDisplayComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.GetSuitsIDs
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_GetSuitsIDs final
{
public:
	TArray<int32>                                 SuitsID;                                           // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(BP_SuitDisplayComponent_C_GetSuitsIDs) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_GetSuitsIDs");
static_assert(sizeof(BP_SuitDisplayComponent_C_GetSuitsIDs) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_GetSuitsIDs");
static_assert(offsetof(BP_SuitDisplayComponent_C_GetSuitsIDs, SuitsID) == 0x000000, "Member 'BP_SuitDisplayComponent_C_GetSuitsIDs::SuitsID' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.InitPartSkeletonMesh
// 0x0060 (0x0060 - 0x0000)
struct BP_SuitDisplayComponent_C_InitPartSkeletonMesh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_InitPartSkeletonMesh");
static_assert(sizeof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh) == 0x000060, "Wrong size on BP_SuitDisplayComponent_C_InitPartSkeletonMesh");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Array_Get_Item_1) == 0x00002C, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_InitPartSkeletonMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_SuitDisplayComponent_C_InitPartSkeletonMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.IsClothesDressed
// 0x0008 (0x0008 - 0x0000)
struct BP_SuitDisplayComponent_C_IsClothesDressed final
{
public:
	int32                                         clothesId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDressed;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_IsClothesDressed) == 0x000004, "Wrong alignment on BP_SuitDisplayComponent_C_IsClothesDressed");
static_assert(sizeof(BP_SuitDisplayComponent_C_IsClothesDressed) == 0x000008, "Wrong size on BP_SuitDisplayComponent_C_IsClothesDressed");
static_assert(offsetof(BP_SuitDisplayComponent_C_IsClothesDressed, clothesId) == 0x000000, "Member 'BP_SuitDisplayComponent_C_IsClothesDressed::clothesId' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_IsClothesDressed, bDressed) == 0x000004, "Member 'BP_SuitDisplayComponent_C_IsClothesDressed::bDressed' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_ChangeClothesByAvatarDA
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA final
{
public:
	class UBP_AvatarConfigDataV3_C*               InDataAsset;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          inKeepVisible;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA, InDataAsset) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA::InDataAsset' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA, inKeepVisible) == 0x000008, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarDA::inKeepVisible' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_ChangeClothesByAvatarTag
// 0x0004 (0x0004 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag final
{
public:
	Enum_AvatarTag                                InTag;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag) == 0x000004, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag) == 0x000004, "Wrong size on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag, InTag) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTag::InTag' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_ChangeClothesByAvatarTagStr
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr final
{
public:
	class FString                                 InTagStr;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr, InTagStr) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStr::InTagStr' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_ChangeClothesByAvatarTagStrV2
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2 final
{
public:
	class FString                                 InTag;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2, InTag) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesByAvatarTagStrV2::InTag' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_ChangeClothesBySkMesh
// 0x0030 (0x0030 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMesh*                          inSkMesh;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bDress;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isNPC;                                             // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MeshTag;                                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh) == 0x000030, "Wrong size on BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh, ComponentName) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh::ComponentName' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh, inSkMesh) == 0x000010, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh::inSkMesh' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh, bDress) == 0x000018, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh::bDress' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh, isNPC) == 0x000019, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh::isNPC' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh, MeshTag) == 0x000020, "Member 'BP_SuitDisplayComponent_C_Lua_ChangeClothesBySkMesh::MeshTag' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_GetMeshTagBySkMesh
// 0x0018 (0x0018 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh final
{
public:
	class USkeletalMesh*                          InMesh;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 MeshTag;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh) == 0x000018, "Wrong size on BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh, InMesh) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh::InMesh' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh, MeshTag) == 0x000008, "Member 'BP_SuitDisplayComponent_C_Lua_GetMeshTagBySkMesh::MeshTag' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_SetApplyHighHeelHight
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight, Enable) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_SetApplyHighHeelHight::Enable' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Lua_SetClothPartCastShadow
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow final
{
public:
	bool                                          InCastShadowValue;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow");
static_assert(sizeof(BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow");
static_assert(offsetof(BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow, InCastShadowValue) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Lua_SetClothPartCastShadow::InCastShadowValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.OnAsyncCallFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_SuitDisplayComponent_C_OnAsyncCallFinished final
{
public:
	class UObject*                                AsyncResult;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_OnAsyncCallFinished) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_OnAsyncCallFinished");
static_assert(sizeof(BP_SuitDisplayComponent_C_OnAsyncCallFinished) == 0x000008, "Wrong size on BP_SuitDisplayComponent_C_OnAsyncCallFinished");
static_assert(offsetof(BP_SuitDisplayComponent_C_OnAsyncCallFinished, AsyncResult) == 0x000000, "Member 'BP_SuitDisplayComponent_C_OnAsyncCallFinished::AsyncResult' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.SetEnableClothesFollowingNS
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS");
static_assert(sizeof(BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS");
static_assert(offsetof(BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS, NewValue) == 0x000000, "Member 'BP_SuitDisplayComponent_C_SetEnableClothesFollowingNS::NewValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.SetEnableClothesSimpleNS
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS");
static_assert(sizeof(BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS");
static_assert(offsetof(BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS, NewValue) == 0x000000, "Member 'BP_SuitDisplayComponent_C_SetEnableClothesSimpleNS::NewValue' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.SetEnableGlintsEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_SuitDisplayComponent_C_SetEnableGlintsEffect final
{
public:
	bool                                          InEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_SetEnableGlintsEffect) == 0x000001, "Wrong alignment on BP_SuitDisplayComponent_C_SetEnableGlintsEffect");
static_assert(sizeof(BP_SuitDisplayComponent_C_SetEnableGlintsEffect) == 0x000001, "Wrong size on BP_SuitDisplayComponent_C_SetEnableGlintsEffect");
static_assert(offsetof(BP_SuitDisplayComponent_C_SetEnableGlintsEffect, InEnable) == 0x000000, "Member 'BP_SuitDisplayComponent_C_SetEnableGlintsEffect::InEnable' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Tmp_ChangeTargetNpcClothAndEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect");
static_assert(sizeof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect) == 0x000050, "Wrong size on BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_Add_VectorVector_ReturnValue) == 0x000028, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_SuitDisplayComponent_C_Tmp_ChangeTargetNpcClothAndEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.Tmp_SetTargetNpcClothAndEffect
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect final
{
public:
	class UBP_AvatarConfigDataV3_C*               TargetDA;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TargetEffect;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect");
static_assert(sizeof(BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect, TargetDA) == 0x000000, "Member 'BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect::TargetDA' has a wrong offset!");
static_assert(offsetof(BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect, TargetEffect) == 0x000008, "Member 'BP_SuitDisplayComponent_C_Tmp_SetTargetNpcClothAndEffect::TargetEffect' has a wrong offset!");

// Function BP_SuitDisplayComponent.BP_SuitDisplayComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_SuitDisplayComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuitDisplayComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_SuitDisplayComponent_C_GetModuleName");
static_assert(sizeof(BP_SuitDisplayComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_SuitDisplayComponent_C_GetModuleName");
static_assert(offsetof(BP_SuitDisplayComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_SuitDisplayComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

