#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_S_Prop_Instrument_07

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_S_Prop_Instrument_07.BP_S_Prop_Instrument_07_C
// 0x0020 (0x03C8 - 0x03A8)
class ABP_S_Prop_Instrument_07_C final : public AActor
{
public:
	class USkeletalMeshComponent*                 INT_Prop_Common_01_SkMesh;                         // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Prop_Instrument_07;                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_S_Prop_Instrument_07_C">();
	}
	static class ABP_S_Prop_Instrument_07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_S_Prop_Instrument_07_C>();
	}
};
static_assert(alignof(ABP_S_Prop_Instrument_07_C) == 0x000008, "Wrong alignment on ABP_S_Prop_Instrument_07_C");
static_assert(sizeof(ABP_S_Prop_Instrument_07_C) == 0x0003C8, "Wrong size on ABP_S_Prop_Instrument_07_C");
static_assert(offsetof(ABP_S_Prop_Instrument_07_C, INT_Prop_Common_01_SkMesh) == 0x0003A8, "Member 'ABP_S_Prop_Instrument_07_C::INT_Prop_Common_01_SkMesh' has a wrong offset!");
static_assert(offsetof(ABP_S_Prop_Instrument_07_C, Plane) == 0x0003B0, "Member 'ABP_S_Prop_Instrument_07_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_S_Prop_Instrument_07_C, S_Prop_Instrument_07) == 0x0003B8, "Member 'ABP_S_Prop_Instrument_07_C::S_Prop_Instrument_07' has a wrong offset!");
static_assert(offsetof(ABP_S_Prop_Instrument_07_C, DefaultSceneRoot) == 0x0003C0, "Member 'ABP_S_Prop_Instrument_07_C::DefaultSceneRoot' has a wrong offset!");

}

