#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StarSeaDustCombine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_InteractiveObjType_structs.hpp"


namespace SDK::Params
{

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.ExecuteUbergraph_BP_StarSeaDustCombine
// 0x003C (0x003C - 0x0000)
struct BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine) == 0x000004, "Wrong alignment on BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine");
static_assert(sizeof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine) == 0x00003C, "Wrong size on BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, EntryPoint) == 0x000000, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Get_Item) == 0x000024, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Get_Item_1) == 0x00002D, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Less_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine, CallFunc_Array_Add_ReturnValue_1) == 0x000038, "Member 'BP_StarSeaDustCombine_C_ExecuteUbergraph_BP_StarSeaDustCombine::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.OnCrystalDestroyed
// 0x0010 (0x0010 - 0x0000)
struct BP_StarSeaDustCombine_C_OnCrystalDestroyed final
{
public:
	class ABP_StarSeaCrystal_C*                   CrystalActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_OnCrystalDestroyed) == 0x000008, "Wrong alignment on BP_StarSeaDustCombine_C_OnCrystalDestroyed");
static_assert(sizeof(BP_StarSeaDustCombine_C_OnCrystalDestroyed) == 0x000010, "Wrong size on BP_StarSeaDustCombine_C_OnCrystalDestroyed");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalDestroyed, CrystalActor) == 0x000000, "Member 'BP_StarSeaDustCombine_C_OnCrystalDestroyed::CrystalActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalDestroyed, CallFunc_MakeLiteralBool_ReturnValue) == 0x000008, "Member 'BP_StarSeaDustCombine_C_OnCrystalDestroyed::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.OnCrystalSpawned
// 0x0038 (0x0038 - 0x0000)
struct BP_StarSeaDustCombine_C_OnCrystalSpawned final
{
public:
	class ABP_StarSeaCrystal_C*                   CrystalActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_OnCrystalSpawned) == 0x000008, "Wrong alignment on BP_StarSeaDustCombine_C_OnCrystalSpawned");
static_assert(sizeof(BP_StarSeaDustCombine_C_OnCrystalSpawned) == 0x000038, "Wrong size on BP_StarSeaDustCombine_C_OnCrystalSpawned");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CrystalActor) == 0x000000, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CrystalActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, Temp_int_Variable) == 0x000008, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, Temp_bool_Variable) == 0x00000C, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CallFunc_Array_Add_ReturnValue_1) == 0x000030, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnCrystalSpawned, CallFunc_MakeLiteralBool_ReturnValue) == 0x000034, "Member 'BP_StarSeaDustCombine_C_OnCrystalSpawned::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.OnDustDestroyed
// 0x0010 (0x0010 - 0x0000)
struct BP_StarSeaDustCombine_C_OnDustDestroyed final
{
public:
	class ABP_StarSeaDust_C*                      DustActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_OnDustDestroyed) == 0x000008, "Wrong alignment on BP_StarSeaDustCombine_C_OnDustDestroyed");
static_assert(sizeof(BP_StarSeaDustCombine_C_OnDustDestroyed) == 0x000010, "Wrong size on BP_StarSeaDustCombine_C_OnDustDestroyed");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustDestroyed, DustActor) == 0x000000, "Member 'BP_StarSeaDustCombine_C_OnDustDestroyed::DustActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustDestroyed, CallFunc_MakeLiteralBool_ReturnValue) == 0x000008, "Member 'BP_StarSeaDustCombine_C_OnDustDestroyed::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.OnDustSpawned
// 0x0038 (0x0038 - 0x0000)
struct BP_StarSeaDustCombine_C_OnDustSpawned final
{
public:
	class ABP_StarSeaDust_C*                      DustActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_OnDustSpawned) == 0x000008, "Wrong alignment on BP_StarSeaDustCombine_C_OnDustSpawned");
static_assert(sizeof(BP_StarSeaDustCombine_C_OnDustSpawned) == 0x000038, "Wrong size on BP_StarSeaDustCombine_C_OnDustSpawned");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, DustActor) == 0x000000, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::DustActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, Temp_int_Variable) == 0x000008, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, Temp_bool_Variable) == 0x00000C, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, CallFunc_Array_Add_ReturnValue_1) == 0x000030, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_OnDustSpawned, CallFunc_MakeLiteralBool_ReturnValue) == 0x000034, "Member 'BP_StarSeaDustCombine_C_OnDustSpawned::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_StarSeaDustCombine_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_StarSeaDustCombine_C_ReceiveTick");
static_assert(sizeof(BP_StarSeaDustCombine_C_ReceiveTick) == 0x000004, "Wrong size on BP_StarSeaDustCombine_C_ReceiveTick");
static_assert(offsetof(BP_StarSeaDustCombine_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_StarSeaDustCombine_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.SetVisible
// 0x0004 (0x0004 - 0x0000)
struct BP_StarSeaDustCombine_C_SetVisible final
{
public:
	E_InteractiveObjType                          Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisible;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_SetVisible) == 0x000001, "Wrong alignment on BP_StarSeaDustCombine_C_SetVisible");
static_assert(sizeof(BP_StarSeaDustCombine_C_SetVisible) == 0x000004, "Wrong size on BP_StarSeaDustCombine_C_SetVisible");
static_assert(offsetof(BP_StarSeaDustCombine_C_SetVisible, Type) == 0x000000, "Member 'BP_StarSeaDustCombine_C_SetVisible::Type' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_SetVisible, bVisible) == 0x000001, "Member 'BP_StarSeaDustCombine_C_SetVisible::bVisible' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_SetVisible, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_StarSeaDustCombine_C_SetVisible::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaDustCombine_C_SetVisible, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_StarSeaDustCombine_C_SetVisible::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_StarSeaDustCombine.BP_StarSeaDustCombine_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_StarSeaDustCombine_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaDustCombine_C_GetModuleName) == 0x000008, "Wrong alignment on BP_StarSeaDustCombine_C_GetModuleName");
static_assert(sizeof(BP_StarSeaDustCombine_C_GetModuleName) == 0x000010, "Wrong size on BP_StarSeaDustCombine_C_GetModuleName");
static_assert(offsetof(BP_StarSeaDustCombine_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_StarSeaDustCombine_C_GetModuleName::ReturnValue' has a wrong offset!");

}

