#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StarSeaCrystal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_InteractionProcess_structs.hpp"
#include "E_EInteractSuccRet_structs.hpp"
#include "X6StateMachine_structs.hpp"
#include "E_InteractiveObjPhantomState_structs.hpp"


namespace SDK::Params
{

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature");
static_assert(sizeof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature, PSystem) == 0x000000, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact1_K2Node_ComponentBoundEvent_4_OnNiagaraSystemFinished__DelegateSignature::PSystem' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature");
static_assert(sizeof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature, PSystem) == 0x000000, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Niagara_Interact_K2Node_ComponentBoundEvent_2_OnNiagaraSystemFinished__DelegateSignature::PSystem' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_StarSeaCrystal_Range_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature final
{
public:
	E_InteractionProcess                          Process;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InteractMasterNetID;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InteractMasterActor;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPressBtnInteraction;                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractedActor;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InterAction_State_C*                InterAction_State;                                 // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature");
static_assert(sizeof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature) == 0x000030, "Wrong size on BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, Process) == 0x000000, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::Process' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, InteractMasterNetID) == 0x000008, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::InteractMasterNetID' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, InteractMasterActor) == 0x000010, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::InteractMasterActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, IsPressBtnInteraction) == 0x000018, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::IsPressBtnInteraction' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, InteractedActor) == 0x000020, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::InteractedActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature, InterAction_State) == 0x000028, "Member 'BP_StarSeaCrystal_C_BndEvt__BP_WishDewDrop_BP_InteractiveActorComponent_K2Node_ComponentBoundEvent_1_ActiveInteractive__DelegateSignature::InterAction_State' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_ChangeVirtual
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_ChangeVirtual final
{
public:
	bool                                          bVirtual;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_ChangeVirtual) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_ChangeVirtual");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_ChangeVirtual) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_ChangeVirtual");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_ChangeVirtual, bVirtual) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_ChangeVirtual::bVirtual' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_CheckVirtual
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_CheckVirtual final
{
public:
	bool                                          bVirtual;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_CheckVirtual) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_CheckVirtual");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_CheckVirtual) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_CheckVirtual");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_CheckVirtual, bVirtual) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_CheckVirtual::bVirtual' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_DisableBreath
// 0x0014 (0x0014 - 0x0000)
struct BP_StarSeaCrystal_C_BP_DisableBreath final
{
public:
	bool                                          CallFunc_SetScalarParameterValue_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetScalarParameterValue_ReturnValue_1;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetScalarParameterValue_ReturnValue_2;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_InValue_ImplicitCast; // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_InValue_ImplicitCast_1; // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_InValue_ImplicitCast_2; // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_DisableBreath) == 0x000004, "Wrong alignment on BP_StarSeaCrystal_C_BP_DisableBreath");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_DisableBreath) == 0x000014, "Wrong size on BP_StarSeaCrystal_C_BP_DisableBreath");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_ReturnValue_1) == 0x000001, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_ReturnValue_2) == 0x000002, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_InValue_ImplicitCast) == 0x000004, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_InValue_ImplicitCast_1) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x00000C, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableBreath, CallFunc_SetScalarParameterValue_InValue_ImplicitCast_2) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_DisableBreath::CallFunc_SetScalarParameterValue_InValue_ImplicitCast_2' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_DisableEmpower
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_DisableEmpower final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_DisableEmpower) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_DisableEmpower");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_DisableEmpower) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_DisableEmpower");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableEmpower, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_DisableEmpower::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_DisableLongRing
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_DisableLongRing final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_DisableLongRing) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_DisableLongRing");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_DisableLongRing) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_DisableLongRing");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableLongRing, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_DisableLongRing::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_DisablePenetrateEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_DisablePenetrateEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_DisablePenetrateEffect) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_DisablePenetrateEffect");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_DisablePenetrateEffect) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_DisablePenetrateEffect");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisablePenetrateEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_DisablePenetrateEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_DisableShortRing
// 0x0001 (0x0001 - 0x0000)
struct BP_StarSeaCrystal_C_BP_DisableShortRing final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_DisableShortRing) == 0x000001, "Wrong alignment on BP_StarSeaCrystal_C_BP_DisableShortRing");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_DisableShortRing) == 0x000001, "Wrong size on BP_StarSeaCrystal_C_BP_DisableShortRing");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_DisableShortRing, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_DisableShortRing::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_EnablePenetrateEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_StarSeaCrystal_C_BP_EnablePenetrateEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AX6PlayerCameraManager*                 CallFunc_GetX6PlayerCameraManager_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_StarSeaCameraModifier_C*            CallFunc_AddNewCameraModifier_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_EnablePenetrateEffect) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_EnablePenetrateEffect");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_EnablePenetrateEffect) == 0x000018, "Wrong size on BP_StarSeaCrystal_C_BP_EnablePenetrateEffect");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_EnablePenetrateEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_EnablePenetrateEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_EnablePenetrateEffect, CallFunc_GetX6PlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_EnablePenetrateEffect::CallFunc_GetX6PlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_EnablePenetrateEffect, CallFunc_AddNewCameraModifier_ReturnValue) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_EnablePenetrateEffect::CallFunc_AddNewCameraModifier_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_ForceInteractSuccess
// 0x0018 (0x0018 - 0x0000)
struct BP_StarSeaCrystal_C_BP_ForceInteractSuccess final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetLocalPlayerPawn_LocalPlayerPawn;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_BP_GetActorEntityID_EntityID;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_ForceInteractSuccess) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_ForceInteractSuccess");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_ForceInteractSuccess) == 0x000018, "Wrong size on BP_StarSeaCrystal_C_BP_ForceInteractSuccess");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_ForceInteractSuccess, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_ForceInteractSuccess::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_ForceInteractSuccess, CallFunc_GetLocalPlayerPawn_LocalPlayerPawn) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_ForceInteractSuccess::CallFunc_GetLocalPlayerPawn_LocalPlayerPawn' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_ForceInteractSuccess, CallFunc_BP_GetActorEntityID_EntityID) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_ForceInteractSuccess::CallFunc_BP_GetActorEntityID_EntityID' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_IsArriveAtPlayer
// 0x00E0 (0x00E0 - 0x0000)
struct BP_StarSeaCrystal_C_BP_IsArriveAtPlayer final
{
public:
	bool                                          isArrive;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetLocalPlayerPawn_LocalPlayerPawn;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue_1;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetLocalPlayerPawn_LocalPlayerPawn_1;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_DistanceSquared_ReturnValue_2;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_IsArriveAtPlayer");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer) == 0x0000E0, "Wrong size on BP_StarSeaCrystal_C_BP_IsArriveAtPlayer");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, isArrive) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::isArrive' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x000038, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_GetLocalPlayerPawn_LocalPlayerPawn) == 0x000060, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_GetLocalPlayerPawn_LocalPlayerPawn' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000068, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Vector_DistanceSquared_ReturnValue_1) == 0x000080, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Vector_DistanceSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000090, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_GetLocalPlayerPawn_LocalPlayerPawn_1) == 0x0000B0, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_GetLocalPlayerPawn_LocalPlayerPawn_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000B8, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Vector_DistanceSquared_ReturnValue_2) == 0x0000D0, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Vector_DistanceSquared_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsArriveAtPlayer, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x0000D8, "Member 'BP_StarSeaCrystal_C_BP_IsArriveAtPlayer::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_IsEnergized
// 0x0010 (0x0010 - 0x0000)
struct BP_StarSeaCrystal_C_BP_IsEnergized final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnergized;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_IsEnergized) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_IsEnergized");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_IsEnergized) == 0x000010, "Wrong size on BP_StarSeaCrystal_C_BP_IsEnergized");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsEnergized, Actor) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_IsEnergized::Actor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_IsEnergized, bIsEnergized) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_IsEnergized::bIsEnergized' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_OnEmpower
// 0x0020 (0x0020 - 0x0000)
struct BP_StarSeaCrystal_C_BP_OnEmpower final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_OnEmpower) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_OnEmpower");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_OnEmpower) == 0x000020, "Wrong size on BP_StarSeaCrystal_C_BP_OnEmpower");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnEmpower, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_OnEmpower::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnEmpower, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_OnEmpower::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnEmpower, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_OnEmpower::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnEmpower, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000018, "Member 'BP_StarSeaCrystal_C_BP_OnEmpower::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnEmpower, CallFunc_K2_SetTimer_Time_ImplicitCast_1) == 0x00001C, "Member 'BP_StarSeaCrystal_C_BP_OnEmpower::CallFunc_K2_SetTimer_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_OnLongRing
// 0x0020 (0x0020 - 0x0000)
struct BP_StarSeaCrystal_C_BP_OnLongRing final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_OnLongRing) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_OnLongRing");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_OnLongRing) == 0x000020, "Wrong size on BP_StarSeaCrystal_C_BP_OnLongRing");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnLongRing, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_OnLongRing::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnLongRing, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_OnLongRing::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnLongRing, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_OnLongRing::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnLongRing, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000018, "Member 'BP_StarSeaCrystal_C_BP_OnLongRing::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnLongRing, CallFunc_K2_SetTimer_Time_ImplicitCast_1) == 0x00001C, "Member 'BP_StarSeaCrystal_C_BP_OnLongRing::CallFunc_K2_SetTimer_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_OnShortRing
// 0x0020 (0x0020 - 0x0000)
struct BP_StarSeaCrystal_C_BP_OnShortRing final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_OnShortRing) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_OnShortRing");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_OnShortRing) == 0x000020, "Wrong size on BP_StarSeaCrystal_C_BP_OnShortRing");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnShortRing, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_OnShortRing::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnShortRing, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_OnShortRing::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnShortRing, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_OnShortRing::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnShortRing, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000018, "Member 'BP_StarSeaCrystal_C_BP_OnShortRing::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_OnShortRing, CallFunc_K2_SetTimer_Time_ImplicitCast_1) == 0x00001C, "Member 'BP_StarSeaCrystal_C_BP_OnShortRing::CallFunc_K2_SetTimer_Time_ImplicitCast_1' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_StartFly
// 0x00E0 (0x00E0 - 0x0000)
struct BP_StarSeaCrystal_C_BP_StartFly final
{
public:
	class ACharacter*                             CallFunc_GetLocalPlayerPawn_LocalPlayerPawn;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_StartFly) == 0x000010, "Wrong alignment on BP_StarSeaCrystal_C_BP_StartFly");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_StartFly) == 0x0000E0, "Wrong size on BP_StarSeaCrystal_C_BP_StartFly");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_GetLocalPlayerPawn_LocalPlayerPawn) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_GetLocalPlayerPawn_LocalPlayerPawn' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_FindLookAtRotation_ReturnValue) == 0x000038, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_BreakRotator_Roll) == 0x000050, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_BreakRotator_Pitch) == 0x000054, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_BreakRotator_Yaw) == 0x000058, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_StartFly, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_StarSeaCrystal_C_BP_StartFly::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_UpdateActorLocationOnCurve
// 0x0150 (0x0150 - 0x0000)
struct BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve final
{
public:
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0050(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVectorValue_InTime_ImplicitCast;       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve) == 0x000150, "Wrong size on BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_GetVectorValue_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_TransformLocation_ReturnValue) == 0x000020, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_Add_VectorVector_ReturnValue) == 0x000038, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000050, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000148, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve, CallFunc_GetVectorValue_InTime_ImplicitCast) == 0x00014C, "Member 'BP_StarSeaCrystal_C_BP_UpdateActorLocationOnCurve::CallFunc_GetVectorValue_InTime_ImplicitCast' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_UpdateCoupleLocation
// 0x0230 (0x0230 - 0x0000)
struct BP_StarSeaCrystal_C_BP_UpdateCoupleLocation final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0138(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation) == 0x000008, "Wrong alignment on BP_StarSeaCrystal_C_BP_UpdateCoupleLocation");
static_assert(sizeof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation) == 0x000230, "Wrong size on BP_StarSeaCrystal_C_BP_UpdateCoupleLocation");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, DeltaTime) == 0x000000, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000040, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_FindLookAtRotation_ReturnValue) == 0x000058, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000070, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_VSize_ReturnValue) == 0x0000C0, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Normal_ReturnValue) == 0x0000C8, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_FMin_ReturnValue) == 0x0000E0, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000E8, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000108, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000120, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StarSeaCrystal_C_BP_UpdateCoupleLocation, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000138, "Member 'BP_StarSeaCrystal_C_BP_UpdateCoupleLocation::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_StarSeaCrystal.BP_StarSeaCrystal_C.BP_UpdateLocation
// 0x0240 (0x0240 - 0x0000)
struct BP_StarSeaCrystal_C_BP_UpdateLocation final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
