#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StarSeaSummonMeteorArea

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StarSeaSummonMeteorArea.BP_StarSeaSummonMeteorArea_C.ExecuteUbergraph_BP_StarSeaSummonMeteorArea
// 0x0140 (0x0140 - 0x0000)
struct BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsX6GameNikki_IsNikki;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsX6GameNikki_IsNikki_1;                  // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea) == 0x000008, "Wrong alignment on BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea");
static_assert(sizeof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea) == 0x000140, "Wrong size on BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, EntryPoint) == 0x000000, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000120, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000138, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, CallFunc_IsX6GameNikki_IsNikki) == 0x00013C, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::CallFunc_IsX6GameNikki_IsNikki' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea, CallFunc_IsX6GameNikki_IsNikki_1) == 0x00013D, "Member 'BP_StarSeaSummonMeteorArea_C_ExecuteUbergraph_BP_StarSeaSummonMeteorArea::CallFunc_IsX6GameNikki_IsNikki_1' has a wrong offset!");

// Function BP_StarSeaSummonMeteorArea.BP_StarSeaSummonMeteorArea_C.BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_StarSeaSummonMeteorArea.BP_StarSeaSummonMeteorArea_C.BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_StarSeaSummonMeteorArea_C_BndEvt__BP_StarSeaSummonMeteorArea_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_StarSeaSummonMeteorArea.BP_StarSeaSummonMeteorArea_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_StarSeaSummonMeteorArea_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_StarSeaSummonMeteorArea_C_GetModuleName) == 0x000008, "Wrong alignment on BP_StarSeaSummonMeteorArea_C_GetModuleName");
static_assert(sizeof(BP_StarSeaSummonMeteorArea_C_GetModuleName) == 0x000010, "Wrong size on BP_StarSeaSummonMeteorArea_C_GetModuleName");
static_assert(offsetof(BP_StarSeaSummonMeteorArea_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_StarSeaSummonMeteorArea_C_GetModuleName::ReturnValue' has a wrong offset!");

}

