#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveMask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_CloudMask_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SaveMask.BP_SaveMask_C
// 0x0108 (0x04B0 - 0x03A8)
class ABP_SaveMask_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_CloudMask                          SaveCloudMask;                                     // 0x03C0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CloudMask_Object_C*>         AddCloudMaskArray;                                 // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FST_CloudMask>                  AddStructureArray;                                 // 0x0490(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UDABP_CloudMask_C*                      DA_CloudMask;                                      // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_CloudMaskGenerator_C*               Ref_Generator;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SaveMask(int32 EntryPoint);
	void SaveLocalMask();
	void SwitchCloudPreset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SaveMask_C">();
	}
	static class ABP_SaveMask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SaveMask_C>();
	}
};
static_assert(alignof(ABP_SaveMask_C) == 0x000010, "Wrong alignment on ABP_SaveMask_C");
static_assert(sizeof(ABP_SaveMask_C) == 0x0004B0, "Wrong size on ABP_SaveMask_C");
static_assert(offsetof(ABP_SaveMask_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_SaveMask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_SaveMask_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, SaveCloudMask) == 0x0003C0, "Member 'ABP_SaveMask_C::SaveCloudMask' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, AddCloudMaskArray) == 0x000480, "Member 'ABP_SaveMask_C::AddCloudMaskArray' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, AddStructureArray) == 0x000490, "Member 'ABP_SaveMask_C::AddStructureArray' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, DA_CloudMask) == 0x0004A0, "Member 'ABP_SaveMask_C::DA_CloudMask' has a wrong offset!");
static_assert(offsetof(ABP_SaveMask_C, Ref_Generator) == 0x0004A8, "Member 'ABP_SaveMask_C::Ref_Generator' has a wrong offset!");

}

