#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StarSeaDayNight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StarSeaDayNight.BP_StarSeaDayNight_C
// 0x0050 (0x03F8 - 0x03A8)
class ABP_StarSeaDayNight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicWeatherAmbianceComponent*       Day;                                               // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDynamicWeatherAmbianceComponent*       Night;                                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         NightOut_Alpha_3BD208954308AA583D730096C5AE2EE6;   // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            NightOut__Direction_3BD208954308AA583D730096C5AE2EE6; // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     NightOut;                                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DayOut_Alpha_34FCAB914EAB127341834DB4C0A1DEFE;     // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DayOut__Direction_34FCAB914EAB127341834DB4C0A1DEFE; // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DayOut;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSys_C*                         TODSystem;                                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Multiplayer_MoonBoat_C*             MoonBoat;                                          // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void DayOut__FinishedFunc();
	void DayOut__UpdateFunc();
	void ExecuteUbergraph_BP_StarSeaDayNight(int32 EntryPoint);
	void Get_Moon_Boat();
	void Get_TOD_System();
	void NightOut__FinishedFunc();
	void NightOut__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StarSeaDayNight_C">();
	}
	static class ABP_StarSeaDayNight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StarSeaDayNight_C>();
	}
};
static_assert(alignof(ABP_StarSeaDayNight_C) == 0x000008, "Wrong alignment on ABP_StarSeaDayNight_C");
static_assert(sizeof(ABP_StarSeaDayNight_C) == 0x0003F8, "Wrong size on ABP_StarSeaDayNight_C");
static_assert(offsetof(ABP_StarSeaDayNight_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_StarSeaDayNight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, Day) == 0x0003B0, "Member 'ABP_StarSeaDayNight_C::Day' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, Night) == 0x0003B8, "Member 'ABP_StarSeaDayNight_C::Night' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, Box) == 0x0003C0, "Member 'ABP_StarSeaDayNight_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, NightOut_Alpha_3BD208954308AA583D730096C5AE2EE6) == 0x0003C8, "Member 'ABP_StarSeaDayNight_C::NightOut_Alpha_3BD208954308AA583D730096C5AE2EE6' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, NightOut__Direction_3BD208954308AA583D730096C5AE2EE6) == 0x0003CC, "Member 'ABP_StarSeaDayNight_C::NightOut__Direction_3BD208954308AA583D730096C5AE2EE6' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, NightOut) == 0x0003D0, "Member 'ABP_StarSeaDayNight_C::NightOut' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, DayOut_Alpha_34FCAB914EAB127341834DB4C0A1DEFE) == 0x0003D8, "Member 'ABP_StarSeaDayNight_C::DayOut_Alpha_34FCAB914EAB127341834DB4C0A1DEFE' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, DayOut__Direction_34FCAB914EAB127341834DB4C0A1DEFE) == 0x0003DC, "Member 'ABP_StarSeaDayNight_C::DayOut__Direction_34FCAB914EAB127341834DB4C0A1DEFE' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, DayOut) == 0x0003E0, "Member 'ABP_StarSeaDayNight_C::DayOut' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, TODSystem) == 0x0003E8, "Member 'ABP_StarSeaDayNight_C::TODSystem' has a wrong offset!");
static_assert(offsetof(ABP_StarSeaDayNight_C, MoonBoat) == 0x0003F0, "Member 'ABP_StarSeaDayNight_C::MoonBoat' has a wrong offset!");

}

