#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerLineSection

#include "Basic.hpp"

#include "PaperDialogueProvider_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.K2_GetSectionTitle
// 0x01E8 (0x01E8 - 0x0000)
struct BP_SequencerLineSection_C_K2_GetSectionTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0010)()
	struct FPCDX6DialogueData                     CallFunc_GetX6DialogueData_PCDX6DialogueData;      // 0x0020(0x0098)()
	bool                                          CallFunc_GetX6DialogueData_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDialogueActorName_ReturnValue;         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDialogueLineTextById_ReturnValue;      // 0x0118(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0010)()
};
static_assert(alignof(BP_SequencerLineSection_C_K2_GetSectionTitle) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_K2_GetSectionTitle");
static_assert(sizeof(BP_SequencerLineSection_C_K2_GetSectionTitle) == 0x0001E8, "Wrong size on BP_SequencerLineSection_C_K2_GetSectionTitle");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, ReturnValue) == 0x000000, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_GetX6DialogueData_PCDX6DialogueData) == 0x000020, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_GetX6DialogueData_PCDX6DialogueData' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_GetX6DialogueData_ReturnValue) == 0x0000B8, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_GetX6DialogueData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_GetDialogueActorName_ReturnValue) == 0x000108, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_GetDialogueActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_GetDialogueLineTextById_ReturnValue) == 0x000118, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_GetDialogueLineTextById_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, K2Node_MakeStruct_FormatArgumentData_2) == 0x000180, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, K2Node_MakeArray_Array) == 0x0001C8, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetSectionTitle, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'BP_SequencerLineSection_C_K2_GetSectionTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.K2_GetLineText
// 0x0020 (0x0020 - 0x0000)
struct BP_SequencerLineSection_C_K2_GetLineText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetDialogueLineTextById_ReturnValue;      // 0x0010(0x0010)()
};
static_assert(alignof(BP_SequencerLineSection_C_K2_GetLineText) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_K2_GetLineText");
static_assert(sizeof(BP_SequencerLineSection_C_K2_GetLineText) == 0x000020, "Wrong size on BP_SequencerLineSection_C_K2_GetLineText");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetLineText, ReturnValue) == 0x000000, "Member 'BP_SequencerLineSection_C_K2_GetLineText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetLineText, CallFunc_GetDialogueLineTextById_ReturnValue) == 0x000010, "Member 'BP_SequencerLineSection_C_K2_GetLineText::CallFunc_GetDialogueLineTextById_ReturnValue' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.K2_GetActorName
// 0x00D0 (0x00D0 - 0x0000)
struct BP_SequencerLineSection_C_K2_GetActorName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FPCDX6DialogueData                     CallFunc_GetX6DialogueData_PCDX6DialogueData;      // 0x0010(0x0098)()
	bool                                          CallFunc_GetX6DialogueData_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDialogueActorName_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0010)()
};
static_assert(alignof(BP_SequencerLineSection_C_K2_GetActorName) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_K2_GetActorName");
static_assert(sizeof(BP_SequencerLineSection_C_K2_GetActorName) == 0x0000D0, "Wrong size on BP_SequencerLineSection_C_K2_GetActorName");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetActorName, ReturnValue) == 0x000000, "Member 'BP_SequencerLineSection_C_K2_GetActorName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetActorName, CallFunc_GetX6DialogueData_PCDX6DialogueData) == 0x000010, "Member 'BP_SequencerLineSection_C_K2_GetActorName::CallFunc_GetX6DialogueData_PCDX6DialogueData' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetActorName, CallFunc_GetX6DialogueData_ReturnValue) == 0x0000A8, "Member 'BP_SequencerLineSection_C_K2_GetActorName::CallFunc_GetX6DialogueData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetActorName, CallFunc_GetDialogueActorName_ReturnValue) == 0x0000B0, "Member 'BP_SequencerLineSection_C_K2_GetActorName::CallFunc_GetDialogueActorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_K2_GetActorName, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'BP_SequencerLineSection_C_K2_GetActorName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.ExecuteUbergraph_BP_SequencerLineSection
// 0x0028 (0x0028 - 0x0000)
struct BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndFrameSeconds_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartFrameSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection");
static_assert(sizeof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection) == 0x000028, "Wrong size on BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, EntryPoint) == 0x000000, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, CallFunc_GetEndFrameSeconds_ReturnValue) == 0x000004, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::CallFunc_GetEndFrameSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, CallFunc_GetStartFrameSeconds_ReturnValue) == 0x000008, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::CallFunc_GetStartFrameSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_SequencerLineSection_C_ExecuteUbergraph_BP_SequencerLineSection::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.BP_OnLineSectionEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_SequencerLineSection_C_BP_OnLineSectionEnd final
{
public:
	class FName                                   LineId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerLineSection_C_BP_OnLineSectionEnd) == 0x000004, "Wrong alignment on BP_SequencerLineSection_C_BP_OnLineSectionEnd");
static_assert(sizeof(BP_SequencerLineSection_C_BP_OnLineSectionEnd) == 0x000008, "Wrong size on BP_SequencerLineSection_C_BP_OnLineSectionEnd");
static_assert(offsetof(BP_SequencerLineSection_C_BP_OnLineSectionEnd, LineId_0) == 0x000000, "Member 'BP_SequencerLineSection_C_BP_OnLineSectionEnd::LineId_0' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.BP_OnLineSectionBegin
// 0x0010 (0x0010 - 0x0000)
struct BP_SequencerLineSection_C_BP_OnLineSectionBegin final
{
public:
	class FName                                   LineId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SectionDuration;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerLineSection_C_BP_OnLineSectionBegin) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_BP_OnLineSectionBegin");
static_assert(sizeof(BP_SequencerLineSection_C_BP_OnLineSectionBegin) == 0x000010, "Wrong size on BP_SequencerLineSection_C_BP_OnLineSectionBegin");
static_assert(offsetof(BP_SequencerLineSection_C_BP_OnLineSectionBegin, LineId_0) == 0x000000, "Member 'BP_SequencerLineSection_C_BP_OnLineSectionBegin::LineId_0' has a wrong offset!");
static_assert(offsetof(BP_SequencerLineSection_C_BP_OnLineSectionBegin, SectionDuration) == 0x000008, "Member 'BP_SequencerLineSection_C_BP_OnLineSectionBegin::SectionDuration' has a wrong offset!");

// Function BP_SequencerLineSection.BP_SequencerLineSection_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_SequencerLineSection_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_SequencerLineSection_C_GetModuleName) == 0x000008, "Wrong alignment on BP_SequencerLineSection_C_GetModuleName");
static_assert(sizeof(BP_SequencerLineSection_C_GetModuleName) == 0x000010, "Wrong size on BP_SequencerLineSection_C_GetModuleName");
static_assert(offsetof(BP_SequencerLineSection_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_SequencerLineSection_C_GetModuleName::ReturnValue' has a wrong offset!");

}

