#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperMoon01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SuperMoon01.BP_SuperMoon01_C
// 0x0138 (0x04E0 - 0x03A8)
class ABP_SuperMoon01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ShinePlane;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moon;                                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SuperMoonScene;                                    // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_72BD60E74131D56DFDB2B9A0CCB132C4; // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MoonMI;                                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Moon;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MoonColor;                                         // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform01;                                       // 0x0400(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleDeg;                                          // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InVect;                                            // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Axis;                                              // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        OutRangeA;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutRangeB;                                         // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            C_MoonAlpha;                                       // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DyEnvWeatehrComp_SuperMoon01_C*     AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01;            // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InLS_;                                             // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleDeg_0;                                        // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x04C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        TransitionFogDensity;                              // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Set_To_Component();
	void RotAroundAxis(float AngleDeg_0);
	double Remapped1015p(float InputPin);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void PostContrust();
	void ExecuteUbergraph_BP_SuperMoon01(int32 EntryPoint);
	void EditorUpdate();
	void DrawTracks();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SuperMoon01_C">();
	}
	static class ABP_SuperMoon01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SuperMoon01_C>();
	}
};
static_assert(alignof(ABP_SuperMoon01_C) == 0x000010, "Wrong alignment on ABP_SuperMoon01_C");
static_assert(sizeof(ABP_SuperMoon01_C) == 0x0004E0, "Wrong size on ABP_SuperMoon01_C");
static_assert(offsetof(ABP_SuperMoon01_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_SuperMoon01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, ShinePlane) == 0x0003B0, "Member 'ABP_SuperMoon01_C::ShinePlane' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Moon) == 0x0003B8, "Member 'ABP_SuperMoon01_C::Moon' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, SuperMoonScene) == 0x0003C0, "Member 'ABP_SuperMoon01_C::SuperMoonScene' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Timeline__Direction_72BD60E74131D56DFDB2B9A0CCB132C4) == 0x0003C8, "Member 'ABP_SuperMoon01_C::Timeline__Direction_72BD60E74131D56DFDB2B9A0CCB132C4' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Timeline) == 0x0003D0, "Member 'ABP_SuperMoon01_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Scale) == 0x0003D8, "Member 'ABP_SuperMoon01_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, MoonMI) == 0x0003E0, "Member 'ABP_SuperMoon01_C::MoonMI' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, MID_Moon) == 0x0003E8, "Member 'ABP_SuperMoon01_C::MID_Moon' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, MoonColor) == 0x0003F0, "Member 'ABP_SuperMoon01_C::MoonColor' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Transform01) == 0x000400, "Member 'ABP_SuperMoon01_C::Transform01' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, AngleDeg) == 0x000460, "Member 'ABP_SuperMoon01_C::AngleDeg' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, InVect) == 0x000468, "Member 'ABP_SuperMoon01_C::InVect' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, Axis) == 0x000480, "Member 'ABP_SuperMoon01_C::Axis' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, OutRangeA) == 0x000498, "Member 'ABP_SuperMoon01_C::OutRangeA' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, OutRangeB) == 0x0004A0, "Member 'ABP_SuperMoon01_C::OutRangeB' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, C_MoonAlpha) == 0x0004A8, "Member 'ABP_SuperMoon01_C::C_MoonAlpha' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01) == 0x0004B0, "Member 'ABP_SuperMoon01_C::AsBP_Dy_Env_Weatehr_Comp_Super_Moon_01' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, InLS_) == 0x0004B8, "Member 'ABP_SuperMoon01_C::InLS_' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, AngleDeg_0) == 0x0004BC, "Member 'ABP_SuperMoon01_C::AngleDeg_0' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, NewRotation) == 0x0004C0, "Member 'ABP_SuperMoon01_C::NewRotation' has a wrong offset!");
static_assert(offsetof(ABP_SuperMoon01_C, TransitionFogDensity) == 0x0004D8, "Member 'ABP_SuperMoon01_C::TransitionFogDensity' has a wrong offset!");

}

