#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetLevel_ColorVariant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SetLevel_ColorVariant.BP_SetLevel_ColorVariant_C
// 0x0028 (0x03D0 - 0x03A8)
class ABP_SetLevel_ColorVariant_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Tex_ColorVariant;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LandsRes;                                          // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SetLevel_ColorVariant(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SetLevel_ColorVariant_C">();
	}
	static class ABP_SetLevel_ColorVariant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SetLevel_ColorVariant_C>();
	}
};
static_assert(alignof(ABP_SetLevel_ColorVariant_C) == 0x000008, "Wrong alignment on ABP_SetLevel_ColorVariant_C");
static_assert(sizeof(ABP_SetLevel_ColorVariant_C) == 0x0003D0, "Wrong size on ABP_SetLevel_ColorVariant_C");
static_assert(offsetof(ABP_SetLevel_ColorVariant_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_SetLevel_ColorVariant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SetLevel_ColorVariant_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_SetLevel_ColorVariant_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SetLevel_ColorVariant_C, Tex_ColorVariant) == 0x0003B8, "Member 'ABP_SetLevel_ColorVariant_C::Tex_ColorVariant' has a wrong offset!");
static_assert(offsetof(ABP_SetLevel_ColorVariant_C, LandsRes) == 0x0003C0, "Member 'ABP_SetLevel_ColorVariant_C::LandsRes' has a wrong offset!");

}

