#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TemperatureBaseComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TemperatureBaseComponent.BP_TemperatureBaseComponent_C.GetAmbientTemperatureValue
// 0x0008 (0x0008 - 0x0000)
struct BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue) == 0x000008, "Wrong alignment on BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue");
static_assert(sizeof(BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue) == 0x000008, "Wrong size on BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue");
static_assert(offsetof(BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue, NewParam) == 0x000000, "Member 'BP_TemperatureBaseComponent_C_GetAmbientTemperatureValue::NewParam' has a wrong offset!");

// Function BP_TemperatureBaseComponent.BP_TemperatureBaseComponent_C.SetAmbientTemperatureValue
// 0x0008 (0x0008 - 0x0000)
struct BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue) == 0x000008, "Wrong alignment on BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue");
static_assert(sizeof(BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue) == 0x000008, "Wrong size on BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue");
static_assert(offsetof(BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue, NewParam) == 0x000000, "Member 'BP_TemperatureBaseComponent_C_SetAmbientTemperatureValue::NewParam' has a wrong offset!");

// Function BP_TemperatureBaseComponent.BP_TemperatureBaseComponent_C.UpdateAmbientTemperatureValue
// 0x0008 (0x0008 - 0x0000)
struct BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue) == 0x000008, "Wrong alignment on BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue");
static_assert(sizeof(BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue) == 0x000008, "Wrong size on BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue");
static_assert(offsetof(BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue, NewParam) == 0x000000, "Member 'BP_TemperatureBaseComponent_C_UpdateAmbientTemperatureValue::NewParam' has a wrong offset!");

// Function BP_TemperatureBaseComponent.BP_TemperatureBaseComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_TemperatureBaseComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_TemperatureBaseComponent_C_GetModuleName) == 0x000008, "Wrong alignment on BP_TemperatureBaseComponent_C_GetModuleName");
static_assert(sizeof(BP_TemperatureBaseComponent_C_GetModuleName) == 0x000010, "Wrong size on BP_TemperatureBaseComponent_C_GetModuleName");
static_assert(offsetof(BP_TemperatureBaseComponent_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_TemperatureBaseComponent_C_GetModuleName::ReturnValue' has a wrong offset!");

}

