#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TODSystem_Master

#include "Basic.hpp"

#include "S_TimeStamp_structs.hpp"
#include "DynamicEnvironmentSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_TODSystem_Master_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsRunningCommandletMode_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_TODSystem_Master_C_UserConstructionScript");
static_assert(sizeof(BP_TODSystem_Master_C_UserConstructionScript) == 0x000002, "Wrong size on BP_TODSystem_Master_C_UserConstructionScript");
static_assert(offsetof(BP_TODSystem_Master_C_UserConstructionScript, CallFunc_IsRunningCommandletMode_ReturnValue) == 0x000000, "Member 'BP_TODSystem_Master_C_UserConstructionScript::CallFunc_IsRunningCommandletMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UserConstructionScript, CallFunc_IsEditor_Mode_inEditor) == 0x000001, "Member 'BP_TODSystem_Master_C_UserConstructionScript::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.UpdateTimeStamp
// 0x0098 (0x0098 - 0x0000)
struct BP_TODSystem_Master_C_UpdateTimeStamp final
{
public:
	struct FTimeStamp                             TimeStamp1;                                        // 0x0000(0x002C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TimeStamp                           TimeStamp;                                         // 0x0030(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_UpdateTimeStamp) == 0x000008, "Wrong alignment on BP_TODSystem_Master_C_UpdateTimeStamp");
static_assert(sizeof(BP_TODSystem_Master_C_UpdateTimeStamp) == 0x000098, "Wrong size on BP_TODSystem_Master_C_UpdateTimeStamp");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeStamp, TimeStamp1) == 0x000000, "Member 'BP_TODSystem_Master_C_UpdateTimeStamp::TimeStamp1' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeStamp, TimeStamp) == 0x000030, "Member 'BP_TODSystem_Master_C_UpdateTimeStamp::TimeStamp' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.UpdateTimeSettings01
// 0x0020 (0x0020 - 0x0000)
struct BP_TODSystem_Master_C_UpdateTimeSettings01 final
{
public:
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_UpdateTimeSettings01) == 0x000008, "Wrong alignment on BP_TODSystem_Master_C_UpdateTimeSettings01");
static_assert(sizeof(BP_TODSystem_Master_C_UpdateTimeSettings01) == 0x000020, "Wrong size on BP_TODSystem_Master_C_UpdateTimeSettings01");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeSettings01, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_TODSystem_Master_C_UpdateTimeSettings01::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeSettings01, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_TODSystem_Master_C_UpdateTimeSettings01::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeSettings01, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BP_TODSystem_Master_C_UpdateTimeSettings01::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateTimeSettings01, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'BP_TODSystem_Master_C_UpdateTimeSettings01::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.UpdateLocalNowTime
// 0x0018 (0x0018 - 0x0000)
struct BP_TODSystem_Master_C_UpdateLocalNowTime final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_UpdateLocalNowTime) == 0x000008, "Wrong alignment on BP_TODSystem_Master_C_UpdateLocalNowTime");
static_assert(sizeof(BP_TODSystem_Master_C_UpdateLocalNowTime) == 0x000018, "Wrong size on BP_TODSystem_Master_C_UpdateLocalNowTime");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateLocalNowTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_TODSystem_Master_C_UpdateLocalNowTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateLocalNowTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_TODSystem_Master_C_UpdateLocalNowTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_UpdateLocalNowTime, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_TODSystem_Master_C_UpdateLocalNowTime::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.ToggleStreetLamps
// 0x0001 (0x0001 - 0x0000)
struct BP_TODSystem_Master_C_ToggleStreetLamps final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_ToggleStreetLamps) == 0x000001, "Wrong alignment on BP_TODSystem_Master_C_ToggleStreetLamps");
static_assert(sizeof(BP_TODSystem_Master_C_ToggleStreetLamps) == 0x000001, "Wrong size on BP_TODSystem_Master_C_ToggleStreetLamps");
static_assert(offsetof(BP_TODSystem_Master_C_ToggleStreetLamps, On) == 0x000000, "Member 'BP_TODSystem_Master_C_ToggleStreetLamps::On' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.SetRegionLamps
// 0x0010 (0x0010 - 0x0000)
struct BP_TODSystem_Master_C_SetRegionLamps final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RegionId;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_SetRegionLamps) == 0x000008, "Wrong alignment on BP_TODSystem_Master_C_SetRegionLamps");
static_assert(sizeof(BP_TODSystem_Master_C_SetRegionLamps) == 0x000010, "Wrong size on BP_TODSystem_Master_C_SetRegionLamps");
static_assert(offsetof(BP_TODSystem_Master_C_SetRegionLamps, Percent) == 0x000000, "Member 'BP_TODSystem_Master_C_SetRegionLamps::Percent' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_SetRegionLamps, RegionId) == 0x000008, "Member 'BP_TODSystem_Master_C_SetRegionLamps::RegionId' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TODSystem_Master_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TODSystem_Master_C_ReceiveTick");
static_assert(sizeof(BP_TODSystem_Master_C_ReceiveTick) == 0x000004, "Wrong size on BP_TODSystem_Master_C_ReceiveTick");
static_assert(offsetof(BP_TODSystem_Master_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TODSystem_Master_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TODSystem_Master_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TODSystem_Master_C_ReceiveEndPlay");
static_assert(sizeof(BP_TODSystem_Master_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TODSystem_Master_C_ReceiveEndPlay");
static_assert(offsetof(BP_TODSystem_Master_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TODSystem_Master_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TODSystem_Master.BP_TODSystem_Master_C.ExecuteUbergraph_BP_TODSystem_Master
// 0x00B8 (0x00B8 - 0x0000)
struct BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeStamp                             K2Node_CustomEvent_TimeStamp1;                     // 0x0004(0x002C)(NoDestructor)
	struct FS_TimeStamp                           K2Node_CustomEvent_TimeStamp;                      // 0x0030(0x0068)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_percent;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_regionId;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On;                             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DeltaTime_ImplicitCast;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master) == 0x000008, "Wrong alignment on BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master");
static_assert(sizeof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master) == 0x0000B8, "Wrong size on BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, EntryPoint) == 0x000000, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_CustomEvent_TimeStamp1) == 0x000004, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_CustomEvent_TimeStamp1' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_CustomEvent_TimeStamp) == 0x000030, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_CustomEvent_TimeStamp' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_CustomEvent_percent) == 0x000098, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_CustomEvent_percent' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_CustomEvent_regionId) == 0x0000A0, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_CustomEvent_regionId' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_CustomEvent_On) == 0x0000A4, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_Event_EndPlayReason) == 0x0000AC, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master, K2Node_VariableSet_DeltaTime_ImplicitCast) == 0x0000B0, "Member 'BP_TODSystem_Master_C_ExecuteUbergraph_BP_TODSystem_Master::K2Node_VariableSet_DeltaTime_ImplicitCast' has a wrong offset!");

}

