#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIPFInteractor_Foliage

#include "Basic.hpp"

#include "UIPF_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UIPFInteractor_Foliage.BP_UIPFInteractor_Foliage_C
// 0x0070 (0x0360 - 0x02F0)
class UBP_UIPFInteractor_Foliage_C : public UUIPFInteractor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          FirstTime;                                         // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Character_Max_Speed;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TrailPos;                                          // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetlaSeconds;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStop;                                            // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEffect;                                          // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewVar_0;                                          // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewVar_1;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TrailDir;                                          // 0x0340(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        Interp_Speed;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UIPFInteractor_Foliage(int32 EntryPoint);
	struct FVector GetCustomLocation();
	struct FVector4 GetCustomVelocity();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIPFInteractor_Foliage_C">();
	}
	static class UBP_UIPFInteractor_Foliage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UIPFInteractor_Foliage_C>();
	}
};
static_assert(alignof(UBP_UIPFInteractor_Foliage_C) == 0x000010, "Wrong alignment on UBP_UIPFInteractor_Foliage_C");
static_assert(sizeof(UBP_UIPFInteractor_Foliage_C) == 0x000360, "Wrong size on UBP_UIPFInteractor_Foliage_C");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, UberGraphFrame) == 0x0002F0, "Member 'UBP_UIPFInteractor_Foliage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, FirstTime) == 0x0002F8, "Member 'UBP_UIPFInteractor_Foliage_C::FirstTime' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, Character_Max_Speed) == 0x000300, "Member 'UBP_UIPFInteractor_Foliage_C::Character_Max_Speed' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, TrailPos) == 0x000308, "Member 'UBP_UIPFInteractor_Foliage_C::TrailPos' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, DetlaSeconds) == 0x000320, "Member 'UBP_UIPFInteractor_Foliage_C::DetlaSeconds' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, IsStop) == 0x000328, "Member 'UBP_UIPFInteractor_Foliage_C::IsStop' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, IsEffect) == 0x000329, "Member 'UBP_UIPFInteractor_Foliage_C::IsEffect' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, NewVar_0) == 0x000330, "Member 'UBP_UIPFInteractor_Foliage_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, NewVar_1) == 0x000338, "Member 'UBP_UIPFInteractor_Foliage_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, TrailDir) == 0x000340, "Member 'UBP_UIPFInteractor_Foliage_C::TrailDir' has a wrong offset!");
static_assert(offsetof(UBP_UIPFInteractor_Foliage_C, Interp_Speed) == 0x000358, "Member 'UBP_UIPFInteractor_Foliage_C::Interp_Speed' has a wrong offset!");

}

