#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIPFManager_FX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UIPFManager_FX.BP_UIPFManager_FX_C.ExecuteUbergraph_BP_UIPFManager_FX
// 0x0068 (0x0068 - 0x0000)
struct BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractorID;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX) == 0x000008, "Wrong alignment on BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX");
static_assert(sizeof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX) == 0x000068, "Wrong size on BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, EntryPoint) == 0x000000, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000008, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, K2Node_Event_InteractorID) == 0x000010, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::K2Node_Event_InteractorID' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, K2Node_Event_HitLocation) == 0x000018, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, CallFunc_MakeLiteralString_ReturnValue) == 0x000030, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX, CallFunc_GetNiagaraParameterCollection_ReturnValue_1) == 0x000060, "Member 'BP_UIPFManager_FX_C_ExecuteUbergraph_BP_UIPFManager_FX::CallFunc_GetNiagaraParameterCollection_ReturnValue_1' has a wrong offset!");

// Function BP_UIPFManager_FX.BP_UIPFManager_FX_C.UpdateInteractorLocation
// 0x0020 (0x0020 - 0x0000)
struct BP_UIPFManager_FX_C_UpdateInteractorLocation final
{
public:
	int32                                         InteractorID;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFManager_FX_C_UpdateInteractorLocation) == 0x000008, "Wrong alignment on BP_UIPFManager_FX_C_UpdateInteractorLocation");
static_assert(sizeof(BP_UIPFManager_FX_C_UpdateInteractorLocation) == 0x000020, "Wrong size on BP_UIPFManager_FX_C_UpdateInteractorLocation");
static_assert(offsetof(BP_UIPFManager_FX_C_UpdateInteractorLocation, InteractorID) == 0x000000, "Member 'BP_UIPFManager_FX_C_UpdateInteractorLocation::InteractorID' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_FX_C_UpdateInteractorLocation, HitLocation) == 0x000008, "Member 'BP_UIPFManager_FX_C_UpdateInteractorLocation::HitLocation' has a wrong offset!");

}

