#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIWS_Manager_Impl

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UIWS_Manager_Impl.BP_UIWS_Manager_Impl_C.ExchangeHeight1
// 0x0018 (0x0018 - 0x0000)
struct BP_UIWS_Manager_Impl_C_ExchangeHeight1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIWS_Manager_Impl_C_ExchangeHeight1) == 0x000008, "Wrong alignment on BP_UIWS_Manager_Impl_C_ExchangeHeight1");
static_assert(sizeof(BP_UIWS_Manager_Impl_C_ExchangeHeight1) == 0x000018, "Wrong size on BP_UIWS_Manager_Impl_C_ExchangeHeight1");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeHeight1, Loaded) == 0x000000, "Member 'BP_UIWS_Manager_Impl_C_ExchangeHeight1::Loaded' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeHeight1, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_UIWS_Manager_Impl_C_ExchangeHeight1::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeHeight1, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_UIWS_Manager_Impl_C_ExchangeHeight1::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UIWS_Manager_Impl.BP_UIWS_Manager_Impl_C.ExchangeNormal
// 0x0018 (0x0018 - 0x0000)
struct BP_UIWS_Manager_Impl_C_ExchangeNormal final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIWS_Manager_Impl_C_ExchangeNormal) == 0x000008, "Wrong alignment on BP_UIWS_Manager_Impl_C_ExchangeNormal");
static_assert(sizeof(BP_UIWS_Manager_Impl_C_ExchangeNormal) == 0x000018, "Wrong size on BP_UIWS_Manager_Impl_C_ExchangeNormal");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeNormal, Loaded) == 0x000000, "Member 'BP_UIWS_Manager_Impl_C_ExchangeNormal::Loaded' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeNormal, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_UIWS_Manager_Impl_C_ExchangeNormal::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExchangeNormal, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_UIWS_Manager_Impl_C_ExchangeNormal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UIWS_Manager_Impl.BP_UIWS_Manager_Impl_C.ExecuteUbergraph_BP_UIWS_Manager_Impl
// 0x0470 (0x0470 - 0x0000)
struct BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_10;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_11;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_12;         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_13;         // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_14;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_15;         // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_16;         // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_17;         // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_18;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_19;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2; // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_1;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_20;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_21;         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_3; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_22;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_23;         // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_24;         // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_25;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_26;         // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_27;         // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_28;         // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_29;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_30;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_31;         // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_2; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_2;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewValue_2;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_3; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_3;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_6;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_9;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_4; // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_10;           // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_32;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_33;         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_34;         // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_35;         // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_36;         // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_37;         // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_38;         // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_39;         // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_40;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_41;         // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewValue_1;                           // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetPlayerPos_PlayerPos;                   // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_11;           // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_13;           // 0x01F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_14;           // 0x0208(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_2; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_15;           // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_16;           // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_3; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewValue;                             // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_4;      // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_5;      // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_2;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_17;           // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0260(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0270(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B[0x1];                                      // 0x036B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl) == 0x000008, "Wrong alignment on BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl");
static_assert(sizeof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl) == 0x000470, "Wrong size on BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, EntryPoint) == 0x000000, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000018, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000028, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00002C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x00002D, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00002E, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00002F, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000030, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000031, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000032, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x000033, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x000034, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000035, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000036, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1) == 0x000038, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_10) == 0x000048, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_11) == 0x000049, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_12) == 0x00004A, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_13) == 0x00004B, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_14) == 0x00004C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_15) == 0x00004D, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_16) == 0x00004E, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_17) == 0x00004F, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_18) == 0x000050, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_19) == 0x000051, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000054, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2) == 0x000058, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue_1) == 0x000068, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_20) == 0x000069, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_21) == 0x00006A, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_3) == 0x000070, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BooleanOR_ReturnValue) == 0x000080, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_22) == 0x000081, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_23) == 0x000082, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_24) == 0x000083, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_25) == 0x000084, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_26) == 0x000085, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_27) == 0x000086, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_28) == 0x000087, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_29) == 0x000088, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_30) == 0x000089, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_31) == 0x00008A, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetConsoleVariableIntValue_ReturnValue_2) == 0x00008C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetConsoleVariableIntValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue_2) == 0x000090, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_Event_DeltaSeconds) == 0x000094, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x0000D8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_Event_NewValue_2) == 0x0000DC, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_Event_NewValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_SwitchInteger_CmpSuccess) == 0x0000DD, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_IsValid_ReturnValue) == 0x0000DE, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_IsValid_ReturnValue_1) == 0x0000DF, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BooleanOR_ReturnValue_1) == 0x0000E0, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetConsoleVariableIntValue_ReturnValue_3) == 0x0000E4, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetConsoleVariableIntValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BooleanAND_ReturnValue) == 0x0000E8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue_3) == 0x0000E9, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000EC, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000FC, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_7) == 0x00010C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_8) == 0x00011C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_IsValid_ReturnValue_2) == 0x00012C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_9) == 0x000130, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BooleanAND_ReturnValue_1) == 0x000140, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_4) == 0x000148, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_10) == 0x000158, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_32) == 0x000168, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_33) == 0x000169, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_34) == 0x00016A, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_35) == 0x00016B, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_36) == 0x00016C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_37) == 0x00016D, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_38) == 0x00016E, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_39) == 0x00016F, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_40) == 0x000170, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_40' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_StrStr_ReturnValue_41) == 0x000171, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_StrStr_ReturnValue_41' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_Event_NewValue_1) == 0x000172, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_Event_NewValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000173, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_MakeArray_Array) == 0x000178, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetPlayerPos_PlayerPos) == 0x000188, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetPlayerPos_PlayerPos' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A0, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001B8, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001D0, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001E0, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1) == 0x0001F0, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001F4, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_SwitchInteger_CmpSuccess_1) == 0x000204, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_14) == 0x000208, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_2) == 0x000218, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_15) == 0x00021C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_SwitchInteger_CmpSuccess_2) == 0x00022C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_16) == 0x000230, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_3) == 0x000240, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_Event_NewValue) == 0x000244, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue_4) == 0x000245, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x000246, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_32ByteByte_ReturnValue_5) == 0x000247, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_32ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BooleanOR_ReturnValue_2) == 0x000248, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_EqualEqual_BoolBool_ReturnValue_2) == 0x000249, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_EqualEqual_BoolBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, K2Node_CreateDelegate_OutputDelegate_17) == 0x00024C, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, Temp_object_Variable) == 0x000260, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000270, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000368, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BreakHitResult_bBlockingHit) == 0x000369, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl, CallFunc_BreakHitResult_bInitialOverlap) == 0x00036A, "Member 'BP_UIWS_Manager_Impl_C_ExecuteUbergraph_BP_UIWS_Manager_Impl::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
