#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIPFManager_FX

#include "Basic.hpp"

#include "UIPF_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UIPFManager_FX.BP_UIPFManager_FX_C
// 0x0038 (0x0630 - 0x05F8)
class ABP_UIPFManager_FX_C final : public AUIPFManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Character_Max_Speed;                               // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinSpeed;                                          // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TrailPos;                                          // 0x0610(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstTime;                                         // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0629(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UIPFManager_FX(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateInteractorLocation(int32 InteractorID, const struct FVector& HitLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIPFManager_FX_C">();
	}
	static class ABP_UIPFManager_FX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UIPFManager_FX_C>();
	}
};
static_assert(alignof(ABP_UIPFManager_FX_C) == 0x000008, "Wrong alignment on ABP_UIPFManager_FX_C");
static_assert(sizeof(ABP_UIPFManager_FX_C) == 0x000630, "Wrong size on ABP_UIPFManager_FX_C");
static_assert(offsetof(ABP_UIPFManager_FX_C, UberGraphFrame) == 0x0005F8, "Member 'ABP_UIPFManager_FX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UIPFManager_FX_C, Character_Max_Speed) == 0x000600, "Member 'ABP_UIPFManager_FX_C::Character_Max_Speed' has a wrong offset!");
static_assert(offsetof(ABP_UIPFManager_FX_C, MinSpeed) == 0x000608, "Member 'ABP_UIPFManager_FX_C::MinSpeed' has a wrong offset!");
static_assert(offsetof(ABP_UIPFManager_FX_C, TrailPos) == 0x000610, "Member 'ABP_UIPFManager_FX_C::TrailPos' has a wrong offset!");
static_assert(offsetof(ABP_UIPFManager_FX_C, FirstTime) == 0x000628, "Member 'ABP_UIPFManager_FX_C::FirstTime' has a wrong offset!");
static_assert(offsetof(ABP_UIPFManager_FX_C, NewVar_0) == 0x000629, "Member 'ABP_UIPFManager_FX_C::NewVar_0' has a wrong offset!");

}

