#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIWS_Manager_Impl

#include "Basic.hpp"

#include "BP_UIWS_Manager_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UIWS_Manager_Impl.BP_UIWS_Manager_Impl_C
// 0x00B8 (0x0528 - 0x0470)
class ABP_UIWS_Manager_Impl_C final : public ABP_UIWS_Manager_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_UIWS_Manager_Impl_C;             // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          RGHeightMap;                                       // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          High_Quality_RT;                                   // 0x0479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 TempHeight;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 HeightRT_HQ;                                       // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 HeightRT;                                          // 0x04B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 NormalRT_HQ;                                       // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 NormalRT;                                          // 0x0500(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExchangeHeight1(class UObject* Loaded);
	void ExchangeNormal(class UObject* Loaded);
	void ExecuteUbergraph_BP_UIWS_Manager_Impl(int32 EntryPoint);
	void GetPlayerPos(struct FVector* PlayerPos);
	void GetPlayerPos_LastFrame(struct FVector* PlayerPos);
	void InitMat();
	void InitRT();
	void LoadCopyMat(class UObject* Loaded);
	void LoadHeight1(class UObject* Loaded);
	void LoadLowQualityNormalRTForHighQuality(class UObject* Loaded);
	void LoadNormal(class UObject* Loaded);
	void LoadNormalMat(class UObject* Loaded);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetInteractivity(bool NewValue);
	void Use_High_Quality_Render_Target(bool NewValue);
	void Use2ChannelHeightMap(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIWS_Manager_Impl_C">();
	}
	static class ABP_UIWS_Manager_Impl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UIWS_Manager_Impl_C>();
	}
};
static_assert(alignof(ABP_UIWS_Manager_Impl_C) == 0x000008, "Wrong alignment on ABP_UIWS_Manager_Impl_C");
static_assert(sizeof(ABP_UIWS_Manager_Impl_C) == 0x000528, "Wrong size on ABP_UIWS_Manager_Impl_C");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, UberGraphFrame_BP_UIWS_Manager_Impl_C) == 0x000470, "Member 'ABP_UIWS_Manager_Impl_C::UberGraphFrame_BP_UIWS_Manager_Impl_C' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, RGHeightMap) == 0x000478, "Member 'ABP_UIWS_Manager_Impl_C::RGHeightMap' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, High_Quality_RT) == 0x000479, "Member 'ABP_UIWS_Manager_Impl_C::High_Quality_RT' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, TempHeight) == 0x000480, "Member 'ABP_UIWS_Manager_Impl_C::TempHeight' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, HeightRT_HQ) == 0x000488, "Member 'ABP_UIWS_Manager_Impl_C::HeightRT_HQ' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, HeightRT) == 0x0004B0, "Member 'ABP_UIWS_Manager_Impl_C::HeightRT' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, NormalRT_HQ) == 0x0004D8, "Member 'ABP_UIWS_Manager_Impl_C::NormalRT_HQ' has a wrong offset!");
static_assert(offsetof(ABP_UIWS_Manager_Impl_C, NormalRT) == 0x000500, "Member 'ABP_UIWS_Manager_Impl_C::NormalRT' has a wrong offset!");

}

