#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIPFInteractor_Foliage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UIPFInteractor_Foliage.BP_UIPFInteractor_Foliage_C.ExecuteUbergraph_BP_UIPFInteractor_Foliage
// 0x0008 (0x0008 - 0x0000)
struct BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage) == 0x000004, "Wrong alignment on BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage");
static_assert(sizeof(BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage) == 0x000008, "Wrong size on BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage, EntryPoint) == 0x000000, "Member 'BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_UIPFInteractor_Foliage_C_ExecuteUbergraph_BP_UIPFInteractor_Foliage::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_UIPFInteractor_Foliage.BP_UIPFInteractor_Foliage_C.GetCustomLocation
// 0x0078 (0x0078 - 0x0000)
struct BP_UIPFInteractor_Foliage_C_GetCustomLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFInteractor_Foliage_C_GetCustomLocation) == 0x000008, "Wrong alignment on BP_UIPFInteractor_Foliage_C_GetCustomLocation");
static_assert(sizeof(BP_UIPFInteractor_Foliage_C_GetCustomLocation) == 0x000078, "Wrong size on BP_UIPFInteractor_Foliage_C_GetCustomLocation");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, ReturnValue) == 0x000000, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000018, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomLocation, CallFunc_SelectVector_ReturnValue) == 0x000060, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomLocation::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

// Function BP_UIPFInteractor_Foliage.BP_UIPFInteractor_Foliage_C.GetCustomVelocity
// 0x0200 (0x0200 - 0x0000)
struct BP_UIPFInteractor_Foliage_C_GetCustomVelocity final
{
public:
	struct FVector4                               ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DrawValue;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraParameterCollectionInstance*    CallFunc_GetNiagaraParameterCollection_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeUnclamped_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x01D0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast;       // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity) == 0x000010, "Wrong alignment on BP_UIPFInteractor_Foliage_C_GetCustomVelocity");
static_assert(sizeof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity) == 0x000200, "Wrong size on BP_UIPFInteractor_Foliage_C_GetCustomVelocity");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, ReturnValue) == 0x000000, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, DrawValue) == 0x000020, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::DrawValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_GetNiagaraParameterCollection_ReturnValue) == 0x000038, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_GetNiagaraParameterCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_GetVelocity_ReturnValue) == 0x000058, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Normal_ReturnValue) == 0x000070, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_VSize_ReturnValue) == 0x000088, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_BreakVector_X) == 0x000090, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_BreakVector_Y) == 0x000098, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_BreakVector_Z) == 0x0000A0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000A8, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0000C0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_RInterpTo_ReturnValue) == 0x0000D8, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_NegateVector_ReturnValue) == 0x0000F0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000120, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Add_VectorVector_ReturnValue) == 0x000138, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_SelectFloat_ReturnValue) == 0x000160, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_VInterpTo_ReturnValue) == 0x000168, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000180, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_ClampVectorSize_ReturnValue) == 0x000198, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_VSize_ReturnValue_1) == 0x0001B0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_MapRangeUnclamped_ReturnValue) == 0x0001C0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_SelectFloat_ReturnValue_1) == 0x0001C8, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_MakeVector4_ReturnValue) == 0x0001D0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0001F0, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x0001F4, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x0001F8, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_GetCustomVelocity, CallFunc_VInterpTo_InterpSpeed_ImplicitCast) == 0x0001FC, "Member 'BP_UIPFInteractor_Foliage_C_GetCustomVelocity::CallFunc_VInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");

// Function BP_UIPFInteractor_Foliage.BP_UIPFInteractor_Foliage_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_UIPFInteractor_Foliage_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFInteractor_Foliage_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_UIPFInteractor_Foliage_C_ReceiveEndPlay");
static_assert(sizeof(BP_UIPFInteractor_Foliage_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_UIPFInteractor_Foliage_C_ReceiveEndPlay");
static_assert(offsetof(BP_UIPFInteractor_Foliage_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_UIPFInteractor_Foliage_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

