#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIPFManager_Foliage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UIPFManager_Foliage.BP_UIPFManager_Foliage_C.ExecuteUbergraph_BP_UIPFManager_Foliage
// 0x0048 (0x0048 - 0x0000)
struct BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_7;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_8;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_9;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage) == 0x000008, "Wrong alignment on BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage");
static_assert(sizeof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage) == 0x000048, "Wrong size on BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, EntryPoint) == 0x000000, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000008, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000018, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00001C, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x00001D, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00001E, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x00001F, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000020, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000021, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000022, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x000023, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_7) == 0x000024, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_8) == 0x000025, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, CallFunc_EqualEqual_StrStr_ReturnValue_9) == 0x000026, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::CallFunc_EqualEqual_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'BP_UIPFManager_Foliage_C_ExecuteUbergraph_BP_UIPFManager_Foliage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function BP_UIPFManager_Foliage.BP_UIPFManager_Foliage_C.OnCur_RT_Loaded
// 0x0018 (0x0018 - 0x0000)
struct BP_UIPFManager_Foliage_C_OnCur_RT_Loaded final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFManager_Foliage_C_OnCur_RT_Loaded) == 0x000008, "Wrong alignment on BP_UIPFManager_Foliage_C_OnCur_RT_Loaded");
static_assert(sizeof(BP_UIPFManager_Foliage_C_OnCur_RT_Loaded) == 0x000018, "Wrong size on BP_UIPFManager_Foliage_C_OnCur_RT_Loaded");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnCur_RT_Loaded, Loaded) == 0x000000, "Member 'BP_UIPFManager_Foliage_C_OnCur_RT_Loaded::Loaded' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnCur_RT_Loaded, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_UIPFManager_Foliage_C_OnCur_RT_Loaded::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnCur_RT_Loaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_UIPFManager_Foliage_C_OnCur_RT_Loaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UIPFManager_Foliage.BP_UIPFManager_Foliage_C.OnPre_RT_Loaded
// 0x0018 (0x0018 - 0x0000)
struct BP_UIPFManager_Foliage_C_OnPre_RT_Loaded final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_AsTexture_Render_Target_2D;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIPFManager_Foliage_C_OnPre_RT_Loaded) == 0x000008, "Wrong alignment on BP_UIPFManager_Foliage_C_OnPre_RT_Loaded");
static_assert(sizeof(BP_UIPFManager_Foliage_C_OnPre_RT_Loaded) == 0x000018, "Wrong size on BP_UIPFManager_Foliage_C_OnPre_RT_Loaded");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnPre_RT_Loaded, Loaded) == 0x000000, "Member 'BP_UIPFManager_Foliage_C_OnPre_RT_Loaded::Loaded' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnPre_RT_Loaded, K2Node_DynamicCast_AsTexture_Render_Target_2D) == 0x000008, "Member 'BP_UIPFManager_Foliage_C_OnPre_RT_Loaded::K2Node_DynamicCast_AsTexture_Render_Target_2D' has a wrong offset!");
static_assert(offsetof(BP_UIPFManager_Foliage_C_OnPre_RT_Loaded, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_UIPFManager_Foliage_C_OnPre_RT_Loaded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

