#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WhaleGameplayContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WhaleGameplayContainer.BP_WhaleGameplayContainer_C.ExecuteUbergraph_BP_WhaleGameplayContainer
// 0x0018 (0x0018 - 0x0000)
struct BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CustomRayMarchingCloud_C*           CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer) == 0x000008, "Wrong alignment on BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer");
static_assert(sizeof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer) == 0x000018, "Wrong size on BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer");
static_assert(offsetof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer, EntryPoint) == 0x000000, "Member 'BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_WhaleGameplayContainer_C_ExecuteUbergraph_BP_WhaleGameplayContainer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_WhaleGameplayContainer.BP_WhaleGameplayContainer_C.Start
// 0x0018 (0x0018 - 0x0000)
struct BP_WhaleGameplayContainer_C_Start final
{
public:
	class UBP_NPCAttractorDynamicGameplayData_Template_C* InDataAsset;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InNPCActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WhaleGameplayContainer_C_Start) == 0x000008, "Wrong alignment on BP_WhaleGameplayContainer_C_Start");
static_assert(sizeof(BP_WhaleGameplayContainer_C_Start) == 0x000018, "Wrong size on BP_WhaleGameplayContainer_C_Start");
static_assert(offsetof(BP_WhaleGameplayContainer_C_Start, InDataAsset) == 0x000000, "Member 'BP_WhaleGameplayContainer_C_Start::InDataAsset' has a wrong offset!");
static_assert(offsetof(BP_WhaleGameplayContainer_C_Start, InNPCActor) == 0x000008, "Member 'BP_WhaleGameplayContainer_C_Start::InNPCActor' has a wrong offset!");
static_assert(offsetof(BP_WhaleGameplayContainer_C_Start, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WhaleGameplayContainer_C_Start::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WhaleGameplayContainer.BP_WhaleGameplayContainer_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_WhaleGameplayContainer_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_WhaleGameplayContainer_C_GetModuleName) == 0x000008, "Wrong alignment on BP_WhaleGameplayContainer_C_GetModuleName");
static_assert(sizeof(BP_WhaleGameplayContainer_C_GetModuleName) == 0x000010, "Wrong size on BP_WhaleGameplayContainer_C_GetModuleName");
static_assert(offsetof(BP_WhaleGameplayContainer_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_WhaleGameplayContainer_C_GetModuleName::ReturnValue' has a wrong offset!");

}

