#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterInteractionConfig_Template

#include "Basic.hpp"

#include "F_WaterIneract_Bone2CapsuleCenter_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterInteractionConfig_Template.BP_WaterInteractionConfig_Template_C
// 0x01A0 (0x01D0 - 0x0030)
class UBP_WaterInteractionConfig_Template_C final : public UPrimaryDataAsset
{
public:
	double                                        WaterDepthEnteringWalkGait;                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<double, class UBP_BuffConfig_C*>         SlowDownBuffConfigInWater;                         // 0x0038(0x0050)(Edit, BlueprintVisible)
	double                                        FallDownVelocityZ;                                 // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinWaterDepth;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowDivingPart;                                   // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ShowDivingPartDepth;                               // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SFX_FallDownShallowWater;                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SFX_FallDownWater;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DeepWaterDepth;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnterWaterJudgeOffset;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<double, TSoftObjectPtr<class UNiagaraSystem>> FallInToShallowWaterNSByVelocityZ;            // 0x00C8(0x0050)(Edit, BlueprintVisible)
	TMap<double, TSoftObjectPtr<class UNiagaraSystem>> FallInToDeepWaterNSByVelocityZ;               // 0x0118(0x0050)(Edit, BlueprintVisible)
	double                                        DeadCapsuleRadio;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DeepScaleCurve;                                    // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          WaterFlowFX;                                       // 0x0178(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UCurveFloat*                            WaterFlowSpawnRateCurve;                           // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_WaterIneract_Bone2CapsuleCenter     DaMiaoBone2CapsuleCenter;                          // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_WaterIneract_Bone2CapsuleCenter     NikkiBone2CapsuleCenter;                           // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterInteractionConfig_Template_C">();
	}
	static class UBP_WaterInteractionConfig_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WaterInteractionConfig_Template_C>();
	}
};
static_assert(alignof(UBP_WaterInteractionConfig_Template_C) == 0x000008, "Wrong alignment on UBP_WaterInteractionConfig_Template_C");
static_assert(sizeof(UBP_WaterInteractionConfig_Template_C) == 0x0001D0, "Wrong size on UBP_WaterInteractionConfig_Template_C");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, WaterDepthEnteringWalkGait) == 0x000030, "Member 'UBP_WaterInteractionConfig_Template_C::WaterDepthEnteringWalkGait' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, SlowDownBuffConfigInWater) == 0x000038, "Member 'UBP_WaterInteractionConfig_Template_C::SlowDownBuffConfigInWater' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, FallDownVelocityZ) == 0x000088, "Member 'UBP_WaterInteractionConfig_Template_C::FallDownVelocityZ' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, MinWaterDepth) == 0x000090, "Member 'UBP_WaterInteractionConfig_Template_C::MinWaterDepth' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, bShowDivingPart) == 0x000098, "Member 'UBP_WaterInteractionConfig_Template_C::bShowDivingPart' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, ShowDivingPartDepth) == 0x0000A0, "Member 'UBP_WaterInteractionConfig_Template_C::ShowDivingPartDepth' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, SFX_FallDownShallowWater) == 0x0000A8, "Member 'UBP_WaterInteractionConfig_Template_C::SFX_FallDownShallowWater' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, SFX_FallDownWater) == 0x0000B0, "Member 'UBP_WaterInteractionConfig_Template_C::SFX_FallDownWater' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, DeepWaterDepth) == 0x0000B8, "Member 'UBP_WaterInteractionConfig_Template_C::DeepWaterDepth' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, EnterWaterJudgeOffset) == 0x0000C0, "Member 'UBP_WaterInteractionConfig_Template_C::EnterWaterJudgeOffset' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, FallInToShallowWaterNSByVelocityZ) == 0x0000C8, "Member 'UBP_WaterInteractionConfig_Template_C::FallInToShallowWaterNSByVelocityZ' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, FallInToDeepWaterNSByVelocityZ) == 0x000118, "Member 'UBP_WaterInteractionConfig_Template_C::FallInToDeepWaterNSByVelocityZ' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, DeadCapsuleRadio) == 0x000168, "Member 'UBP_WaterInteractionConfig_Template_C::DeadCapsuleRadio' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, DeepScaleCurve) == 0x000170, "Member 'UBP_WaterInteractionConfig_Template_C::DeepScaleCurve' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, WaterFlowFX) == 0x000178, "Member 'UBP_WaterInteractionConfig_Template_C::WaterFlowFX' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, WaterFlowSpawnRateCurve) == 0x0001A0, "Member 'UBP_WaterInteractionConfig_Template_C::WaterFlowSpawnRateCurve' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, DaMiaoBone2CapsuleCenter) == 0x0001A8, "Member 'UBP_WaterInteractionConfig_Template_C::DaMiaoBone2CapsuleCenter' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, NikkiBone2CapsuleCenter) == 0x0001B8, "Member 'UBP_WaterInteractionConfig_Template_C::NikkiBone2CapsuleCenter' has a wrong offset!");
static_assert(offsetof(UBP_WaterInteractionConfig_Template_C, BoneName) == 0x0001C8, "Member 'UBP_WaterInteractionConfig_Template_C::BoneName' has a wrong offset!");

}

