#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherSensitiveActorManager

#include "Basic.hpp"

#include "Enum_WeatherType_structs.hpp"
#include "Engine_structs.hpp"
#include "F_WeatherSensitiveActors_structs.hpp"
#include "ActorLayerUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.BP_GetCurrentWeather
// 0x0004 (0x0004 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather final
{
public:
	Enum_WeatherType                              Weather;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather) == 0x000004, "Wrong alignment on BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather) == 0x000004, "Wrong size on BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather, Weather) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_BP_GetCurrentWeather::Weather' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.BP_GetDisplayedWeather
// 0x0004 (0x0004 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather final
{
public:
	Enum_WeatherType                              Weather;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather) == 0x000004, "Wrong alignment on BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather) == 0x000004, "Wrong size on BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather, Weather) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_BP_GetDisplayedWeather::Weather' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.BP_IsManagedActor
// 0x0030 (0x0030 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_BP_IsManagedActor final
{
public:
	TSoftObjectPtr<class AActor>                  ActorSoftRef;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          bIsManaged;                                        // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActor) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorManager_C_BP_IsManagedActor");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActor) == 0x000030, "Wrong size on BP_WeatherSensitiveActorManager_C_BP_IsManagedActor");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActor, ActorSoftRef) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_BP_IsManagedActor::ActorSoftRef' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActor, bIsManaged) == 0x000028, "Member 'BP_WeatherSensitiveActorManager_C_BP_IsManagedActor::bIsManaged' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.BP_IsManagedActorTemp
// 0x0010 (0x0010 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsManagedActor;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp) == 0x000010, "Wrong size on BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp, Actor) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp::Actor' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp, bIsManagedActor) == 0x000008, "Member 'BP_WeatherSensitiveActorManager_C_BP_IsManagedActorTemp::bIsManagedActor' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.EditorOnly_GenerateBounds
// 0x0410 (0x0410 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds final
{
public:
	TSet<class AActor*>                           ActorsInAllWeather;                                // 0x0000(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorLayer                            K2Node_MakeStruct_ActorLayer;                      // 0x008C(0x0008)(NoDestructor)
	struct FActorLayer                            K2Node_MakeStruct_ActorLayer_1;                    // 0x0094(0x0008)(NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActors_ReturnValue;                    // 0x00A0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetActors_ReturnValue_1;                  // 0x00B0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x01E8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         CallFunc_Set_ToArray_Result;                       // 0x02E0(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetActorArrayBounds_Center;               // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorArrayBounds_BoxExtent;            // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingLegacyMode_bLegacyMode;            // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_2;                         // 0x0340(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_WeatherType>                      CallFunc_Map_Keys_Keys;                            // 0x0390(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_WeatherType                              CallFunc_Array_Get_Item_3;                         // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_WeatherSensitiveActors              CallFunc_Map_Find_Value;                           // 0x03B0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item_4;                         // 0x03C8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds) == 0x000410, "Wrong size on BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, ActorsInAllWeather) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::ActorsInAllWeather' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Loop_Counter_Variable_1) == 0x000060, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Array_Index_Variable_2) == 0x000070, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Loop_Counter_Variable_3) == 0x000074, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_IntInt_ReturnValue_3) == 0x000078, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Loop_Counter_Variable_4) == 0x00007C, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_IntInt_ReturnValue_4) == 0x000080, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Array_Index_Variable_3) == 0x000084, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, Temp_int_Array_Index_Variable_4) == 0x000088, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_MakeStruct_ActorLayer) == 0x00008C, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_MakeStruct_ActorLayer' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_MakeStruct_ActorLayer_1) == 0x000094, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_MakeStruct_ActorLayer_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_GetActors_ReturnValue) == 0x0000A0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_GetActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_GetActors_ReturnValue_1) == 0x0000B0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_GetActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D9, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_VSize_ReturnValue) == 0x0000E0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0001E8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Set_ToArray_Result) == 0x0002E0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_GetActorArrayBounds_Center) == 0x0002F0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_GetActorArrayBounds_Center' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_GetActorArrayBounds_BoxExtent) == 0x000308, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_GetActorArrayBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Add_VectorVector_ReturnValue) == 0x000320, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_IsUsingLegacyMode_bLegacyMode) == 0x000338, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_IsUsingLegacyMode_bLegacyMode' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Get_Item_2) == 0x000340, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Length_ReturnValue_2) == 0x000368, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000370, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Less_IntInt_ReturnValue_2) == 0x000378, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_DynamicCast_AsActor) == 0x000380, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_DynamicCast_bSuccess) == 0x000388, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Map_Keys_Keys) == 0x000390, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Length_ReturnValue_3) == 0x0003A0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Get_Item_3) == 0x0003A4, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Less_IntInt_ReturnValue_3) == 0x0003A8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Map_Find_Value) == 0x0003B0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Map_Find_ReturnValue) == 0x0003C0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Length_ReturnValue_4) == 0x0003C4, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Array_Get_Item_4) == 0x0003C8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Less_IntInt_ReturnValue_4) == 0x0003F0, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0003F8, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_DynamicCast_AsActor_1) == 0x000400, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, K2Node_DynamicCast_bSuccess_1) == 0x000408, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x00040C, "Member 'BP_WeatherSensitiveActorManager_C_EditorOnly_GenerateBounds::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.ExecuteUbergraph_BP_WeatherSensitiveActorManager
// 0x0008 (0x0008 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager) == 0x000004, "Wrong alignment on BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager) == 0x000008, "Wrong size on BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager, EntryPoint) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_WeatherSensitiveActorManager_C_ExecuteUbergraph_BP_WeatherSensitiveActorManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.IsUsingLegacyMode
// 0x0010 (0x0010 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode final
{
public:
	bool                                          bLegacyMode;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode) == 0x000004, "Wrong alignment on BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode) == 0x000010, "Wrong size on BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, bLegacyMode) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::bLegacyMode' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, CallFunc_Map_Length_ReturnValue) == 0x000004, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00000D, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'BP_WeatherSensitiveActorManager_C_IsUsingLegacyMode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_WeatherSensitiveActorManager_C_ReceiveTick");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_WeatherSensitiveActorManager_C_ReceiveTick");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_WeatherSensitiveActorManager.BP_WeatherSensitiveActorManager_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_WeatherSensitiveActorManager_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorManager_C_GetModuleName) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorManager_C_GetModuleName");
static_assert(sizeof(BP_WeatherSensitiveActorManager_C_GetModuleName) == 0x000010, "Wrong size on BP_WeatherSensitiveActorManager_C_GetModuleName");
static_assert(offsetof(BP_WeatherSensitiveActorManager_C_GetModuleName, ReturnValue) == 0x000000, "Member 'BP_WeatherSensitiveActorManager_C_GetModuleName::ReturnValue' has a wrong offset!");

}

