#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoolenHeart_SimulatedLSeq

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"
#include "F_SimulatedWoolenHeartPerformanceInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WoolenHeart_SimulatedLSeq.BP_WoolenHeart_SimulatedLSeq_C
// 0x01C8 (0x0600 - 0x0438)
class ABP_WoolenHeart_SimulatedLSeq_C final : public AX6Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             BP_SimulatedNikki;                                 // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_bSimulatedPerformanceFinish;                    // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         BP_FlyingNS;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BP_FinishNS;                                       // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_WoolenHeartSimulatedLSeqConfig_C*   BP_PerformanceDA;                                  // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            BP_FlyToPlayerSpeedCurve;                          // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int64                                         BP_WoolenHeartEntiyID;                             // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_SimulatedWoolenHeartPerformanceInfo BP_PerformanceInfo;                                // 0x0480(0x0160)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ASkeletalMeshActor*                     MeshActor;                                         // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABP_WoolenHeart_SimulatedLSeq_C* SimulatedLSeqActor, class ACharacter* SimulatedNikki)> PostLSEndPlay; // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_CheckDestroySelf();
	void BP_Init(class AActor* SimulatedNikki, const struct FF_SimulatedWoolenHeartPerformanceInfo& PerformanceInfo, bool* bLSPlayed);
	void BP_IsPlayingGetWoolenHeartPerformance(int64 WoolenHeartEntiyID, bool* bPlaying);
	void BP_PerformanceBeginPlay();
	void BP_PerformanceEndPlay();
	void BP_PlayFeatureSequence(class ULevelSequence* LSAsset, bool* bSuccess);
	void BP_PlayWoolenHeartFlyPerformance(const struct FF_SimulatedWoolenHeartPerformanceInfo& PerformanceInfo);
	void BP_SetPlayingGetWoolenHeartPerformance(int64 WoolenHeartEntiyID, bool bPlaying);
	void ExecuteUbergraph_BP_WoolenHeart_SimulatedLSeq(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WoolenHeart_SimulatedLSeq_C">();
	}
	static class ABP_WoolenHeart_SimulatedLSeq_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WoolenHeart_SimulatedLSeq_C>();
	}
};
static_assert(alignof(ABP_WoolenHeart_SimulatedLSeq_C) == 0x000010, "Wrong alignment on ABP_WoolenHeart_SimulatedLSeq_C");
static_assert(sizeof(ABP_WoolenHeart_SimulatedLSeq_C) == 0x000600, "Wrong size on ABP_WoolenHeart_SimulatedLSeq_C");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, UberGraphFrame) == 0x000438, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, DefaultSceneRoot) == 0x000440, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_SimulatedNikki) == 0x000448, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_SimulatedNikki' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_bSimulatedPerformanceFinish) == 0x000450, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_bSimulatedPerformanceFinish' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_FlyingNS) == 0x000458, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_FlyingNS' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_FinishNS) == 0x000460, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_FinishNS' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_PerformanceDA) == 0x000468, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_PerformanceDA' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_FlyToPlayerSpeedCurve) == 0x000470, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_FlyToPlayerSpeedCurve' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_WoolenHeartEntiyID) == 0x000478, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_WoolenHeartEntiyID' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, BP_PerformanceInfo) == 0x000480, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::BP_PerformanceInfo' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, MeshActor) == 0x0005E0, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::MeshActor' has a wrong offset!");
static_assert(offsetof(ABP_WoolenHeart_SimulatedLSeq_C, PostLSEndPlay) == 0x0005E8, "Member 'ABP_WoolenHeart_SimulatedLSeq_C::PostLSEndPlay' has a wrong offset!");

}

