#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponState

#include "Basic.hpp"

#include "F_PlayerStateToPoseType_structs.hpp"
#include "F_PlayerActionToShowAnimFlag_structs.hpp"
#include "EPlayerActionTypes_structs.hpp"
#include "Enum_WeaponPoseType_structs.hpp"
#include "F_PlayerStateToShowAnimFlag_structs.hpp"
#include "Enum_WeaponStateInterruptHandler_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponState.BP_WeaponState_C
// 0x00A0 (0x00D0 - 0x0030)
class UBP_WeaponState_C final : public UPrimaryDataAsset
{
public:
	TArray<struct FF_PlayerStateToPoseType>       PlayerState2PoseTypeList;                          // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<Enum_WeaponPoseType>                   PoseTypeListForPriority;                           // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FF_PlayerStateToShowAnimFlag>   PlayerState2ShowAnimFlagList;                      // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FF_PlayerActionToShowAnimFlag>  HideWeaponActionList;                              // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBP_WeaponOverlayConfigs_Skeleton_C*> OverlayConfigSets;                            // 0x0070(0x0010)(Edit, BlueprintVisible)
	TMap<EPlayerActionTypes, Enum_WeaponStateInterruptHandler> StopWeaponStateHandlers;              // 0x0080(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponState_C">();
	}
	static class UBP_WeaponState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeaponState_C>();
	}
};
static_assert(alignof(UBP_WeaponState_C) == 0x000008, "Wrong alignment on UBP_WeaponState_C");
static_assert(sizeof(UBP_WeaponState_C) == 0x0000D0, "Wrong size on UBP_WeaponState_C");
static_assert(offsetof(UBP_WeaponState_C, PlayerState2PoseTypeList) == 0x000030, "Member 'UBP_WeaponState_C::PlayerState2PoseTypeList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponState_C, PoseTypeListForPriority) == 0x000040, "Member 'UBP_WeaponState_C::PoseTypeListForPriority' has a wrong offset!");
static_assert(offsetof(UBP_WeaponState_C, PlayerState2ShowAnimFlagList) == 0x000050, "Member 'UBP_WeaponState_C::PlayerState2ShowAnimFlagList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponState_C, HideWeaponActionList) == 0x000060, "Member 'UBP_WeaponState_C::HideWeaponActionList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponState_C, OverlayConfigSets) == 0x000070, "Member 'UBP_WeaponState_C::OverlayConfigSets' has a wrong offset!");
static_assert(offsetof(UBP_WeaponState_C, StopWeaponStateHandlers) == 0x000080, "Member 'UBP_WeaponState_C::StopWeaponStateHandlers' has a wrong offset!");

}

