#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherSensitiveActorListenerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_WeatherType_structs.hpp"


namespace SDK::Params
{

// Function BP_WeatherSensitiveActorListenerComponent.BP_WeatherSensitiveActorListenerComponent_C.ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent
// 0x0188 (0x0188 - 0x0000)
struct BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActorNameOrLabel_ReturnValue;          // 0x0010(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WeatherSensitiveActorManager_C*     K2Node_DynamicCast_AsBP_Weather_Sensitive_Actor_Manager; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_WeatherType                              CallFunc_BP_GetDisplayedWeather_Weather;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsManagedActor_bIsManaged;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	Enum_WeatherType                              CallFunc_BP_GetDisplayedWeather_Weather_1;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActorNameOrLabel_ReturnValue_1;        // 0x00D0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E0(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0010)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent");
static_assert(sizeof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent) == 0x000188, "Wrong size on BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, EntryPoint) == 0x000000, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_GetActorNameOrLabel_ReturnValue) == 0x000010, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_GetActorNameOrLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000080, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, Temp_int_Array_Index_Variable) == 0x000084, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000088, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000090, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000A0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, K2Node_DynamicCast_AsBP_Weather_Sensitive_Actor_Manager) == 0x0000B0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::K2Node_DynamicCast_AsBP_Weather_Sensitive_Actor_Manager' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_BP_GetDisplayedWeather_Weather) == 0x0000C0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_BP_GetDisplayedWeather_Weather' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_BP_IsManagedActor_bIsManaged) == 0x0000C4, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_BP_IsManagedActor_bIsManaged' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_BP_GetDisplayedWeather_Weather_1) == 0x0000C8, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_BP_GetDisplayedWeather_Weather_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_GetActorNameOrLabel_ReturnValue_1) == 0x0000D0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_GetActorNameOrLabel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, Temp_int_Loop_Counter_Variable) == 0x0000F0, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, K2Node_MakeArray_Array) == 0x000140, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Format_ReturnValue) == 0x000158, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_BooleanAND_ReturnValue) == 0x000168, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'BP_WeatherSensitiveActorListenerComponent_C_ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_WeatherSensitiveActorListenerComponent.BP_WeatherSensitiveActorListenerComponent_C.GetListendActor
// 0x0028 (0x0028 - 0x0000)
struct BP_WeatherSensitiveActorListenerComponent_C_GetListendActor final
{
public:
	TSoftObjectPtr<class AActor>                  ListendActor_0;                                    // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherSensitiveActorListenerComponent_C_GetListendActor) == 0x000008, "Wrong alignment on BP_WeatherSensitiveActorListenerComponent_C_GetListendActor");
static_assert(sizeof(BP_WeatherSensitiveActorListenerComponent_C_GetListendActor) == 0x000028, "Wrong size on BP_WeatherSensitiveActorListenerComponent_C_GetListendActor");
static_assert(offsetof(BP_WeatherSensitiveActorListenerComponent_C_GetListendActor, ListendActor_0) == 0x000000, "Member 'BP_WeatherSensitiveActorListenerComponent_C_GetListendActor::ListendActor_0' has a wrong offset!");

}

