#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoolenHeartSimulatedLSeqConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WoolenHeartSimulatedLSeqConfig.BP_WoolenHeartSimulatedLSeqConfig_C
// 0x0018 (0x0048 - 0x0030)
class UBP_WoolenHeartSimulatedLSeqConfig_C final : public UPrimaryDataAsset
{
public:
	double                                        FlyDuration;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutonomousInteractDistance;                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedHoldHands;                                    // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WoolenHeartSimulatedLSeqConfig_C">();
	}
	static class UBP_WoolenHeartSimulatedLSeqConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WoolenHeartSimulatedLSeqConfig_C>();
	}
};
static_assert(alignof(UBP_WoolenHeartSimulatedLSeqConfig_C) == 0x000008, "Wrong alignment on UBP_WoolenHeartSimulatedLSeqConfig_C");
static_assert(sizeof(UBP_WoolenHeartSimulatedLSeqConfig_C) == 0x000048, "Wrong size on UBP_WoolenHeartSimulatedLSeqConfig_C");
static_assert(offsetof(UBP_WoolenHeartSimulatedLSeqConfig_C, FlyDuration) == 0x000030, "Member 'UBP_WoolenHeartSimulatedLSeqConfig_C::FlyDuration' has a wrong offset!");
static_assert(offsetof(UBP_WoolenHeartSimulatedLSeqConfig_C, AutonomousInteractDistance) == 0x000038, "Member 'UBP_WoolenHeartSimulatedLSeqConfig_C::AutonomousInteractDistance' has a wrong offset!");
static_assert(offsetof(UBP_WoolenHeartSimulatedLSeqConfig_C, bNeedHoldHands) == 0x000040, "Member 'UBP_WoolenHeartSimulatedLSeqConfig_C::bNeedHoldHands' has a wrong offset!");

}

