#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherSensitiveActorListenerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_WeatherType_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeatherSensitiveActorListenerComponent.BP_WeatherSensitiveActorListenerComponent_C
// 0x0040 (0x00E8 - 0x00A8)
class UBP_WeatherSensitiveActorListenerComponent_C final : public UBP_X6ActorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(class ABP_WeatherSensitiveActorManager_C* manager, Enum_WeatherType WeatherType)> OnWeatherSensitiveActorChanged; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class AActor>                  ListendActor;                                      // 0x00C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeatherSensitiveActorListenerComponent(int32 EntryPoint);
	void GetListendActor(TSoftObjectPtr<class AActor>* ListendActor_0);
	void ManualTryTriggerEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeatherSensitiveActorListenerComponent_C">();
	}
	static class UBP_WeatherSensitiveActorListenerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeatherSensitiveActorListenerComponent_C>();
	}
};
static_assert(alignof(UBP_WeatherSensitiveActorListenerComponent_C) == 0x000008, "Wrong alignment on UBP_WeatherSensitiveActorListenerComponent_C");
static_assert(sizeof(UBP_WeatherSensitiveActorListenerComponent_C) == 0x0000E8, "Wrong size on UBP_WeatherSensitiveActorListenerComponent_C");
static_assert(offsetof(UBP_WeatherSensitiveActorListenerComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_WeatherSensitiveActorListenerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_WeatherSensitiveActorListenerComponent_C, OnWeatherSensitiveActorChanged) == 0x0000B0, "Member 'UBP_WeatherSensitiveActorListenerComponent_C::OnWeatherSensitiveActorChanged' has a wrong offset!");
static_assert(offsetof(UBP_WeatherSensitiveActorListenerComponent_C, ListendActor) == 0x0000C0, "Member 'UBP_WeatherSensitiveActorListenerComponent_C::ListendActor' has a wrong offset!");

}

