#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WhaleGameplayContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPCAttractorDynamicGameplayContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WhaleGameplayContainer.BP_WhaleGameplayContainer_C
// 0x0050 (0x04C0 - 0x0470)
class ABP_WhaleGameplayContainer_C final : public ABP_NPCAttractorDynamicGameplayContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_WhaleGameplayContainer_C;        // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 mesh;                                              // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SummonClound_ScaleParam_699003F64CF61C6327420D86DC1BD9BA; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SummonClound__Direction_699003F64CF61C6327420D86DC1BD9BA; // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SummonClound;                                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SummonAnim;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_CustomRayMarchingCloud_C*           Clound;                                            // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CloudLayerName;                                    // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_InitCloud();
	void ExecuteUbergraph_BP_WhaleGameplayContainer(int32 EntryPoint);
	void PlayCloudPerform();
	void ReceiveBeginPlay();
	void Start(class UBP_NPCAttractorDynamicGameplayData_Template_C* InDataAsset, class AActor* InNPCActor);
	void Stop();
	void SummonClound__FinishedFunc();
	void SummonClound__UpdateFunc();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WhaleGameplayContainer_C">();
	}
	static class ABP_WhaleGameplayContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WhaleGameplayContainer_C>();
	}
};
static_assert(alignof(ABP_WhaleGameplayContainer_C) == 0x000008, "Wrong alignment on ABP_WhaleGameplayContainer_C");
static_assert(sizeof(ABP_WhaleGameplayContainer_C) == 0x0004C0, "Wrong size on ABP_WhaleGameplayContainer_C");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, UberGraphFrame_BP_WhaleGameplayContainer_C) == 0x000470, "Member 'ABP_WhaleGameplayContainer_C::UberGraphFrame_BP_WhaleGameplayContainer_C' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, Arrow) == 0x000478, "Member 'ABP_WhaleGameplayContainer_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, mesh) == 0x000480, "Member 'ABP_WhaleGameplayContainer_C::mesh' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, SummonClound_ScaleParam_699003F64CF61C6327420D86DC1BD9BA) == 0x000488, "Member 'ABP_WhaleGameplayContainer_C::SummonClound_ScaleParam_699003F64CF61C6327420D86DC1BD9BA' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, SummonClound__Direction_699003F64CF61C6327420D86DC1BD9BA) == 0x00048C, "Member 'ABP_WhaleGameplayContainer_C::SummonClound__Direction_699003F64CF61C6327420D86DC1BD9BA' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, SummonClound) == 0x000490, "Member 'ABP_WhaleGameplayContainer_C::SummonClound' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, SummonAnim) == 0x000498, "Member 'ABP_WhaleGameplayContainer_C::SummonAnim' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, Clound) == 0x0004A0, "Member 'ABP_WhaleGameplayContainer_C::Clound' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, Mid) == 0x0004A8, "Member 'ABP_WhaleGameplayContainer_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_WhaleGameplayContainer_C, CloudLayerName) == 0x0004B0, "Member 'ABP_WhaleGameplayContainer_C::CloudLayerName' has a wrong offset!");

}

