#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_X6_UIPFInteractor_Foliage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_X6_UIPFInteractor_Foliage.BP_X6_UIPFInteractor_Foliage_C.GetUIPFManagerToRegister
// 0x0018 (0x0018 - 0x0000)
struct BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister final
{
public:
	class AUIPFManager*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UX6GameInstance*                        CallFunc_GetX6GameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUIPFManager*                           CallFunc_GetUIPFManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister) == 0x000008, "Wrong alignment on BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister");
static_assert(sizeof(BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister) == 0x000018, "Wrong size on BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister");
static_assert(offsetof(BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister, ReturnValue) == 0x000000, "Member 'BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister, CallFunc_GetX6GameInstance_ReturnValue) == 0x000008, "Member 'BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister::CallFunc_GetX6GameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister, CallFunc_GetUIPFManager_ReturnValue) == 0x000010, "Member 'BP_X6_UIPFInteractor_Foliage_C_GetUIPFManagerToRegister::CallFunc_GetUIPFManager_ReturnValue' has a wrong offset!");

}

