#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_X6SkillPreviewActor_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_X6SkillPreviewActor_V2.BP_X6SkillPreviewActor_V2_C
// 0x0050 (0x03F8 - 0x03A8)
class ABP_X6SkillPreviewActor_V2_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TriggerOwner;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        YawOffset;                                         // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RibbonEffect;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_X6SkillPreviewActor_V2(int32 EntryPoint);
	void GetOverriddenInfo(class UBP_BulletDataAsset_C* BulletData, class FName OverrideSocket, const struct FTransform& OverrideTransform, class FString* Socket, struct FVector* OffsetLocation, struct FRotator* OffsetRotation);
	void GetSocketTransform(const class FString& ScoketName, struct FTransform* SocketTransform);
	void GetTransformByOffset(const class FString& Socket, const struct FVector& OffsetLoc, const struct FRotator& OffsetRot, struct FVector* OutLoc, struct FRotator* OutRot);
	void Init(class UBP_BulletDataAsset_C* BulletData, class AActor* Owner_0, class FName Socket, const struct FTransform& OffsetTransform);
	void InitSimple(double Speed);
	void PreviewRibbon(TSoftObjectPtr<class UNiagaraSystem> NiagaraSystem, TSoftObjectPtr<class UMaterialInterface> RibbonMat, TArray<struct FVector>& LocationArray, TArray<struct FVector>& VelocityArray, bool bIsCircle, int32 CountPerLine, TArray<int32>& HitBalls, TArray<double>& Intensities);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_X6SkillPreviewActor_V2_C">();
	}
	static class ABP_X6SkillPreviewActor_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_X6SkillPreviewActor_V2_C>();
	}
};
static_assert(alignof(ABP_X6SkillPreviewActor_V2_C) == 0x000008, "Wrong alignment on ABP_X6SkillPreviewActor_V2_C");
static_assert(sizeof(ABP_X6SkillPreviewActor_V2_C) == 0x0003F8, "Wrong size on ABP_X6SkillPreviewActor_V2_C");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_X6SkillPreviewActor_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, Box) == 0x0003B0, "Member 'ABP_X6SkillPreviewActor_V2_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, Sphere) == 0x0003B8, "Member 'ABP_X6SkillPreviewActor_V2_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, StaticMesh) == 0x0003C0, "Member 'ABP_X6SkillPreviewActor_V2_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, Niagara) == 0x0003C8, "Member 'ABP_X6SkillPreviewActor_V2_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, Scene) == 0x0003D0, "Member 'ABP_X6SkillPreviewActor_V2_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, ProjectileMovement) == 0x0003D8, "Member 'ABP_X6SkillPreviewActor_V2_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, TriggerOwner) == 0x0003E0, "Member 'ABP_X6SkillPreviewActor_V2_C::TriggerOwner' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, YawOffset) == 0x0003E8, "Member 'ABP_X6SkillPreviewActor_V2_C::YawOffset' has a wrong offset!");
static_assert(offsetof(ABP_X6SkillPreviewActor_V2_C, RibbonEffect) == 0x0003F0, "Member 'ABP_X6SkillPreviewActor_V2_C::RibbonEffect' has a wrong offset!");

}

