#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_X6AsyncTask_RequestSpawnBullet_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "X6Task_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_X6AsyncTask_RequestSpawnBullet_V2.BP_X6AsyncTask_RequestSpawnBullet_V2_C
// 0x0118 (0x0160 - 0x0048)
class UBP_X6AsyncTask_RequestSpawnBullet_V2_C final : public UX6TaskAsyncBase
{
public:
	TMulticastInlineDelegate<void(class AActor* ReturnActor)> OnSpawnFinished;                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	class AActor*                                 BP_OwnerActor;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_BulletDataAsset_C*                  BP_BulletData;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USceneComponent*                        BP_TargetComponent;                                // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 BP_TargetActor;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OffsetTransform;                                   // 0x0080(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTransform                             StartTransform;                                    // 0x00E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLastBullet;                                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSpawnFailed;                                     // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnTaskStart(class FName* EventName);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_X6AsyncTask_RequestSpawnBullet_V2_C">();
	}
	static class UBP_X6AsyncTask_RequestSpawnBullet_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_X6AsyncTask_RequestSpawnBullet_V2_C>();
	}
};
static_assert(alignof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C) == 0x000010, "Wrong alignment on UBP_X6AsyncTask_RequestSpawnBullet_V2_C");
static_assert(sizeof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C) == 0x000160, "Wrong size on UBP_X6AsyncTask_RequestSpawnBullet_V2_C");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, OnSpawnFinished) == 0x000048, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::OnSpawnFinished' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, BP_OwnerActor) == 0x000058, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::BP_OwnerActor' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, BP_BulletData) == 0x000060, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::BP_BulletData' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, BP_TargetComponent) == 0x000068, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::BP_TargetComponent' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, BP_TargetActor) == 0x000070, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::BP_TargetActor' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, OffsetTransform) == 0x000080, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::OffsetTransform' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, StartTransform) == 0x0000E0, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::StartTransform' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, IsLastBullet) == 0x000140, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::IsLastBullet' has a wrong offset!");
static_assert(offsetof(UBP_X6AsyncTask_RequestSpawnBullet_V2_C, OnSpawnFailed) == 0x000148, "Member 'UBP_X6AsyncTask_RequestSpawnBullet_V2_C::OnSpawnFailed' has a wrong offset!");

}

