#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_MatchCloth

#include "Basic.hpp"

#include "NikkiFitCloth_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPFL_MatchCloth.BPFL_MatchCloth_C.ClearPairCacheExcept
// 0x0038 (0x0038 - 0x0000)
struct BPFL_MatchCloth_C_ClearPairCacheExcept final
{
public:
	class UMatchClothObject_C*                    InMatchClothesObject;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InParent;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    NewLocalVar;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SuitDisplayComponent_C*             K2Node_DynamicCast_AsBP_Suit_Display_Component;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_MatchCloth_C_ClearPairCacheExcept) == 0x000008, "Wrong alignment on BPFL_MatchCloth_C_ClearPairCacheExcept");
static_assert(sizeof(BPFL_MatchCloth_C_ClearPairCacheExcept) == 0x000038, "Wrong size on BPFL_MatchCloth_C_ClearPairCacheExcept");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, InMatchClothesObject) == 0x000000, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::InMatchClothesObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, InParent) == 0x000008, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::InParent' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, __WorldContext) == 0x000010, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, NewLocalVar) == 0x000018, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, K2Node_DynamicCast_AsBP_Suit_Display_Component) == 0x000028, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::K2Node_DynamicCast_AsBP_Suit_Display_Component' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_ClearPairCacheExcept, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BPFL_MatchCloth_C_ClearPairCacheExcept::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_MatchCloth.BPFL_MatchCloth_C.FindOrCreateMatchClothObject
// 0x0038 (0x0038 - 0x0000)
struct BPFL_MatchCloth_C_FindOrCreateMatchClothObject final
{
public:
	class UMatchClothObject_C*                    InMatchClothObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InParent;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    ResultMatchClothObject;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNew;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchClothObject_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject) == 0x000008, "Wrong alignment on BPFL_MatchCloth_C_FindOrCreateMatchClothObject");
static_assert(sizeof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject) == 0x000038, "Wrong size on BPFL_MatchCloth_C_FindOrCreateMatchClothObject");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, InMatchClothObject) == 0x000000, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::InMatchClothObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, InParent) == 0x000008, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::InParent' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, __WorldContext) == 0x000010, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, ResultMatchClothObject) == 0x000018, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::ResultMatchClothObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, IsNew) == 0x000020, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::IsNew' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_FindOrCreateMatchClothObject, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BPFL_MatchCloth_C_FindOrCreateMatchClothObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_MatchCloth.BPFL_MatchCloth_C.MatchClothSetupToRun
// 0x00F0 (0x00F0 - 0x0000)
struct BPFL_MatchCloth_C_MatchClothSetupToRun final
{
public:
	class UMatchClothObject_C*                    InMatchClothObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InParent;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class USkeletalMeshComponent*> SuitPartsMap;                                 // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          isNewObject;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchClothObject_C*                    ResultMatchClothObject;                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  SkelMeshArray;                                     // 0x0078(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchClothObject_C*                    CallFunc_FindOrCreateMatchClothObject_ResultMatchClothObject; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindOrCreateMatchClothObject_isNew;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Map_Find_Value;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_MatchCloth_C_MatchClothSetupToRun) == 0x000008, "Wrong alignment on BPFL_MatchCloth_C_MatchClothSetupToRun");
static_assert(sizeof(BPFL_MatchCloth_C_MatchClothSetupToRun) == 0x0000F0, "Wrong size on BPFL_MatchCloth_C_MatchClothSetupToRun");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, InMatchClothObject) == 0x000000, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::InMatchClothObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, InParent) == 0x000008, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::InParent' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, SuitPartsMap) == 0x000010, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::SuitPartsMap' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, __WorldContext) == 0x000060, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, isNewObject) == 0x000068, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::isNewObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, ResultMatchClothObject) == 0x000070, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::ResultMatchClothObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, SkelMeshArray) == 0x000078, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::SkelMeshArray' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_FindOrCreateMatchClothObject_ResultMatchClothObject) == 0x000090, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_FindOrCreateMatchClothObject_ResultMatchClothObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_FindOrCreateMatchClothObject_isNew) == 0x000098, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_FindOrCreateMatchClothObject_isNew' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Map_Keys_Keys) == 0x0000A8, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Map_Find_Value) == 0x0000D0, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Map_Find_ReturnValue) == 0x0000D8, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Less_IntInt_ReturnValue) == 0x0000D9, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x0000E0, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MatchClothSetupToRun, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'BPFL_MatchCloth_C_MatchClothSetupToRun::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BPFL_MatchCloth.BPFL_MatchCloth_C.MultiThread_ClothMatch
// 0x0060 (0x0060 - 0x0000)
struct BPFL_MatchCloth_C_MultiThread_ClothMatch final
{
public:
	class UObject*                                Parent;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  InputSkelMeshArray;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    ResultObject;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_SuitDisplayComponent_C*             K2Node_DynamicCast_AsBP_Suit_Display_Component;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_AsyncNewObject_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchClothObject_C*                    K2Node_DynamicCast_AsMatch_Cloth_Object;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_MatchCloth_C_MultiThread_ClothMatch) == 0x000008, "Wrong alignment on BPFL_MatchCloth_C_MultiThread_ClothMatch");
static_assert(sizeof(BPFL_MatchCloth_C_MultiThread_ClothMatch) == 0x000060, "Wrong size on BPFL_MatchCloth_C_MultiThread_ClothMatch");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, Parent) == 0x000000, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::Parent' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, InputSkelMeshArray) == 0x000008, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::InputSkelMeshArray' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, __WorldContext) == 0x000018, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, ResultObject) == 0x000020, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::ResultObject' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, K2Node_DynamicCast_AsBP_Suit_Display_Component) == 0x000038, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::K2Node_DynamicCast_AsBP_Suit_Display_Component' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, CallFunc_AsyncNewObject_ReturnValue) == 0x000048, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::CallFunc_AsyncNewObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, K2Node_DynamicCast_AsMatch_Cloth_Object) == 0x000050, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::K2Node_DynamicCast_AsMatch_Cloth_Object' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_MultiThread_ClothMatch, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BPFL_MatchCloth_C_MultiThread_ClothMatch::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPFL_MatchCloth.BPFL_MatchCloth_C.SingleMatchClothes
// 0x0680 (0x0680 - 0x0000)
struct BPFL_MatchCloth_C_SingleMatchClothes final
{
public:
	class USkeletalMeshComponent*                 InnerSkelMeshComp;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OuterSkelMeshComp;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FMatchClothParameter                   InMatchClothesParam;                               // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsAdditive;                                        // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     OuterFitSetting;                                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     InnerFitSetting;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMatchClothParameter                   Local_MatchClothParam;                             // 0x0058(0x0028)(Edit, BlueprintVisible)
	TArray<struct FTransform>                     BoneSpaceTransform;                                // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           BoneNames;                                         // 0x0090(0x0010)(Edit, BlueprintVisible)
	class FName                                   Temp_name_Variable;                                // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Temp_int_Variable;                                 // 0x00B8(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_Select_Default;                             // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClothsMatchSetting_C*                  K2Node_DynamicCast_AsCloths_Match_Setting;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLODMatchClothParameter                CallFunc_Array_Get_Item;                           // 0x0118(0x00F0)()
	class UFitClothCacheAsset*                    K2Node_DynamicCast_AsFit_Cloth_Cache_Asset;        // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue_1;    // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     K2Node_DynamicCast_AsFit_Match_Setting;            // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue_2;    // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClothsMatchSetting_C*                  K2Node_DynamicCast_AsCloths_Match_Setting_1;       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFitClothCacheAsset*                    K2Node_DynamicCast_AsFit_Cloth_Cache_Asset_1;      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue_3;    // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     K2Node_DynamicCast_AsFit_Match_Setting_1;          // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0xF];                                      // 0x02A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Temp_int_Variable_2;                               // 0x0320(0x0010)(ReferenceParm)
	TArray<struct FSectionValuePair>              Temp_struct_Variable;                              // 0x0330(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBoneName_ReturnValue;                  // 0x0344(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSectionValuePair>              K2Node_Select_Default_1;                           // 0x0350(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0xF];                                      // 0x0361(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRefPoseTransform_ReturnValue;          // 0x0370(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x03D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_Select_Default_2;                           // 0x0430(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_TransformTransform_ReturnValue; // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0xF];                                      // 0x0441(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0450(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Temp_int_Variable_3;                               // 0x04B0(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_Select_Default_3;                           // 0x04C0(0x0010)(ReferenceParm)
	struct FMatchClothOuterSectionParameter       K2Node_MakeStruct_MatchClothOuterSectionParameter; // 0x04D0(0x0040)()
	struct FLODMatchClothParameter                K2Node_SetFieldsInStruct_StructOut;                // 0x0510(0x00F0)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumBones_ReturnValue;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_2;       // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue_4;    // 0x0620(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_3;       // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAssetUserData*                         CallFunc_GetAssetUserDataOfClass_ReturnValue_5;    // 0x0638(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_4;       // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_5;       // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_6;       // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_7;       // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_8;       // 0x0668(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0672(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_MatchCloth_C_SingleMatchClothes) == 0x000010, "Wrong alignment on BPFL_MatchCloth_C_SingleMatchClothes");
static_assert(sizeof(BPFL_MatchCloth_C_SingleMatchClothes) == 0x000680, "Wrong size on BPFL_MatchCloth_C_SingleMatchClothes");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, InnerSkelMeshComp) == 0x000000, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::InnerSkelMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, OuterSkelMeshComp) == 0x000008, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::OuterSkelMeshComp' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, InMatchClothesParam) == 0x000010, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::InMatchClothesParam' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, IsAdditive) == 0x000038, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::IsAdditive' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, __WorldContext) == 0x000040, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, OuterFitSetting) == 0x000048, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::OuterFitSetting' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, InnerFitSetting) == 0x000050, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::InnerFitSetting' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Local_MatchClothParam) == 0x000058, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Local_MatchClothParam' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, BoneSpaceTransform) == 0x000080, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::BoneSpaceTransform' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, BoneNames) == 0x000090, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::BoneNames' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_name_Variable) == 0x0000A0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_name_Variable_1) == 0x0000A8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_bool_Variable) == 0x0000B0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Array_Index_Variable) == 0x0000B4, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Variable) == 0x0000B8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_bool_Variable_1) == 0x0000C8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000D0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000D1, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0000D2, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x0000D3, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_Select_Default) == 0x0000D8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x0000F0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue) == 0x0000F8, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsCloths_Match_Setting) == 0x000100, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsCloths_Match_Setting' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000110, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_Get_Item) == 0x000118, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsFit_Cloth_Cache_Asset) == 0x000208, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsFit_Cloth_Cache_Asset' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_Length_ReturnValue) == 0x000214, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue_1) == 0x000218, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Less_IntInt_ReturnValue) == 0x000220, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsFit_Match_Setting) == 0x000228, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsFit_Match_Setting' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000238, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_1) == 0x000240, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue_2) == 0x000248, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_AddUnique_ReturnValue) == 0x000250, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsCloths_Match_Setting_1) == 0x000258, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsCloths_Match_Setting_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess_3) == 0x000260, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000268, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsFit_Cloth_Cache_Asset_1) == 0x000270, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsFit_Cloth_Cache_Asset_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess_4) == 0x000278, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000280, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue_3) == 0x000288, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_AsFit_Match_Setting_1) == 0x000290, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_AsFit_Match_Setting_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_DynamicCast_bSuccess_5) == 0x000298, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_Find_ReturnValue) == 0x00029C, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x0002A0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_MakeTransform_ReturnValue) == 0x0002B0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_IsEmpty_ReturnValue) == 0x000310, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Variable_1) == 0x000314, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000318, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Variable_2) == 0x000320, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_struct_Variable) == 0x000330, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_bool_Variable_2) == 0x000340, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetBoneName_ReturnValue) == 0x000344, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetBoneName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_Select_Default_1) == 0x000350, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_bool_Variable_3) == 0x000360, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetRefPoseTransform_ReturnValue) == 0x000370, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetRefPoseTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x0003D0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_Select_Default_2) == 0x000430, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_EqualEqual_TransformTransform_ReturnValue) == 0x000440, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_EqualEqual_TransformTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_ComposeTransforms_ReturnValue) == 0x000450, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, Temp_int_Variable_3) == 0x0004B0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_Select_Default_3) == 0x0004C0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_MakeStruct_MatchClothOuterSectionParameter) == 0x0004D0, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_MakeStruct_MatchClothOuterSectionParameter' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, K2Node_SetFieldsInStruct_StructOut) == 0x000510, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_Add_ReturnValue) == 0x000600, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Array_Add_ReturnValue_1) == 0x000604, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetNumBones_ReturnValue) == 0x000608, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetNumBones_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_Subtract_IntInt_ReturnValue) == 0x00060C, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_2) == 0x000610, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000618, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue_4) == 0x000620, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_IsValid_ReturnValue) == 0x000628, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_3) == 0x000630, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetAssetUserDataOfClass_ReturnValue_5) == 0x000638, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetAssetUserDataOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_IsValid_ReturnValue_1) == 0x000640, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_BooleanAND_ReturnValue) == 0x000641, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_4) == 0x000648, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_5) == 0x000650, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_6) == 0x000658, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_7) == 0x000660, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_GetSkeletalMeshAsset_ReturnValue_8) == 0x000668, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_GetSkeletalMeshAsset_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_IsValid_ReturnValue_2) == 0x000670, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_IsValid_ReturnValue_3) == 0x000671, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFL_MatchCloth_C_SingleMatchClothes, CallFunc_BooleanAND_ReturnValue_1) == 0x000672, "Member 'BPFL_MatchCloth_C_SingleMatchClothes::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

