#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Locomotion_RegularFlyState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_Locomotion_RegularFlyState.BPI_Locomotion_RegularFlyState_C.BPI_Get_RegularFlyingConfigData
// 0x0018 (0x0018 - 0x0000)
struct BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData final
{
public:
	double                                        LowFlyingSpeed;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalFlyingSpeed;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TopFlyingSpeed;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData) == 0x000008, "Wrong alignment on BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData");
static_assert(sizeof(BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData) == 0x000018, "Wrong size on BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData");
static_assert(offsetof(BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData, LowFlyingSpeed) == 0x000000, "Member 'BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData::LowFlyingSpeed' has a wrong offset!");
static_assert(offsetof(BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData, NormalFlyingSpeed) == 0x000008, "Member 'BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData::NormalFlyingSpeed' has a wrong offset!");
static_assert(offsetof(BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData, TopFlyingSpeed) == 0x000010, "Member 'BPI_Locomotion_RegularFlyState_C_BPI_Get_RegularFlyingConfigData::TopFlyingSpeed' has a wrong offset!");

}

