#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Multi_InteractiveObj

#include "Basic.hpp"

#include "E_EInteractSuccRet_structs.hpp"


namespace SDK::Params
{

// Function BPI_Multi_InteractiveObj.BPI_Multi_InteractiveObj_C.On_Multi_ActiveSuccess
// 0x0010 (0x0010 - 0x0000)
struct BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess final
{
public:
	class AActor*                                 Other_player_actor;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_EInteractSuccRet                            Result;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess) == 0x000008, "Wrong alignment on BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess");
static_assert(sizeof(BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess) == 0x000010, "Wrong size on BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess");
static_assert(offsetof(BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess, Other_player_actor) == 0x000000, "Member 'BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess::Other_player_actor' has a wrong offset!");
static_assert(offsetof(BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess, Result) == 0x000008, "Member 'BPI_Multi_InteractiveObj_C_On_Multi_ActiveSuccess::Result' has a wrong offset!");

// Function BPI_Multi_InteractiveObj.BPI_Multi_InteractiveObj_C.On_Multi_InteractiveObjActive
// 0x0018 (0x0018 - 0x0000)
struct BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive) == 0x000008, "Wrong alignment on BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive");
static_assert(sizeof(BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive) == 0x000018, "Wrong size on BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive");
static_assert(offsetof(BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive, Data) == 0x000000, "Member 'BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive::Data' has a wrong offset!");
static_assert(offsetof(BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive, Player) == 0x000010, "Member 'BPI_Multi_InteractiveObj_C_On_Multi_InteractiveObjActive::Player' has a wrong offset!");

}

