#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_FluxRectBlend

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BS_FluxRectBlend.BS_FluxRectBlend
// 0x0010 (0x0010 - 0x0000)
struct FBS_FluxRectBlend final
{
public:
	float                                         AxisXNegative_19_BDCFAFC742FF8C7B9864BC9EE408F91A; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisYNegative_20_F80AE358483B38E9ED84C5928CEEEFFB; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisXPositive_21_7D50126945AD13EBC260458170B2A48C; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisYPositive_22_C2D290D44A12072842719580809AD022; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_FluxRectBlend) == 0x000004, "Wrong alignment on FBS_FluxRectBlend");
static_assert(sizeof(FBS_FluxRectBlend) == 0x000010, "Wrong size on FBS_FluxRectBlend");
static_assert(offsetof(FBS_FluxRectBlend, AxisXNegative_19_BDCFAFC742FF8C7B9864BC9EE408F91A) == 0x000000, "Member 'FBS_FluxRectBlend::AxisXNegative_19_BDCFAFC742FF8C7B9864BC9EE408F91A' has a wrong offset!");
static_assert(offsetof(FBS_FluxRectBlend, AxisYNegative_20_F80AE358483B38E9ED84C5928CEEEFFB) == 0x000004, "Member 'FBS_FluxRectBlend::AxisYNegative_20_F80AE358483B38E9ED84C5928CEEEFFB' has a wrong offset!");
static_assert(offsetof(FBS_FluxRectBlend, AxisXPositive_21_7D50126945AD13EBC260458170B2A48C) == 0x000008, "Member 'FBS_FluxRectBlend::AxisXPositive_21_7D50126945AD13EBC260458170B2A48C' has a wrong offset!");
static_assert(offsetof(FBS_FluxRectBlend, AxisYPositive_22_C2D290D44A12072842719580809AD022) == 0x00000C, "Member 'FBS_FluxRectBlend::AxisYPositive_22_C2D290D44A12072842719580809AD022' has a wrong offset!");

}

