#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_FluxBuoyancyPontoon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_FluxBuoyancyPontoon.BS_FluxBuoyancyPontoon
// 0x0068 (0x0068 - 0x0000)
struct FBS_FluxBuoyancyPontoon final
{
public:
	double                                        Radius_2_B9CA715C4E9171970BC76AA4844A7620;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset_5_1AB63E754521965989EFD491B0127D25;         // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Drag_12_CAA1CF2544B36C7CF6C2D6B0072C8C54;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_15_B99CACE040AE14C6E5416E96E163584C;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BuoyancyTraceStart_20_5BDBFB3648B8E449FC4BB2B92B580311; // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BuoyancyTraceEnd_21_3E3FE894498A75793859619DE0A45A2C; // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Frequency_24_3F5588E44D6BCF0B6B5FFE839F1AA7E1;     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_FluxBuoyancyPontoon) == 0x000008, "Wrong alignment on FBS_FluxBuoyancyPontoon");
static_assert(sizeof(FBS_FluxBuoyancyPontoon) == 0x000068, "Wrong size on FBS_FluxBuoyancyPontoon");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, Radius_2_B9CA715C4E9171970BC76AA4844A7620) == 0x000000, "Member 'FBS_FluxBuoyancyPontoon::Radius_2_B9CA715C4E9171970BC76AA4844A7620' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, Offset_5_1AB63E754521965989EFD491B0127D25) == 0x000008, "Member 'FBS_FluxBuoyancyPontoon::Offset_5_1AB63E754521965989EFD491B0127D25' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, Drag_12_CAA1CF2544B36C7CF6C2D6B0072C8C54) == 0x000020, "Member 'FBS_FluxBuoyancyPontoon::Drag_12_CAA1CF2544B36C7CF6C2D6B0072C8C54' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, Socket_15_B99CACE040AE14C6E5416E96E163584C) == 0x000028, "Member 'FBS_FluxBuoyancyPontoon::Socket_15_B99CACE040AE14C6E5416E96E163584C' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, BuoyancyTraceStart_20_5BDBFB3648B8E449FC4BB2B92B580311) == 0x000030, "Member 'FBS_FluxBuoyancyPontoon::BuoyancyTraceStart_20_5BDBFB3648B8E449FC4BB2B92B580311' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, BuoyancyTraceEnd_21_3E3FE894498A75793859619DE0A45A2C) == 0x000048, "Member 'FBS_FluxBuoyancyPontoon::BuoyancyTraceEnd_21_3E3FE894498A75793859619DE0A45A2C' has a wrong offset!");
static_assert(offsetof(FBS_FluxBuoyancyPontoon, Frequency_24_3F5588E44D6BCF0B6B5FFE839F1AA7E1) == 0x000060, "Member 'FBS_FluxBuoyancyPontoon::Frequency_24_3F5588E44D6BCF0B6B5FFE839F1AA7E1' has a wrong offset!");

}

