#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_QuadrupedAnimalReaction_UpdateFleeParams

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_QuadrupedAnimalReaction_UpdateFleeParams.BTS_QuadrupedAnimalReaction_UpdateFleeParams_C
// 0x0098 (0x0130 - 0x0098)
class UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C final : public UX6BTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 FleeTargetLocKey;                                  // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 StimuliSourceActorKey;                             // 0x00C8(0x0028)(Edit, BlueprintVisible)
	class UFSM_QuadrupedAnimalReaction_C*         FSM;                                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StimuliSourceActor;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ContinuousVeryCloseFleePointCountKey;              // 0x0100(0x0028)(Edit, BlueprintVisible)
	class APawn*                                  ControlledPawn;                                    // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void TaskBegin_3733FB3D497423EB48C054A1059843F8(class UX6TaskAsyncBase* Task);
	void Success_3733FB3D497423EB48C054A1059843F8(const struct FVector& Loc);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn_0, float DeltaSeconds);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn_0);
	void Fail_3733FB3D497423EB48C054A1059843F8();
	void ExecuteUbergraph_BTS_QuadrupedAnimalReaction_UpdateFleeParams(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_QuadrupedAnimalReaction_UpdateFleeParams_C">();
	}
	static class UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C>();
	}
};
static_assert(alignof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C) == 0x000008, "Wrong alignment on UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C");
static_assert(sizeof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C) == 0x000130, "Wrong size on UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, UberGraphFrame) == 0x000098, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, FleeTargetLocKey) == 0x0000A0, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::FleeTargetLocKey' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, StimuliSourceActorKey) == 0x0000C8, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::StimuliSourceActorKey' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, FSM) == 0x0000F0, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::FSM' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, StimuliSourceActor) == 0x0000F8, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::StimuliSourceActor' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, ContinuousVeryCloseFleePointCountKey) == 0x000100, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::ContinuousVeryCloseFleePointCountKey' has a wrong offset!");
static_assert(offsetof(UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C, ControlledPawn) == 0x000128, "Member 'UBTS_QuadrupedAnimalReaction_UpdateFleeParams_C::ControlledPawn' has a wrong offset!");

}

