#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_QuadrupedAnimalReaction_InitFleeParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_QuadrupedAnimalReaction_InitFleeParams.BTT_QuadrupedAnimalReaction_InitFleeParams_C.TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA
// 0x0008 (0x0008 - 0x0000)
struct BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA final
{
public:
	class UX6TaskAsyncBase*                       Task;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA) == 0x000008, "Wrong size on BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA, Task) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_InitFleeParams_C_TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA::Task' has a wrong offset!");

// Function BTT_QuadrupedAnimalReaction_InitFleeParams.BTT_QuadrupedAnimalReaction_InitFleeParams_C.Success_40570C8D4E1CD97EBDE2D591E971D6EA
// 0x0018 (0x0018 - 0x0000)
struct BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA) == 0x000018, "Wrong size on BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA, Loc) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_InitFleeParams_C_Success_40570C8D4E1CD97EBDE2D591E971D6EA::Loc' has a wrong offset!");

// Function BTT_QuadrupedAnimalReaction_InitFleeParams.BTT_QuadrupedAnimalReaction_InitFleeParams_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn_0;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI, ControlledPawn_0) == 0x000008, "Member 'BTT_QuadrupedAnimalReaction_InitFleeParams_C_ReceiveExecuteAI::ControlledPawn_0' has a wrong offset!");

// Function BTT_QuadrupedAnimalReaction_InitFleeParams.BTT_QuadrupedAnimalReaction_InitFleeParams_C.ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams
// 0x01C8 (0x01C8 - 0x0000)
struct BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6AsyncTask_QueryAreaEscapeLoc_C*      CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InovkeAsyncTaskStart_EventName;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         CallFunc_GetAnimalReactionFSM_FSM;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetStimuliSourceActor_StimuliSourceActor; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Loc)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFleeQueryParams_Center;                // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeRadius;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMin;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMax;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UX6TaskAsyncBase*                       K2Node_CustomEvent_Task;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFleeQueryParams_Center_1;              // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeRadius_1;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMin_1;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMax_1;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFleeQueryParams_Center_2;              // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeRadius_2;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMin_2;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeQueryParams_FleeStepDistMax_2;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Loc;                            // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetFleeSucceedDistance_FleeSucceedDistance; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue;      // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue_1;    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UX6TaskAsyncBase* Task)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSimpleFleePoint_FleePoint;             // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams) == 0x0001C8, "Wrong size on BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams, EntryPoint) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_InitFleeParams_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams::EntryPoint' has a wrong offset!");
