#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_QuadrupedAnimalReaction_InitFleeParams

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_QuadrupedAnimalReaction_InitFleeParams.BTT_QuadrupedAnimalReaction_InitFleeParams_C
// 0x0120 (0x01D0 - 0x00B0)
class UBTT_QuadrupedAnimalReaction_InitFleeParams_C final : public UX6BTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 FleeTargetLocationKey;                             // 0x00B8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 StimuliSourceActorKey;                             // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 LocomotionTypeKey;                                 // 0x0108(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FleeSucceedDistanceKey;                            // 0x0130(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ProjectToNavMeshResultKey;                         // 0x0158(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ContinuousVeryCloseFleePointCountKey;              // 0x0180(0x0028)(Edit, BlueprintVisible)
	class UFSM_QuadrupedAnimalReaction_C*         FSM;                                               // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StimuliSourceActor;                                // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MinQueryRadius;                                    // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SImpleFleeRadius;                                  // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TaskBegin_40570C8D4E1CD97EBDE2D591E971D6EA(class UX6TaskAsyncBase* Task);
	void Success_40570C8D4E1CD97EBDE2D591E971D6EA(const struct FVector& Loc);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn_0);
	void OnQueryFail();
	void Fail_40570C8D4E1CD97EBDE2D591E971D6EA();
	void ExecuteUbergraph_BTT_QuadrupedAnimalReaction_InitFleeParams(int32 EntryPoint);
	void AddClosePointCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_QuadrupedAnimalReaction_InitFleeParams_C">();
	}
	static class UBTT_QuadrupedAnimalReaction_InitFleeParams_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_QuadrupedAnimalReaction_InitFleeParams_C>();
	}
};
static_assert(alignof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C) == 0x000008, "Wrong alignment on UBTT_QuadrupedAnimalReaction_InitFleeParams_C");
static_assert(sizeof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C) == 0x0001D0, "Wrong size on UBTT_QuadrupedAnimalReaction_InitFleeParams_C");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, UberGraphFrame) == 0x0000B0, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, FleeTargetLocationKey) == 0x0000B8, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::FleeTargetLocationKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, StimuliSourceActorKey) == 0x0000E0, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::StimuliSourceActorKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, LocomotionTypeKey) == 0x000108, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::LocomotionTypeKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, FleeSucceedDistanceKey) == 0x000130, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::FleeSucceedDistanceKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, ProjectToNavMeshResultKey) == 0x000158, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::ProjectToNavMeshResultKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, ContinuousVeryCloseFleePointCountKey) == 0x000180, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::ContinuousVeryCloseFleePointCountKey' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, FSM) == 0x0001A8, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::FSM' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, StimuliSourceActor) == 0x0001B0, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::StimuliSourceActor' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, ControlledPawn) == 0x0001B8, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::ControlledPawn' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, MinQueryRadius) == 0x0001C0, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::MinQueryRadius' has a wrong offset!");
static_assert(offsetof(UBTT_QuadrupedAnimalReaction_InitFleeParams_C, SImpleFleeRadius) == 0x0001C8, "Member 'UBTT_QuadrupedAnimalReaction_InitFleeParams_C::SImpleFleeRadius' has a wrong offset!");

}

