#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_QuadrupedAnimalReaction_TryEnterState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_QuadrupedAnimalReaction_TryEnterState.BTT_QuadrupedAnimalReaction_TryEnterState_C.ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState
// 0x0028 (0x0028 - 0x0000)
struct BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         CallFunc_GetAnimalReactionFSM_FSM;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryEnterState_bSuccess;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState) == 0x000028, "Wrong size on BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, EntryPoint) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, CallFunc_GetAnimalReactionFSM_FSM) == 0x000018, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::CallFunc_GetAnimalReactionFSM_FSM' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState, CallFunc_TryEnterState_bSuccess) == 0x000021, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ExecuteUbergraph_BTT_QuadrupedAnimalReaction_TryEnterState::CallFunc_TryEnterState_bSuccess' has a wrong offset!");

// Function BTT_QuadrupedAnimalReaction_TryEnterState.BTT_QuadrupedAnimalReaction_TryEnterState_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_QuadrupedAnimalReaction_TryEnterState_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

