#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterColorPickerWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CharacterColorPickerWidget.CharacterPGColorPicker.GetColor
// 0x0010 (0x0010 - 0x0000)
struct CharacterPGColorPicker_GetColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterPGColorPicker_GetColor) == 0x000004, "Wrong alignment on CharacterPGColorPicker_GetColor");
static_assert(sizeof(CharacterPGColorPicker_GetColor) == 0x000010, "Wrong size on CharacterPGColorPicker_GetColor");
static_assert(offsetof(CharacterPGColorPicker_GetColor, ReturnValue) == 0x000000, "Member 'CharacterPGColorPicker_GetColor::ReturnValue' has a wrong offset!");

// Function CharacterColorPickerWidget.CharacterPGColorPicker.SetColor
// 0x0010 (0x0010 - 0x0000)
struct CharacterPGColorPicker_SetColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterPGColorPicker_SetColor) == 0x000004, "Wrong alignment on CharacterPGColorPicker_SetColor");
static_assert(sizeof(CharacterPGColorPicker_SetColor) == 0x000010, "Wrong size on CharacterPGColorPicker_SetColor");
static_assert(offsetof(CharacterPGColorPicker_SetColor, NewColor) == 0x000000, "Member 'CharacterPGColorPicker_SetColor::NewColor' has a wrong offset!");

}

