#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterGeneratorNetwork

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CharacterGeneratorNetwork.PicturePixel
// 0x0014 (0x0014 - 0x0000)
struct FPicturePixel final
{
public:
	int32                                         PositionX;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PositionY;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelR;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelG;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelB;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPicturePixel) == 0x000004, "Wrong alignment on FPicturePixel");
static_assert(sizeof(FPicturePixel) == 0x000014, "Wrong size on FPicturePixel");
static_assert(offsetof(FPicturePixel, PositionX) == 0x000000, "Member 'FPicturePixel::PositionX' has a wrong offset!");
static_assert(offsetof(FPicturePixel, PositionY) == 0x000004, "Member 'FPicturePixel::PositionY' has a wrong offset!");
static_assert(offsetof(FPicturePixel, ChannelR) == 0x000008, "Member 'FPicturePixel::ChannelR' has a wrong offset!");
static_assert(offsetof(FPicturePixel, ChannelG) == 0x00000C, "Member 'FPicturePixel::ChannelG' has a wrong offset!");
static_assert(offsetof(FPicturePixel, ChannelB) == 0x000010, "Member 'FPicturePixel::ChannelB' has a wrong offset!");

}

