#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterThumbnailImageWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class CharacterThumbnailImageWidget.CharacterThumbnailImage
// 0x0028 (0x01B0 - 0x0188)
class UCharacterThumbnailImage final : public UWidget
{
public:
	int32                                         Width;                                             // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Object;                                            // 0x0190(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ChangeAssetData(const struct FSoftObjectPath& NewObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterThumbnailImage">();
	}
	static class UCharacterThumbnailImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterThumbnailImage>();
	}
};
static_assert(alignof(UCharacterThumbnailImage) == 0x000008, "Wrong alignment on UCharacterThumbnailImage");
static_assert(sizeof(UCharacterThumbnailImage) == 0x0001B0, "Wrong size on UCharacterThumbnailImage");
static_assert(offsetof(UCharacterThumbnailImage, Width) == 0x000188, "Member 'UCharacterThumbnailImage::Width' has a wrong offset!");
static_assert(offsetof(UCharacterThumbnailImage, Height) == 0x00018C, "Member 'UCharacterThumbnailImage::Height' has a wrong offset!");
static_assert(offsetof(UCharacterThumbnailImage, Object) == 0x000190, "Member 'UCharacterThumbnailImage::Object' has a wrong offset!");

}

