#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterGenerator

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct CharacterGenerator.CharacterGenAnimNode
// 0x0178 (0x0188 - 0x0010)
struct FCharacterGenAnimNode final : public FAnimNode_Base
{
public:
	struct FPoseLink                              LocalPose;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bUsePreviousGenAssetMethod : 1;                    // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterGenAsset*                     CharacterGenAsset;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseSkeletonMorphCache : 1;                        // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x157];                                     // 0x0031(0x0157)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterGenAnimNode) == 0x000008, "Wrong alignment on FCharacterGenAnimNode");
static_assert(sizeof(FCharacterGenAnimNode) == 0x000188, "Wrong size on FCharacterGenAnimNode");
static_assert(offsetof(FCharacterGenAnimNode, LocalPose) == 0x000010, "Member 'FCharacterGenAnimNode::LocalPose' has a wrong offset!");
static_assert(offsetof(FCharacterGenAnimNode, CharacterGenAsset) == 0x000028, "Member 'FCharacterGenAnimNode::CharacterGenAsset' has a wrong offset!");

}

