#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckPointTasks

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CheckPointTasks.TaskBase
// 0x0028 (0x0050 - 0x0028)
class UTaskBase : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TaskBase">();
	}
	static class UTaskBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskBase>();
	}
};
static_assert(alignof(UTaskBase) == 0x000008, "Wrong alignment on UTaskBase");
static_assert(sizeof(UTaskBase) == 0x000050, "Wrong size on UTaskBase");

// Class CheckPointTasks.CollectProfile
// 0x0030 (0x0080 - 0x0050)
class UCollectProfile final : public UTaskBase
{
public:
	class FString                                 SavePath;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CollectProfile">();
	}
	static class UCollectProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectProfile>();
	}
};
static_assert(alignof(UCollectProfile) == 0x000008, "Wrong alignment on UCollectProfile");
static_assert(sizeof(UCollectProfile) == 0x000080, "Wrong size on UCollectProfile");
static_assert(offsetof(UCollectProfile, SavePath) == 0x000050, "Member 'UCollectProfile::SavePath' has a wrong offset!");

// Class CheckPointTasks.RefreshPSO
// 0x0030 (0x0080 - 0x0050)
class URefreshPSO final : public UTaskBase
{
public:
	class FString                                 SavePath;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RefreshPSO">();
	}
	static class URefreshPSO* GetDefaultObj()
	{
		return GetDefaultObjImpl<URefreshPSO>();
	}
};
static_assert(alignof(URefreshPSO) == 0x000008, "Wrong alignment on URefreshPSO");
static_assert(sizeof(URefreshPSO) == 0x000080, "Wrong size on URefreshPSO");
static_assert(offsetof(URefreshPSO, SavePath) == 0x000050, "Member 'URefreshPSO::SavePath' has a wrong offset!");

// Class CheckPointTasks.TaskManager
// 0x00A0 (0x00D0 - 0x0030)
class UTaskManager final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TaskManager">();
	}
	static class UTaskManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskManager>();
	}
};
static_assert(alignof(UTaskManager) == 0x000008, "Wrong alignment on UTaskManager");
static_assert(sizeof(UTaskManager) == 0x0000D0, "Wrong size on UTaskManager");

}

