#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothesAssetExtraData

#include "Basic.hpp"

#include "ESpecialType_structs.hpp"
#include "EClothesHidePartType_structs.hpp"
#include "EHatType_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ClothesAssetExtraData.ClothesAssetExtraData_C
// 0x0058 (0x0080 - 0x0028)
class UClothesAssetExtraData_C final : public UX6ClothesAssetExtraData
{
public:
	ESpecialType                                  SpecialType;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ShoeHeight;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EClothesHidePartType>                  HideParts;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHatType                                      HatType;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              HiddenInfoDT;                                      // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        ShoeToeHeight;                                     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckNikkiSkNameContainsConfig(TArray<class FString>& Configs, bool* IsHidden);
	void CheckNPCSkNameContainsConfig(TArray<class FString>& Configs, bool* IsHidden);
	void ConstructObjectHiddenCategory_EditorOnly(TArray<class FName>* HiddenCategories);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClothesAssetExtraData_C">();
	}
	static class UClothesAssetExtraData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothesAssetExtraData_C>();
	}
};
static_assert(alignof(UClothesAssetExtraData_C) == 0x000008, "Wrong alignment on UClothesAssetExtraData_C");
static_assert(sizeof(UClothesAssetExtraData_C) == 0x000080, "Wrong size on UClothesAssetExtraData_C");
static_assert(offsetof(UClothesAssetExtraData_C, SpecialType) == 0x000028, "Member 'UClothesAssetExtraData_C::SpecialType' has a wrong offset!");
static_assert(offsetof(UClothesAssetExtraData_C, ShoeHeight) == 0x000030, "Member 'UClothesAssetExtraData_C::ShoeHeight' has a wrong offset!");
static_assert(offsetof(UClothesAssetExtraData_C, HideParts) == 0x000038, "Member 'UClothesAssetExtraData_C::HideParts' has a wrong offset!");
static_assert(offsetof(UClothesAssetExtraData_C, HatType) == 0x000048, "Member 'UClothesAssetExtraData_C::HatType' has a wrong offset!");
static_assert(offsetof(UClothesAssetExtraData_C, HiddenInfoDT) == 0x000050, "Member 'UClothesAssetExtraData_C::HiddenInfoDT' has a wrong offset!");
static_assert(offsetof(UClothesAssetExtraData_C, ShoeToeHeight) == 0x000078, "Member 'UClothesAssetExtraData_C::ShoeToeHeight' has a wrong offset!");

}

