#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothesTypeData

#include "Basic.hpp"

#include "EClothesType_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ClothesTypeData.ClothesTypeData_C
// 0x0028 (0x0050 - 0x0028)
class UClothesTypeData_C final : public UX6ClothesTypeData
{
public:
	EClothesType                                  ClothesRadiusType;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ClothesFrontThickness_Follow;                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesBackThickness_Follow;                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesFrontThickness_Splay;                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesBackThickness_Splay;                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClothesTypeData_C">();
	}
	static class UClothesTypeData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothesTypeData_C>();
	}
};
static_assert(alignof(UClothesTypeData_C) == 0x000008, "Wrong alignment on UClothesTypeData_C");
static_assert(sizeof(UClothesTypeData_C) == 0x000050, "Wrong size on UClothesTypeData_C");
static_assert(offsetof(UClothesTypeData_C, ClothesRadiusType) == 0x000028, "Member 'UClothesTypeData_C::ClothesRadiusType' has a wrong offset!");
static_assert(offsetof(UClothesTypeData_C, ClothesFrontThickness_Follow) == 0x000030, "Member 'UClothesTypeData_C::ClothesFrontThickness_Follow' has a wrong offset!");
static_assert(offsetof(UClothesTypeData_C, ClothesBackThickness_Follow) == 0x000038, "Member 'UClothesTypeData_C::ClothesBackThickness_Follow' has a wrong offset!");
static_assert(offsetof(UClothesTypeData_C, ClothesFrontThickness_Splay) == 0x000040, "Member 'UClothesTypeData_C::ClothesFrontThickness_Splay' has a wrong offset!");
static_assert(offsetof(UClothesTypeData_C, ClothesBackThickness_Splay) == 0x000048, "Member 'UClothesTypeData_C::ClothesBackThickness_Splay' has a wrong offset!");

}

