#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothesAssetExtraData

#include "Basic.hpp"


namespace SDK::Params
{

// Function ClothesAssetExtraData.ClothesAssetExtraData_C.CheckNikkiSkNameContainsConfig
// 0x0158 (0x0158 - 0x0000)
struct ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig final
{
public:
	TArray<class FString>                         Configs;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsHidden;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SKName;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue_1;                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue_1; // 0x00B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_4;                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_5;                         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_6;                         // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig) == 0x000008, "Wrong alignment on ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig");
static_assert(sizeof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig) == 0x000158, "Wrong size on ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, Configs) == 0x000000, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::Configs' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, IsHidden) == 0x000010, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::IsHidden' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, SKName) == 0x000018, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::SKName' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Len_ReturnValue) == 0x000028, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000030, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item) == 0x000048, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Mid_ReturnValue) == 0x000058, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000068, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Mid_ReturnValue_1) == 0x000080, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Mid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000090, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_GetOuterObject_ReturnValue) == 0x0000B0, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_GetCharacterArrayFromString_ReturnValue_1) == 0x0000B8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_GetCharacterArrayFromString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_GetDisplayName_ReturnValue) == 0x0000C8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_3) == 0x0000E8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_4) == 0x0000F8, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_5) == 0x000108, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000128, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x000129, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Get_Item_6) == 0x000130, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000140, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue) == 0x000150, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_1) == 0x000151, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_2) == 0x000152, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue) == 0x000153, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_3) == 0x000154, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue_1) == 0x000155, "Member 'ClothesAssetExtraData_C_CheckNikkiSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function ClothesAssetExtraData.ClothesAssetExtraData_C.CheckNPCSkNameContainsConfig
// 0x01F8 (0x01F8 - 0x0000)
struct ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig final
{
public:
	TArray<class FString>                         Configs;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsHidden;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SKName;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_4;                         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_5;                         // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_6;                         // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_4;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_5;             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue_1;                        // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue_1; // 0x01A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Mid_ReturnValue_2;                        // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_7;                         // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig) == 0x000008, "Wrong alignment on ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig");
static_assert(sizeof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig) == 0x0001F8, "Wrong size on ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, Configs) == 0x000000, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::Configs' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, IsHidden) == 0x000010, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::IsHidden' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, SKName) == 0x000018, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::SKName' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000028, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Len_ReturnValue) == 0x000038, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item) == 0x000040, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Mid_ReturnValue) == 0x000068, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_3) == 0x000088, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_4) == 0x000098, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_5) == 0x0000A8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000C8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D0, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue) == 0x0000E0, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0000E1, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_1) == 0x0000F8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_2) == 0x0000F9, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_6) == 0x000100, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue) == 0x000110, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000118, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue_1) == 0x000128, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000130, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_3) == 0x000140, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000148, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_4) == 0x000158, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Contains_ReturnValue_5) == 0x000159, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Mid_ReturnValue_1) == 0x000160, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Mid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue_2) == 0x000170, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000178, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_BooleanOR_ReturnValue_3) == 0x000188, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000190, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Len_ReturnValue_1) == 0x0001A0, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_GetCharacterArrayFromString_ReturnValue_1) == 0x0001A8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_GetCharacterArrayFromString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Mid_ReturnValue_2) == 0x0001B8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Mid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_Array_Get_Item_7) == 0x0001C8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x0001D8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_GetOuterObject_ReturnValue) == 0x0001E0, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig, CallFunc_GetDisplayName_ReturnValue) == 0x0001E8, "Member 'ClothesAssetExtraData_C_CheckNPCSkNameContainsConfig::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function ClothesAssetExtraData.ClothesAssetExtraData_C.ConstructObjectHiddenCategory_EditorOnly
// 0x0030 (0x0030 - 0x0000)
struct ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly final
{
public:
	TArray<class FName>                           HiddenCategories;                                  // 0x0000(0x0010)(Parm, OutParm)
	class FName                                   RowName;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanHidden;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           HiddenArray;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly) == 0x000008, "Wrong alignment on ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly");
static_assert(sizeof(ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly) == 0x000030, "Wrong size on ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly");
static_assert(offsetof(ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly, HiddenCategories) == 0x000000, "Member 'ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly::HiddenCategories' has a wrong offset!");
static_assert(offsetof(ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly, RowName) == 0x000010, "Member 'ClothesAssetExtraData_C_ConstructObjectHiddenCategory_EditorOnly::RowName' has a wrong offset!");
