#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloudNoiseSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CloudNoiseSettings.CloudNoiseSettings
// 0x000C (0x000C - 0x0000)
struct FCloudNoiseSettings final
{
public:
	float                                         NoiseTiling_2_26C9ADC14ABA98359057ACA53F87F166;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseIntensity_4_98D0867F45985E9299B79E9C2364A293; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoiseSeed_6_502C956B4FA8703A25D943B032A3C6A4;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCloudNoiseSettings) == 0x000004, "Wrong alignment on FCloudNoiseSettings");
static_assert(sizeof(FCloudNoiseSettings) == 0x00000C, "Wrong size on FCloudNoiseSettings");
static_assert(offsetof(FCloudNoiseSettings, NoiseTiling_2_26C9ADC14ABA98359057ACA53F87F166) == 0x000000, "Member 'FCloudNoiseSettings::NoiseTiling_2_26C9ADC14ABA98359057ACA53F87F166' has a wrong offset!");
static_assert(offsetof(FCloudNoiseSettings, NoiseIntensity_4_98D0867F45985E9299B79E9C2364A293) == 0x000004, "Member 'FCloudNoiseSettings::NoiseIntensity_4_98D0867F45985E9299B79E9C2364A293' has a wrong offset!");
static_assert(offsetof(FCloudNoiseSettings, NoiseSeed_6_502C956B4FA8703A25D943B032A3C6A4) == 0x000008, "Member 'FCloudNoiseSettings::NoiseSeed_6_502C956B4FA8703A25D943B032A3C6A4' has a wrong offset!");

}

