#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_ProceduralAnim_Nikki

#include "Basic.hpp"

#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_ProceduralAnim_Nikki.CR_ProceduralAnim_Nikki_C
// 0x0098 (0x0B40 - 0x0AA8)
class UCR_ProceduralAnim_Nikki_C final : public UControlRig
{
public:
	struct FVector                                FootPostionL;                                      // 0x0AA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootPositionR;                                     // 0x0AC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FootAlphaL;                                        // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FootAlphaR;                                        // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  FootRotationL;                                     // 0x0AF0(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  FootRotationR;                                     // 0x0B10(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighHeel_Ankle_Angle;                              // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_ProceduralAnim_Nikki_C">();
	}
	static class UCR_ProceduralAnim_Nikki_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_ProceduralAnim_Nikki_C>();
	}
};
static_assert(alignof(UCR_ProceduralAnim_Nikki_C) == 0x000010, "Wrong alignment on UCR_ProceduralAnim_Nikki_C");
static_assert(sizeof(UCR_ProceduralAnim_Nikki_C) == 0x000B40, "Wrong size on UCR_ProceduralAnim_Nikki_C");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootPostionL) == 0x000AA8, "Member 'UCR_ProceduralAnim_Nikki_C::FootPostionL' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootPositionR) == 0x000AC0, "Member 'UCR_ProceduralAnim_Nikki_C::FootPositionR' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootAlphaL) == 0x000AD8, "Member 'UCR_ProceduralAnim_Nikki_C::FootAlphaL' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootAlphaR) == 0x000AE0, "Member 'UCR_ProceduralAnim_Nikki_C::FootAlphaR' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootRotationL) == 0x000AF0, "Member 'UCR_ProceduralAnim_Nikki_C::FootRotationL' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, FootRotationR) == 0x000B10, "Member 'UCR_ProceduralAnim_Nikki_C::FootRotationR' has a wrong offset!");
static_assert(offsetof(UCR_ProceduralAnim_Nikki_C, HighHeel_Ankle_Angle) == 0x000B30, "Member 'UCR_ProceduralAnim_Nikki_C::HighHeel_Ankle_Angle' has a wrong offset!");

}

