#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "X6EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function CustomWidget.X6LongPressedButtonSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct X6LongPressedButtonSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6LongPressedButtonSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on X6LongPressedButtonSlot_SetHorizontalAlignment");
static_assert(sizeof(X6LongPressedButtonSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on X6LongPressedButtonSlot_SetHorizontalAlignment");
static_assert(offsetof(X6LongPressedButtonSlot_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'X6LongPressedButtonSlot_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function CustomWidget.X6LongPressedButtonSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct X6LongPressedButtonSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6LongPressedButtonSlot_SetPadding) == 0x000004, "Wrong alignment on X6LongPressedButtonSlot_SetPadding");
static_assert(sizeof(X6LongPressedButtonSlot_SetPadding) == 0x000010, "Wrong size on X6LongPressedButtonSlot_SetPadding");
static_assert(offsetof(X6LongPressedButtonSlot_SetPadding, InPadding) == 0x000000, "Member 'X6LongPressedButtonSlot_SetPadding::InPadding' has a wrong offset!");

// Function CustomWidget.X6LongPressedButtonSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct X6LongPressedButtonSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6LongPressedButtonSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on X6LongPressedButtonSlot_SetVerticalAlignment");
static_assert(sizeof(X6LongPressedButtonSlot_SetVerticalAlignment) == 0x000001, "Wrong size on X6LongPressedButtonSlot_SetVerticalAlignment");
static_assert(offsetof(X6LongPressedButtonSlot_SetVerticalAlignment, InVerticalAlignment) == 0x000000, "Member 'X6LongPressedButtonSlot_SetVerticalAlignment::InVerticalAlignment' has a wrong offset!");

// Function CustomWidget.X6MultiPlatformButton.BindInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6MultiPlatformButton_BindInputAction final
{
public:
	class UX6InputAction*                         InputAction;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6MultiPlatformButton_BindInputAction) == 0x000008, "Wrong alignment on X6MultiPlatformButton_BindInputAction");
static_assert(sizeof(X6MultiPlatformButton_BindInputAction) == 0x000008, "Wrong size on X6MultiPlatformButton_BindInputAction");
static_assert(offsetof(X6MultiPlatformButton_BindInputAction, InputAction) == 0x000000, "Member 'X6MultiPlatformButton_BindInputAction::InputAction' has a wrong offset!");

// Function CustomWidget.X6MultiPlatformButton.HandleInputActionCanceled
// 0x0038 (0x0038 - 0x0000)
struct X6MultiPlatformButton_HandleInputActionCanceled final
{
public:
	struct FX6InputActionValue                    ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FX6InputActionTriggerKeyData>   TriggerKeyDatas;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6MultiPlatformButton_HandleInputActionCanceled) == 0x000008, "Wrong alignment on X6MultiPlatformButton_HandleInputActionCanceled");
static_assert(sizeof(X6MultiPlatformButton_HandleInputActionCanceled) == 0x000038, "Wrong size on X6MultiPlatformButton_HandleInputActionCanceled");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCanceled, ActionValue) == 0x000000, "Member 'X6MultiPlatformButton_HandleInputActionCanceled::ActionValue' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCanceled, ElapsedTime) == 0x000020, "Member 'X6MultiPlatformButton_HandleInputActionCanceled::ElapsedTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCanceled, TriggeredTime) == 0x000024, "Member 'X6MultiPlatformButton_HandleInputActionCanceled::TriggeredTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCanceled, TriggerKeyDatas) == 0x000028, "Member 'X6MultiPlatformButton_HandleInputActionCanceled::TriggerKeyDatas' has a wrong offset!");

// Function CustomWidget.X6MultiPlatformButton.HandleInputActionCompleted
// 0x0038 (0x0038 - 0x0000)
struct X6MultiPlatformButton_HandleInputActionCompleted final
{
public:
	struct FX6InputActionValue                    ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FX6InputActionTriggerKeyData>   TriggerKeyDatas;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6MultiPlatformButton_HandleInputActionCompleted) == 0x000008, "Wrong alignment on X6MultiPlatformButton_HandleInputActionCompleted");
static_assert(sizeof(X6MultiPlatformButton_HandleInputActionCompleted) == 0x000038, "Wrong size on X6MultiPlatformButton_HandleInputActionCompleted");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCompleted, ActionValue) == 0x000000, "Member 'X6MultiPlatformButton_HandleInputActionCompleted::ActionValue' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCompleted, ElapsedTime) == 0x000020, "Member 'X6MultiPlatformButton_HandleInputActionCompleted::ElapsedTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCompleted, TriggeredTime) == 0x000024, "Member 'X6MultiPlatformButton_HandleInputActionCompleted::TriggeredTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionCompleted, TriggerKeyDatas) == 0x000028, "Member 'X6MultiPlatformButton_HandleInputActionCompleted::TriggerKeyDatas' has a wrong offset!");

// Function CustomWidget.X6MultiPlatformButton.HandleInputActionStarted
// 0x0038 (0x0038 - 0x0000)
struct X6MultiPlatformButton_HandleInputActionStarted final
{
public:
	struct FX6InputActionValue                    ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FX6InputActionTriggerKeyData>   TriggerKeyDatas;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6MultiPlatformButton_HandleInputActionStarted) == 0x000008, "Wrong alignment on X6MultiPlatformButton_HandleInputActionStarted");
static_assert(sizeof(X6MultiPlatformButton_HandleInputActionStarted) == 0x000038, "Wrong size on X6MultiPlatformButton_HandleInputActionStarted");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionStarted, ActionValue) == 0x000000, "Member 'X6MultiPlatformButton_HandleInputActionStarted::ActionValue' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionStarted, ElapsedTime) == 0x000020, "Member 'X6MultiPlatformButton_HandleInputActionStarted::ElapsedTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionStarted, TriggeredTime) == 0x000024, "Member 'X6MultiPlatformButton_HandleInputActionStarted::TriggeredTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionStarted, TriggerKeyDatas) == 0x000028, "Member 'X6MultiPlatformButton_HandleInputActionStarted::TriggerKeyDatas' has a wrong offset!");

// Function CustomWidget.X6MultiPlatformButton.HandleInputActionTriggered
// 0x0038 (0x0038 - 0x0000)
struct X6MultiPlatformButton_HandleInputActionTriggered final
{
public:
	struct FX6InputActionValue                    ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FX6InputActionTriggerKeyData>   TriggerKeyDatas;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6MultiPlatformButton_HandleInputActionTriggered) == 0x000008, "Wrong alignment on X6MultiPlatformButton_HandleInputActionTriggered");
static_assert(sizeof(X6MultiPlatformButton_HandleInputActionTriggered) == 0x000038, "Wrong size on X6MultiPlatformButton_HandleInputActionTriggered");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionTriggered, ActionValue) == 0x000000, "Member 'X6MultiPlatformButton_HandleInputActionTriggered::ActionValue' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionTriggered, ElapsedTime) == 0x000020, "Member 'X6MultiPlatformButton_HandleInputActionTriggered::ElapsedTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionTriggered, TriggeredTime) == 0x000024, "Member 'X6MultiPlatformButton_HandleInputActionTriggered::TriggeredTime' has a wrong offset!");
static_assert(offsetof(X6MultiPlatformButton_HandleInputActionTriggered, TriggerKeyDatas) == 0x000028, "Member 'X6MultiPlatformButton_HandleInputActionTriggered::TriggerKeyDatas' has a wrong offset!");

// Function CustomWidget.X6WrapBox.SetEntryNum
// 0x0004 (0x0004 - 0x0000)
struct X6WrapBox_SetEntryNum final
{
public:
	int32                                         InNum;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6WrapBox_SetEntryNum) == 0x000004, "Wrong alignment on X6WrapBox_SetEntryNum");
static_assert(sizeof(X6WrapBox_SetEntryNum) == 0x000004, "Wrong size on X6WrapBox_SetEntryNum");
static_assert(offsetof(X6WrapBox_SetEntryNum, InNum) == 0x000000, "Member 'X6WrapBox_SetEntryNum::InNum' has a wrong offset!");

// Function CustomWidget.X6WrapBox.SetEntryWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct X6WrapBox_SetEntryWidgetClass final
{
public:
	TSubclassOf<class UUserWidget>                InEntryWidgetClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6WrapBox_SetEntryWidgetClass) == 0x000008, "Wrong alignment on X6WrapBox_SetEntryWidgetClass");
static_assert(sizeof(X6WrapBox_SetEntryWidgetClass) == 0x000008, "Wrong size on X6WrapBox_SetEntryWidgetClass");
static_assert(offsetof(X6WrapBox_SetEntryWidgetClass, InEntryWidgetClass) == 0x000000, "Member 'X6WrapBox_SetEntryWidgetClass::InEntryWidgetClass' has a wrong offset!");

}

