#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function CustomButton.CustomShapeButton.SetAdvancedHitAlpha
// 0x0004 (0x0004 - 0x0000)
struct CustomShapeButton_SetAdvancedHitAlpha final
{
public:
	int32                                         InAlpha;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomShapeButton_SetAdvancedHitAlpha) == 0x000004, "Wrong alignment on CustomShapeButton_SetAdvancedHitAlpha");
static_assert(sizeof(CustomShapeButton_SetAdvancedHitAlpha) == 0x000004, "Wrong size on CustomShapeButton_SetAdvancedHitAlpha");
static_assert(offsetof(CustomShapeButton_SetAdvancedHitAlpha, InAlpha) == 0x000000, "Member 'CustomShapeButton_SetAdvancedHitAlpha::InAlpha' has a wrong offset!");

// Function CustomButton.CustomShapeButton.SetAdvancedHitTexture
// 0x0008 (0x0008 - 0x0000)
struct CustomShapeButton_SetAdvancedHitTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomShapeButton_SetAdvancedHitTexture) == 0x000008, "Wrong alignment on CustomShapeButton_SetAdvancedHitTexture");
static_assert(sizeof(CustomShapeButton_SetAdvancedHitTexture) == 0x000008, "Wrong size on CustomShapeButton_SetAdvancedHitTexture");
static_assert(offsetof(CustomShapeButton_SetAdvancedHitTexture, InTexture) == 0x000000, "Member 'CustomShapeButton_SetAdvancedHitTexture::InTexture' has a wrong offset!");

}

