#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: D_StarSeaPublicSpace_LS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass D_StarSeaPublicSpace_LS.D_StarSeaPublicSpace_LS_C
// 0x0028 (0x03D8 - 0x03B0)
class AD_StarSeaPublicSpace_LS_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            TOD_Time_Curve;                                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ADynamicWeatherVolume*                  DynamicWeatherVolume_2_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADE_SpotLight_01_C*                     DE_SpotLight_01_C_41_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADynamicWeatherVolume*                  DynamicWeatherVolume_0_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty; // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AAAA();
	void ExecuteUbergraph_D_StarSeaPublicSpace_LS(int32 EntryPoint);
	void OnLoaded_42C496BD44BA605173BFF1AE864F3FAA(class UObject* Loaded);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"D_StarSeaPublicSpace_LS_C">();
	}
	static class AD_StarSeaPublicSpace_LS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AD_StarSeaPublicSpace_LS_C>();
	}
};
static_assert(alignof(AD_StarSeaPublicSpace_LS_C) == 0x000008, "Wrong alignment on AD_StarSeaPublicSpace_LS_C");
static_assert(sizeof(AD_StarSeaPublicSpace_LS_C) == 0x0003D8, "Wrong size on AD_StarSeaPublicSpace_LS_C");
static_assert(offsetof(AD_StarSeaPublicSpace_LS_C, UberGraphFrame) == 0x0003B0, "Member 'AD_StarSeaPublicSpace_LS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AD_StarSeaPublicSpace_LS_C, TOD_Time_Curve) == 0x0003B8, "Member 'AD_StarSeaPublicSpace_LS_C::TOD_Time_Curve' has a wrong offset!");
static_assert(offsetof(AD_StarSeaPublicSpace_LS_C, DynamicWeatherVolume_2_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty) == 0x0003C0, "Member 'AD_StarSeaPublicSpace_LS_C::DynamicWeatherVolume_2_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty' has a wrong offset!");
static_assert(offsetof(AD_StarSeaPublicSpace_LS_C, DE_SpotLight_01_C_41_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty) == 0x0003C8, "Member 'AD_StarSeaPublicSpace_LS_C::DE_SpotLight_01_C_41_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty' has a wrong offset!");
static_assert(offsetof(AD_StarSeaPublicSpace_LS_C, DynamicWeatherVolume_0_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty) == 0x0003D0, "Member 'AD_StarSeaPublicSpace_LS_C::DynamicWeatherVolume_0_ExecuteUbergraph_D_StarSeaPublicSpace_LS_RefProperty' has a wrong offset!");

}

