#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: D_StarSeaPublicSpace_LS

#include "Basic.hpp"


namespace SDK::Params
{

// Function D_StarSeaPublicSpace_LS.D_StarSeaPublicSpace_LS_C.ExecuteUbergraph_D_StarSeaPublicSpace_LS
// 0x0040 (0x0040 - 0x0000)
struct D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS) == 0x000008, "Wrong alignment on D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS");
static_assert(sizeof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS) == 0x000040, "Wrong size on D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, EntryPoint) == 0x000000, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::EntryPoint' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, Temp_object_Variable) == 0x000018, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000024, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'D_StarSeaPublicSpace_LS_C_ExecuteUbergraph_D_StarSeaPublicSpace_LS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function D_StarSeaPublicSpace_LS.D_StarSeaPublicSpace_LS_C.OnLoaded_42C496BD44BA605173BFF1AE864F3FAA
// 0x0008 (0x0008 - 0x0000)
struct D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA) == 0x000008, "Wrong alignment on D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA");
static_assert(sizeof(D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA) == 0x000008, "Wrong size on D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA, Loaded) == 0x000000, "Member 'D_StarSeaPublicSpace_LS_C_OnLoaded_42C496BD44BA605173BFF1AE864F3FAA::Loaded' has a wrong offset!");

// Function D_StarSeaPublicSpace_LS.D_StarSeaPublicSpace_LS_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct D_StarSeaPublicSpace_LS_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(D_StarSeaPublicSpace_LS_C_ReceiveTick) == 0x000004, "Wrong alignment on D_StarSeaPublicSpace_LS_C_ReceiveTick");
static_assert(sizeof(D_StarSeaPublicSpace_LS_C_ReceiveTick) == 0x000004, "Wrong size on D_StarSeaPublicSpace_LS_C_ReceiveTick");
static_assert(offsetof(D_StarSeaPublicSpace_LS_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'D_StarSeaPublicSpace_LS_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

