#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DatalayerBPLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DatalayerBPLibrary.DataLayerBPFunctionLibrary.CopyDataLayerTemplateSpawnerInfo
// 0x0028 (0x0028 - 0x0000)
struct DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo final
{
public:
	int32                                         InID;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InType;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutIDs;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutTypes;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo) == 0x000008, "Wrong alignment on DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo");
static_assert(sizeof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo) == 0x000028, "Wrong size on DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo");
static_assert(offsetof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo, InID) == 0x000000, "Member 'DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo::InID' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo, InType) == 0x000004, "Member 'DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo::InType' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo, OutIDs) == 0x000008, "Member 'DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo::OutIDs' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo, OutTypes) == 0x000018, "Member 'DataLayerBPFunctionLibrary_CopyDataLayerTemplateSpawnerInfo::OutTypes' has a wrong offset!");

// Function DatalayerBPLibrary.DataLayerBPFunctionLibrary.ExtractDatalayerReferenceInfo
// 0x0050 (0x0050 - 0x0000)
struct DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo) == 0x000008, "Wrong alignment on DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo");
static_assert(sizeof(DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo) == 0x000050, "Wrong size on DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo");
static_assert(offsetof(DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo, ReturnValue) == 0x000000, "Member 'DataLayerBPFunctionLibrary_ExtractDatalayerReferenceInfo::ReturnValue' has a wrong offset!");

// Function DatalayerBPLibrary.DataLayerBPFunctionLibrary.SpawnDatalayerItem
// 0x0080 (0x0080 - 0x0000)
struct DataLayerBPFunctionLibrary_SpawnDatalayerItem final
{
public:
	struct FTransform                             InTransform;                                       // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InObjectType;                                      // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InObjectID;                                        // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TemplateActor;                                     // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SingleSelect;                                      // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DataLayerBPFunctionLibrary_SpawnDatalayerItem) == 0x000010, "Wrong alignment on DataLayerBPFunctionLibrary_SpawnDatalayerItem");
static_assert(sizeof(DataLayerBPFunctionLibrary_SpawnDatalayerItem) == 0x000080, "Wrong size on DataLayerBPFunctionLibrary_SpawnDatalayerItem");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, InTransform) == 0x000000, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::InTransform' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, InObjectType) == 0x000060, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::InObjectType' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, InObjectID) == 0x000064, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::InObjectID' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, TemplateActor) == 0x000068, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::TemplateActor' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, SingleSelect) == 0x000070, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::SingleSelect' has a wrong offset!");
static_assert(offsetof(DataLayerBPFunctionLibrary_SpawnDatalayerItem, ReturnValue) == 0x000078, "Member 'DataLayerBPFunctionLibrary_SpawnDatalayerItem::ReturnValue' has a wrong offset!");

}

