#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicEnvironmentSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DynamicEnvironmentSystem.EWeatherCollisionShape
// NumValues: 0x0005
enum class EWeatherCollisionShape : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	Volume                                   = 3,
	MAX                                      = 4,
};

// Enum DynamicEnvironmentSystem.EWeatherAmbianceComponentType
// NumValues: 0x000C
enum class EWeatherAmbianceComponentType : uint8
{
	TimeOfDay                                = 0,
	SingleWeather                            = 1,
	SunAndSkyLight                           = 2,
	SkyAtmosphere                            = 3,
	ExponentialHeightFog                     = 4,
	PostProcessing                           = 5,
	EnvironmentShading                       = 6,
	CharacterLighting                        = 7,
	WeatherComponent                         = 8,
	OverrideAllMode                          = 9,
	Curve24H                                 = 10,
	MAX                                      = 11,
};

// Enum DynamicEnvironmentSystem.EWeatherVolumeType
// NumValues: 0x000C
enum class EWeatherVolumeType : uint8
{
	TimeOfDay                                = 0,
	SingleWeather                            = 1,
	SunAndSkyLight                           = 2,
	SkyAtmosphere                            = 3,
	ExponentialHeightFog                     = 4,
	PostProcessing                           = 5,
	EnvironmentShading                       = 6,
	CharacterLighting                        = 7,
	WeatherComponent                         = 8,
	OverrideAllMode                          = 9,
	Curve24H                                 = 10,
	MAX                                      = 11,
};

// Enum DynamicEnvironmentSystem.EWeatherEnableMode
// NumValues: 0x0004
enum class EWeatherEnableMode : uint8
{
	Default                                  = 0,
	PCOnly                                   = 1,
	MobileOnly                               = 2,
	MAX                                      = 3,
};

// Enum DynamicEnvironmentSystem.EWeatherEffectType
// NumValues: 0x0003
enum class EWeatherEffectType : uint8
{
	NonParticle                              = 0,
	Particle                                 = 1,
	MAX                                      = 2,
};

// ScriptStruct DynamicEnvironmentSystem.WeatherEnableOnGI
// 0x0001 (0x0001 - 0x0000)
struct FWeatherEnableOnGI final
{
public:
	uint8                                         bSkyLight : 1;                                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnlighten : 1;                                    // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFRXGI : 1;                                        // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLumen : 1;                                        // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};
static_assert(alignof(FWeatherEnableOnGI) == 0x000001, "Wrong alignment on FWeatherEnableOnGI");
static_assert(sizeof(FWeatherEnableOnGI) == 0x000001, "Wrong size on FWeatherEnableOnGI");

// ScriptStruct DynamicEnvironmentSystem.TimeSpanLerpConfig
// 0x0020 (0x0020 - 0x0000)
struct FTimeSpanLerpConfig final
{
public:
	class FName                                   SpanName;                                          // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTimeSpanLerpConfig) == 0x000008, "Wrong alignment on FTimeSpanLerpConfig");
static_assert(sizeof(FTimeSpanLerpConfig) == 0x000020, "Wrong size on FTimeSpanLerpConfig");
static_assert(offsetof(FTimeSpanLerpConfig, SpanName) == 0x000000, "Member 'FTimeSpanLerpConfig::SpanName' has a wrong offset!");
static_assert(offsetof(FTimeSpanLerpConfig, StartTime) == 0x000008, "Member 'FTimeSpanLerpConfig::StartTime' has a wrong offset!");
static_assert(offsetof(FTimeSpanLerpConfig, EndTime) == 0x00000C, "Member 'FTimeSpanLerpConfig::EndTime' has a wrong offset!");
static_assert(offsetof(FTimeSpanLerpConfig, ShowName) == 0x000010, "Member 'FTimeSpanLerpConfig::ShowName' has a wrong offset!");

// ScriptStruct DynamicEnvironmentSystem.SunLightLerpConfig
// 0x0128 (0x0128 - 0x0000)
struct FSunLightLerpConfig final
{
public:
	uint8                                         bOverride_Rotator : 1;                             // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Intensity : 1;                           // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightColor : 1;                          // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Temperature : 1;                         // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CustomAtmosphereLightIntensity : 1;      // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CustomAtmosphereLightColor : 1;          // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ContactShadowLength : 1;                 // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightIntensity : 1;                  // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightColor : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightTemperature : 1;                // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CustomAtmosphereMoonLightIntensity : 1;  // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CustomAtmosphereMoonLightColor : 1;      // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightContactShadowLength : 1;        // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SoftShadowEdgeColor : 1;                 // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowAmount : 1;                        // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ShadowBias : 1;                          // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DynamicShadowDistanceMovableLight : 1;   // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricScatteringIntensity : 1;       // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudShadowOpacity : 1;                  // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionFadeDistance : 1;           // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DisabledBrightness : 1;                  // 0x0002(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomPassScale : 1;                      // 0x0002(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomFirstPassDistance : 1;              // 0x0002(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomScale : 1;                          // 0x0002(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomScale_Mobile : 1;                   // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomThreshold : 1;                      // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomThreshold_Mobile : 1;               // 0x0003(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomMaxBrightness : 1;                  // 0x0003(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomMaxBrightness_Mobile : 1;           // 0x0003(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_BloomTint : 1;                           // 0x0003(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightSourceAngle : 1;                    // 0x0003(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AtmosphereSunDiskColorScale : 1;         // 0x0003(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_IndirectLightingIntensity : 1;           // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightIntensityMultiply : 1;              // 0x0004(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SpecularScale : 1;                       // 0x0004(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CloudScatteredLuminanceScale : 1;        // 0x0004(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SunTrackModifier;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotator;                                           // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntensityMobileMultiply;                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColorMobileMultiply;                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Temperature;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomAtmosphereLightIntensity;                    // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CustomAtmosphereLightColor;                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContactShadowLength;                               // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonLightIntensity;                                // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MoonLightColor;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonLightTemperature;                              // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomAtmosphereMoonLightIntensity;                // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CustomAtmosphereMoonLightColor;                    // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonLightContactShadowLength;                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SoftShadowEdgeColor;                               // 0x009C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowAmount;                                      // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowBias;                                        // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicShadowDistanceMovableLight;                 // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowOpacity;                                // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightFunctionFadeDistance;                         // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisabledBrightness;                                // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomPassScale;                                    // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomFirstPassDistance;                            // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomScale;                                        // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomScale_Mobile;                                 // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomThreshold;                                    // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomThreshold_Mobile;                             // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomMaxBrightness;                                // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomMaxBrightness_Mobile;                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BloomTint;                                         // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightSourceAngle;                                  // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AtmosphereSunDiskColorScale;                       // 0x00FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IndirectLightingIntensity;                         // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightIntensityMultiply;                            // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpecularScale;                                     // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudScatteredLuminanceScale;                      // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSunLightLerpConfig) == 0x000008, "Wrong alignment on FSunLightLerpConfig");
static_assert(sizeof(FSunLightLerpConfig) == 0x000128, "Wrong size on FSunLightLerpConfig");
static_assert(offsetof(FSunLightLerpConfig, SunTrackModifier) == 0x000008, "Member 'FSunLightLerpConfig::SunTrackModifier' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, Rotator) == 0x000010, "Member 'FSunLightLerpConfig::Rotator' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, Intensity) == 0x000028, "Member 'FSunLightLerpConfig::Intensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, IntensityMobileMultiply) == 0x00002C, "Member 'FSunLightLerpConfig::IntensityMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, LightColor) == 0x000030, "Member 'FSunLightLerpConfig::LightColor' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, LightColorMobileMultiply) == 0x000040, "Member 'FSunLightLerpConfig::LightColorMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, Temperature) == 0x000050, "Member 'FSunLightLerpConfig::Temperature' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CustomAtmosphereLightIntensity) == 0x000054, "Member 'FSunLightLerpConfig::CustomAtmosphereLightIntensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CustomAtmosphereLightColor) == 0x000058, "Member 'FSunLightLerpConfig::CustomAtmosphereLightColor' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, ContactShadowLength) == 0x000068, "Member 'FSunLightLerpConfig::ContactShadowLength' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, MoonLightIntensity) == 0x00006C, "Member 'FSunLightLerpConfig::MoonLightIntensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, MoonLightColor) == 0x000070, "Member 'FSunLightLerpConfig::MoonLightColor' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, MoonLightTemperature) == 0x000080, "Member 'FSunLightLerpConfig::MoonLightTemperature' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CustomAtmosphereMoonLightIntensity) == 0x000084, "Member 'FSunLightLerpConfig::CustomAtmosphereMoonLightIntensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CustomAtmosphereMoonLightColor) == 0x000088, "Member 'FSunLightLerpConfig::CustomAtmosphereMoonLightColor' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, MoonLightContactShadowLength) == 0x000098, "Member 'FSunLightLerpConfig::MoonLightContactShadowLength' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, SoftShadowEdgeColor) == 0x00009C, "Member 'FSunLightLerpConfig::SoftShadowEdgeColor' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, ShadowAmount) == 0x0000AC, "Member 'FSunLightLerpConfig::ShadowAmount' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, ShadowBias) == 0x0000B0, "Member 'FSunLightLerpConfig::ShadowBias' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, DynamicShadowDistanceMovableLight) == 0x0000B4, "Member 'FSunLightLerpConfig::DynamicShadowDistanceMovableLight' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, VolumetricScatteringIntensity) == 0x0000B8, "Member 'FSunLightLerpConfig::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CloudShadowOpacity) == 0x0000BC, "Member 'FSunLightLerpConfig::CloudShadowOpacity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, LightFunctionFadeDistance) == 0x0000C0, "Member 'FSunLightLerpConfig::LightFunctionFadeDistance' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, DisabledBrightness) == 0x0000C4, "Member 'FSunLightLerpConfig::DisabledBrightness' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomPassScale) == 0x0000C8, "Member 'FSunLightLerpConfig::BloomPassScale' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomFirstPassDistance) == 0x0000CC, "Member 'FSunLightLerpConfig::BloomFirstPassDistance' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomScale) == 0x0000D0, "Member 'FSunLightLerpConfig::BloomScale' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomScale_Mobile) == 0x0000D4, "Member 'FSunLightLerpConfig::BloomScale_Mobile' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomThreshold) == 0x0000D8, "Member 'FSunLightLerpConfig::BloomThreshold' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomThreshold_Mobile) == 0x0000DC, "Member 'FSunLightLerpConfig::BloomThreshold_Mobile' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomMaxBrightness) == 0x0000E0, "Member 'FSunLightLerpConfig::BloomMaxBrightness' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomMaxBrightness_Mobile) == 0x0000E4, "Member 'FSunLightLerpConfig::BloomMaxBrightness_Mobile' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, BloomTint) == 0x0000E8, "Member 'FSunLightLerpConfig::BloomTint' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, LightSourceAngle) == 0x0000F8, "Member 'FSunLightLerpConfig::LightSourceAngle' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, AtmosphereSunDiskColorScale) == 0x0000FC, "Member 'FSunLightLerpConfig::AtmosphereSunDiskColorScale' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, IndirectLightingIntensity) == 0x00010C, "Member 'FSunLightLerpConfig::IndirectLightingIntensity' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, LightIntensityMultiply) == 0x000110, "Member 'FSunLightLerpConfig::LightIntensityMultiply' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, SpecularScale) == 0x000114, "Member 'FSunLightLerpConfig::SpecularScale' has a wrong offset!");
static_assert(offsetof(FSunLightLerpConfig, CloudScatteredLuminanceScale) == 0x000118, "Member 'FSunLightLerpConfig::CloudScatteredLuminanceScale' has a wrong offset!");

// ScriptStruct DynamicEnvironmentSystem.SkyLightLerpConfig
// 0x0088 (0x0088 - 0x0000)
struct FSkyLightLerpConfig final
{
public:
	uint8                                         bOverride_Intensity : 1;                           // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightColor : 1;                          // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SourceCubemapAngle : 1;                  // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LowerHemisphereColor : 1;                // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EnvironmentReflectionTint : 1;           // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SLWEnvironmentReflectionTint : 1;        // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricScatteringIntensity : 1;       // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightFunctionLeaking : 1;             // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntensityMobileMultiply;                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColorMobileMultiply;                          // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceCubemapAngle;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LowerHemisphereColor;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnvironmentReflectionTint;                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnvironmentReflectionTintMobileMultiply;           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SLWEnvironmentReflectionTint;                      // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SLWEnvironmentReflectionTintMobileMultiply;        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightFunctionLeaking;                           // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkyLightLerpConfig) == 0x000004, "Wrong alignment on FSkyLightLerpConfig");
static_assert(sizeof(FSkyLightLerpConfig) == 0x000088, "Wrong size on FSkyLightLerpConfig");
static_assert(offsetof(FSkyLightLerpConfig, Intensity) == 0x000004, "Member 'FSkyLightLerpConfig::Intensity' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, IntensityMobileMultiply) == 0x000008, "Member 'FSkyLightLerpConfig::IntensityMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, LightColor) == 0x00000C, "Member 'FSkyLightLerpConfig::LightColor' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, LightColorMobileMultiply) == 0x00001C, "Member 'FSkyLightLerpConfig::LightColorMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, SourceCubemapAngle) == 0x00002C, "Member 'FSkyLightLerpConfig::SourceCubemapAngle' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, LowerHemisphereColor) == 0x000030, "Member 'FSkyLightLerpConfig::LowerHemisphereColor' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, EnvironmentReflectionTint) == 0x000040, "Member 'FSkyLightLerpConfig::EnvironmentReflectionTint' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, EnvironmentReflectionTintMobileMultiply) == 0x000050, "Member 'FSkyLightLerpConfig::EnvironmentReflectionTintMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, SLWEnvironmentReflectionTint) == 0x000060, "Member 'FSkyLightLerpConfig::SLWEnvironmentReflectionTint' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, SLWEnvironmentReflectionTintMobileMultiply) == 0x000070, "Member 'FSkyLightLerpConfig::SLWEnvironmentReflectionTintMobileMultiply' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, VolumetricScatteringIntensity) == 0x000080, "Member 'FSkyLightLerpConfig::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FSkyLightLerpConfig, SkyLightFunctionLeaking) == 0x000084, "Member 'FSkyLightLerpConfig::SkyLightFunctionLeaking' has a wrong offset!");

// ScriptStruct DynamicEnvironmentSystem.SkyAtmosphereLerpConfig
// 0x007C (0x007C - 0x0000)
struct FSkyAtmosphereLerpConfig final
{
public:
	uint8                                         bOverride_AtmosphereHeight : 1;                    // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MultiScatteringFactor : 1;               // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RayleighScatteringScale : 1;             // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RayleighScattering : 1;                  // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RayleighExponentialDistribution : 1;     // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieScatteringScale : 1;                  // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieScattering : 1;                       // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieAbsorptionScale : 1;                  // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieAbsorption : 1;                       // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieAnisotropy : 1;                       // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MieExponentialDistribution : 1;          // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OtherAbsorptionScale : 1;                // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OtherAbsorption : 1;                     // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLuminanceFactor : 1;                  // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AerialPespectiveViewDistanceScale : 1;   // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_HeightFogContribution : 1;               // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AtmosphereHeight;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RayleighScatteringScale;                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RayleighScattering;                                // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RayleighExponentialDistribution;                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieScatteringScale;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MieScattering;                                     // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieAbsorptionScale;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MieAbsorption;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieAnisotropy;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieExponentialDistribution;                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OtherAbsorptionScale;                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OtherAbsorption;                                   // 0x0054(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SkyLuminanceFactor;                                // 0x0064(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AerialPespectiveViewDistanceScale;                 // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightFogContribution;                             // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkyAtmosphereLerpConfig) == 0x000004, "Wrong alignment on FSkyAtmosphereLerpConfig");
static_assert(sizeof(FSkyAtmosphereLerpConfig) == 0x00007C, "Wrong size on FSkyAtmosphereLerpConfig");
static_assert(offsetof(FSkyAtmosphereLerpConfig, AtmosphereHeight) == 0x000004, "Member 'FSkyAtmosphereLerpConfig::AtmosphereHeight' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, RayleighScatteringScale) == 0x000008, "Member 'FSkyAtmosphereLerpConfig::RayleighScatteringScale' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, RayleighScattering) == 0x00000C, "Member 'FSkyAtmosphereLerpConfig::RayleighScattering' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, RayleighExponentialDistribution) == 0x00001C, "Member 'FSkyAtmosphereLerpConfig::RayleighExponentialDistribution' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieScatteringScale) == 0x000020, "Member 'FSkyAtmosphereLerpConfig::MieScatteringScale' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieScattering) == 0x000024, "Member 'FSkyAtmosphereLerpConfig::MieScattering' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieAbsorptionScale) == 0x000034, "Member 'FSkyAtmosphereLerpConfig::MieAbsorptionScale' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieAbsorption) == 0x000038, "Member 'FSkyAtmosphereLerpConfig::MieAbsorption' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieAnisotropy) == 0x000048, "Member 'FSkyAtmosphereLerpConfig::MieAnisotropy' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, MieExponentialDistribution) == 0x00004C, "Member 'FSkyAtmosphereLerpConfig::MieExponentialDistribution' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, OtherAbsorptionScale) == 0x000050, "Member 'FSkyAtmosphereLerpConfig::OtherAbsorptionScale' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, OtherAbsorption) == 0x000054, "Member 'FSkyAtmosphereLerpConfig::OtherAbsorption' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, SkyLuminanceFactor) == 0x000064, "Member 'FSkyAtmosphereLerpConfig::SkyLuminanceFactor' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, AerialPespectiveViewDistanceScale) == 0x000074, "Member 'FSkyAtmosphereLerpConfig::AerialPespectiveViewDistanceScale' has a wrong offset!");
static_assert(offsetof(FSkyAtmosphereLerpConfig, HeightFogContribution) == 0x000078, "Member 'FSkyAtmosphereLerpConfig::HeightFogContribution' has a wrong offset!");

// ScriptStruct DynamicEnvironmentSystem.ExponentialHeightFogLerpConfig
// 0x0528 (0x0528 - 0x0000)
struct FExponentialHeightFogLerpConfig final
{
public:
	uint8                                         bOverride_FogColor : 1;                            // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogFactor : 1;                           // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FadeOffset : 1;                          // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FadeDistFactor : 1;                      // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CustomLocation : 1;                      // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogDensity : 1;                          // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogHeightFalloff : 1;                    // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogHeightOffset : 1;                     // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondFogData : 1;                       // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SecondFogDataHigh : 1;                   // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogInscatteringColor : 1;                // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyAtmosphereAmbientContributionColorScale : 1; // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DirectionalInscatteringExponent : 1;     // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DirectionalInscatteringStartDistance : 1; // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DirectionalInscatteringColor : 1;        // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogMaxOpacity : 1;                       // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_StartDistance : 1;                       // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogCutoffDistance : 1;                   // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DistanceTintColor : 1;                   // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DistanceTintOffset : 1;                  // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DistanceTintHardness : 1;                // 0x0002(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FarDistanceTintColor : 1;                // 0x0002(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FarDistanceTintOffset : 1;               // 0x0002(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FarDistanceTintHardness : 1;             // 0x0002(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogScatteringDistribution : 1; // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogAlbedo : 1;                 // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogEmissive : 1;               // 0x0003(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogExtinctionScale : 1;        // 0x0003(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogDistance : 1;               // 0x0003(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogStartDistance : 1;          // 0x0003(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VolumetricFogNearFadeInDistance : 1;     // 0x0003(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeCurveLinearColor               FogColor;                                          // 0x0008(0x0208)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRuntimeCurveLinearColor               FogFactor;                                         // 0x0210(0x0208)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         FadeOffset;                                        // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeDistFactor;                                    // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CustomLocation;                                    // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogDensity;                                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFalloff;                                  // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightOffset;                                   // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExponentialHeightFogData              SecondFogData;                                     // 0x0444(0x001C)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPublic)
	struct FExponentialHeightFogData              SecondFogDataHigh;                                 // 0x0460(0x001C)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogInscatteringColor;                              // 0x047C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SkyAtmosphereAmbientContributionColorScale;        // 0x048C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionalInscatteringExponent;                   // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionalInscatteringStartDistance;              // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DirectionalInscatteringColor;                      // 0x04A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogMaxOpacity;                                     // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
