#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnlightenCore

#include "Basic.hpp"


namespace SDK::Params
{

// Function EnlightenCore.EnlightenSystemContainer.ResetEnlightenRuntime
// 0x0010 (0x0010 - 0x0000)
struct EnlightenSystemContainer_ResetEnlightenRuntime final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnlightenSystemContainer_ResetEnlightenRuntime) == 0x000008, "Wrong alignment on EnlightenSystemContainer_ResetEnlightenRuntime");
static_assert(sizeof(EnlightenSystemContainer_ResetEnlightenRuntime) == 0x000010, "Wrong size on EnlightenSystemContainer_ResetEnlightenRuntime");
static_assert(offsetof(EnlightenSystemContainer_ResetEnlightenRuntime, WorldContextObject) == 0x000000, "Member 'EnlightenSystemContainer_ResetEnlightenRuntime::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EnlightenSystemContainer_ResetEnlightenRuntime, ReturnValue) == 0x000008, "Member 'EnlightenSystemContainer_ResetEnlightenRuntime::ReturnValue' has a wrong offset!");

// Function EnlightenCore.EnlightenSystemContainer.SetEnlightenActiveLevel
// 0x0018 (0x0018 - 0x0000)
struct EnlightenSystemContainer_SetEnlightenActiveLevel final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EnlightenSystemContainer_SetEnlightenActiveLevel) == 0x000008, "Wrong alignment on EnlightenSystemContainer_SetEnlightenActiveLevel");
static_assert(sizeof(EnlightenSystemContainer_SetEnlightenActiveLevel) == 0x000018, "Wrong size on EnlightenSystemContainer_SetEnlightenActiveLevel");
static_assert(offsetof(EnlightenSystemContainer_SetEnlightenActiveLevel, WorldContextObject) == 0x000000, "Member 'EnlightenSystemContainer_SetEnlightenActiveLevel::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EnlightenSystemContainer_SetEnlightenActiveLevel, LevelName) == 0x000008, "Member 'EnlightenSystemContainer_SetEnlightenActiveLevel::LevelName' has a wrong offset!");

// Function EnlightenCore.EnlightenSystemContainer.SetUpdateBudget
// 0x0010 (0x0010 - 0x0000)
struct EnlightenSystemContainer_SetUpdateBudget final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateBudgetMS;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EnlightenSystemContainer_SetUpdateBudget) == 0x000008, "Wrong alignment on EnlightenSystemContainer_SetUpdateBudget");
static_assert(sizeof(EnlightenSystemContainer_SetUpdateBudget) == 0x000010, "Wrong size on EnlightenSystemContainer_SetUpdateBudget");
static_assert(offsetof(EnlightenSystemContainer_SetUpdateBudget, WorldContextObject) == 0x000000, "Member 'EnlightenSystemContainer_SetUpdateBudget::WorldContextObject' has a wrong offset!");
static_assert(offsetof(EnlightenSystemContainer_SetUpdateBudget, UpdateBudgetMS) == 0x000008, "Member 'EnlightenSystemContainer_SetUpdateBudget::UpdateBudgetMS' has a wrong offset!");

}

