#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AbilityMontageSelector

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_AbilityMontageSelector.F_AbilityMontageSelector
// 0x0048 (0x0048 - 0x0000)
struct FF_AbilityMontageSelector final
{
public:
	struct FGameplayTagContainer                  ActivationRequiredTags_2_D6AFBEEB48920E842A6BBA9E5A546202; // 0x0000(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  ActivationBlockedTags_4_A50C4554437258872213A1B2B832CBA7; // 0x0020(0x0020)(Edit, BlueprintVisible)
	class UAnimMontage*                           Montage_7_87F4D0BC473472F03B5433873B458CDC;        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AbilityMontageSelector) == 0x000008, "Wrong alignment on FF_AbilityMontageSelector");
static_assert(sizeof(FF_AbilityMontageSelector) == 0x000048, "Wrong size on FF_AbilityMontageSelector");
static_assert(offsetof(FF_AbilityMontageSelector, ActivationRequiredTags_2_D6AFBEEB48920E842A6BBA9E5A546202) == 0x000000, "Member 'FF_AbilityMontageSelector::ActivationRequiredTags_2_D6AFBEEB48920E842A6BBA9E5A546202' has a wrong offset!");
static_assert(offsetof(FF_AbilityMontageSelector, ActivationBlockedTags_4_A50C4554437258872213A1B2B832CBA7) == 0x000020, "Member 'FF_AbilityMontageSelector::ActivationBlockedTags_4_A50C4554437258872213A1B2B832CBA7' has a wrong offset!");
static_assert(offsetof(FF_AbilityMontageSelector, Montage_7_87F4D0BC473472F03B5433873B458CDC) == 0x000040, "Member 'FF_AbilityMontageSelector::Montage_7_87F4D0BC473472F03B5433873B458CDC' has a wrong offset!");

}

