#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AdjustTransformRPCParam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "F_AdjustLerpSpeedModifer_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_AdjustTransformRPCParam.F_AdjustTransformRPCParam
// 0x00D0 (0x00D0 - 0x0000)
struct FF_AdjustTransformRPCParam final
{
public:
	struct FTransform                             AdjustTargetTransform_95_9D49B2DF4EA4DC4B2E5355BD938C407B; // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedSyncLoc_99_D4A570974B1982658D20A0B0E5F287F2;   // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedSyncRot_101_E92BE27D428F47291E37CD863B30D0B4;  // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceVerticalGround_139_7D874C624244715F7813AE8B9D7615A1; // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreInput_103_BE79E64D414E5FDACC2A59ADC8867C24;  // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotateSpeed_106_87393F55474EC86129ED98B0B93731C3;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OverrideMinRot_108_7766D6E5459149225F213A91895B9FC5; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OverrideMinDis_110_433E3E3242E76D348AD4BF9FEDA50CA7; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkipRecovery_112_A9C9EB0D4B76C571CDC41FB14036E742; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceSkip_115_F28314124FCECD9E2A0134AB2FAF31F7;    // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceLerp_117_D5EE6C4948168BDD16F858A84B1A2F67;    // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LerpLocSpeed_120_E1A2F89347FA12C6A65F56AEE6F25757; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_AdjustLerpSpeedModifer>      LerpLocSpeedModifier_143_F0A8A01545798BEB3B3825942872FEC0; // 0x0098(0x0010)(Edit, BlueprintVisible)
	double                                        LerpRotSpeed_126_F07D6A8840E11CA1E472E7B7A3EFCFFF; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_AdjustLerpSpeedModifer>      LerpRotSpeedModifier_144_84B9333B4C50D4A7B8E40BBB7B8B34A8; // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class UCurveFloat*                            OverrideLerpCurve_132_5C73D8014343BD1616FFA2A43ED5E3EC; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         ObjectSpawnerID_145_E8C73F3A44A29F865B29A0A59C91E050; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AdjustTransformRPCParam) == 0x000010, "Wrong alignment on FF_AdjustTransformRPCParam");
static_assert(sizeof(FF_AdjustTransformRPCParam) == 0x0000D0, "Wrong size on FF_AdjustTransformRPCParam");
static_assert(offsetof(FF_AdjustTransformRPCParam, AdjustTargetTransform_95_9D49B2DF4EA4DC4B2E5355BD938C407B) == 0x000000, "Member 'FF_AdjustTransformRPCParam::AdjustTargetTransform_95_9D49B2DF4EA4DC4B2E5355BD938C407B' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, NeedSyncLoc_99_D4A570974B1982658D20A0B0E5F287F2) == 0x000060, "Member 'FF_AdjustTransformRPCParam::NeedSyncLoc_99_D4A570974B1982658D20A0B0E5F287F2' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, NeedSyncRot_101_E92BE27D428F47291E37CD863B30D0B4) == 0x000061, "Member 'FF_AdjustTransformRPCParam::NeedSyncRot_101_E92BE27D428F47291E37CD863B30D0B4' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, ForceVerticalGround_139_7D874C624244715F7813AE8B9D7615A1) == 0x000062, "Member 'FF_AdjustTransformRPCParam::ForceVerticalGround_139_7D874C624244715F7813AE8B9D7615A1' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, IgnoreInput_103_BE79E64D414E5FDACC2A59ADC8867C24) == 0x000063, "Member 'FF_AdjustTransformRPCParam::IgnoreInput_103_BE79E64D414E5FDACC2A59ADC8867C24' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, RotateSpeed_106_87393F55474EC86129ED98B0B93731C3) == 0x000068, "Member 'FF_AdjustTransformRPCParam::RotateSpeed_106_87393F55474EC86129ED98B0B93731C3' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, OverrideMinRot_108_7766D6E5459149225F213A91895B9FC5) == 0x000070, "Member 'FF_AdjustTransformRPCParam::OverrideMinRot_108_7766D6E5459149225F213A91895B9FC5' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, OverrideMinDis_110_433E3E3242E76D348AD4BF9FEDA50CA7) == 0x000078, "Member 'FF_AdjustTransformRPCParam::OverrideMinDis_110_433E3E3242E76D348AD4BF9FEDA50CA7' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, SkipRecovery_112_A9C9EB0D4B76C571CDC41FB14036E742) == 0x000080, "Member 'FF_AdjustTransformRPCParam::SkipRecovery_112_A9C9EB0D4B76C571CDC41FB14036E742' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, ForceSkip_115_F28314124FCECD9E2A0134AB2FAF31F7) == 0x000088, "Member 'FF_AdjustTransformRPCParam::ForceSkip_115_F28314124FCECD9E2A0134AB2FAF31F7' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, ForceLerp_117_D5EE6C4948168BDD16F858A84B1A2F67) == 0x000089, "Member 'FF_AdjustTransformRPCParam::ForceLerp_117_D5EE6C4948168BDD16F858A84B1A2F67' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, LerpLocSpeed_120_E1A2F89347FA12C6A65F56AEE6F25757) == 0x000090, "Member 'FF_AdjustTransformRPCParam::LerpLocSpeed_120_E1A2F89347FA12C6A65F56AEE6F25757' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, LerpLocSpeedModifier_143_F0A8A01545798BEB3B3825942872FEC0) == 0x000098, "Member 'FF_AdjustTransformRPCParam::LerpLocSpeedModifier_143_F0A8A01545798BEB3B3825942872FEC0' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, LerpRotSpeed_126_F07D6A8840E11CA1E472E7B7A3EFCFFF) == 0x0000A8, "Member 'FF_AdjustTransformRPCParam::LerpRotSpeed_126_F07D6A8840E11CA1E472E7B7A3EFCFFF' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, LerpRotSpeedModifier_144_84B9333B4C50D4A7B8E40BBB7B8B34A8) == 0x0000B0, "Member 'FF_AdjustTransformRPCParam::LerpRotSpeedModifier_144_84B9333B4C50D4A7B8E40BBB7B8B34A8' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, OverrideLerpCurve_132_5C73D8014343BD1616FFA2A43ED5E3EC) == 0x0000C0, "Member 'FF_AdjustTransformRPCParam::OverrideLerpCurve_132_5C73D8014343BD1616FFA2A43ED5E3EC' has a wrong offset!");
static_assert(offsetof(FF_AdjustTransformRPCParam, ObjectSpawnerID_145_E8C73F3A44A29F865B29A0A59C91E050) == 0x0000C8, "Member 'FF_AdjustTransformRPCParam::ObjectSpawnerID_145_E8C73F3A44A29F865B29A0A59C91E050' has a wrong offset!");

}

