#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AdjustLerpSpeedModifer

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_AdjustLerpSpeedModifer.F_AdjustLerpSpeedModifer
// 0x0018 (0x0018 - 0x0000)
struct FF_AdjustLerpSpeedModifer final
{
public:
	double                                        RangeMin_6_E7DAA5C340FEDE377F7BC7BC4B9B2CBF;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RangeMax_7_F837FBFE4FE5122270E58599F8C60FEA;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewSpeed_8_94989C90431B2E23E1CC3A81272A3417;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AdjustLerpSpeedModifer) == 0x000008, "Wrong alignment on FF_AdjustLerpSpeedModifer");
static_assert(sizeof(FF_AdjustLerpSpeedModifer) == 0x000018, "Wrong size on FF_AdjustLerpSpeedModifer");
static_assert(offsetof(FF_AdjustLerpSpeedModifer, RangeMin_6_E7DAA5C340FEDE377F7BC7BC4B9B2CBF) == 0x000000, "Member 'FF_AdjustLerpSpeedModifer::RangeMin_6_E7DAA5C340FEDE377F7BC7BC4B9B2CBF' has a wrong offset!");
static_assert(offsetof(FF_AdjustLerpSpeedModifer, RangeMax_7_F837FBFE4FE5122270E58599F8C60FEA) == 0x000008, "Member 'FF_AdjustLerpSpeedModifer::RangeMax_7_F837FBFE4FE5122270E58599F8C60FEA' has a wrong offset!");
static_assert(offsetof(FF_AdjustLerpSpeedModifer, NewSpeed_8_94989C90431B2E23E1CC3A81272A3417) == 0x000010, "Member 'FF_AdjustLerpSpeedModifer::NewSpeed_8_94989C90431B2E23E1CC3A81272A3417' has a wrong offset!");

}

