#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AnimalJewelry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_AnimalJewelry.F_AnimalJewelry
// 0x00D0 (0x00D0 - 0x0000)
struct FF_AnimalJewelry final
{
public:
	class FText                                   AnimalJewelry_Name_10_47681D63407B622F5BCB0BB143B2E108; // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   Animal_Name_29_15779F11493E7EEDFE259581AD2B4A1C;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Animal_ID_22_AE25290F4CE20E2D403CA1827A412204;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           JewelryType_28_25E5BDA04A5D4F4F4B7764A52083DB2A;   // 0x0024(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh_30_C24CE3FA4529B7CC13F1F8A0EAE82439;    // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             transform_25_B7E60F8444C018FC8F0C4EA1F1C195F5;     // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperDialogueConditionNode*            Condition_24_39DC482C43B55A694CF37B80700E6A16;     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AnimalJewelry) == 0x000010, "Wrong alignment on FF_AnimalJewelry");
static_assert(sizeof(FF_AnimalJewelry) == 0x0000D0, "Wrong size on FF_AnimalJewelry");
static_assert(offsetof(FF_AnimalJewelry, AnimalJewelry_Name_10_47681D63407B622F5BCB0BB143B2E108) == 0x000000, "Member 'FF_AnimalJewelry::AnimalJewelry_Name_10_47681D63407B622F5BCB0BB143B2E108' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, Animal_Name_29_15779F11493E7EEDFE259581AD2B4A1C) == 0x000010, "Member 'FF_AnimalJewelry::Animal_Name_29_15779F11493E7EEDFE259581AD2B4A1C' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, Animal_ID_22_AE25290F4CE20E2D403CA1827A412204) == 0x000020, "Member 'FF_AnimalJewelry::Animal_ID_22_AE25290F4CE20E2D403CA1827A412204' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, JewelryType_28_25E5BDA04A5D4F4F4B7764A52083DB2A) == 0x000024, "Member 'FF_AnimalJewelry::JewelryType_28_25E5BDA04A5D4F4F4B7764A52083DB2A' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, StaticMesh_30_C24CE3FA4529B7CC13F1F8A0EAE82439) == 0x000030, "Member 'FF_AnimalJewelry::StaticMesh_30_C24CE3FA4529B7CC13F1F8A0EAE82439' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, transform_25_B7E60F8444C018FC8F0C4EA1F1C195F5) == 0x000060, "Member 'FF_AnimalJewelry::transform_25_B7E60F8444C018FC8F0C4EA1F1C195F5' has a wrong offset!");
static_assert(offsetof(FF_AnimalJewelry, Condition_24_39DC482C43B55A694CF37B80700E6A16) == 0x0000C0, "Member 'FF_AnimalJewelry::Condition_24_39DC482C43B55A694CF37B80700E6A16' has a wrong offset!");

}

