#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AnimalClusterBehaviorAssignmentInfo

#include "Basic.hpp"

#include "F_AnimalClusterMemberBehaviorDetail_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_AnimalClusterBehaviorAssignmentInfo.F_AnimalClusterBehaviorAssignmentInfo
// 0x0060 (0x0060 - 0x0000)
struct FF_AnimalClusterBehaviorAssignmentInfo final
{
public:
	struct FF_AnimalClusterMemberBehaviorDetail   Detail_4_F765792D4BC676EDC27E4DB637C01BB7;         // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        TimeStamp_8_FDD83581496ED1FFD4C60BB4E8638769;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_5_6856780F4ADC1BF8FF604388D33C0F6A;       // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_11_40B39B1D4E4FCF8AD8E5D58AB431C456;      // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FF_AnimalClusterBehaviorAssignmentInfo) == 0x000008, "Wrong alignment on FF_AnimalClusterBehaviorAssignmentInfo");
static_assert(sizeof(FF_AnimalClusterBehaviorAssignmentInfo) == 0x000060, "Wrong size on FF_AnimalClusterBehaviorAssignmentInfo");
static_assert(offsetof(FF_AnimalClusterBehaviorAssignmentInfo, Detail_4_F765792D4BC676EDC27E4DB637C01BB7) == 0x000000, "Member 'FF_AnimalClusterBehaviorAssignmentInfo::Detail_4_F765792D4BC676EDC27E4DB637C01BB7' has a wrong offset!");
static_assert(offsetof(FF_AnimalClusterBehaviorAssignmentInfo, TimeStamp_8_FDD83581496ED1FFD4C60BB4E8638769) == 0x000028, "Member 'FF_AnimalClusterBehaviorAssignmentInfo::TimeStamp_8_FDD83581496ED1FFD4C60BB4E8638769' has a wrong offset!");
static_assert(offsetof(FF_AnimalClusterBehaviorAssignmentInfo, Location_5_6856780F4ADC1BF8FF604388D33C0F6A) == 0x000030, "Member 'FF_AnimalClusterBehaviorAssignmentInfo::Location_5_6856780F4ADC1BF8FF604388D33C0F6A' has a wrong offset!");
static_assert(offsetof(FF_AnimalClusterBehaviorAssignmentInfo, Rotation_11_40B39B1D4E4FCF8AD8E5D58AB431C456) == 0x000048, "Member 'FF_AnimalClusterBehaviorAssignmentInfo::Rotation_11_40B39B1D4E4FCF8AD8E5D58AB431C456' has a wrong offset!");

}

