#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AnimalKeeper_AnimalStatus

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_AnimalKeeper_AnimalStatus.F_AnimalKeeper_AnimalStatus
// 0x00D8 (0x00D8 - 0x0000)
struct FF_AnimalKeeper_AnimalStatus final
{
public:
	int32                                         Animal_ID_6_1A5E9D5141D3E85F4FCD6594B4A62333;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Animal_Name_7_C6A52C5A4859D4BDABEA7AAE4C916157;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Dirtiness_Degree_11_A5DC46C3427613B09B2D6195849ABE02; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Animal_Dirty_Randomness_57_5145FBEB42835552E9BFF6B69E95CBD3; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Dirtiness_Recovery_Period_13_5090A3B24FE69C730E9129B748BF32C0; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Item_ID_15_7B29D1534400CF381D4C7296E68A407C;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Animal_First_Class_Size_20_9CFC646D482D0BECAB144B9FE06A7ACB; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Animal_Second_Class_Size_21_79E725174D2FD9E3D415C499925A9F68; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Animal_Size_Combo_24_97FCCE6D46BCC3FF467312BE624F266E; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Animal_Clean_Idle_Index_37_1E54EA014883D9DDE2B5AFBF49610DCF; // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Animal_Clean_Idle_Weight_38_0F09E27D448E039F067EE2A5C7A20274; // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Animal_Dirty_Idle_Index_39_90F9E0E649CD37D7F1D7CD95DFC4EC87; // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Animal_Dirty_Idle_Weight_40_8903DAEA436CC1165F394DAAF276242E; // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class UAnimMontage>>    Animal_Be_Cleaning_Montage_49_FD8987D6436E09B73EA7EEA0B24FE91D; // 0x0078(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Animal_Be_Cleaning_Montage_Weight_48_DA3C0178413DC810F39223B7A9764BBC; // 0x0088(0x0010)(Edit, BlueprintVisible)
	TArray<TSoftObjectPtr<class UAnimMontage>>    Animal_Happy_Montage_51_D88F0005461BE9AE9234C8BCDECA9EEF; // 0x0098(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Animal_Happy_Montage_Weight_54_9B52B78B4741349EC25D69849268A477; // 0x00A8(0x0010)(Edit, BlueprintVisible)
	int32                                         Quality_60_5DFB93664484C1CF391A85AE55FF8E0A;       // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnedDirtyOrNot_62_225B8FA94C0BEBBB178AD6B6199C1D41; // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   Animal_Cut_Montage_67_B1FF35854CB5B27C3EAC70BED035A736; // 0x00C0(0x0010)(Edit, BlueprintVisible)
	bool                                          AlwaysDirty_69_16D88A344DB2CA1EFBC2E8ACDDCF7853;   // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AnimalKeeper_AnimalStatus) == 0x000008, "Wrong alignment on FF_AnimalKeeper_AnimalStatus");
static_assert(sizeof(FF_AnimalKeeper_AnimalStatus) == 0x0000D8, "Wrong size on FF_AnimalKeeper_AnimalStatus");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_ID_6_1A5E9D5141D3E85F4FCD6594B4A62333) == 0x000000, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_ID_6_1A5E9D5141D3E85F4FCD6594B4A62333' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Name_7_C6A52C5A4859D4BDABEA7AAE4C916157) == 0x000008, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Name_7_C6A52C5A4859D4BDABEA7AAE4C916157' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Dirtiness_Degree_11_A5DC46C3427613B09B2D6195849ABE02) == 0x000018, "Member 'FF_AnimalKeeper_AnimalStatus::Dirtiness_Degree_11_A5DC46C3427613B09B2D6195849ABE02' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Dirty_Randomness_57_5145FBEB42835552E9BFF6B69E95CBD3) == 0x00001C, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Dirty_Randomness_57_5145FBEB42835552E9BFF6B69E95CBD3' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Dirtiness_Recovery_Period_13_5090A3B24FE69C730E9129B748BF32C0) == 0x000020, "Member 'FF_AnimalKeeper_AnimalStatus::Dirtiness_Recovery_Period_13_5090A3B24FE69C730E9129B748BF32C0' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Item_ID_15_7B29D1534400CF381D4C7296E68A407C) == 0x000024, "Member 'FF_AnimalKeeper_AnimalStatus::Item_ID_15_7B29D1534400CF381D4C7296E68A407C' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_First_Class_Size_20_9CFC646D482D0BECAB144B9FE06A7ACB) == 0x000028, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_First_Class_Size_20_9CFC646D482D0BECAB144B9FE06A7ACB' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Second_Class_Size_21_79E725174D2FD9E3D415C499925A9F68) == 0x00002C, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Second_Class_Size_21_79E725174D2FD9E3D415C499925A9F68' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Size_Combo_24_97FCCE6D46BCC3FF467312BE624F266E) == 0x000030, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Size_Combo_24_97FCCE6D46BCC3FF467312BE624F266E' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Clean_Idle_Index_37_1E54EA014883D9DDE2B5AFBF49610DCF) == 0x000038, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Clean_Idle_Index_37_1E54EA014883D9DDE2B5AFBF49610DCF' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Clean_Idle_Weight_38_0F09E27D448E039F067EE2A5C7A20274) == 0x000048, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Clean_Idle_Weight_38_0F09E27D448E039F067EE2A5C7A20274' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Dirty_Idle_Index_39_90F9E0E649CD37D7F1D7CD95DFC4EC87) == 0x000058, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Dirty_Idle_Index_39_90F9E0E649CD37D7F1D7CD95DFC4EC87' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Dirty_Idle_Weight_40_8903DAEA436CC1165F394DAAF276242E) == 0x000068, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Dirty_Idle_Weight_40_8903DAEA436CC1165F394DAAF276242E' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Be_Cleaning_Montage_49_FD8987D6436E09B73EA7EEA0B24FE91D) == 0x000078, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Be_Cleaning_Montage_49_FD8987D6436E09B73EA7EEA0B24FE91D' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Be_Cleaning_Montage_Weight_48_DA3C0178413DC810F39223B7A9764BBC) == 0x000088, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Be_Cleaning_Montage_Weight_48_DA3C0178413DC810F39223B7A9764BBC' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Happy_Montage_51_D88F0005461BE9AE9234C8BCDECA9EEF) == 0x000098, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Happy_Montage_51_D88F0005461BE9AE9234C8BCDECA9EEF' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Happy_Montage_Weight_54_9B52B78B4741349EC25D69849268A477) == 0x0000A8, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Happy_Montage_Weight_54_9B52B78B4741349EC25D69849268A477' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Quality_60_5DFB93664484C1CF391A85AE55FF8E0A) == 0x0000B8, "Member 'FF_AnimalKeeper_AnimalStatus::Quality_60_5DFB93664484C1CF391A85AE55FF8E0A' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, SpawnedDirtyOrNot_62_225B8FA94C0BEBBB178AD6B6199C1D41) == 0x0000BC, "Member 'FF_AnimalKeeper_AnimalStatus::SpawnedDirtyOrNot_62_225B8FA94C0BEBBB178AD6B6199C1D41' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, Animal_Cut_Montage_67_B1FF35854CB5B27C3EAC70BED035A736) == 0x0000C0, "Member 'FF_AnimalKeeper_AnimalStatus::Animal_Cut_Montage_67_B1FF35854CB5B27C3EAC70BED035A736' has a wrong offset!");
static_assert(offsetof(FF_AnimalKeeper_AnimalStatus, AlwaysDirty_69_16D88A344DB2CA1EFBC2E8ACDDCF7853) == 0x0000D0, "Member 'FF_AnimalKeeper_AnimalStatus::AlwaysDirty_69_16D88A344DB2CA1EFBC2E8ACDDCF7853' has a wrong offset!");

}

