#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_AvatarStateAndQuestFlag

#include "Basic.hpp"

#include "F_NPCAndAvatarStateID_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_AvatarStateAndQuestFlag.F_AvatarStateAndQuestFlag
// 0x0038 (0x0038 - 0x0000)
struct FF_AvatarStateAndQuestFlag final
{
public:
	int64                                         questflag_id_3_F8349E2F413B573DC5112E9EA142ACB9;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 graph_tag_6_796506574944579529FB54907737FDEE;      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FF_NPCAndAvatarStateID>         npc_data_18_DA753D4B4BCF2B0EEA7E4F82380E122C;      // 0x0018(0x0010)(Edit, BlueprintVisible)
	class FString                                 desc_15_C658517541E4A8D04D44E79F615F7E37;          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_AvatarStateAndQuestFlag) == 0x000008, "Wrong alignment on FF_AvatarStateAndQuestFlag");
static_assert(sizeof(FF_AvatarStateAndQuestFlag) == 0x000038, "Wrong size on FF_AvatarStateAndQuestFlag");
static_assert(offsetof(FF_AvatarStateAndQuestFlag, questflag_id_3_F8349E2F413B573DC5112E9EA142ACB9) == 0x000000, "Member 'FF_AvatarStateAndQuestFlag::questflag_id_3_F8349E2F413B573DC5112E9EA142ACB9' has a wrong offset!");
static_assert(offsetof(FF_AvatarStateAndQuestFlag, graph_tag_6_796506574944579529FB54907737FDEE) == 0x000008, "Member 'FF_AvatarStateAndQuestFlag::graph_tag_6_796506574944579529FB54907737FDEE' has a wrong offset!");
static_assert(offsetof(FF_AvatarStateAndQuestFlag, npc_data_18_DA753D4B4BCF2B0EEA7E4F82380E122C) == 0x000018, "Member 'FF_AvatarStateAndQuestFlag::npc_data_18_DA753D4B4BCF2B0EEA7E4F82380E122C' has a wrong offset!");
static_assert(offsetof(FF_AvatarStateAndQuestFlag, desc_15_C658517541E4A8D04D44E79F615F7E37) == 0x000028, "Member 'FF_AvatarStateAndQuestFlag::desc_15_C658517541E4A8D04D44E79F615F7E37' has a wrong offset!");

}

