#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_BattleMusicActionData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_BattleMusicActionData.F_BattleMusicActionData
// 0x0058 (0x0058 - 0x0000)
struct FF_BattleMusicActionData final
{
public:
	TSoftObjectPtr<class UAkAudioType>            EnterActionData_2_FEE32FAE4F654CD63047D2A04964CFB3; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioType>            ExitActionData_4_1D8E4F354174C9B6A4BCF59598163772; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Priority_8_1A9D49E14040DD450886CA809951A05F;       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_BattleMusicActionData) == 0x000008, "Wrong alignment on FF_BattleMusicActionData");
static_assert(sizeof(FF_BattleMusicActionData) == 0x000058, "Wrong size on FF_BattleMusicActionData");
static_assert(offsetof(FF_BattleMusicActionData, EnterActionData_2_FEE32FAE4F654CD63047D2A04964CFB3) == 0x000000, "Member 'FF_BattleMusicActionData::EnterActionData_2_FEE32FAE4F654CD63047D2A04964CFB3' has a wrong offset!");
static_assert(offsetof(FF_BattleMusicActionData, ExitActionData_4_1D8E4F354174C9B6A4BCF59598163772) == 0x000028, "Member 'FF_BattleMusicActionData::ExitActionData_4_1D8E4F354174C9B6A4BCF59598163772' has a wrong offset!");
static_assert(offsetof(FF_BattleMusicActionData, Priority_8_1A9D49E14040DD450886CA809951A05F) == 0x000050, "Member 'FF_BattleMusicActionData::Priority_8_1A9D49E14040DD450886CA809951A05F' has a wrong offset!");

}

