#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_BossSkillTipConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_BossSkillTipConfig.F_BossSkillTipConfig
// 0x0030 (0x0030 - 0x0000)
struct FF_BossSkillTipConfig final
{
public:
	class FString                                 SkillKey_8_DE6E0BFF4B6F6D1D857CEE8AB63D2A19;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         TipIDList_7_4FED12E2483E0CDBE2862991E2DEB408;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	double                                        TipCD_13_5464BC8148F7A042DE14C6BCDACFC54D;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority_16_715BD15F4646F4C0DBAB7996D36E9735;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_BossSkillTipConfig) == 0x000008, "Wrong alignment on FF_BossSkillTipConfig");
static_assert(sizeof(FF_BossSkillTipConfig) == 0x000030, "Wrong size on FF_BossSkillTipConfig");
static_assert(offsetof(FF_BossSkillTipConfig, SkillKey_8_DE6E0BFF4B6F6D1D857CEE8AB63D2A19) == 0x000000, "Member 'FF_BossSkillTipConfig::SkillKey_8_DE6E0BFF4B6F6D1D857CEE8AB63D2A19' has a wrong offset!");
static_assert(offsetof(FF_BossSkillTipConfig, TipIDList_7_4FED12E2483E0CDBE2862991E2DEB408) == 0x000010, "Member 'FF_BossSkillTipConfig::TipIDList_7_4FED12E2483E0CDBE2862991E2DEB408' has a wrong offset!");
static_assert(offsetof(FF_BossSkillTipConfig, TipCD_13_5464BC8148F7A042DE14C6BCDACFC54D) == 0x000020, "Member 'FF_BossSkillTipConfig::TipCD_13_5464BC8148F7A042DE14C6BCDACFC54D' has a wrong offset!");
static_assert(offsetof(FF_BossSkillTipConfig, Priority_16_715BD15F4646F4C0DBAB7996D36E9735) == 0x000028, "Member 'FF_BossSkillTipConfig::Priority_16_715BD15F4646F4C0DBAB7996D36E9735' has a wrong offset!");

}

