#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_CameraParamsForRpc

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_CameraParamsForRpc.F_CameraParamsForRpc
// 0x00A8 (0x00A8 - 0x0000)
struct FF_CameraParamsForRpc final
{
public:
	int32                                         PortraitMode_3_FEFA3C9D4076F0D1C25F9D93C5086202;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FocalLength_53_99E0C59849CCBFDF2F3FB1B647236A6B;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FocalLengthPercent_5_E3C6318F4F4F5C0BB66F06967C349287; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraRoll_7_4D414FB548300C5D0BB7BA908288BFDE;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ApertrueSection_10_7C54E0EB454148D6F41C10A3324A25C9; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SupportLineEnable_13_89FB324A49C04F4AF23CD9B62ABD7E36; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNpcHidden_16_EAA5C33744BC57FAE51BC88F0A73088A;   // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteractiveObjVisibile_18_92EFF64A441E3A05DAF686AFFB868A5B; // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MagicBallVisible_20_6998E100466F6DA0333EEF87431BA42F; // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VignetteIntensity_57_143960674578631168A9038FF1A2F63E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BloomIntensity_23_67C10FFF466CB65FDA9CFFA7C1541503; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BloomThreshold_25_CD9EBD654F2FBB0053E5C6BFFBE82475; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Brightness_27_181A53594D5D26769AD0AF81A5471F02;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Exposure_29_A1D96C06469815C04D51B6823C8C1B4A;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Contrast_31_B44AFCB9493BF2B64FBB78B2EF5DE425;      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Saturation_33_2F548A63491B1083230C01A2F14F608B;    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vibrance_35_CFC8F77F4ED6DFC5AAE04B928BCA5DC7;      // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hightlights_37_C5ACC43743D3CD4DE2E2F98B4E809158;   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Shadow_39_A0342A894DF496EBB9C7AA9D1997CD4A;        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LightID_42_19BE30E34190D0FD61CC14A85C0797CF;       // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        LightStrength_45_F3FCF06B4D3F38C2662A0091E4DC9757; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 FilterID_48_ABFDEA384DF98E0C011ABFBDF4203F17;      // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        FilterStrength_51_02DE38A247C50C0BBD74E68D6B21B990; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_CameraParamsForRpc) == 0x000008, "Wrong alignment on FF_CameraParamsForRpc");
static_assert(sizeof(FF_CameraParamsForRpc) == 0x0000A8, "Wrong size on FF_CameraParamsForRpc");
static_assert(offsetof(FF_CameraParamsForRpc, PortraitMode_3_FEFA3C9D4076F0D1C25F9D93C5086202) == 0x000000, "Member 'FF_CameraParamsForRpc::PortraitMode_3_FEFA3C9D4076F0D1C25F9D93C5086202' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, FocalLength_53_99E0C59849CCBFDF2F3FB1B647236A6B) == 0x000008, "Member 'FF_CameraParamsForRpc::FocalLength_53_99E0C59849CCBFDF2F3FB1B647236A6B' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, FocalLengthPercent_5_E3C6318F4F4F5C0BB66F06967C349287) == 0x000010, "Member 'FF_CameraParamsForRpc::FocalLengthPercent_5_E3C6318F4F4F5C0BB66F06967C349287' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, CameraRoll_7_4D414FB548300C5D0BB7BA908288BFDE) == 0x000018, "Member 'FF_CameraParamsForRpc::CameraRoll_7_4D414FB548300C5D0BB7BA908288BFDE' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, ApertrueSection_10_7C54E0EB454148D6F41C10A3324A25C9) == 0x000020, "Member 'FF_CameraParamsForRpc::ApertrueSection_10_7C54E0EB454148D6F41C10A3324A25C9' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, SupportLineEnable_13_89FB324A49C04F4AF23CD9B62ABD7E36) == 0x000024, "Member 'FF_CameraParamsForRpc::SupportLineEnable_13_89FB324A49C04F4AF23CD9B62ABD7E36' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, IsNpcHidden_16_EAA5C33744BC57FAE51BC88F0A73088A) == 0x000025, "Member 'FF_CameraParamsForRpc::IsNpcHidden_16_EAA5C33744BC57FAE51BC88F0A73088A' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, IsInteractiveObjVisibile_18_92EFF64A441E3A05DAF686AFFB868A5B) == 0x000026, "Member 'FF_CameraParamsForRpc::IsInteractiveObjVisibile_18_92EFF64A441E3A05DAF686AFFB868A5B' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, MagicBallVisible_20_6998E100466F6DA0333EEF87431BA42F) == 0x000027, "Member 'FF_CameraParamsForRpc::MagicBallVisible_20_6998E100466F6DA0333EEF87431BA42F' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, VignetteIntensity_57_143960674578631168A9038FF1A2F63E) == 0x000028, "Member 'FF_CameraParamsForRpc::VignetteIntensity_57_143960674578631168A9038FF1A2F63E' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, BloomIntensity_23_67C10FFF466CB65FDA9CFFA7C1541503) == 0x000030, "Member 'FF_CameraParamsForRpc::BloomIntensity_23_67C10FFF466CB65FDA9CFFA7C1541503' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, BloomThreshold_25_CD9EBD654F2FBB0053E5C6BFFBE82475) == 0x000038, "Member 'FF_CameraParamsForRpc::BloomThreshold_25_CD9EBD654F2FBB0053E5C6BFFBE82475' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Brightness_27_181A53594D5D26769AD0AF81A5471F02) == 0x000040, "Member 'FF_CameraParamsForRpc::Brightness_27_181A53594D5D26769AD0AF81A5471F02' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Exposure_29_A1D96C06469815C04D51B6823C8C1B4A) == 0x000048, "Member 'FF_CameraParamsForRpc::Exposure_29_A1D96C06469815C04D51B6823C8C1B4A' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Contrast_31_B44AFCB9493BF2B64FBB78B2EF5DE425) == 0x000050, "Member 'FF_CameraParamsForRpc::Contrast_31_B44AFCB9493BF2B64FBB78B2EF5DE425' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Saturation_33_2F548A63491B1083230C01A2F14F608B) == 0x000058, "Member 'FF_CameraParamsForRpc::Saturation_33_2F548A63491B1083230C01A2F14F608B' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Vibrance_35_CFC8F77F4ED6DFC5AAE04B928BCA5DC7) == 0x000060, "Member 'FF_CameraParamsForRpc::Vibrance_35_CFC8F77F4ED6DFC5AAE04B928BCA5DC7' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Hightlights_37_C5ACC43743D3CD4DE2E2F98B4E809158) == 0x000068, "Member 'FF_CameraParamsForRpc::Hightlights_37_C5ACC43743D3CD4DE2E2F98B4E809158' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, Shadow_39_A0342A894DF496EBB9C7AA9D1997CD4A) == 0x000070, "Member 'FF_CameraParamsForRpc::Shadow_39_A0342A894DF496EBB9C7AA9D1997CD4A' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, LightID_42_19BE30E34190D0FD61CC14A85C0797CF) == 0x000078, "Member 'FF_CameraParamsForRpc::LightID_42_19BE30E34190D0FD61CC14A85C0797CF' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, LightStrength_45_F3FCF06B4D3F38C2662A0091E4DC9757) == 0x000088, "Member 'FF_CameraParamsForRpc::LightStrength_45_F3FCF06B4D3F38C2662A0091E4DC9757' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, FilterID_48_ABFDEA384DF98E0C011ABFBDF4203F17) == 0x000090, "Member 'FF_CameraParamsForRpc::FilterID_48_ABFDEA384DF98E0C011ABFBDF4203F17' has a wrong offset!");
static_assert(offsetof(FF_CameraParamsForRpc, FilterStrength_51_02DE38A247C50C0BBD74E68D6B21B990) == 0x0000A0, "Member 'FF_CameraParamsForRpc::FilterStrength_51_02DE38A247C50C0BBD74E68D6B21B990' has a wrong offset!");

}

