#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Character_MaterialEffectConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_Character_MaterialEffectConfig.F_Character_MaterialEffectConfig
// 0x0080 (0x0080 - 0x0000)
struct FF_Character_MaterialEffectConfig final
{
public:
	class FName                                   ParamName_3_5F62E248410EB67F37B62888C6C108D7;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UCurveFloat>             ParamCurve_7_497BCEC749255CF740AFDA9A0F5FF9E9;     // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UCurveFloat>             BlendOutCurve_10_9D277CCA41070BF426F5AD8017275C7A; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UCurveFloat>             RecoveryCurve_15_46E874AC414F0B6871FBA58CCCBED6D5; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_Character_MaterialEffectConfig) == 0x000008, "Wrong alignment on FF_Character_MaterialEffectConfig");
static_assert(sizeof(FF_Character_MaterialEffectConfig) == 0x000080, "Wrong size on FF_Character_MaterialEffectConfig");
static_assert(offsetof(FF_Character_MaterialEffectConfig, ParamName_3_5F62E248410EB67F37B62888C6C108D7) == 0x000000, "Member 'FF_Character_MaterialEffectConfig::ParamName_3_5F62E248410EB67F37B62888C6C108D7' has a wrong offset!");
static_assert(offsetof(FF_Character_MaterialEffectConfig, ParamCurve_7_497BCEC749255CF740AFDA9A0F5FF9E9) == 0x000008, "Member 'FF_Character_MaterialEffectConfig::ParamCurve_7_497BCEC749255CF740AFDA9A0F5FF9E9' has a wrong offset!");
static_assert(offsetof(FF_Character_MaterialEffectConfig, BlendOutCurve_10_9D277CCA41070BF426F5AD8017275C7A) == 0x000030, "Member 'FF_Character_MaterialEffectConfig::BlendOutCurve_10_9D277CCA41070BF426F5AD8017275C7A' has a wrong offset!");
static_assert(offsetof(FF_Character_MaterialEffectConfig, RecoveryCurve_15_46E874AC414F0B6871FBA58CCCBED6D5) == 0x000058, "Member 'FF_Character_MaterialEffectConfig::RecoveryCurve_15_46E874AC414F0B6871FBA58CCCBED6D5' has a wrong offset!");

}

