#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ControlAnimalConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_ControlAnimalConfig.F_ControlAnimalConfig
// 0x00E0 (0x00E0 - 0x0000)
struct FF_ControlAnimalConfig final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_29_D8D79E3842500E595FBE02AA7FC199D5;  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           IdleAnim_26_CAEA4C2843605E7318515D9391397BDA;      // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           MoveAnim_28_5028D7E2499398B770A2A28B870C4922;      // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UBlendSpace1D>           MoveBlendAnim_36_77841BAB40183D6EE835B082F0762D4B; // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            PerformMontage_32_304D5F824268B7CBC3D6FDAE1073517B; // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UBP_MovementAllConfigTemplate_C*        MovementConfig_8_91C8799A4DD376A386ED0AA6C435535F; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraBaseParamsData*                  CameraConfig_5_F2D62A2F43E5ABE90645D49FD9C6E373;   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MoveSpeed_39_D9E2B6A045C4C6C10A98E18154DB01D6;     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_ControlAnimalConfig) == 0x000008, "Wrong alignment on FF_ControlAnimalConfig");
static_assert(sizeof(FF_ControlAnimalConfig) == 0x0000E0, "Wrong size on FF_ControlAnimalConfig");
static_assert(offsetof(FF_ControlAnimalConfig, SkeletalMesh_29_D8D79E3842500E595FBE02AA7FC199D5) == 0x000000, "Member 'FF_ControlAnimalConfig::SkeletalMesh_29_D8D79E3842500E595FBE02AA7FC199D5' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, IdleAnim_26_CAEA4C2843605E7318515D9391397BDA) == 0x000028, "Member 'FF_ControlAnimalConfig::IdleAnim_26_CAEA4C2843605E7318515D9391397BDA' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, MoveAnim_28_5028D7E2499398B770A2A28B870C4922) == 0x000050, "Member 'FF_ControlAnimalConfig::MoveAnim_28_5028D7E2499398B770A2A28B870C4922' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, MoveBlendAnim_36_77841BAB40183D6EE835B082F0762D4B) == 0x000078, "Member 'FF_ControlAnimalConfig::MoveBlendAnim_36_77841BAB40183D6EE835B082F0762D4B' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, PerformMontage_32_304D5F824268B7CBC3D6FDAE1073517B) == 0x0000A0, "Member 'FF_ControlAnimalConfig::PerformMontage_32_304D5F824268B7CBC3D6FDAE1073517B' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, MovementConfig_8_91C8799A4DD376A386ED0AA6C435535F) == 0x0000C8, "Member 'FF_ControlAnimalConfig::MovementConfig_8_91C8799A4DD376A386ED0AA6C435535F' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, CameraConfig_5_F2D62A2F43E5ABE90645D49FD9C6E373) == 0x0000D0, "Member 'FF_ControlAnimalConfig::CameraConfig_5_F2D62A2F43E5ABE90645D49FD9C6E373' has a wrong offset!");
static_assert(offsetof(FF_ControlAnimalConfig, MoveSpeed_39_D9E2B6A045C4C6C10A98E18154DB01D6) == 0x0000D8, "Member 'FF_ControlAnimalConfig::MoveSpeed_39_D9E2B6A045C4C6C10A98E18154DB01D6' has a wrong offset!");

}

