#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_CorrectionAnim

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_CorrectionAnim.F_CorrectionAnim
// 0x00C8 (0x00C8 - 0x0000)
struct FF_CorrectionAnim final
{
public:
	TSoftObjectPtr<class UAnimMontage>            L90_11_784F260D4086A35B2D8964BB42ECE2EC;           // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            R90_12_2A9DD62245836BC9EB2FAB9D27C5525B;           // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            L180_13_F011189A44263D01C343F3B320EDEEB2;          // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            R180_14_634361A54D39FC17AAC2F9B1973FAD60;          // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Fwd_19_C96F392D49C42A0155A39EAA77E3E347;           // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_CorrectionAnim) == 0x000008, "Wrong alignment on FF_CorrectionAnim");
static_assert(sizeof(FF_CorrectionAnim) == 0x0000C8, "Wrong size on FF_CorrectionAnim");
static_assert(offsetof(FF_CorrectionAnim, L90_11_784F260D4086A35B2D8964BB42ECE2EC) == 0x000000, "Member 'FF_CorrectionAnim::L90_11_784F260D4086A35B2D8964BB42ECE2EC' has a wrong offset!");
static_assert(offsetof(FF_CorrectionAnim, R90_12_2A9DD62245836BC9EB2FAB9D27C5525B) == 0x000028, "Member 'FF_CorrectionAnim::R90_12_2A9DD62245836BC9EB2FAB9D27C5525B' has a wrong offset!");
static_assert(offsetof(FF_CorrectionAnim, L180_13_F011189A44263D01C343F3B320EDEEB2) == 0x000050, "Member 'FF_CorrectionAnim::L180_13_F011189A44263D01C343F3B320EDEEB2' has a wrong offset!");
static_assert(offsetof(FF_CorrectionAnim, R180_14_634361A54D39FC17AAC2F9B1973FAD60) == 0x000078, "Member 'FF_CorrectionAnim::R180_14_634361A54D39FC17AAC2F9B1973FAD60' has a wrong offset!");
static_assert(offsetof(FF_CorrectionAnim, Fwd_19_C96F392D49C42A0155A39EAA77E3E347) == 0x0000A0, "Member 'FF_CorrectionAnim::Fwd_19_C96F392D49C42A0155A39EAA77E3E347' has a wrong offset!");

}

