#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_DamageCommon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EFeedBackReason_structs.hpp"
#include "EDamagePerformanceType_structs.hpp"
#include "EHitDisMoveType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_DamageCommon.F_DamageCommon
// 0x00A0 (0x00A0 - 0x0000)
struct FF_DamageCommon final
{
public:
	int32                                         BaseValue_5_2F6DBECA4F3E4C64A1128B8930D36578;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePerformanceType                        Performance_8_BCF98EEF4A161CFE5D57678B530DB015;    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFeedBackReason                               FeedBackReason_11_E2BC8BD14C64D29996C7D686792518D3; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   camera_shake_14_CC6733F143B030AFAB2B019A199EE327;  // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          controller_shake_17_A55B92164E9E9A7B7776DD8334E74455; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        slomo_duration_20_33736FE74551A34161EC82AAE717F44F; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        slomo_ratio_22_24AB602745C868CB82FA30B3AA888EAC;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 HitNSKey_25_E80D3CCF4F15BB22D69F38A5C3E6B37E;      // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HitSoundKey_27_FD0D41E8468762FF13D6998BDA8C7A17;   // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        HitDistance_30_7B82FC6944B3AD8CCAA4B181E7DE813F;   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitHeight_34_D1247FFF43E1F3096C1FD5AE419CBB2D;     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitDuration_36_8F070933465F6F4FD44AB9B4178FF5AA;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 HitCurveVectorKey_39_07E7A3664CC02D707B198FA17A74AA6B; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          HitOpenLandFinish_42_0688599D4666D9AD485B19913528DFD2; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHitDisMoveType                               HitMoveType_45_E19F4E174FE2153E715020A272C18DB9;   // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           HitBackTag_57_0A4CFD0B41F496F7C5023588D3DED52F;    // 0x0094(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForceBack_48_A332D8E04686917108A406A741F4CCAB;   // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsApplyNoDoDamage_50_C379025442167AD8B78F6EA4434D1371; // 0x009D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsApplyExecute_52_12E059274C3372E3A0A52496DF04E7A3; // 0x009E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_DamageCommon) == 0x000008, "Wrong alignment on FF_DamageCommon");
static_assert(sizeof(FF_DamageCommon) == 0x0000A0, "Wrong size on FF_DamageCommon");
static_assert(offsetof(FF_DamageCommon, BaseValue_5_2F6DBECA4F3E4C64A1128B8930D36578) == 0x000000, "Member 'FF_DamageCommon::BaseValue_5_2F6DBECA4F3E4C64A1128B8930D36578' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, Performance_8_BCF98EEF4A161CFE5D57678B530DB015) == 0x000004, "Member 'FF_DamageCommon::Performance_8_BCF98EEF4A161CFE5D57678B530DB015' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, FeedBackReason_11_E2BC8BD14C64D29996C7D686792518D3) == 0x000005, "Member 'FF_DamageCommon::FeedBackReason_11_E2BC8BD14C64D29996C7D686792518D3' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, camera_shake_14_CC6733F143B030AFAB2B019A199EE327) == 0x000008, "Member 'FF_DamageCommon::camera_shake_14_CC6733F143B030AFAB2B019A199EE327' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, controller_shake_17_A55B92164E9E9A7B7776DD8334E74455) == 0x000030, "Member 'FF_DamageCommon::controller_shake_17_A55B92164E9E9A7B7776DD8334E74455' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, slomo_duration_20_33736FE74551A34161EC82AAE717F44F) == 0x000038, "Member 'FF_DamageCommon::slomo_duration_20_33736FE74551A34161EC82AAE717F44F' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, slomo_ratio_22_24AB602745C868CB82FA30B3AA888EAC) == 0x000040, "Member 'FF_DamageCommon::slomo_ratio_22_24AB602745C868CB82FA30B3AA888EAC' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitNSKey_25_E80D3CCF4F15BB22D69F38A5C3E6B37E) == 0x000048, "Member 'FF_DamageCommon::HitNSKey_25_E80D3CCF4F15BB22D69F38A5C3E6B37E' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitSoundKey_27_FD0D41E8468762FF13D6998BDA8C7A17) == 0x000058, "Member 'FF_DamageCommon::HitSoundKey_27_FD0D41E8468762FF13D6998BDA8C7A17' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitDistance_30_7B82FC6944B3AD8CCAA4B181E7DE813F) == 0x000068, "Member 'FF_DamageCommon::HitDistance_30_7B82FC6944B3AD8CCAA4B181E7DE813F' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitHeight_34_D1247FFF43E1F3096C1FD5AE419CBB2D) == 0x000070, "Member 'FF_DamageCommon::HitHeight_34_D1247FFF43E1F3096C1FD5AE419CBB2D' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitDuration_36_8F070933465F6F4FD44AB9B4178FF5AA) == 0x000078, "Member 'FF_DamageCommon::HitDuration_36_8F070933465F6F4FD44AB9B4178FF5AA' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitCurveVectorKey_39_07E7A3664CC02D707B198FA17A74AA6B) == 0x000080, "Member 'FF_DamageCommon::HitCurveVectorKey_39_07E7A3664CC02D707B198FA17A74AA6B' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitOpenLandFinish_42_0688599D4666D9AD485B19913528DFD2) == 0x000090, "Member 'FF_DamageCommon::HitOpenLandFinish_42_0688599D4666D9AD485B19913528DFD2' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitMoveType_45_E19F4E174FE2153E715020A272C18DB9) == 0x000091, "Member 'FF_DamageCommon::HitMoveType_45_E19F4E174FE2153E715020A272C18DB9' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, HitBackTag_57_0A4CFD0B41F496F7C5023588D3DED52F) == 0x000094, "Member 'FF_DamageCommon::HitBackTag_57_0A4CFD0B41F496F7C5023588D3DED52F' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, IsForceBack_48_A332D8E04686917108A406A741F4CCAB) == 0x00009C, "Member 'FF_DamageCommon::IsForceBack_48_A332D8E04686917108A406A741F4CCAB' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, IsApplyNoDoDamage_50_C379025442167AD8B78F6EA4434D1371) == 0x00009D, "Member 'FF_DamageCommon::IsApplyNoDoDamage_50_C379025442167AD8B78F6EA4434D1371' has a wrong offset!");
static_assert(offsetof(FF_DamageCommon, IsApplyExecute_52_12E059274C3372E3A0A52496DF04E7A3) == 0x00009E, "Member 'FF_DamageCommon::IsApplyExecute_52_12E059274C3372E3A0A52496DF04E7A3' has a wrong offset!");

}

