#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_DeathConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_DeathConfig.F_DeathConfig
// 0x0050 (0x0050 - 0x0000)
struct FF_DeathConfig final
{
public:
	class UAnimMontage*                           Idle_26_0CF5EECA493E809075B97FABFEAE50B8;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Front_18_3A9E40F146045FA9234C3F874D7105BC;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Back_19_2305A6324EA9FF45B35232A06DF3585E;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Left_20_0983D29249F9D0715CC3BDA610993805;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Right_21_26507AD041401DA042B1E1930BFF4059;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOpenDeathFly_1_192D5A744E31EA6A4CD26EBD03447550; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LaunchVelocityXY_15_2C29BC4345125D68FB4223B6BA1AD345; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LaunchVelocityZ_17_2481C3F749FFE3E782E233BB12F8E21C; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenDeathIdle_28_EE5F692046FBBACC5A3C33A71634AE47; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayCloseCollision_29_B6B5A2DC4613A5CA12DDFEB8CB463BD7; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_DeathConfig) == 0x000008, "Wrong alignment on FF_DeathConfig");
static_assert(sizeof(FF_DeathConfig) == 0x000050, "Wrong size on FF_DeathConfig");
static_assert(offsetof(FF_DeathConfig, Idle_26_0CF5EECA493E809075B97FABFEAE50B8) == 0x000000, "Member 'FF_DeathConfig::Idle_26_0CF5EECA493E809075B97FABFEAE50B8' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, Front_18_3A9E40F146045FA9234C3F874D7105BC) == 0x000008, "Member 'FF_DeathConfig::Front_18_3A9E40F146045FA9234C3F874D7105BC' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, Back_19_2305A6324EA9FF45B35232A06DF3585E) == 0x000010, "Member 'FF_DeathConfig::Back_19_2305A6324EA9FF45B35232A06DF3585E' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, Left_20_0983D29249F9D0715CC3BDA610993805) == 0x000018, "Member 'FF_DeathConfig::Left_20_0983D29249F9D0715CC3BDA610993805' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, Right_21_26507AD041401DA042B1E1930BFF4059) == 0x000020, "Member 'FF_DeathConfig::Right_21_26507AD041401DA042B1E1930BFF4059' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, IsOpenDeathFly_1_192D5A744E31EA6A4CD26EBD03447550) == 0x000028, "Member 'FF_DeathConfig::IsOpenDeathFly_1_192D5A744E31EA6A4CD26EBD03447550' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, LaunchVelocityXY_15_2C29BC4345125D68FB4223B6BA1AD345) == 0x000030, "Member 'FF_DeathConfig::LaunchVelocityXY_15_2C29BC4345125D68FB4223B6BA1AD345' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, LaunchVelocityZ_17_2481C3F749FFE3E782E233BB12F8E21C) == 0x000038, "Member 'FF_DeathConfig::LaunchVelocityZ_17_2481C3F749FFE3E782E233BB12F8E21C' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, OpenDeathIdle_28_EE5F692046FBBACC5A3C33A71634AE47) == 0x000040, "Member 'FF_DeathConfig::OpenDeathIdle_28_EE5F692046FBBACC5A3C33A71634AE47' has a wrong offset!");
static_assert(offsetof(FF_DeathConfig, DelayCloseCollision_29_B6B5A2DC4613A5CA12DDFEB8CB463BD7) == 0x000048, "Member 'FF_DeathConfig::DelayCloseCollision_29_B6B5A2DC4613A5CA12DDFEB8CB463BD7' has a wrong offset!");

}

