#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_DeathReason

#include "Basic.hpp"

#include "EFeedBackReason_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_DeathReason.F_DeathReason
// 0x0028 (0x0028 - 0x0000)
struct FF_DeathReason final
{
public:
	EFeedBackReason                               Placeholder_17_E4B5FE7D4A04F35FDD83F7B62B122453;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DeathTypeName_13_228841DC4DA94F1A18771C87DEE5A321; // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           DeathTipsArray_12_F8FFAAFF4172D957A71FB995FAEEAB17; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_DeathReason) == 0x000008, "Wrong alignment on FF_DeathReason");
static_assert(sizeof(FF_DeathReason) == 0x000028, "Wrong size on FF_DeathReason");
static_assert(offsetof(FF_DeathReason, Placeholder_17_E4B5FE7D4A04F35FDD83F7B62B122453) == 0x000000, "Member 'FF_DeathReason::Placeholder_17_E4B5FE7D4A04F35FDD83F7B62B122453' has a wrong offset!");
static_assert(offsetof(FF_DeathReason, DeathTypeName_13_228841DC4DA94F1A18771C87DEE5A321) == 0x000008, "Member 'FF_DeathReason::DeathTypeName_13_228841DC4DA94F1A18771C87DEE5A321' has a wrong offset!");
static_assert(offsetof(FF_DeathReason, DeathTipsArray_12_F8FFAAFF4172D957A71FB995FAEEAB17) == 0x000018, "Member 'FF_DeathReason::DeathTipsArray_12_F8FFAAFF4172D957A71FB995FAEEAB17' has a wrong offset!");

}

