#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_FloatingJump_CT_Float

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_FloatingJump_CT_Float.F_FloatingJump_CT_Float
// 0x0060 (0x0060 - 0x0000)
struct FF_FloatingJump_CT_Float final
{
public:
	double                                        DurationOfEnteringFloat_43_766C3834426D979AD6F16BA5873E9EB9; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinimumHeightOfEnteringFloat_47_4C24AFBB49A011FDEB5D47A2B959F922; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloatGravity_15_DA1044EF46893110277FF09646A85917;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloatBrakingDecelerationFalling_16_7D3C40904EA47ED034E169A4AD75B27E; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloatFallinglateralFriction_17_A8F9577C4016D69C1C56FD8226CD0C33; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloatAirControl_38_CCCA7D014EA8D461A87CDCAB15392FA2; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FloatRotationActorInterpSpeed_52_B90249CA44CD13F9998671BC06DAE384; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        FloatRotationTargetInterpSpeed_53_AA4A64E6410C4375F36B958EDCBA1952; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHorizontalFloatSpeed_33_A568B6C3418DEFB23B2A1A91EE27D05B; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutomaticallyFloatWhenReachingApex_55_9A4E75FD4E513E92EF1E64BEE9584053; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveOfPassiveWayToTriggerFloating_37_124214DB4E2250D5444E4FB3BC7734F8; // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FloatDuration_35_93EA09BA431CCA13B2BEDEA5F373846D; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FloatInterpDuration_32_A518C9F94FC28330A6F73B981A415F1D; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_FloatingJump_CT_Float) == 0x000008, "Wrong alignment on FF_FloatingJump_CT_Float");
static_assert(sizeof(FF_FloatingJump_CT_Float) == 0x000060, "Wrong size on FF_FloatingJump_CT_Float");
static_assert(offsetof(FF_FloatingJump_CT_Float, DurationOfEnteringFloat_43_766C3834426D979AD6F16BA5873E9EB9) == 0x000000, "Member 'FF_FloatingJump_CT_Float::DurationOfEnteringFloat_43_766C3834426D979AD6F16BA5873E9EB9' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, MinimumHeightOfEnteringFloat_47_4C24AFBB49A011FDEB5D47A2B959F922) == 0x000008, "Member 'FF_FloatingJump_CT_Float::MinimumHeightOfEnteringFloat_47_4C24AFBB49A011FDEB5D47A2B959F922' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatGravity_15_DA1044EF46893110277FF09646A85917) == 0x000010, "Member 'FF_FloatingJump_CT_Float::FloatGravity_15_DA1044EF46893110277FF09646A85917' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatBrakingDecelerationFalling_16_7D3C40904EA47ED034E169A4AD75B27E) == 0x000018, "Member 'FF_FloatingJump_CT_Float::FloatBrakingDecelerationFalling_16_7D3C40904EA47ED034E169A4AD75B27E' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatFallinglateralFriction_17_A8F9577C4016D69C1C56FD8226CD0C33) == 0x000020, "Member 'FF_FloatingJump_CT_Float::FloatFallinglateralFriction_17_A8F9577C4016D69C1C56FD8226CD0C33' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatAirControl_38_CCCA7D014EA8D461A87CDCAB15392FA2) == 0x000028, "Member 'FF_FloatingJump_CT_Float::FloatAirControl_38_CCCA7D014EA8D461A87CDCAB15392FA2' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatRotationActorInterpSpeed_52_B90249CA44CD13F9998671BC06DAE384) == 0x000030, "Member 'FF_FloatingJump_CT_Float::FloatRotationActorInterpSpeed_52_B90249CA44CD13F9998671BC06DAE384' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatRotationTargetInterpSpeed_53_AA4A64E6410C4375F36B958EDCBA1952) == 0x000038, "Member 'FF_FloatingJump_CT_Float::FloatRotationTargetInterpSpeed_53_AA4A64E6410C4375F36B958EDCBA1952' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, MaxHorizontalFloatSpeed_33_A568B6C3418DEFB23B2A1A91EE27D05B) == 0x000040, "Member 'FF_FloatingJump_CT_Float::MaxHorizontalFloatSpeed_33_A568B6C3418DEFB23B2A1A91EE27D05B' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, AutomaticallyFloatWhenReachingApex_55_9A4E75FD4E513E92EF1E64BEE9584053) == 0x000048, "Member 'FF_FloatingJump_CT_Float::AutomaticallyFloatWhenReachingApex_55_9A4E75FD4E513E92EF1E64BEE9584053' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, ActiveOfPassiveWayToTriggerFloating_37_124214DB4E2250D5444E4FB3BC7734F8) == 0x000049, "Member 'FF_FloatingJump_CT_Float::ActiveOfPassiveWayToTriggerFloating_37_124214DB4E2250D5444E4FB3BC7734F8' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatDuration_35_93EA09BA431CCA13B2BEDEA5F373846D) == 0x000050, "Member 'FF_FloatingJump_CT_Float::FloatDuration_35_93EA09BA431CCA13B2BEDEA5F373846D' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Float, FloatInterpDuration_32_A518C9F94FC28330A6F73B981A415F1D) == 0x000058, "Member 'FF_FloatingJump_CT_Float::FloatInterpDuration_32_A518C9F94FC28330A6F73B981A415F1D' has a wrong offset!");

}

