#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_FloatingJump_CT_Fall

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_FloatingJump_CT_Fall.F_FloatingJump_CT_Fall
// 0x0048 (0x0048 - 0x0000)
struct FF_FloatingJump_CT_Fall final
{
public:
	double                                        FallGravity_20_0B68323047F8627CC47434AAFFA938B1;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallBrakingDecelerationFalling_21_44DF1DF343128763DFA4A78857CC280A; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallFallinglateralFriction_28_F909FA794C11CA8E84200EB54D81999F; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallAirControl_22_358EC27145BC6FC73F680E83F8BEA6A3; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FallRotationActorInterpSpeed_36_F8A4C26A4C363BCAA875D38EB5932A6C; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        FallRotationTargetInterpSpeed_39_5665CF2647BC9F78F97ECA9BA81E81C7; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableReleaseToFall_33_5E9C8A63444B9E46A7068DA12BAEDBB2; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReleaseToFall_ZAxisBrakingDeceleartion_31_5308FDD84749974BECBC07A85E20576D; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReleaseToFall_Gravity_43_5417F6594BD534949F5E51A56AF5BEE8; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_FloatingJump_CT_Fall) == 0x000008, "Wrong alignment on FF_FloatingJump_CT_Fall");
static_assert(sizeof(FF_FloatingJump_CT_Fall) == 0x000048, "Wrong size on FF_FloatingJump_CT_Fall");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallGravity_20_0B68323047F8627CC47434AAFFA938B1) == 0x000000, "Member 'FF_FloatingJump_CT_Fall::FallGravity_20_0B68323047F8627CC47434AAFFA938B1' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallBrakingDecelerationFalling_21_44DF1DF343128763DFA4A78857CC280A) == 0x000008, "Member 'FF_FloatingJump_CT_Fall::FallBrakingDecelerationFalling_21_44DF1DF343128763DFA4A78857CC280A' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallFallinglateralFriction_28_F909FA794C11CA8E84200EB54D81999F) == 0x000010, "Member 'FF_FloatingJump_CT_Fall::FallFallinglateralFriction_28_F909FA794C11CA8E84200EB54D81999F' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallAirControl_22_358EC27145BC6FC73F680E83F8BEA6A3) == 0x000018, "Member 'FF_FloatingJump_CT_Fall::FallAirControl_22_358EC27145BC6FC73F680E83F8BEA6A3' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallRotationActorInterpSpeed_36_F8A4C26A4C363BCAA875D38EB5932A6C) == 0x000020, "Member 'FF_FloatingJump_CT_Fall::FallRotationActorInterpSpeed_36_F8A4C26A4C363BCAA875D38EB5932A6C' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, FallRotationTargetInterpSpeed_39_5665CF2647BC9F78F97ECA9BA81E81C7) == 0x000028, "Member 'FF_FloatingJump_CT_Fall::FallRotationTargetInterpSpeed_39_5665CF2647BC9F78F97ECA9BA81E81C7' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, EnableReleaseToFall_33_5E9C8A63444B9E46A7068DA12BAEDBB2) == 0x000030, "Member 'FF_FloatingJump_CT_Fall::EnableReleaseToFall_33_5E9C8A63444B9E46A7068DA12BAEDBB2' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, ReleaseToFall_ZAxisBrakingDeceleartion_31_5308FDD84749974BECBC07A85E20576D) == 0x000038, "Member 'FF_FloatingJump_CT_Fall::ReleaseToFall_ZAxisBrakingDeceleartion_31_5308FDD84749974BECBC07A85E20576D' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Fall, ReleaseToFall_Gravity_43_5417F6594BD534949F5E51A56AF5BEE8) == 0x000040, "Member 'FF_FloatingJump_CT_Fall::ReleaseToFall_Gravity_43_5417F6594BD534949F5E51A56AF5BEE8' has a wrong offset!");

}

