#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_FloatingJump_CT_Jump

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_FloatingJump_CT_Jump.F_FloatingJump_CT_Jump
// 0x0048 (0x0048 - 0x0000)
struct FF_FloatingJump_CT_Jump final
{
public:
	double                                        JumpGravity_17_98D52CE3489F526C96F078BF1E6AB3C4;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            JumpZVelocityCurve_19_0B68323047F8627CC47434AAFFA938B1; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        JumpBrakingDecelerationFalling_12_44DF1DF343128763DFA4A78857CC280A; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpFallinglateralFriction_15_40690A0C4EB3C7C0A4D260A360BCB30D; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpAirControl_13_358EC27145BC6FC73F680E83F8BEA6A3; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            JumpRotationActorInterpSpeed_31_61E984E849533368965BA38AD4677DFF; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        JumpRotationTargetInterpSpeed_33_4F271C2D4777A9A002EDDA9491E13E64; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpMinimumHeightToBeChecked_25_1A7D957040D6438D8AA29D9BCB88F9DC; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpDelayTime_36_D06DE0F44D22F393674559B6CCE38302; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_FloatingJump_CT_Jump) == 0x000008, "Wrong alignment on FF_FloatingJump_CT_Jump");
static_assert(sizeof(FF_FloatingJump_CT_Jump) == 0x000048, "Wrong size on FF_FloatingJump_CT_Jump");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpGravity_17_98D52CE3489F526C96F078BF1E6AB3C4) == 0x000000, "Member 'FF_FloatingJump_CT_Jump::JumpGravity_17_98D52CE3489F526C96F078BF1E6AB3C4' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpZVelocityCurve_19_0B68323047F8627CC47434AAFFA938B1) == 0x000008, "Member 'FF_FloatingJump_CT_Jump::JumpZVelocityCurve_19_0B68323047F8627CC47434AAFFA938B1' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpBrakingDecelerationFalling_12_44DF1DF343128763DFA4A78857CC280A) == 0x000010, "Member 'FF_FloatingJump_CT_Jump::JumpBrakingDecelerationFalling_12_44DF1DF343128763DFA4A78857CC280A' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpFallinglateralFriction_15_40690A0C4EB3C7C0A4D260A360BCB30D) == 0x000018, "Member 'FF_FloatingJump_CT_Jump::JumpFallinglateralFriction_15_40690A0C4EB3C7C0A4D260A360BCB30D' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpAirControl_13_358EC27145BC6FC73F680E83F8BEA6A3) == 0x000020, "Member 'FF_FloatingJump_CT_Jump::JumpAirControl_13_358EC27145BC6FC73F680E83F8BEA6A3' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpRotationActorInterpSpeed_31_61E984E849533368965BA38AD4677DFF) == 0x000028, "Member 'FF_FloatingJump_CT_Jump::JumpRotationActorInterpSpeed_31_61E984E849533368965BA38AD4677DFF' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpRotationTargetInterpSpeed_33_4F271C2D4777A9A002EDDA9491E13E64) == 0x000030, "Member 'FF_FloatingJump_CT_Jump::JumpRotationTargetInterpSpeed_33_4F271C2D4777A9A002EDDA9491E13E64' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpMinimumHeightToBeChecked_25_1A7D957040D6438D8AA29D9BCB88F9DC) == 0x000038, "Member 'FF_FloatingJump_CT_Jump::JumpMinimumHeightToBeChecked_25_1A7D957040D6438D8AA29D9BCB88F9DC' has a wrong offset!");
static_assert(offsetof(FF_FloatingJump_CT_Jump, JumpDelayTime_36_D06DE0F44D22F393674559B6CCE38302) == 0x000040, "Member 'FF_FloatingJump_CT_Jump::JumpDelayTime_36_D06DE0F44D22F393674559B6CCE38302' has a wrong offset!");

}

