#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_GetWoolenHeartPerformanceInfo

#include "Basic.hpp"

#include "EWoolenHeartEMVersion_structs.hpp"
#include "F_SharedWoolenHeartConfig_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_GetWoolenHeartPerformanceInfo.F_GetWoolenHeartPerformanceInfo
// 0x0100 (0x0100 - 0x0000)
struct FF_GetWoolenHeartPerformanceInfo final
{
public:
	class ULevelSequence*                         LS_6_D77D959948C589BE412FC38D980B938C;             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          WoolenHeartMesh_20_2199D6FE4C612CAFF2F21B91FBD0C783; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      WoolenHeartAnim_24_4C14871A482090610E9032B2B8F368FB; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PlayerAM_14_F400DC6940B8C0799C78F19D64A158FA;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class AActor*>              BindingTag2Actor_40_771C0D52494BE18A67D16A8DDE08399C; // 0x0020(0x0050)(Edit, BlueprintVisible)
	EWoolenHeartEMVersion                         EMVersion_17_C8DD91D74340D914E0EDFD9B0162A022;     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             PlayerToShare_29_11708A7847EDF0F6B61983AD49A8F38C; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int64                                         WoolenHeartEntiyID_32_751E539340176AA085D587936E58C173; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPhantom_34_8DB563E34A1E4F55BF2663A4A4315815;      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UMaterialInterface*>  SKMeshPhantomMaterials_39_31C272F340C38489B626E8988420DE83; // 0x0090(0x0050)(Edit, BlueprintVisible)
	class UStaticMesh*                            SharedWoolenHeartMesh_43_FCC75B704D760AD13A512BADDCA9B907; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_SharedWoolenHeartConfig             SharedWoolenHeartConfig_46_B30CAA19477F0C2A6C98AEA3A332B2F8; // 0x00E8(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_GetWoolenHeartPerformanceInfo) == 0x000008, "Wrong alignment on FF_GetWoolenHeartPerformanceInfo");
static_assert(sizeof(FF_GetWoolenHeartPerformanceInfo) == 0x000100, "Wrong size on FF_GetWoolenHeartPerformanceInfo");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, LS_6_D77D959948C589BE412FC38D980B938C) == 0x000000, "Member 'FF_GetWoolenHeartPerformanceInfo::LS_6_D77D959948C589BE412FC38D980B938C' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, WoolenHeartMesh_20_2199D6FE4C612CAFF2F21B91FBD0C783) == 0x000008, "Member 'FF_GetWoolenHeartPerformanceInfo::WoolenHeartMesh_20_2199D6FE4C612CAFF2F21B91FBD0C783' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, WoolenHeartAnim_24_4C14871A482090610E9032B2B8F368FB) == 0x000010, "Member 'FF_GetWoolenHeartPerformanceInfo::WoolenHeartAnim_24_4C14871A482090610E9032B2B8F368FB' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, PlayerAM_14_F400DC6940B8C0799C78F19D64A158FA) == 0x000018, "Member 'FF_GetWoolenHeartPerformanceInfo::PlayerAM_14_F400DC6940B8C0799C78F19D64A158FA' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, BindingTag2Actor_40_771C0D52494BE18A67D16A8DDE08399C) == 0x000020, "Member 'FF_GetWoolenHeartPerformanceInfo::BindingTag2Actor_40_771C0D52494BE18A67D16A8DDE08399C' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, EMVersion_17_C8DD91D74340D914E0EDFD9B0162A022) == 0x000070, "Member 'FF_GetWoolenHeartPerformanceInfo::EMVersion_17_C8DD91D74340D914E0EDFD9B0162A022' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, PlayerToShare_29_11708A7847EDF0F6B61983AD49A8F38C) == 0x000078, "Member 'FF_GetWoolenHeartPerformanceInfo::PlayerToShare_29_11708A7847EDF0F6B61983AD49A8F38C' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, WoolenHeartEntiyID_32_751E539340176AA085D587936E58C173) == 0x000080, "Member 'FF_GetWoolenHeartPerformanceInfo::WoolenHeartEntiyID_32_751E539340176AA085D587936E58C173' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, bPhantom_34_8DB563E34A1E4F55BF2663A4A4315815) == 0x000088, "Member 'FF_GetWoolenHeartPerformanceInfo::bPhantom_34_8DB563E34A1E4F55BF2663A4A4315815' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, SKMeshPhantomMaterials_39_31C272F340C38489B626E8988420DE83) == 0x000090, "Member 'FF_GetWoolenHeartPerformanceInfo::SKMeshPhantomMaterials_39_31C272F340C38489B626E8988420DE83' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, SharedWoolenHeartMesh_43_FCC75B704D760AD13A512BADDCA9B907) == 0x0000E0, "Member 'FF_GetWoolenHeartPerformanceInfo::SharedWoolenHeartMesh_43_FCC75B704D760AD13A512BADDCA9B907' has a wrong offset!");
static_assert(offsetof(FF_GetWoolenHeartPerformanceInfo, SharedWoolenHeartConfig_46_B30CAA19477F0C2A6C98AEA3A332B2F8) == 0x0000E8, "Member 'FF_GetWoolenHeartPerformanceInfo::SharedWoolenHeartConfig_46_B30CAA19477F0C2A6C98AEA3A332B2F8' has a wrong offset!");

}

