#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_GroceryNPCInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_GroceryNPCInfo.F_GroceryNPCInfo
// 0x0060 (0x0060 - 0x0000)
struct FF_GroceryNPCInfo final
{
public:
	int32                                         NPCID_25_A843DC5F42186CEADD5D4EBC5738D71D;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NPCVersion_29_35D5CB024E577CC9E102048D837B98EF;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_4_64A8BF4944D2C76C51991984DF3895EA;       // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_12_E4034B1B466C478E994EF2861DE305D0;      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        FocalLength_13_15D0C6E3472C7BFA81C99DA5A17C5388;   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NPCRotation_16_8A28F89243F3D7205D30ADA7423BD7EF;   // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseRelativeLocation_22_49ED25DC4A83B6FBEE5CC29B9E59DDD5; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_GroceryNPCInfo) == 0x000008, "Wrong alignment on FF_GroceryNPCInfo");
static_assert(sizeof(FF_GroceryNPCInfo) == 0x000060, "Wrong size on FF_GroceryNPCInfo");
static_assert(offsetof(FF_GroceryNPCInfo, NPCID_25_A843DC5F42186CEADD5D4EBC5738D71D) == 0x000000, "Member 'FF_GroceryNPCInfo::NPCID_25_A843DC5F42186CEADD5D4EBC5738D71D' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, NPCVersion_29_35D5CB024E577CC9E102048D837B98EF) == 0x000004, "Member 'FF_GroceryNPCInfo::NPCVersion_29_35D5CB024E577CC9E102048D837B98EF' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, Location_4_64A8BF4944D2C76C51991984DF3895EA) == 0x000008, "Member 'FF_GroceryNPCInfo::Location_4_64A8BF4944D2C76C51991984DF3895EA' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, Rotation_12_E4034B1B466C478E994EF2861DE305D0) == 0x000020, "Member 'FF_GroceryNPCInfo::Rotation_12_E4034B1B466C478E994EF2861DE305D0' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, FocalLength_13_15D0C6E3472C7BFA81C99DA5A17C5388) == 0x000038, "Member 'FF_GroceryNPCInfo::FocalLength_13_15D0C6E3472C7BFA81C99DA5A17C5388' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, NPCRotation_16_8A28F89243F3D7205D30ADA7423BD7EF) == 0x000040, "Member 'FF_GroceryNPCInfo::NPCRotation_16_8A28F89243F3D7205D30ADA7423BD7EF' has a wrong offset!");
static_assert(offsetof(FF_GroceryNPCInfo, UseRelativeLocation_22_49ED25DC4A83B6FBEE5CC29B9E59DDD5) == 0x000058, "Member 'FF_GroceryNPCInfo::UseRelativeLocation_22_49ED25DC4A83B6FBEE5CC29B9E59DDD5' has a wrong offset!");

}

