#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HitActionSet

#include "Basic.hpp"

#include "EHitActionType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_HitActionSet.F_HitActionSet
// 0x0028 (0x0028 - 0x0000)
struct FF_HitActionSet final
{
public:
	EHitActionType                                HitType_21_3D6123F4473CD4CB2C671EB14B6A807A;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Front_10_E3DCA1B245512B89D07CC5964441053D;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Back_14_8AB7541B4646B9C15F73D4A02A4EFC48;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Left_15_2D0D4630499CD4CB7D01C7ACFC00E88A;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Right_16_C23A368F4D1070D00EACBAB8870B6B69;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HitActionSet) == 0x000008, "Wrong alignment on FF_HitActionSet");
static_assert(sizeof(FF_HitActionSet) == 0x000028, "Wrong size on FF_HitActionSet");
static_assert(offsetof(FF_HitActionSet, HitType_21_3D6123F4473CD4CB2C671EB14B6A807A) == 0x000000, "Member 'FF_HitActionSet::HitType_21_3D6123F4473CD4CB2C671EB14B6A807A' has a wrong offset!");
static_assert(offsetof(FF_HitActionSet, Front_10_E3DCA1B245512B89D07CC5964441053D) == 0x000008, "Member 'FF_HitActionSet::Front_10_E3DCA1B245512B89D07CC5964441053D' has a wrong offset!");
static_assert(offsetof(FF_HitActionSet, Back_14_8AB7541B4646B9C15F73D4A02A4EFC48) == 0x000010, "Member 'FF_HitActionSet::Back_14_8AB7541B4646B9C15F73D4A02A4EFC48' has a wrong offset!");
static_assert(offsetof(FF_HitActionSet, Left_15_2D0D4630499CD4CB7D01C7ACFC00E88A) == 0x000018, "Member 'FF_HitActionSet::Left_15_2D0D4630499CD4CB7D01C7ACFC00E88A' has a wrong offset!");
static_assert(offsetof(FF_HitActionSet, Right_16_C23A368F4D1070D00EACBAB8870B6B69) == 0x000020, "Member 'FF_HitActionSet::Right_16_C23A368F4D1070D00EACBAB8870B6B69' has a wrong offset!");

}

