#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HitMainBodySet

#include "Basic.hpp"

#include "F_HitActionSet_structs.hpp"
#include "F_HitBackActionSet_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_HitMainBodySet.F_HitMainBodySet
// 0x0078 (0x0078 - 0x0000)
struct FF_HitMainBodySet final
{
public:
	struct FF_HitActionSet                        Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A;        // 0x0000(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FF_HitActionSet                        Heavy_47_58AA5946483203E27EB3E8A3DD3E9712;         // 0x0028(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FF_HitBackActionSet                    Back_56_4AF14C10470706EECAF539B504382CC3;          // 0x0050(0x0028)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HitMainBodySet) == 0x000008, "Wrong alignment on FF_HitMainBodySet");
static_assert(sizeof(FF_HitMainBodySet) == 0x000078, "Wrong size on FF_HitMainBodySet");
static_assert(offsetof(FF_HitMainBodySet, Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A) == 0x000000, "Member 'FF_HitMainBodySet::Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A' has a wrong offset!");
static_assert(offsetof(FF_HitMainBodySet, Heavy_47_58AA5946483203E27EB3E8A3DD3E9712) == 0x000028, "Member 'FF_HitMainBodySet::Heavy_47_58AA5946483203E27EB3E8A3DD3E9712' has a wrong offset!");
static_assert(offsetof(FF_HitMainBodySet, Back_56_4AF14C10470706EECAF539B504382CC3) == 0x000050, "Member 'FF_HitMainBodySet::Back_56_4AF14C10470706EECAF539B504382CC3' has a wrong offset!");

}

