#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HitOtherPartsSet

#include "Basic.hpp"

#include "F_HitActionSet_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_HitOtherPartsSet.F_HitOtherPartsSet
// 0x0088 (0x0088 - 0x0000)
struct FF_HitOtherPartsSet final
{
public:
	class FString                                 PartName_3_27790ADA457D41BCA7B452B0F4BDFFAF;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FF_HitActionSet                        Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A;        // 0x0010(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FF_HitActionSet                        Heavy_47_58AA5946483203E27EB3E8A3DD3E9712;         // 0x0038(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FF_HitActionSet                        Back_48_04E3979E4DC49AAB4995A99EC0BE1A1B;          // 0x0060(0x0028)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HitOtherPartsSet) == 0x000008, "Wrong alignment on FF_HitOtherPartsSet");
static_assert(sizeof(FF_HitOtherPartsSet) == 0x000088, "Wrong size on FF_HitOtherPartsSet");
static_assert(offsetof(FF_HitOtherPartsSet, PartName_3_27790ADA457D41BCA7B452B0F4BDFFAF) == 0x000000, "Member 'FF_HitOtherPartsSet::PartName_3_27790ADA457D41BCA7B452B0F4BDFFAF' has a wrong offset!");
static_assert(offsetof(FF_HitOtherPartsSet, Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A) == 0x000010, "Member 'FF_HitOtherPartsSet::Slight_40_E3FC3B3E4DC1058E103B7E82E34B530A' has a wrong offset!");
static_assert(offsetof(FF_HitOtherPartsSet, Heavy_47_58AA5946483203E27EB3E8A3DD3E9712) == 0x000038, "Member 'FF_HitOtherPartsSet::Heavy_47_58AA5946483203E27EB3E8A3DD3E9712' has a wrong offset!");
static_assert(offsetof(FF_HitOtherPartsSet, Back_48_04E3979E4DC49AAB4995A99EC0BE1A1B) == 0x000060, "Member 'FF_HitOtherPartsSet::Back_48_04E3979E4DC49AAB4995A99EC0BE1A1B' has a wrong offset!");

}

