#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HitAKResSet

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_HitAKResSet.F_HitAKResSet
// 0x0028 (0x0028 - 0x0000)
struct FF_HitAKResSet final
{
public:
	class FString                                 ResKey_6_320D97E048D6E9DF29E2D68E3F9E5C43;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AKRes_7_F060A79F4F13667A136A12A584B964EF;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Dec_9_6D701CB0438F922CBD9BE1889541F781;            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HitAKResSet) == 0x000008, "Wrong alignment on FF_HitAKResSet");
static_assert(sizeof(FF_HitAKResSet) == 0x000028, "Wrong size on FF_HitAKResSet");
static_assert(offsetof(FF_HitAKResSet, ResKey_6_320D97E048D6E9DF29E2D68E3F9E5C43) == 0x000000, "Member 'FF_HitAKResSet::ResKey_6_320D97E048D6E9DF29E2D68E3F9E5C43' has a wrong offset!");
static_assert(offsetof(FF_HitAKResSet, AKRes_7_F060A79F4F13667A136A12A584B964EF) == 0x000010, "Member 'FF_HitAKResSet::AKRes_7_F060A79F4F13667A136A12A584B964EF' has a wrong offset!");
static_assert(offsetof(FF_HitAKResSet, Dec_9_6D701CB0438F922CBD9BE1889541F781) == 0x000018, "Member 'FF_HitAKResSet::Dec_9_6D701CB0438F922CBD9BE1889541F781' has a wrong offset!");

}

