#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_HoldHandIdleBreakAnim

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_HoldHandIdleBreakAnim.F_HoldHandIdleBreakAnim
// 0x0020 (0x0020 - 0x0000)
struct FF_HoldHandIdleBreakAnim final
{
public:
	class UAnimSequence*                          InitialL_21_686716D14E7932C476904A9849E94E97;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          InitialR_22_D15D8BF54B6DAB9D38EA4C8C1E4C44F0;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          PassiveL_23_B4C24DD54D272CD266DDBF801AC3EF81;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          PassiveR_24_7DB19A0F46EED02BA8B6B49AF6E5C455;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_HoldHandIdleBreakAnim) == 0x000008, "Wrong alignment on FF_HoldHandIdleBreakAnim");
static_assert(sizeof(FF_HoldHandIdleBreakAnim) == 0x000020, "Wrong size on FF_HoldHandIdleBreakAnim");
static_assert(offsetof(FF_HoldHandIdleBreakAnim, InitialL_21_686716D14E7932C476904A9849E94E97) == 0x000000, "Member 'FF_HoldHandIdleBreakAnim::InitialL_21_686716D14E7932C476904A9849E94E97' has a wrong offset!");
static_assert(offsetof(FF_HoldHandIdleBreakAnim, InitialR_22_D15D8BF54B6DAB9D38EA4C8C1E4C44F0) == 0x000008, "Member 'FF_HoldHandIdleBreakAnim::InitialR_22_D15D8BF54B6DAB9D38EA4C8C1E4C44F0' has a wrong offset!");
static_assert(offsetof(FF_HoldHandIdleBreakAnim, PassiveL_23_B4C24DD54D272CD266DDBF801AC3EF81) == 0x000010, "Member 'FF_HoldHandIdleBreakAnim::PassiveL_23_B4C24DD54D272CD266DDBF801AC3EF81' has a wrong offset!");
static_assert(offsetof(FF_HoldHandIdleBreakAnim, PassiveR_24_7DB19A0F46EED02BA8B6B49AF6E5C455) == 0x000018, "Member 'FF_HoldHandIdleBreakAnim::PassiveR_24_7DB19A0F46EED02BA8B6B49AF6E5C455' has a wrong offset!");

}

