#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ImageRecognitionObjInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_ImageRecognitionObjInfo.F_ImageRecognitionObjInfo
// 0x0030 (0x0030 - 0x0000)
struct FF_ImageRecognitionObjInfo final
{
public:
	int32                                         ObjID_18_EFF2454244A9220426AC8995C6B1BC2E;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_21_806BB73E4B7D741F874BE7939D56001F;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   HintText_24_0110F7534203A2A9FF6423B339B55AC0;      // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        ScreenRatio_27_B7A129C4452FDDC42E6EC69500B441E9;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckNikkiOverLap_29_ABE979A64BCB6B62948404894427867D; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckDirtiness_31_796E43ED467A943D33215E8BBF337F3F; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDirty_33_6E7A0F6540C07235472C8F9CD0A01B66;       // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroupID_36_408077C84977682D3749AE9C22403C04;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PerformanceTag_39_B6059F1D44BFA2CF80E4B695C305199D; // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_ImageRecognitionObjInfo) == 0x000008, "Wrong alignment on FF_ImageRecognitionObjInfo");
static_assert(sizeof(FF_ImageRecognitionObjInfo) == 0x000030, "Wrong size on FF_ImageRecognitionObjInfo");
static_assert(offsetof(FF_ImageRecognitionObjInfo, ObjID_18_EFF2454244A9220426AC8995C6B1BC2E) == 0x000000, "Member 'FF_ImageRecognitionObjInfo::ObjID_18_EFF2454244A9220426AC8995C6B1BC2E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, Num_21_806BB73E4B7D741F874BE7939D56001F) == 0x000004, "Member 'FF_ImageRecognitionObjInfo::Num_21_806BB73E4B7D741F874BE7939D56001F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, HintText_24_0110F7534203A2A9FF6423B339B55AC0) == 0x000008, "Member 'FF_ImageRecognitionObjInfo::HintText_24_0110F7534203A2A9FF6423B339B55AC0' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, ScreenRatio_27_B7A129C4452FDDC42E6EC69500B441E9) == 0x000018, "Member 'FF_ImageRecognitionObjInfo::ScreenRatio_27_B7A129C4452FDDC42E6EC69500B441E9' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, NeedCheckNikkiOverLap_29_ABE979A64BCB6B62948404894427867D) == 0x000020, "Member 'FF_ImageRecognitionObjInfo::NeedCheckNikkiOverLap_29_ABE979A64BCB6B62948404894427867D' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, NeedCheckDirtiness_31_796E43ED467A943D33215E8BBF337F3F) == 0x000021, "Member 'FF_ImageRecognitionObjInfo::NeedCheckDirtiness_31_796E43ED467A943D33215E8BBF337F3F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, IsDirty_33_6E7A0F6540C07235472C8F9CD0A01B66) == 0x000022, "Member 'FF_ImageRecognitionObjInfo::IsDirty_33_6E7A0F6540C07235472C8F9CD0A01B66' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, GroupID_36_408077C84977682D3749AE9C22403C04) == 0x000024, "Member 'FF_ImageRecognitionObjInfo::GroupID_36_408077C84977682D3749AE9C22403C04' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionObjInfo, PerformanceTag_39_B6059F1D44BFA2CF80E4B695C305199D) == 0x000028, "Member 'FF_ImageRecognitionObjInfo::PerformanceTag_39_B6059F1D44BFA2CF80E4B695C305199D' has a wrong offset!");

}

