#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ImageRecognitionSpawnerInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_ImageRecognitionSpawnerInfo.F_ImageRecognitionSpawnerInfo
// 0x0030 (0x0030 - 0x0000)
struct FF_ImageRecognitionSpawnerInfo final
{
public:
	int64                                         SpawnerID_37_EFF2454244A9220426AC8995C6B1BC2E;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   HintText_22_7F4DB3F74199197B9BD33DB090E81945;      // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckDirtiness_35_BAE008144DDF63102463578AE82998C2; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDirty_36_9DC74FAC49DD9ADD392F929256714984;       // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroupID_41_9708BF1947712C5D614F0DB2FC88334B;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PerformanceTag_44_385B26844B5E8489879A82B3D4B51249; // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_ImageRecognitionSpawnerInfo) == 0x000008, "Wrong alignment on FF_ImageRecognitionSpawnerInfo");
static_assert(sizeof(FF_ImageRecognitionSpawnerInfo) == 0x000030, "Wrong size on FF_ImageRecognitionSpawnerInfo");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, SpawnerID_37_EFF2454244A9220426AC8995C6B1BC2E) == 0x000000, "Member 'FF_ImageRecognitionSpawnerInfo::SpawnerID_37_EFF2454244A9220426AC8995C6B1BC2E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, HintText_22_7F4DB3F74199197B9BD33DB090E81945) == 0x000008, "Member 'FF_ImageRecognitionSpawnerInfo::HintText_22_7F4DB3F74199197B9BD33DB090E81945' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D) == 0x000018, "Member 'FF_ImageRecognitionSpawnerInfo::ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A) == 0x000020, "Member 'FF_ImageRecognitionSpawnerInfo::NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, NeedCheckDirtiness_35_BAE008144DDF63102463578AE82998C2) == 0x000021, "Member 'FF_ImageRecognitionSpawnerInfo::NeedCheckDirtiness_35_BAE008144DDF63102463578AE82998C2' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, IsDirty_36_9DC74FAC49DD9ADD392F929256714984) == 0x000022, "Member 'FF_ImageRecognitionSpawnerInfo::IsDirty_36_9DC74FAC49DD9ADD392F929256714984' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, GroupID_41_9708BF1947712C5D614F0DB2FC88334B) == 0x000024, "Member 'FF_ImageRecognitionSpawnerInfo::GroupID_41_9708BF1947712C5D614F0DB2FC88334B' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionSpawnerInfo, PerformanceTag_44_385B26844B5E8489879A82B3D4B51249) == 0x000028, "Member 'FF_ImageRecognitionSpawnerInfo::PerformanceTag_44_385B26844B5E8489879A82B3D4B51249' has a wrong offset!");

}

