#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ImageRecognitionActorInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_ImageRecognitionActorInfo.F_ImageRecognitionActorInfo
// 0x0050 (0x0050 - 0x0000)
struct FF_ImageRecognitionActorInfo final
{
public:
	class FString                                 ActorTag_32_EFF2454244A9220426AC8995C6B1BC2E;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TagParam_35_55554A494690D7A91B5450997365D6D5;      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   HintText_22_7F4DB3F74199197B9BD33DB090E81945;      // 0x0020(0x0010)(Edit, BlueprintVisible)
	double                                        ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroupID_30_FF3CE1F54CE33EEEC18910A56AD3954C;       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num_38_1C98C4644C0B437016C02EB25AE312A6;           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotCheckOverLap_41_E87CABAA4F9F801F781E9C8879D897BC; // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PerformanceTag_44_3AFDA96E4D13FBE70289BF8FC8DDB172; // 0x0048(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_ImageRecognitionActorInfo) == 0x000008, "Wrong alignment on FF_ImageRecognitionActorInfo");
static_assert(sizeof(FF_ImageRecognitionActorInfo) == 0x000050, "Wrong size on FF_ImageRecognitionActorInfo");
static_assert(offsetof(FF_ImageRecognitionActorInfo, ActorTag_32_EFF2454244A9220426AC8995C6B1BC2E) == 0x000000, "Member 'FF_ImageRecognitionActorInfo::ActorTag_32_EFF2454244A9220426AC8995C6B1BC2E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, TagParam_35_55554A494690D7A91B5450997365D6D5) == 0x000010, "Member 'FF_ImageRecognitionActorInfo::TagParam_35_55554A494690D7A91B5450997365D6D5' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, HintText_22_7F4DB3F74199197B9BD33DB090E81945) == 0x000020, "Member 'FF_ImageRecognitionActorInfo::HintText_22_7F4DB3F74199197B9BD33DB090E81945' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D) == 0x000030, "Member 'FF_ImageRecognitionActorInfo::ScreenRatio_25_7D2250EC4FFCF245337AF2A50CB09C3D' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A) == 0x000038, "Member 'FF_ImageRecognitionActorInfo::NeedCheckNikkiOverLap_27_41725DA54FE189AAA77791A31258566A' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, GroupID_30_FF3CE1F54CE33EEEC18910A56AD3954C) == 0x00003C, "Member 'FF_ImageRecognitionActorInfo::GroupID_30_FF3CE1F54CE33EEEC18910A56AD3954C' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, Num_38_1C98C4644C0B437016C02EB25AE312A6) == 0x000040, "Member 'FF_ImageRecognitionActorInfo::Num_38_1C98C4644C0B437016C02EB25AE312A6' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, NotCheckOverLap_41_E87CABAA4F9F801F781E9C8879D897BC) == 0x000044, "Member 'FF_ImageRecognitionActorInfo::NotCheckOverLap_41_E87CABAA4F9F801F781E9C8879D897BC' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionActorInfo, PerformanceTag_44_3AFDA96E4D13FBE70289BF8FC8DDB172) == 0x000048, "Member 'FF_ImageRecognitionActorInfo::PerformanceTag_44_3AFDA96E4D13FBE70289BF8FC8DDB172' has a wrong offset!");

}

