#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ImageRecognitionPhotoList

#include "Basic.hpp"

#include "F_ImageRecognitionActorInfo_structs.hpp"
#include "F_ImageRecognitionNpcInfo_structs.hpp"
#include "Enum_WeatherType_structs.hpp"
#include "F_ImageRecognitionObjInfo_structs.hpp"
#include "F_ImageRecognitionGroupMinCheckInfo_structs.hpp"
#include "F_ImageRecognitionSpawnerInfo_structs.hpp"
#include "F_ImageRecognitionPointsInfo_structs.hpp"
#include "F_ImageRecognitionNikkiPositionCheckInfo_structs.hpp"
#include "E_ImageRecognitionFinishType_structs.hpp"
#include "EInt32PlayerPawnStateTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_ImageRecognitionPhotoList.F_ImageRecognitionPhotoList
// 0x0188 (0x0188 - 0x0000)
struct FF_ImageRecognitionPhotoList final
{
public:
	bool                                          NeedCheckWeather_25_D980B280456A653D4B953BBFD962F46F; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_WeatherType>                      Weather_104_81C80ACE4ABC8CF126A41C848FEC6224;      // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          NeedCheckMeteorShower_78_5DE689FF4A6A759268C91F90689F1825; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedCheckHour_26_DF2C30F54BF07A5AC14D889442FE1C71; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HourBegin_15_1A6ABF224D3569E22D94A4B782164C8E;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HourEnd_16_41B255334A99AF7B563D2EA4AE8A734B;       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_ImageRecognitionNpcInfo>     NpcList_39_FF09900549608792840B28915B8323A6;       // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_ImageRecognitionObjInfo>     ObjList_38_44A5DBBD48D1CE5C4A54FB903D07B9F8;       // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_ImageRecognitionActorInfo>   ActorList_121_7137E7464BEB503E3BC5E48144360F0F;    // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_ImageRecognitionSpawnerInfo> SpawnerList_76_CC4F3EAC4A2EC292E76D6389B0B5069D;   // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_ImageRecognitionPointsInfo>  PointsList_92_E46A8C7F477DF1B37C78648A5797A33F;    // 0x0068(0x0010)(Edit, BlueprintVisible)
	bool                                          NeedCheckGroupPhoto_47_CF47693840DDAD9449C8C18B85CFA6A5; // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroupPhotoDistanceDetermination_44_9937A6D74BC5EA5C8C98C7B4E49DACDA; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PromptText_31_80D4034E4CF8E8434F8DC6A32299DF2E;    // 0x0088(0x0010)(Edit, BlueprintVisible)
	bool                                          NeedCheckAnim_69_B4D582B04B6EAE7907C161B123C4EB9E; // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UAnimSequenceBase>> Anim_72_E2EEB95E412F50F9E89BEF9F10DB0393;        // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   OverrideNpcText_129_BD891CD043FB66A255E10EA8FA466231; // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   OverrideFormatText_130_95E2FD164E3414060AF1A482F97AD216; // 0x00C0(0x0010)(Edit, BlueprintVisible)
	class FText                                   OverridePromptText_131_E6A2E08842CDF3EB1A4BE5A34FBBC657; // 0x00D0(0x0010)(Edit, BlueprintVisible)
	struct FF_ImageRecognitionNikkiPositionCheckInfo NikkiPositionCheckInfo_103_F08A64F143A7F77B4747069797264A2B; // 0x00E0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FF_ImageRecognitionGroupMinCheckInfo> GroupMinCheck_108_38D59FB544FB9A948DF219A2EB7E2467; // 0x0120(0x0010)(Edit, BlueprintVisible)
	E_ImageRecognitionFinishType                  FinishType_111_5FE654C04E864436A3C6A28A39B3FCB9;   // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FinishTypeParam_114_F6CD63394B944758EAA5EDA2589AB71F; // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                FallbackPhoto_117_727775AD46CDF5A9EDF8AD8157BCA9EF; // 0x0138(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          AutoSubmit_123_7FE51F664667E397FA6A85A3D2A5F14B;   // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          invalidWhenHideNpc_150_5451D0C14ADCB9130CD490A578167E32; // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideFrame_128_A45E252F4239927E9C633F9DDAD7ADC1;    // 0x0162(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EInt32PlayerPawnStateTypes                    PlayerState_136_9D319D1E4136F56507BDC49ECD3F626C;  // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 SingleDressIDList_151_8E572AD94FBE9F8597E7E9A5F00CBAF2; // 0x0168(0x0010)(Edit, BlueprintVisible)
	TArray<int64>                                 SuitIDList_153_EAFEE092471A0338F34E77A8461F90FC;   // 0x0178(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_ImageRecognitionPhotoList) == 0x000008, "Wrong alignment on FF_ImageRecognitionPhotoList");
static_assert(sizeof(FF_ImageRecognitionPhotoList) == 0x000188, "Wrong size on FF_ImageRecognitionPhotoList");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NeedCheckWeather_25_D980B280456A653D4B953BBFD962F46F) == 0x000000, "Member 'FF_ImageRecognitionPhotoList::NeedCheckWeather_25_D980B280456A653D4B953BBFD962F46F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, Weather_104_81C80ACE4ABC8CF126A41C848FEC6224) == 0x000008, "Member 'FF_ImageRecognitionPhotoList::Weather_104_81C80ACE4ABC8CF126A41C848FEC6224' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NeedCheckMeteorShower_78_5DE689FF4A6A759268C91F90689F1825) == 0x000018, "Member 'FF_ImageRecognitionPhotoList::NeedCheckMeteorShower_78_5DE689FF4A6A759268C91F90689F1825' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NeedCheckHour_26_DF2C30F54BF07A5AC14D889442FE1C71) == 0x000019, "Member 'FF_ImageRecognitionPhotoList::NeedCheckHour_26_DF2C30F54BF07A5AC14D889442FE1C71' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, HourBegin_15_1A6ABF224D3569E22D94A4B782164C8E) == 0x00001C, "Member 'FF_ImageRecognitionPhotoList::HourBegin_15_1A6ABF224D3569E22D94A4B782164C8E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, HourEnd_16_41B255334A99AF7B563D2EA4AE8A734B) == 0x000020, "Member 'FF_ImageRecognitionPhotoList::HourEnd_16_41B255334A99AF7B563D2EA4AE8A734B' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NpcList_39_FF09900549608792840B28915B8323A6) == 0x000028, "Member 'FF_ImageRecognitionPhotoList::NpcList_39_FF09900549608792840B28915B8323A6' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, ObjList_38_44A5DBBD48D1CE5C4A54FB903D07B9F8) == 0x000038, "Member 'FF_ImageRecognitionPhotoList::ObjList_38_44A5DBBD48D1CE5C4A54FB903D07B9F8' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, ActorList_121_7137E7464BEB503E3BC5E48144360F0F) == 0x000048, "Member 'FF_ImageRecognitionPhotoList::ActorList_121_7137E7464BEB503E3BC5E48144360F0F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, SpawnerList_76_CC4F3EAC4A2EC292E76D6389B0B5069D) == 0x000058, "Member 'FF_ImageRecognitionPhotoList::SpawnerList_76_CC4F3EAC4A2EC292E76D6389B0B5069D' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, PointsList_92_E46A8C7F477DF1B37C78648A5797A33F) == 0x000068, "Member 'FF_ImageRecognitionPhotoList::PointsList_92_E46A8C7F477DF1B37C78648A5797A33F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NeedCheckGroupPhoto_47_CF47693840DDAD9449C8C18B85CFA6A5) == 0x000078, "Member 'FF_ImageRecognitionPhotoList::NeedCheckGroupPhoto_47_CF47693840DDAD9449C8C18B85CFA6A5' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, GroupPhotoDistanceDetermination_44_9937A6D74BC5EA5C8C98C7B4E49DACDA) == 0x000080, "Member 'FF_ImageRecognitionPhotoList::GroupPhotoDistanceDetermination_44_9937A6D74BC5EA5C8C98C7B4E49DACDA' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, PromptText_31_80D4034E4CF8E8434F8DC6A32299DF2E) == 0x000088, "Member 'FF_ImageRecognitionPhotoList::PromptText_31_80D4034E4CF8E8434F8DC6A32299DF2E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NeedCheckAnim_69_B4D582B04B6EAE7907C161B123C4EB9E) == 0x000098, "Member 'FF_ImageRecognitionPhotoList::NeedCheckAnim_69_B4D582B04B6EAE7907C161B123C4EB9E' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, Anim_72_E2EEB95E412F50F9E89BEF9F10DB0393) == 0x0000A0, "Member 'FF_ImageRecognitionPhotoList::Anim_72_E2EEB95E412F50F9E89BEF9F10DB0393' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, OverrideNpcText_129_BD891CD043FB66A255E10EA8FA466231) == 0x0000B0, "Member 'FF_ImageRecognitionPhotoList::OverrideNpcText_129_BD891CD043FB66A255E10EA8FA466231' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, OverrideFormatText_130_95E2FD164E3414060AF1A482F97AD216) == 0x0000C0, "Member 'FF_ImageRecognitionPhotoList::OverrideFormatText_130_95E2FD164E3414060AF1A482F97AD216' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, OverridePromptText_131_E6A2E08842CDF3EB1A4BE5A34FBBC657) == 0x0000D0, "Member 'FF_ImageRecognitionPhotoList::OverridePromptText_131_E6A2E08842CDF3EB1A4BE5A34FBBC657' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, NikkiPositionCheckInfo_103_F08A64F143A7F77B4747069797264A2B) == 0x0000E0, "Member 'FF_ImageRecognitionPhotoList::NikkiPositionCheckInfo_103_F08A64F143A7F77B4747069797264A2B' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, GroupMinCheck_108_38D59FB544FB9A948DF219A2EB7E2467) == 0x000120, "Member 'FF_ImageRecognitionPhotoList::GroupMinCheck_108_38D59FB544FB9A948DF219A2EB7E2467' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, FinishType_111_5FE654C04E864436A3C6A28A39B3FCB9) == 0x000130, "Member 'FF_ImageRecognitionPhotoList::FinishType_111_5FE654C04E864436A3C6A28A39B3FCB9' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, FinishTypeParam_114_F6CD63394B944758EAA5EDA2589AB71F) == 0x000134, "Member 'FF_ImageRecognitionPhotoList::FinishTypeParam_114_F6CD63394B944758EAA5EDA2589AB71F' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, FallbackPhoto_117_727775AD46CDF5A9EDF8AD8157BCA9EF) == 0x000138, "Member 'FF_ImageRecognitionPhotoList::FallbackPhoto_117_727775AD46CDF5A9EDF8AD8157BCA9EF' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, AutoSubmit_123_7FE51F664667E397FA6A85A3D2A5F14B) == 0x000160, "Member 'FF_ImageRecognitionPhotoList::AutoSubmit_123_7FE51F664667E397FA6A85A3D2A5F14B' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, invalidWhenHideNpc_150_5451D0C14ADCB9130CD490A578167E32) == 0x000161, "Member 'FF_ImageRecognitionPhotoList::invalidWhenHideNpc_150_5451D0C14ADCB9130CD490A578167E32' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, HideFrame_128_A45E252F4239927E9C633F9DDAD7ADC1) == 0x000162, "Member 'FF_ImageRecognitionPhotoList::HideFrame_128_A45E252F4239927E9C633F9DDAD7ADC1' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, PlayerState_136_9D319D1E4136F56507BDC49ECD3F626C) == 0x000164, "Member 'FF_ImageRecognitionPhotoList::PlayerState_136_9D319D1E4136F56507BDC49ECD3F626C' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, SingleDressIDList_151_8E572AD94FBE9F8597E7E9A5F00CBAF2) == 0x000168, "Member 'FF_ImageRecognitionPhotoList::SingleDressIDList_151_8E572AD94FBE9F8597E7E9A5F00CBAF2' has a wrong offset!");
static_assert(offsetof(FF_ImageRecognitionPhotoList, SuitIDList_153_EAFEE092471A0338F34E77A8461F90FC) == 0x000178, "Member 'FF_ImageRecognitionPhotoList::SuitIDList_153_EAFEE092471A0338F34E77A8461F90FC' has a wrong offset!");

}

