#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_InputActionSound

#include "Basic.hpp"

#include "X6EnhancedInput_structs.hpp"
#include "Enum_InputActionSoundPlayType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_InputActionSound.F_InputActionSound
// 0x0040 (0x0040 - 0x0000)
struct FF_InputActionSound final
{
public:
	class UX6InputAction*                         InputAction_14_DBB8742B405EDD27A5053081078A10D4;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EX6TriggerEvent                               TriggerEvent_10_A5DE4D024A6EBD8D55A618927F9B42AD;  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAkAudioEvent>           SoundEvent_13_2356B13A40224B265B0FA4B17E589F62;    // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	Enum_InputActionSoundPlayType                 PlayType_17_AF3F81A14F45F60EDFA7F693A8313D6B;      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_InputActionSound) == 0x000008, "Wrong alignment on FF_InputActionSound");
static_assert(sizeof(FF_InputActionSound) == 0x000040, "Wrong size on FF_InputActionSound");
static_assert(offsetof(FF_InputActionSound, InputAction_14_DBB8742B405EDD27A5053081078A10D4) == 0x000000, "Member 'FF_InputActionSound::InputAction_14_DBB8742B405EDD27A5053081078A10D4' has a wrong offset!");
static_assert(offsetof(FF_InputActionSound, TriggerEvent_10_A5DE4D024A6EBD8D55A618927F9B42AD) == 0x000008, "Member 'FF_InputActionSound::TriggerEvent_10_A5DE4D024A6EBD8D55A618927F9B42AD' has a wrong offset!");
static_assert(offsetof(FF_InputActionSound, SoundEvent_13_2356B13A40224B265B0FA4B17E589F62) == 0x000010, "Member 'FF_InputActionSound::SoundEvent_13_2356B13A40224B265B0FA4B17E589F62' has a wrong offset!");
static_assert(offsetof(FF_InputActionSound, PlayType_17_AF3F81A14F45F60EDFA7F693A8313D6B) == 0x000038, "Member 'FF_InputActionSound::PlayType_17_AF3F81A14F45F60EDFA7F693A8313D6B' has a wrong offset!");

}

