#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_JumpPlungeMontage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_JumpPlungeMontage.F_JumpPlungeMontage
// 0x0058 (0x0058 - 0x0000)
struct FF_JumpPlungeMontage final
{
public:
	class FString                                 Description_2_D6EF62424B3F6D4E5016F089CB6A3A9A;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActivationRequiredTags_5_E598880448D71DC34497948474A43AFC; // 0x0010(0x0020)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UAnimMontage>            PlayMontage_9_07C5CDA0498656760A039DB8F90196F3;    // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_JumpPlungeMontage) == 0x000008, "Wrong alignment on FF_JumpPlungeMontage");
static_assert(sizeof(FF_JumpPlungeMontage) == 0x000058, "Wrong size on FF_JumpPlungeMontage");
static_assert(offsetof(FF_JumpPlungeMontage, Description_2_D6EF62424B3F6D4E5016F089CB6A3A9A) == 0x000000, "Member 'FF_JumpPlungeMontage::Description_2_D6EF62424B3F6D4E5016F089CB6A3A9A' has a wrong offset!");
static_assert(offsetof(FF_JumpPlungeMontage, ActivationRequiredTags_5_E598880448D71DC34497948474A43AFC) == 0x000010, "Member 'FF_JumpPlungeMontage::ActivationRequiredTags_5_E598880448D71DC34497948474A43AFC' has a wrong offset!");
static_assert(offsetof(FF_JumpPlungeMontage, PlayMontage_9_07C5CDA0498656760A039DB8F90196F3) == 0x000030, "Member 'FF_JumpPlungeMontage::PlayMontage_9_07C5CDA0498656760A039DB8F90196F3' has a wrong offset!");

}

