#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MulticastTriggerContext

#include "Basic.hpp"

#include "ESkillCDStartCondition_structs.hpp"
#include "ESkillFlag_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_MulticastTriggerContext.F_MulticastTriggerContext
// 0x00E0 (0x00E0 - 0x0000)
struct FF_MulticastTriggerContext final
{
public:
	struct FVector                                SpawnLocation_92_F990673A488374860FC58CBD4EEA78AF; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SpawnRotation_93_251A69B943B2FC9DFE21E89387627B89; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isModifyHitDirection_1_22931E6A4750D0030737CCA2B5244ED5; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndLocation_34_A60F24C94FCBA4BDFAB160A586F642E1;   // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CustomVelocity_36_95FFAF414A65B83962BD42B15B03024A; // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChoosePointK_50_4EA745724F3C8BC9A5B985AAB251BC35;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChoosePointA_52_4431D9454D92B2F8396998833BAE3DF0;  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginSpeed_54_7B12B9EC47B57C791020938ACD01EFF8;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginArc_56_9E7F6C8B4E69D294A294F7A228BA9F5C;     // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHighArc_59_B0218B5344E5DF895AEB299676E41002;     // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags_76_C2CCA60343063AFDFC9615A77D449550;   // 0x0090(0x0020)(Edit, BlueprintVisible)
	bool                                          IsLastBullet_65_F63D3FFA440E37311FA9C5B967B3A440;  // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         TargetID_102_7200DD23454B671D81BA70B006927A62;     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetComponentName_97_B90EB68549744DBFEFF316A4177EA5A0; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillFlag                                    SkillFlags_73_5B78466B4F86BF4925DBFA844CAAB37E;    // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroupCD_88_E52892AC46C1A3646A6262951F53CCBB;       // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillGroupID_87_DD4224B6462A078A0105F286C3882D67;  // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillCDStartCondition                        CDStartType_86_AF296FE04EAE19B274015D8B66530AA6;   // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExtraFreezeDuration_85_10551BFD4F1FCDBA27E22F883A288D60; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_MulticastTriggerContext) == 0x000008, "Wrong alignment on FF_MulticastTriggerContext");
static_assert(sizeof(FF_MulticastTriggerContext) == 0x0000E0, "Wrong size on FF_MulticastTriggerContext");
static_assert(offsetof(FF_MulticastTriggerContext, SpawnLocation_92_F990673A488374860FC58CBD4EEA78AF) == 0x000000, "Member 'FF_MulticastTriggerContext::SpawnLocation_92_F990673A488374860FC58CBD4EEA78AF' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, SpawnRotation_93_251A69B943B2FC9DFE21E89387627B89) == 0x000018, "Member 'FF_MulticastTriggerContext::SpawnRotation_93_251A69B943B2FC9DFE21E89387627B89' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, isModifyHitDirection_1_22931E6A4750D0030737CCA2B5244ED5) == 0x000030, "Member 'FF_MulticastTriggerContext::isModifyHitDirection_1_22931E6A4750D0030737CCA2B5244ED5' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, EndLocation_34_A60F24C94FCBA4BDFAB160A586F642E1) == 0x000038, "Member 'FF_MulticastTriggerContext::EndLocation_34_A60F24C94FCBA4BDFAB160A586F642E1' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, CustomVelocity_36_95FFAF414A65B83962BD42B15B03024A) == 0x000050, "Member 'FF_MulticastTriggerContext::CustomVelocity_36_95FFAF414A65B83962BD42B15B03024A' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, ChoosePointK_50_4EA745724F3C8BC9A5B985AAB251BC35) == 0x000068, "Member 'FF_MulticastTriggerContext::ChoosePointK_50_4EA745724F3C8BC9A5B985AAB251BC35' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, ChoosePointA_52_4431D9454D92B2F8396998833BAE3DF0) == 0x000070, "Member 'FF_MulticastTriggerContext::ChoosePointA_52_4431D9454D92B2F8396998833BAE3DF0' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, OriginSpeed_54_7B12B9EC47B57C791020938ACD01EFF8) == 0x000078, "Member 'FF_MulticastTriggerContext::OriginSpeed_54_7B12B9EC47B57C791020938ACD01EFF8' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, OriginArc_56_9E7F6C8B4E69D294A294F7A228BA9F5C) == 0x000080, "Member 'FF_MulticastTriggerContext::OriginArc_56_9E7F6C8B4E69D294A294F7A228BA9F5C' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, IsHighArc_59_B0218B5344E5DF895AEB299676E41002) == 0x000088, "Member 'FF_MulticastTriggerContext::IsHighArc_59_B0218B5344E5DF895AEB299676E41002' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, AbilityTags_76_C2CCA60343063AFDFC9615A77D449550) == 0x000090, "Member 'FF_MulticastTriggerContext::AbilityTags_76_C2CCA60343063AFDFC9615A77D449550' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, IsLastBullet_65_F63D3FFA440E37311FA9C5B967B3A440) == 0x0000B0, "Member 'FF_MulticastTriggerContext::IsLastBullet_65_F63D3FFA440E37311FA9C5B967B3A440' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, TargetID_102_7200DD23454B671D81BA70B006927A62) == 0x0000B8, "Member 'FF_MulticastTriggerContext::TargetID_102_7200DD23454B671D81BA70B006927A62' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, TargetComponentName_97_B90EB68549744DBFEFF316A4177EA5A0) == 0x0000C0, "Member 'FF_MulticastTriggerContext::TargetComponentName_97_B90EB68549744DBFEFF316A4177EA5A0' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, SkillFlags_73_5B78466B4F86BF4925DBFA844CAAB37E) == 0x0000C8, "Member 'FF_MulticastTriggerContext::SkillFlags_73_5B78466B4F86BF4925DBFA844CAAB37E' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, GroupCD_88_E52892AC46C1A3646A6262951F53CCBB) == 0x0000CC, "Member 'FF_MulticastTriggerContext::GroupCD_88_E52892AC46C1A3646A6262951F53CCBB' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, SkillGroupID_87_DD4224B6462A078A0105F286C3882D67) == 0x0000D0, "Member 'FF_MulticastTriggerContext::SkillGroupID_87_DD4224B6462A078A0105F286C3882D67' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, CDStartType_86_AF296FE04EAE19B274015D8B66530AA6) == 0x0000D4, "Member 'FF_MulticastTriggerContext::CDStartType_86_AF296FE04EAE19B274015D8B66530AA6' has a wrong offset!");
static_assert(offsetof(FF_MulticastTriggerContext, ExtraFreezeDuration_85_10551BFD4F1FCDBA27E22F883A288D60) == 0x0000D8, "Member 'FF_MulticastTriggerContext::ExtraFreezeDuration_85_10551BFD4F1FCDBA27E22F883A288D60' has a wrong offset!");

}

