#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MulticastDamageContext

#include "Basic.hpp"

#include "EDamagePerformanceType_structs.hpp"
#include "EFeedBackReason_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_MulticastDamageContext.F_MulticastDamageContext
// 0x0050 (0x0050 - 0x0000)
struct FF_MulticastDamageContext final
{
public:
	EFeedBackReason                               Reason_26_74C8D39440DAB5C8C4C3059CF14D1701;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         AttackEntityID_29_B5FE8746452F5FBDCB110FA42BA9D448; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         hitTargetId_20_0DAF40994DCE26A33B1F249C11813167;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitDirection_5_C99AAA694339F4CB48172DB20936F6AC;   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitLocation_7_17FA7205461CD1BE8255A695CCBD3D62;    // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageValue_23_7AC5FC464E94B15DF7EAE3BBA2A3FC4C;   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDamagePerformanceType                        PerformanceType_33_A0FB4B86416BD3E48D273385E9C25BFF; // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_MulticastDamageContext) == 0x000008, "Wrong alignment on FF_MulticastDamageContext");
static_assert(sizeof(FF_MulticastDamageContext) == 0x000050, "Wrong size on FF_MulticastDamageContext");
static_assert(offsetof(FF_MulticastDamageContext, Reason_26_74C8D39440DAB5C8C4C3059CF14D1701) == 0x000000, "Member 'FF_MulticastDamageContext::Reason_26_74C8D39440DAB5C8C4C3059CF14D1701' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, AttackEntityID_29_B5FE8746452F5FBDCB110FA42BA9D448) == 0x000008, "Member 'FF_MulticastDamageContext::AttackEntityID_29_B5FE8746452F5FBDCB110FA42BA9D448' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, hitTargetId_20_0DAF40994DCE26A33B1F249C11813167) == 0x000010, "Member 'FF_MulticastDamageContext::hitTargetId_20_0DAF40994DCE26A33B1F249C11813167' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, hitDirection_5_C99AAA694339F4CB48172DB20936F6AC) == 0x000018, "Member 'FF_MulticastDamageContext::hitDirection_5_C99AAA694339F4CB48172DB20936F6AC' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, hitLocation_7_17FA7205461CD1BE8255A695CCBD3D62) == 0x000030, "Member 'FF_MulticastDamageContext::hitLocation_7_17FA7205461CD1BE8255A695CCBD3D62' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, DamageValue_23_7AC5FC464E94B15DF7EAE3BBA2A3FC4C) == 0x000048, "Member 'FF_MulticastDamageContext::DamageValue_23_7AC5FC464E94B15DF7EAE3BBA2A3FC4C' has a wrong offset!");
static_assert(offsetof(FF_MulticastDamageContext, PerformanceType_33_A0FB4B86416BD3E48D273385E9C25BFF) == 0x00004C, "Member 'FF_MulticastDamageContext::PerformanceType_33_A0FB4B86416BD3E48D273385E9C25BFF' has a wrong offset!");

}

