#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_NPCPhotoReactionAnimWithValidPoses

#include "Basic.hpp"

#include "Enum_HumanPositions_structs.hpp"
#include "E_NPCPhotoReactionAnimLookAtType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_NPCPhotoReactionAnimWithValidPoses.F_NPCPhotoReactionAnimWithValidPoses
// 0x00E0 (0x00E0 - 0x0000)
struct FF_NPCPhotoReactionAnimWithValidPoses final
{
public:
	TSet<Enum_HumanPositions>                     ValidHumanPositions_29_37D5848F426AF0493199ED80568A602D; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C; // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E; // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5;        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPCPhotoReactionAnimLookAtType              LookAtType_17_274DBC8940C27968068D6BB9352102F6;    // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interval_13_C007615240BFFA54A94CF4B86086F31C;      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_NPCPhotoReactionAnimWithValidPoses) == 0x000008, "Wrong alignment on FF_NPCPhotoReactionAnimWithValidPoses");
static_assert(sizeof(FF_NPCPhotoReactionAnimWithValidPoses) == 0x0000E0, "Wrong size on FF_NPCPhotoReactionAnimWithValidPoses");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, ValidHumanPositions_29_37D5848F426AF0493199ED80568A602D) == 0x000000, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::ValidHumanPositions_29_37D5848F426AF0493199ED80568A602D' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E) == 0x000050, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C) == 0x000078, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E) == 0x0000A0, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5) == 0x0000C8, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, LookAtType_17_274DBC8940C27968068D6BB9352102F6) == 0x0000D0, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::LookAtType_17_274DBC8940C27968068D6BB9352102F6' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnimWithValidPoses, Interval_13_C007615240BFFA54A94CF4B86086F31C) == 0x0000D8, "Member 'FF_NPCPhotoReactionAnimWithValidPoses::Interval_13_C007615240BFFA54A94CF4B86086F31C' has a wrong offset!");

}

