#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_NPCPhotoReactionAnim

#include "Basic.hpp"

#include "E_NPCPhotoReactionAnimLookAtType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_NPCPhotoReactionAnim.F_NPCPhotoReactionAnim
// 0x00C0 (0x00C0 - 0x0000)
struct FF_NPCPhotoReactionAnim final
{
public:
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5;        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NPCPhotoReactionAnimLookAtType              LookAtType_17_274DBC8940C27968068D6BB9352102F6;    // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interval_13_C007615240BFFA54A94CF4B86086F31C;      // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_HandHeldObjTemplate_C> HandHeldConfig_29_204F6E9A41A15A64847156841C53AB62; // 0x0090(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          UseEmptyHand_31_CC51C547423D3F9AE394DCAEFCE41FAE;  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_NPCPhotoReactionAnim) == 0x000008, "Wrong alignment on FF_NPCPhotoReactionAnim");
static_assert(sizeof(FF_NPCPhotoReactionAnim) == 0x0000C0, "Wrong size on FF_NPCPhotoReactionAnim");
static_assert(offsetof(FF_NPCPhotoReactionAnim, PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E) == 0x000000, "Member 'FF_NPCPhotoReactionAnim::PhotoReactionStartAnim_23_CA1D540F4AF2AC1ADB74C385092ED91E' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C) == 0x000028, "Member 'FF_NPCPhotoReactionAnim::PhotoReactionLoopAnim_19_938B84AB4DD0DE903135B8BDBABA0A5C' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E) == 0x000050, "Member 'FF_NPCPhotoReactionAnim::PhotoReactionEndAnim_25_861138604956CC8C45CD32A24A78024E' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5) == 0x000078, "Member 'FF_NPCPhotoReactionAnim::Chance_15_2E7A87144FB4ED4CC1709B822E7D4DC5' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, LookAtType_17_274DBC8940C27968068D6BB9352102F6) == 0x000080, "Member 'FF_NPCPhotoReactionAnim::LookAtType_17_274DBC8940C27968068D6BB9352102F6' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, Interval_13_C007615240BFFA54A94CF4B86086F31C) == 0x000088, "Member 'FF_NPCPhotoReactionAnim::Interval_13_C007615240BFFA54A94CF4B86086F31C' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, HandHeldConfig_29_204F6E9A41A15A64847156841C53AB62) == 0x000090, "Member 'FF_NPCPhotoReactionAnim::HandHeldConfig_29_204F6E9A41A15A64847156841C53AB62' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionAnim, UseEmptyHand_31_CC51C547423D3F9AE394DCAEFCE41FAE) == 0x0000B8, "Member 'FF_NPCPhotoReactionAnim::UseEmptyHand_31_CC51C547423D3F9AE394DCAEFCE41FAE' has a wrong offset!");

}

