#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_NPCPhotoReactionConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_HumanPositions_structs.hpp"
#include "E_NPCPhotoReactionType_structs.hpp"
#include "E_NPCPhotoReactionAnimType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_NPCPhotoReactionConfig.F_NPCPhotoReactionConfig
// 0x0158 (0x0158 - 0x0000)
struct FF_NPCPhotoReactionConfig final
{
public:
	TSet<Enum_HumanPositions>                     ValidHumanPositions_87_EBB133ED422A59D830827AACF5B023CB; // 0x0000(0x0050)(Edit, BlueprintVisible)
	E_NPCPhotoReactionType                        PhotoReactionType_43_F3D52F784D9D11C7AD4A7CB07770046D; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UBP_NPCPhotoReactionAnimSet_Template_C> DA_PhotoReactionAnimSet_10_A3465F3949D57E7268EBBD8F9461A61D; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_NPCPhotoReactionAnimType                    ReactionAnimType_13_3BB4384A4FE84ECFAEC43188D7C0DDF2; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LookAtTime_19_B7A7D30B4740C611B021DE94AEE7FF78;    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_NPCPhotobombAttachToCameraConfig_Template_C> DA_PhotobombAttachToCameraConfig_36_39237D51424F8D52E0BAF79C0A06B6DB; // 0x0090(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_NPCPhotobombAnimConfig_Template_C> DA_PhotobombAnimConfig_34_3BF2406141EF9B7C6819EFA6544AE3DB; // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        PhotobombStaySeconds_25_CD6295984141222CE404B385ABB2D526; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_NPCPhotoReaction_PassThroughConfig_Template_C> DA_PassThroughConfig_74_B4B1DEE34D83404B7CFCE68FE0002A90; // 0x00E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_NPCPhotoReactionBackAnimConfig_Template_C> DA_BackAnimConfig_77_F75409134F290E3A0A6783B69FFCE757; // 0x0110(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector                                CheckBoxExtend_80_5CAE5F6C4B7B936AF8E42A8489AA1819; // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CheckBoxZPosition_83_98922F7542D5F500511521BD9A098C08; // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_NPCPhotoReactionConfig) == 0x000008, "Wrong alignment on FF_NPCPhotoReactionConfig");
static_assert(sizeof(FF_NPCPhotoReactionConfig) == 0x000158, "Wrong size on FF_NPCPhotoReactionConfig");
static_assert(offsetof(FF_NPCPhotoReactionConfig, ValidHumanPositions_87_EBB133ED422A59D830827AACF5B023CB) == 0x000000, "Member 'FF_NPCPhotoReactionConfig::ValidHumanPositions_87_EBB133ED422A59D830827AACF5B023CB' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, PhotoReactionType_43_F3D52F784D9D11C7AD4A7CB07770046D) == 0x000050, "Member 'FF_NPCPhotoReactionConfig::PhotoReactionType_43_F3D52F784D9D11C7AD4A7CB07770046D' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, DA_PhotoReactionAnimSet_10_A3465F3949D57E7268EBBD8F9461A61D) == 0x000058, "Member 'FF_NPCPhotoReactionConfig::DA_PhotoReactionAnimSet_10_A3465F3949D57E7268EBBD8F9461A61D' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, ReactionAnimType_13_3BB4384A4FE84ECFAEC43188D7C0DDF2) == 0x000080, "Member 'FF_NPCPhotoReactionConfig::ReactionAnimType_13_3BB4384A4FE84ECFAEC43188D7C0DDF2' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, LookAtTime_19_B7A7D30B4740C611B021DE94AEE7FF78) == 0x000088, "Member 'FF_NPCPhotoReactionConfig::LookAtTime_19_B7A7D30B4740C611B021DE94AEE7FF78' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, DA_PhotobombAttachToCameraConfig_36_39237D51424F8D52E0BAF79C0A06B6DB) == 0x000090, "Member 'FF_NPCPhotoReactionConfig::DA_PhotobombAttachToCameraConfig_36_39237D51424F8D52E0BAF79C0A06B6DB' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, DA_PhotobombAnimConfig_34_3BF2406141EF9B7C6819EFA6544AE3DB) == 0x0000B8, "Member 'FF_NPCPhotoReactionConfig::DA_PhotobombAnimConfig_34_3BF2406141EF9B7C6819EFA6544AE3DB' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, PhotobombStaySeconds_25_CD6295984141222CE404B385ABB2D526) == 0x0000E0, "Member 'FF_NPCPhotoReactionConfig::PhotobombStaySeconds_25_CD6295984141222CE404B385ABB2D526' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, DA_PassThroughConfig_74_B4B1DEE34D83404B7CFCE68FE0002A90) == 0x0000E8, "Member 'FF_NPCPhotoReactionConfig::DA_PassThroughConfig_74_B4B1DEE34D83404B7CFCE68FE0002A90' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, DA_BackAnimConfig_77_F75409134F290E3A0A6783B69FFCE757) == 0x000110, "Member 'FF_NPCPhotoReactionConfig::DA_BackAnimConfig_77_F75409134F290E3A0A6783B69FFCE757' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, CheckBoxExtend_80_5CAE5F6C4B7B936AF8E42A8489AA1819) == 0x000138, "Member 'FF_NPCPhotoReactionConfig::CheckBoxExtend_80_5CAE5F6C4B7B936AF8E42A8489AA1819' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfig, CheckBoxZPosition_83_98922F7542D5F500511521BD9A098C08) == 0x000150, "Member 'FF_NPCPhotoReactionConfig::CheckBoxZPosition_83_98922F7542D5F500511521BD9A098C08' has a wrong offset!");

}

