#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_NPCPhotoReactionConfigByCharacter

#include "Basic.hpp"

#include "F_NPCPhotoReactionConfig_structs.hpp"
#include "F_NPCPhotoReactionMissionCondition_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_NPCPhotoReactionConfigByCharacter.F_NPCPhotoReactionConfigByCharacter
// 0x0040 (0x0040 - 0x0000)
struct FF_NPCPhotoReactionConfigByCharacter final
{
public:
	int32                                         CharacterID_7_9A6B5C1249890392B6168EAA642ABA65;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_NPCPhotoReactionConfig>      ReactionList_87_DCE0E5FF4461F878407B0DAD58689045;  // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          AllTaskNeed_93_A4985DA6498E2F8F26BCDBB75CD898D5;   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TaskListEnable_101_11024B014526AE93BDE22EB07DC2BC88; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_NPCPhotoReactionMissionCondition> TaskList_106_19109C7E484B2AB12D6B949E4FC0DE94; // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FString                                 VersionTag_109_1710D784465F2287A8AF979C1BBFA36D;   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_NPCPhotoReactionConfigByCharacter) == 0x000008, "Wrong alignment on FF_NPCPhotoReactionConfigByCharacter");
static_assert(sizeof(FF_NPCPhotoReactionConfigByCharacter) == 0x000040, "Wrong size on FF_NPCPhotoReactionConfigByCharacter");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, CharacterID_7_9A6B5C1249890392B6168EAA642ABA65) == 0x000000, "Member 'FF_NPCPhotoReactionConfigByCharacter::CharacterID_7_9A6B5C1249890392B6168EAA642ABA65' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, ReactionList_87_DCE0E5FF4461F878407B0DAD58689045) == 0x000008, "Member 'FF_NPCPhotoReactionConfigByCharacter::ReactionList_87_DCE0E5FF4461F878407B0DAD58689045' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, AllTaskNeed_93_A4985DA6498E2F8F26BCDBB75CD898D5) == 0x000018, "Member 'FF_NPCPhotoReactionConfigByCharacter::AllTaskNeed_93_A4985DA6498E2F8F26BCDBB75CD898D5' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, TaskListEnable_101_11024B014526AE93BDE22EB07DC2BC88) == 0x000019, "Member 'FF_NPCPhotoReactionConfigByCharacter::TaskListEnable_101_11024B014526AE93BDE22EB07DC2BC88' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, TaskList_106_19109C7E484B2AB12D6B949E4FC0DE94) == 0x000020, "Member 'FF_NPCPhotoReactionConfigByCharacter::TaskList_106_19109C7E484B2AB12D6B949E4FC0DE94' has a wrong offset!");
static_assert(offsetof(FF_NPCPhotoReactionConfigByCharacter, VersionTag_109_1710D784465F2287A8AF979C1BBFA36D) == 0x000030, "Member 'FF_NPCPhotoReactionConfigByCharacter::VersionTag_109_1710D784465F2287A8AF979C1BBFA36D' has a wrong offset!");

}

