#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_OrdinaryDialoguePreset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_DialogueSpeakerBodySize_structs.hpp"
#include "EDlgCameraTargetPointType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_OrdinaryDialoguePreset.F_OrdinaryDialoguePreset
// 0x0090 (0x0090 - 0x0000)
struct FF_OrdinaryDialoguePreset final
{
public:
	E_DialogueSpeakerBodySize                     BodySize_10_D3CE75FF4AD39CD969EE1EB21E4E7861;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DlgCameraArmLength_13_4D536E24420CD80EC3B891AC341318AE; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseAppointedCameraRotator_34_E658D9374ED8C76C6A348C8DC31EDA6E; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               DlgAppointedCameraRotator_32_6A3E5FD74FE996AFB7950C99CB35EAE3; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DlgCameraBlendInTime_24_A5066C224C0FC66F5FEFEFA28FFA9951; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DlgCameraBlendOutTime_23_467FCD7A4A176B71D06AFCA2ED089F8C; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DlgCameraBlendOutYAngle_26_58A74C1E47BCCA1CE1E2518232388976; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDlgCameraTargetPointType                     DlgCameraTargetPointType_39_E44E30234ECE71EC2D4312A6555E42A9; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DlgCameraTargetPointOffset_42_50DC9A95473DD014EC332AA41A3C34E1; // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCameraRotateAroundZAxisWhenOccluded_67_AF364101406285F34C12ED9CC0DA6AE1; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCameraRotateAroundXAxisWhenOccluded_68_594FB68C499A7D2BA558F7A8BC2A165F; // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DetermineOcclusionYawAngle_51_E77CF2114F0BF5511A4BBEA2EEDE4460; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetermineOcclusionPitchAngle_52_941C6D6B4AFE92F4361298900F7D63E8; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutoRotateAroundZAxisAngle_70_1C86D34146B057BC28ABA586E93901AA; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutoRotateAroundXAxisAngle_72_36B14864409788AEF267C5973828930F; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_OrdinaryDialoguePreset) == 0x000008, "Wrong alignment on FF_OrdinaryDialoguePreset");
static_assert(sizeof(FF_OrdinaryDialoguePreset) == 0x000090, "Wrong size on FF_OrdinaryDialoguePreset");
static_assert(offsetof(FF_OrdinaryDialoguePreset, BodySize_10_D3CE75FF4AD39CD969EE1EB21E4E7861) == 0x000000, "Member 'FF_OrdinaryDialoguePreset::BodySize_10_D3CE75FF4AD39CD969EE1EB21E4E7861' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraArmLength_13_4D536E24420CD80EC3B891AC341318AE) == 0x000008, "Member 'FF_OrdinaryDialoguePreset::DlgCameraArmLength_13_4D536E24420CD80EC3B891AC341318AE' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, bUseAppointedCameraRotator_34_E658D9374ED8C76C6A348C8DC31EDA6E) == 0x000010, "Member 'FF_OrdinaryDialoguePreset::bUseAppointedCameraRotator_34_E658D9374ED8C76C6A348C8DC31EDA6E' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgAppointedCameraRotator_32_6A3E5FD74FE996AFB7950C99CB35EAE3) == 0x000018, "Member 'FF_OrdinaryDialoguePreset::DlgAppointedCameraRotator_32_6A3E5FD74FE996AFB7950C99CB35EAE3' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraBlendInTime_24_A5066C224C0FC66F5FEFEFA28FFA9951) == 0x000030, "Member 'FF_OrdinaryDialoguePreset::DlgCameraBlendInTime_24_A5066C224C0FC66F5FEFEFA28FFA9951' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraBlendOutTime_23_467FCD7A4A176B71D06AFCA2ED089F8C) == 0x000038, "Member 'FF_OrdinaryDialoguePreset::DlgCameraBlendOutTime_23_467FCD7A4A176B71D06AFCA2ED089F8C' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraBlendOutYAngle_26_58A74C1E47BCCA1CE1E2518232388976) == 0x000040, "Member 'FF_OrdinaryDialoguePreset::DlgCameraBlendOutYAngle_26_58A74C1E47BCCA1CE1E2518232388976' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraTargetPointType_39_E44E30234ECE71EC2D4312A6555E42A9) == 0x000048, "Member 'FF_OrdinaryDialoguePreset::DlgCameraTargetPointType_39_E44E30234ECE71EC2D4312A6555E42A9' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DlgCameraTargetPointOffset_42_50DC9A95473DD014EC332AA41A3C34E1) == 0x000050, "Member 'FF_OrdinaryDialoguePreset::DlgCameraTargetPointOffset_42_50DC9A95473DD014EC332AA41A3C34E1' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, bCameraRotateAroundZAxisWhenOccluded_67_AF364101406285F34C12ED9CC0DA6AE1) == 0x000068, "Member 'FF_OrdinaryDialoguePreset::bCameraRotateAroundZAxisWhenOccluded_67_AF364101406285F34C12ED9CC0DA6AE1' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, bCameraRotateAroundXAxisWhenOccluded_68_594FB68C499A7D2BA558F7A8BC2A165F) == 0x000069, "Member 'FF_OrdinaryDialoguePreset::bCameraRotateAroundXAxisWhenOccluded_68_594FB68C499A7D2BA558F7A8BC2A165F' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DetermineOcclusionYawAngle_51_E77CF2114F0BF5511A4BBEA2EEDE4460) == 0x000070, "Member 'FF_OrdinaryDialoguePreset::DetermineOcclusionYawAngle_51_E77CF2114F0BF5511A4BBEA2EEDE4460' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, DetermineOcclusionPitchAngle_52_941C6D6B4AFE92F4361298900F7D63E8) == 0x000078, "Member 'FF_OrdinaryDialoguePreset::DetermineOcclusionPitchAngle_52_941C6D6B4AFE92F4361298900F7D63E8' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, AutoRotateAroundZAxisAngle_70_1C86D34146B057BC28ABA586E93901AA) == 0x000080, "Member 'FF_OrdinaryDialoguePreset::AutoRotateAroundZAxisAngle_70_1C86D34146B057BC28ABA586E93901AA' has a wrong offset!");
static_assert(offsetof(FF_OrdinaryDialoguePreset, AutoRotateAroundXAxisAngle_72_36B14864409788AEF267C5973828930F) == 0x000088, "Member 'FF_OrdinaryDialoguePreset::AutoRotateAroundXAxisAngle_72_36B14864409788AEF267C5973828930F' has a wrong offset!");

}

