#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PerformanceGestureInfo

#include "Basic.hpp"

#include "F_PerformanceAnimInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_PerformanceGestureInfo.F_PerformanceGestureInfo
// 0x0050 (0x0050 - 0x0000)
struct FF_PerformanceGestureInfo final
{
public:
	TSoftObjectPtr<class UAnimSequenceBase>       GestureAnim_9_EB468D684A59F36205F474B4308BB2CD;    // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bFullBodyGesture_8_1B38E70448D6D29C729BFDA39478968B; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HandIKOffsetPosition_15_0F986FD6442AE7C1CE9B0AB105916E83; // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_PerformanceAnimInfo                 PoseInfo_18_9721EEC941328BEB2B4AFD91BCA4AA99;      // 0x0048(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_PerformanceGestureInfo) == 0x000008, "Wrong alignment on FF_PerformanceGestureInfo");
static_assert(sizeof(FF_PerformanceGestureInfo) == 0x000050, "Wrong size on FF_PerformanceGestureInfo");
static_assert(offsetof(FF_PerformanceGestureInfo, GestureAnim_9_EB468D684A59F36205F474B4308BB2CD) == 0x000000, "Member 'FF_PerformanceGestureInfo::GestureAnim_9_EB468D684A59F36205F474B4308BB2CD' has a wrong offset!");
static_assert(offsetof(FF_PerformanceGestureInfo, bFullBodyGesture_8_1B38E70448D6D29C729BFDA39478968B) == 0x000028, "Member 'FF_PerformanceGestureInfo::bFullBodyGesture_8_1B38E70448D6D29C729BFDA39478968B' has a wrong offset!");
static_assert(offsetof(FF_PerformanceGestureInfo, HandIKOffsetPosition_15_0F986FD6442AE7C1CE9B0AB105916E83) == 0x000030, "Member 'FF_PerformanceGestureInfo::HandIKOffsetPosition_15_0F986FD6442AE7C1CE9B0AB105916E83' has a wrong offset!");
static_assert(offsetof(FF_PerformanceGestureInfo, PoseInfo_18_9721EEC941328BEB2B4AFD91BCA4AA99) == 0x000048, "Member 'FF_PerformanceGestureInfo::PoseInfo_18_9721EEC941328BEB2B4AFD91BCA4AA99' has a wrong offset!");

}

