#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PerformanceMode_PoseMontage

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_PerformanceMode_PoseMontage.F_PerformanceMode_PoseMontage
// 0x00F8 (0x00F8 - 0x0000)
struct FF_PerformanceMode_PoseMontage final
{
public:
	int32                                         PoseId_3_5927539C43C4F6D419649293CDE2E87B;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            InviteMain_32_805759A64F9FF6979B992D8F5C9E4C39;    // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            InviteEnd_33_01C7192742BE14B260A307A636E39FE5;     // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            HostMain_34_31DCB7E0430B51C23089ADBF24EEEBA4;      // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            HostEnd_35_DBA6EFC94BABF2255B8DEAB58BF0B8A0;       // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            RespondMain_36_D897D747422E373F83B9FA9C17D63228;   // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            RespondEnd_37_CF7B934D487635D53A0E14986F0E5731;    // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_PerformanceMode_PoseMontage) == 0x000008, "Wrong alignment on FF_PerformanceMode_PoseMontage");
static_assert(sizeof(FF_PerformanceMode_PoseMontage) == 0x0000F8, "Wrong size on FF_PerformanceMode_PoseMontage");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, PoseId_3_5927539C43C4F6D419649293CDE2E87B) == 0x000000, "Member 'FF_PerformanceMode_PoseMontage::PoseId_3_5927539C43C4F6D419649293CDE2E87B' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, InviteMain_32_805759A64F9FF6979B992D8F5C9E4C39) == 0x000008, "Member 'FF_PerformanceMode_PoseMontage::InviteMain_32_805759A64F9FF6979B992D8F5C9E4C39' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, InviteEnd_33_01C7192742BE14B260A307A636E39FE5) == 0x000030, "Member 'FF_PerformanceMode_PoseMontage::InviteEnd_33_01C7192742BE14B260A307A636E39FE5' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, HostMain_34_31DCB7E0430B51C23089ADBF24EEEBA4) == 0x000058, "Member 'FF_PerformanceMode_PoseMontage::HostMain_34_31DCB7E0430B51C23089ADBF24EEEBA4' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, HostEnd_35_DBA6EFC94BABF2255B8DEAB58BF0B8A0) == 0x000080, "Member 'FF_PerformanceMode_PoseMontage::HostEnd_35_DBA6EFC94BABF2255B8DEAB58BF0B8A0' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, RespondMain_36_D897D747422E373F83B9FA9C17D63228) == 0x0000A8, "Member 'FF_PerformanceMode_PoseMontage::RespondMain_36_D897D747422E373F83B9FA9C17D63228' has a wrong offset!");
static_assert(offsetof(FF_PerformanceMode_PoseMontage, RespondEnd_37_CF7B934D487635D53A0E14986F0E5731) == 0x0000D0, "Member 'FF_PerformanceMode_PoseMontage::RespondEnd_37_CF7B934D487635D53A0E14986F0E5731' has a wrong offset!");

}

