#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PI_StanceAnimInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "F_PerformanceAnimInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_PI_StanceAnimInfo.F_PI_StanceAnimInfo
// 0x0058 (0x0058 - 0x0000)
struct FF_PI_StanceAnimInfo final
{
public:
	struct FGameplayTag                           StanceTag_16_348AA2EC433E739E9BB92D841F9EA092;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       StanceAnim_18_1F14E69A4EE6AFCC9F1D2E84B0406FA5;    // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bOnlyUseAOHead_8_4ECFFA804860C888BC8B2393B9CEB88A; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HandIKOffsetPosition_11_64EE72F44071C7B47915C0A4CF704235; // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_PerformanceAnimInfo                 PoseInfo_15_8BD2A4B44172D2078C7C61B6A6F5B8C6;      // 0x0050(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_PI_StanceAnimInfo) == 0x000008, "Wrong alignment on FF_PI_StanceAnimInfo");
static_assert(sizeof(FF_PI_StanceAnimInfo) == 0x000058, "Wrong size on FF_PI_StanceAnimInfo");
static_assert(offsetof(FF_PI_StanceAnimInfo, StanceTag_16_348AA2EC433E739E9BB92D841F9EA092) == 0x000000, "Member 'FF_PI_StanceAnimInfo::StanceTag_16_348AA2EC433E739E9BB92D841F9EA092' has a wrong offset!");
static_assert(offsetof(FF_PI_StanceAnimInfo, StanceAnim_18_1F14E69A4EE6AFCC9F1D2E84B0406FA5) == 0x000008, "Member 'FF_PI_StanceAnimInfo::StanceAnim_18_1F14E69A4EE6AFCC9F1D2E84B0406FA5' has a wrong offset!");
static_assert(offsetof(FF_PI_StanceAnimInfo, bOnlyUseAOHead_8_4ECFFA804860C888BC8B2393B9CEB88A) == 0x000030, "Member 'FF_PI_StanceAnimInfo::bOnlyUseAOHead_8_4ECFFA804860C888BC8B2393B9CEB88A' has a wrong offset!");
static_assert(offsetof(FF_PI_StanceAnimInfo, HandIKOffsetPosition_11_64EE72F44071C7B47915C0A4CF704235) == 0x000038, "Member 'FF_PI_StanceAnimInfo::HandIKOffsetPosition_11_64EE72F44071C7B47915C0A4CF704235' has a wrong offset!");
static_assert(offsetof(FF_PI_StanceAnimInfo, PoseInfo_15_8BD2A4B44172D2078C7C61B6A6F5B8C6) == 0x000050, "Member 'FF_PI_StanceAnimInfo::PoseInfo_15_8BD2A4B44172D2078C7C61B6A6F5B8C6' has a wrong offset!");

}

