#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PlayerInputConfigByDevice_CT

#include "Basic.hpp"

#include "X6Game_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_PlayerInputConfigByDevice_CT.F_PlayerInputConfigByDevice_CT
// 0x00C0 (0x00C0 - 0x0000)
struct FF_PlayerInputConfigByDevice_CT final
{
public:
	bool                                          EnableInputLimitFeature_86_5E3F23204BE174E54945BF980800F8E1; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForwardInputLowerLimit_17_DA0009B7427D262F447656A08045FC59; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForwardInputUpperLimit_18_BD13CA9B46F2B34BCEFFDF9046089BA4; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForwardOutputLowerLimit_19_B82FFDE24C1478C599AF52A0A14EFD7F; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForwardOutputUpperLimit_20_931AC8CD490DC1E4594A3EA752E208CE; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightInputLowerLimit_22_237C2EE54185CEFA7834138E3E9E936D; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightInputUpperLimit_23_1E36B66B4C2AD52119ADB9A2D2D696A8; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightOutputLowerLimit_24_3A5FBA4C4E68EDA1A807F1977ECF26EC; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightOutputUpperLimit_25_73093A2940C6C286B4D70AA494DFB434; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LogicalFramesPerSecond_31_F3BBD31141097C138C48DAA50C51DE18; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableStartMovingInputCache_75_DBC33E6F4943336AD984A299DCE08051; // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreStartFrames_46_1EEDC32B4B66D3B0850CABBF189F530C; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartMovingInputCacheFrames_42_C3DC963E43FB74CC74FDAA95550F934B; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableInvalidInput_76_237385F14F08F1C250331485A95DB5E0; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InvalidInputFrames_43_59DB077A49808D65018637A3E0D722EF; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableMutationCache_77_C7997DB64408D5DE625856999416FFFA; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MutationCacheFrames_44_4FBCF1EC43A70E10041F0F82793EF11D; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MutationInputSizeThreshold_92_394724CE491EA4DFA50A8883C51E8AC2; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MutationInputDirectionThreshold_94_F06573DD489A9DBDD0A74DB101D0AC1C; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_CacheSkillDashInput_89_64C5275F4A45664D10960C887620D1E8; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAngularDeadZone_111_B67971E54D8EB7C23868D19D6C357CD1; // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAngularInputDeadZoneConfig>    AngularDeadZoneConfigList_112_5CC5E8EC47F83E44BE39B6868EDF53F4; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	double                                        MaxSpeedDeadZoneDelaySeconds_108_E7D16F6D4CF1E2A18842E5ABE7982C31; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSpeedDeadZoneLerpSeconds_110_C8DDFC41451DE9CA9015C4BF434FBD32; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_PlayerInputConfigByDevice_CT) == 0x000008, "Wrong alignment on FF_PlayerInputConfigByDevice_CT");
static_assert(sizeof(FF_PlayerInputConfigByDevice_CT) == 0x0000C0, "Wrong size on FF_PlayerInputConfigByDevice_CT");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, EnableInputLimitFeature_86_5E3F23204BE174E54945BF980800F8E1) == 0x000000, "Member 'FF_PlayerInputConfigByDevice_CT::EnableInputLimitFeature_86_5E3F23204BE174E54945BF980800F8E1' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, ForwardInputLowerLimit_17_DA0009B7427D262F447656A08045FC59) == 0x000008, "Member 'FF_PlayerInputConfigByDevice_CT::ForwardInputLowerLimit_17_DA0009B7427D262F447656A08045FC59' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, ForwardInputUpperLimit_18_BD13CA9B46F2B34BCEFFDF9046089BA4) == 0x000010, "Member 'FF_PlayerInputConfigByDevice_CT::ForwardInputUpperLimit_18_BD13CA9B46F2B34BCEFFDF9046089BA4' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, ForwardOutputLowerLimit_19_B82FFDE24C1478C599AF52A0A14EFD7F) == 0x000018, "Member 'FF_PlayerInputConfigByDevice_CT::ForwardOutputLowerLimit_19_B82FFDE24C1478C599AF52A0A14EFD7F' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, ForwardOutputUpperLimit_20_931AC8CD490DC1E4594A3EA752E208CE) == 0x000020, "Member 'FF_PlayerInputConfigByDevice_CT::ForwardOutputUpperLimit_20_931AC8CD490DC1E4594A3EA752E208CE' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, RightInputLowerLimit_22_237C2EE54185CEFA7834138E3E9E936D) == 0x000028, "Member 'FF_PlayerInputConfigByDevice_CT::RightInputLowerLimit_22_237C2EE54185CEFA7834138E3E9E936D' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, RightInputUpperLimit_23_1E36B66B4C2AD52119ADB9A2D2D696A8) == 0x000030, "Member 'FF_PlayerInputConfigByDevice_CT::RightInputUpperLimit_23_1E36B66B4C2AD52119ADB9A2D2D696A8' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, RightOutputLowerLimit_24_3A5FBA4C4E68EDA1A807F1977ECF26EC) == 0x000038, "Member 'FF_PlayerInputConfigByDevice_CT::RightOutputLowerLimit_24_3A5FBA4C4E68EDA1A807F1977ECF26EC' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, RightOutputUpperLimit_25_73093A2940C6C286B4D70AA494DFB434) == 0x000040, "Member 'FF_PlayerInputConfigByDevice_CT::RightOutputUpperLimit_25_73093A2940C6C286B4D70AA494DFB434' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, LogicalFramesPerSecond_31_F3BBD31141097C138C48DAA50C51DE18) == 0x000048, "Member 'FF_PlayerInputConfigByDevice_CT::LogicalFramesPerSecond_31_F3BBD31141097C138C48DAA50C51DE18' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, EnableStartMovingInputCache_75_DBC33E6F4943336AD984A299DCE08051) == 0x00004C, "Member 'FF_PlayerInputConfigByDevice_CT::EnableStartMovingInputCache_75_DBC33E6F4943336AD984A299DCE08051' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, PreStartFrames_46_1EEDC32B4B66D3B0850CABBF189F530C) == 0x000050, "Member 'FF_PlayerInputConfigByDevice_CT::PreStartFrames_46_1EEDC32B4B66D3B0850CABBF189F530C' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, StartMovingInputCacheFrames_42_C3DC963E43FB74CC74FDAA95550F934B) == 0x000058, "Member 'FF_PlayerInputConfigByDevice_CT::StartMovingInputCacheFrames_42_C3DC963E43FB74CC74FDAA95550F934B' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, EnableInvalidInput_76_237385F14F08F1C250331485A95DB5E0) == 0x000060, "Member 'FF_PlayerInputConfigByDevice_CT::EnableInvalidInput_76_237385F14F08F1C250331485A95DB5E0' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, InvalidInputFrames_43_59DB077A49808D65018637A3E0D722EF) == 0x000068, "Member 'FF_PlayerInputConfigByDevice_CT::InvalidInputFrames_43_59DB077A49808D65018637A3E0D722EF' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, EnableMutationCache_77_C7997DB64408D5DE625856999416FFFA) == 0x000070, "Member 'FF_PlayerInputConfigByDevice_CT::EnableMutationCache_77_C7997DB64408D5DE625856999416FFFA' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, MutationCacheFrames_44_4FBCF1EC43A70E10041F0F82793EF11D) == 0x000078, "Member 'FF_PlayerInputConfigByDevice_CT::MutationCacheFrames_44_4FBCF1EC43A70E10041F0F82793EF11D' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, MutationInputSizeThreshold_92_394724CE491EA4DFA50A8883C51E8AC2) == 0x000080, "Member 'FF_PlayerInputConfigByDevice_CT::MutationInputSizeThreshold_92_394724CE491EA4DFA50A8883C51E8AC2' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, MutationInputDirectionThreshold_94_F06573DD489A9DBDD0A74DB101D0AC1C) == 0x000088, "Member 'FF_PlayerInputConfigByDevice_CT::MutationInputDirectionThreshold_94_F06573DD489A9DBDD0A74DB101D0AC1C' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, Time_CacheSkillDashInput_89_64C5275F4A45664D10960C887620D1E8) == 0x000090, "Member 'FF_PlayerInputConfigByDevice_CT::Time_CacheSkillDashInput_89_64C5275F4A45664D10960C887620D1E8' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, EnableAngularDeadZone_111_B67971E54D8EB7C23868D19D6C357CD1) == 0x000098, "Member 'FF_PlayerInputConfigByDevice_CT::EnableAngularDeadZone_111_B67971E54D8EB7C23868D19D6C357CD1' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, AngularDeadZoneConfigList_112_5CC5E8EC47F83E44BE39B6868EDF53F4) == 0x0000A0, "Member 'FF_PlayerInputConfigByDevice_CT::AngularDeadZoneConfigList_112_5CC5E8EC47F83E44BE39B6868EDF53F4' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, MaxSpeedDeadZoneDelaySeconds_108_E7D16F6D4CF1E2A18842E5ABE7982C31) == 0x0000B0, "Member 'FF_PlayerInputConfigByDevice_CT::MaxSpeedDeadZoneDelaySeconds_108_E7D16F6D4CF1E2A18842E5ABE7982C31' has a wrong offset!");
static_assert(offsetof(FF_PlayerInputConfigByDevice_CT, MaxSpeedDeadZoneLerpSeconds_110_C8DDFC41451DE9CA9015C4BF434FBD32) == 0x0000B8, "Member 'FF_PlayerInputConfigByDevice_CT::MaxSpeedDeadZoneLerpSeconds_110_C8DDFC41451DE9CA9015C4BF434FBD32' has a wrong offset!");

}

