#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_PuzzleRoomTipsConfigs

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_PuzzleRoomTipsConfigs.F_PuzzleRoomTipsConfigs
// 0x0028 (0x0028 - 0x0000)
struct FF_PuzzleRoomTipsConfigs final
{
public:
	int32                                         PuzzleRoomID_4_E73E8E7D4C543548D9B9F1B1AEB42253;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Banner_Content_6_EF29CF804E1843822DFF818E016B31ED; // 0x0008(0x0010)(Edit, BlueprintVisible)
	class FText                                   Task_Content_7_14A3B1CF45277A4D72C2C7809F1F580E;   // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_PuzzleRoomTipsConfigs) == 0x000008, "Wrong alignment on FF_PuzzleRoomTipsConfigs");
static_assert(sizeof(FF_PuzzleRoomTipsConfigs) == 0x000028, "Wrong size on FF_PuzzleRoomTipsConfigs");
static_assert(offsetof(FF_PuzzleRoomTipsConfigs, PuzzleRoomID_4_E73E8E7D4C543548D9B9F1B1AEB42253) == 0x000000, "Member 'FF_PuzzleRoomTipsConfigs::PuzzleRoomID_4_E73E8E7D4C543548D9B9F1B1AEB42253' has a wrong offset!");
static_assert(offsetof(FF_PuzzleRoomTipsConfigs, Banner_Content_6_EF29CF804E1843822DFF818E016B31ED) == 0x000008, "Member 'FF_PuzzleRoomTipsConfigs::Banner_Content_6_EF29CF804E1843822DFF818E016B31ED' has a wrong offset!");
static_assert(offsetof(FF_PuzzleRoomTipsConfigs, Task_Content_7_14A3B1CF45277A4D72C2C7809F1F580E) == 0x000018, "Member 'FF_PuzzleRoomTipsConfigs::Task_Content_7_14A3B1CF45277A4D72C2C7809F1F580E' has a wrong offset!");

}

