#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_RecoveryComboMontageDetail

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_RecoveryComboMontageDetail.F_RecoveryComboMontageDetail
// 0x0058 (0x0058 - 0x0000)
struct FF_RecoveryComboMontageDetail final
{
public:
	struct FGameplayTag                           TagForMontage_16_03F47EA946FB3953E5146FA6A4FA3F15; // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9;    // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_RecoveryComboMontageDetail) == 0x000008, "Wrong alignment on FF_RecoveryComboMontageDetail");
static_assert(sizeof(FF_RecoveryComboMontageDetail) == 0x000058, "Wrong size on FF_RecoveryComboMontageDetail");
static_assert(offsetof(FF_RecoveryComboMontageDetail, TagForMontage_16_03F47EA946FB3953E5146FA6A4FA3F15) == 0x000000, "Member 'FF_RecoveryComboMontageDetail::TagForMontage_16_03F47EA946FB3953E5146FA6A4FA3F15' has a wrong offset!");
static_assert(offsetof(FF_RecoveryComboMontageDetail, PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9) == 0x000008, "Member 'FF_RecoveryComboMontageDetail::PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9' has a wrong offset!");
static_assert(offsetof(FF_RecoveryComboMontageDetail, FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B) == 0x000030, "Member 'FF_RecoveryComboMontageDetail::FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B' has a wrong offset!");

}

