#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_RecoveryMontage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_RecoveryMontage.F_RecoveryMontage
// 0x0080 (0x0080 - 0x0000)
struct FF_RecoveryMontage final
{
public:
	class FString                                 Description_9_35A5FC6645A9719F5291F2B3EADCE698;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA; // 0x0010(0x0020)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UAnimMontage>            PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9;    // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_RecoveryMontage) == 0x000008, "Wrong alignment on FF_RecoveryMontage");
static_assert(sizeof(FF_RecoveryMontage) == 0x000080, "Wrong size on FF_RecoveryMontage");
static_assert(offsetof(FF_RecoveryMontage, Description_9_35A5FC6645A9719F5291F2B3EADCE698) == 0x000000, "Member 'FF_RecoveryMontage::Description_9_35A5FC6645A9719F5291F2B3EADCE698' has a wrong offset!");
static_assert(offsetof(FF_RecoveryMontage, ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA) == 0x000010, "Member 'FF_RecoveryMontage::ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA' has a wrong offset!");
static_assert(offsetof(FF_RecoveryMontage, PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9) == 0x000030, "Member 'FF_RecoveryMontage::PlayMontage_6_3A8972254C38B874B6B2D58652E9DDD9' has a wrong offset!");
static_assert(offsetof(FF_RecoveryMontage, FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B) == 0x000058, "Member 'FF_RecoveryMontage::FullBodyMontage_13_7969CCA44A6AABB714580AA4DE3C3D9B' has a wrong offset!");

}

