#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_RecoveryPre

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_RecoveryPre.F_RecoveryPre
// 0x0058 (0x0058 - 0x0000)
struct FF_RecoveryPre final
{
public:
	class FText                                   Description_39_54C3654345871FE76C00FABA74F6FE99;   // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FGameplayTag                           FXGCTag_25_59CC45774437EDB0D6BBC9B23F7E4043;       // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActivationRequiredTags_33_CB0A4D514843C921A04146A0EAEBBA41; // 0x0018(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  ActivationBlockedTags_34_1139E0A4400ED98CBAF9238BD98E1E2B; // 0x0038(0x0020)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_RecoveryPre) == 0x000008, "Wrong alignment on FF_RecoveryPre");
static_assert(sizeof(FF_RecoveryPre) == 0x000058, "Wrong size on FF_RecoveryPre");
static_assert(offsetof(FF_RecoveryPre, Description_39_54C3654345871FE76C00FABA74F6FE99) == 0x000000, "Member 'FF_RecoveryPre::Description_39_54C3654345871FE76C00FABA74F6FE99' has a wrong offset!");
static_assert(offsetof(FF_RecoveryPre, FXGCTag_25_59CC45774437EDB0D6BBC9B23F7E4043) == 0x000010, "Member 'FF_RecoveryPre::FXGCTag_25_59CC45774437EDB0D6BBC9B23F7E4043' has a wrong offset!");
static_assert(offsetof(FF_RecoveryPre, ActivationRequiredTags_33_CB0A4D514843C921A04146A0EAEBBA41) == 0x000018, "Member 'FF_RecoveryPre::ActivationRequiredTags_33_CB0A4D514843C921A04146A0EAEBBA41' has a wrong offset!");
static_assert(offsetof(FF_RecoveryPre, ActivationBlockedTags_34_1139E0A4400ED98CBAF9238BD98E1E2B) == 0x000038, "Member 'FF_RecoveryPre::ActivationBlockedTags_34_1139E0A4400ED98CBAF9238BD98E1E2B' has a wrong offset!");

}

