#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_RecoveryComboMontage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "F_RecoveryComboMontageDetail_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_RecoveryComboMontage.F_RecoveryComboMontage
// 0x0040 (0x0040 - 0x0000)
struct FF_RecoveryComboMontage final
{
public:
	class FString                                 Description_9_35A5FC6645A9719F5291F2B3EADCE698;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA; // 0x0010(0x0020)(Edit, BlueprintVisible)
	TArray<struct FF_RecoveryComboMontageDetail>  DetailsArray_24_02EB2BB24FBFAF6DB627A1BC08CC1F19;  // 0x0030(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_RecoveryComboMontage) == 0x000008, "Wrong alignment on FF_RecoveryComboMontage");
static_assert(sizeof(FF_RecoveryComboMontage) == 0x000040, "Wrong size on FF_RecoveryComboMontage");
static_assert(offsetof(FF_RecoveryComboMontage, Description_9_35A5FC6645A9719F5291F2B3EADCE698) == 0x000000, "Member 'FF_RecoveryComboMontage::Description_9_35A5FC6645A9719F5291F2B3EADCE698' has a wrong offset!");
static_assert(offsetof(FF_RecoveryComboMontage, ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA) == 0x000010, "Member 'FF_RecoveryComboMontage::ActivationRequiredTags_2_E4C593BD4424FB7BBC511B97ED2884CA' has a wrong offset!");
static_assert(offsetof(FF_RecoveryComboMontage, DetailsArray_24_02EB2BB24FBFAF6DB627A1BC08CC1F19) == 0x000030, "Member 'FF_RecoveryComboMontage::DetailsArray_24_02EB2BB24FBFAF6DB627A1BC08CC1F19' has a wrong offset!");

}

