#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_RiskPhotoMonsterInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ERiskPhotoCondType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_RiskPhotoMonsterInfo.F_RiskPhotoMonsterInfo
// 0x0020 (0x0020 - 0x0000)
struct FF_RiskPhotoMonsterInfo final
{
public:
	ERiskPhotoCondType                            CondType_15_46936CB74AE890C7497F0FB41AFA5956;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BattleSymbol_14_EFF2454244A9220426AC8995C6B1BC2E;  // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MonsterInfoHintText_23_BFE29A2A424AABF5DB62F9901EA61EF1; // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_RiskPhotoMonsterInfo) == 0x000008, "Wrong alignment on FF_RiskPhotoMonsterInfo");
static_assert(sizeof(FF_RiskPhotoMonsterInfo) == 0x000020, "Wrong size on FF_RiskPhotoMonsterInfo");
static_assert(offsetof(FF_RiskPhotoMonsterInfo, CondType_15_46936CB74AE890C7497F0FB41AFA5956) == 0x000000, "Member 'FF_RiskPhotoMonsterInfo::CondType_15_46936CB74AE890C7497F0FB41AFA5956' has a wrong offset!");
static_assert(offsetof(FF_RiskPhotoMonsterInfo, BattleSymbol_14_EFF2454244A9220426AC8995C6B1BC2E) == 0x000004, "Member 'FF_RiskPhotoMonsterInfo::BattleSymbol_14_EFF2454244A9220426AC8995C6B1BC2E' has a wrong offset!");
static_assert(offsetof(FF_RiskPhotoMonsterInfo, MonsterInfoHintText_23_BFE29A2A424AABF5DB62F9901EA61EF1) == 0x000010, "Member 'FF_RiskPhotoMonsterInfo::MonsterInfoHintText_23_BFE29A2A424AABF5DB62F9901EA61EF1' has a wrong offset!");

}

