#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_SenseSightConfig

#include "Basic.hpp"

#include "X6Enum_AISenseFilter_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_SenseSightConfig.F_SenseSightConfig
// 0x0058 (0x0058 - 0x0000)
struct FF_SenseSightConfig final
{
public:
	TArray<EX6Enum_AISenseFilter>                 filter_flags_31_35E569A9454DEFC5E9CD3AA01733519C;  // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FName                                   socket_name_8_6E3A28F042A37CA59C51CEBEE52B5C0A;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   user_define_tag_30_B9D661644D3268F7234D12AE9181B6B6; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 sense_shape_14_7CB7B78C4AF714F158D562A78A60B0B5;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        radius_17_0750CC4F46148A2C0B931BBC55009D94;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        half_degrees_19_BD69F100460ED1A00AD3E991D8F3F958;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        half_height_21_976483424D03A4DB43A17FA402EA1F71;   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        lost_radius_23_A0100EA947CF6BB37ADC398485B356F2;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        lost_half_degrees_25_778EE55A4120B8AADA8BD1B941915388; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        lost_half_height_28_3E4EC87147398E7E8415D5A3046ADE4B; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_SenseSightConfig) == 0x000008, "Wrong alignment on FF_SenseSightConfig");
static_assert(sizeof(FF_SenseSightConfig) == 0x000058, "Wrong size on FF_SenseSightConfig");
static_assert(offsetof(FF_SenseSightConfig, filter_flags_31_35E569A9454DEFC5E9CD3AA01733519C) == 0x000000, "Member 'FF_SenseSightConfig::filter_flags_31_35E569A9454DEFC5E9CD3AA01733519C' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, socket_name_8_6E3A28F042A37CA59C51CEBEE52B5C0A) == 0x000010, "Member 'FF_SenseSightConfig::socket_name_8_6E3A28F042A37CA59C51CEBEE52B5C0A' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, user_define_tag_30_B9D661644D3268F7234D12AE9181B6B6) == 0x000018, "Member 'FF_SenseSightConfig::user_define_tag_30_B9D661644D3268F7234D12AE9181B6B6' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, sense_shape_14_7CB7B78C4AF714F158D562A78A60B0B5) == 0x000020, "Member 'FF_SenseSightConfig::sense_shape_14_7CB7B78C4AF714F158D562A78A60B0B5' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, radius_17_0750CC4F46148A2C0B931BBC55009D94) == 0x000028, "Member 'FF_SenseSightConfig::radius_17_0750CC4F46148A2C0B931BBC55009D94' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, half_degrees_19_BD69F100460ED1A00AD3E991D8F3F958) == 0x000030, "Member 'FF_SenseSightConfig::half_degrees_19_BD69F100460ED1A00AD3E991D8F3F958' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, half_height_21_976483424D03A4DB43A17FA402EA1F71) == 0x000038, "Member 'FF_SenseSightConfig::half_height_21_976483424D03A4DB43A17FA402EA1F71' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, lost_radius_23_A0100EA947CF6BB37ADC398485B356F2) == 0x000040, "Member 'FF_SenseSightConfig::lost_radius_23_A0100EA947CF6BB37ADC398485B356F2' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, lost_half_degrees_25_778EE55A4120B8AADA8BD1B941915388) == 0x000048, "Member 'FF_SenseSightConfig::lost_half_degrees_25_778EE55A4120B8AADA8BD1B941915388' has a wrong offset!");
static_assert(offsetof(FF_SenseSightConfig, lost_half_height_28_3E4EC87147398E7E8415D5A3046ADE4B) == 0x000050, "Member 'FF_SenseSightConfig::lost_half_height_28_3E4EC87147398E7E8415D5A3046ADE4B' has a wrong offset!");

}

