#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_SimulatedWoolenHeartPerformanceInfo

#include "Basic.hpp"

#include "EGetWoolenHeartPerformanceType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EWoolenHeartEMVersion_structs.hpp"
#include "F_SharedWoolenHeartConfig_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_SimulatedWoolenHeartPerformanceInfo.F_SimulatedWoolenHeartPerformanceInfo
// 0x0160 (0x0160 - 0x0000)
struct FF_SimulatedWoolenHeartPerformanceInfo final
{
public:
	struct FTransform                             WoolenHeartTransform_2_6E81264A47108C358F7994A686F1037A; // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWoolenHeartEMVersion                         EMVersion_5_7AB7351E408AC4B4AD23DDAC9A43E693;      // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShareToLocalPlayer_8_68F9112C43DDFB80A23B3AA3C435093E; // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         WoolenHeartEntityID_11_6FA08974461ED36FE33042BB27AB5DFD; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         LS_16_D8FACB8D4E519033FF68438C44BC0E5F;            // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          WoolenHeartMesh_19_90FD18434BF7EEF8858BAAADC12168CC; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      WoolenHeartAnim_20_885C259D4E6002017A96D89D68DC0AA6; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGetWoolenHeartPerformanceType                PerformanceType_30_D8B63D1F439953952EA06A9226D4C325; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class AActor*>              BindingTag2Actor_34_CF876A6648D66078D173E4946CE27A3D; // 0x0090(0x0050)(Edit, BlueprintVisible)
	class UStaticMesh*                            SharedWoolenHeartMesh_37_F1CB8CBB4315BE25B3D57FA04E0459E4; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FF_SharedWoolenHeartConfig             SharedWoolenHeartConfig_40_30F4E7A3409796AE481FF5B6329DA31C; // 0x00E8(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPhantom_42_022903CF447074BC20628B9C43A6CF52;      // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UMaterialInterface*>  SKMeshPhantomMaterials_49_E636321E4A9F3BF6887273AAA9597759; // 0x0108(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FF_SimulatedWoolenHeartPerformanceInfo) == 0x000010, "Wrong alignment on FF_SimulatedWoolenHeartPerformanceInfo");
static_assert(sizeof(FF_SimulatedWoolenHeartPerformanceInfo) == 0x000160, "Wrong size on FF_SimulatedWoolenHeartPerformanceInfo");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, WoolenHeartTransform_2_6E81264A47108C358F7994A686F1037A) == 0x000000, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::WoolenHeartTransform_2_6E81264A47108C358F7994A686F1037A' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, EMVersion_5_7AB7351E408AC4B4AD23DDAC9A43E693) == 0x000060, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::EMVersion_5_7AB7351E408AC4B4AD23DDAC9A43E693' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, bShareToLocalPlayer_8_68F9112C43DDFB80A23B3AA3C435093E) == 0x000061, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::bShareToLocalPlayer_8_68F9112C43DDFB80A23B3AA3C435093E' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, WoolenHeartEntityID_11_6FA08974461ED36FE33042BB27AB5DFD) == 0x000068, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::WoolenHeartEntityID_11_6FA08974461ED36FE33042BB27AB5DFD' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, LS_16_D8FACB8D4E519033FF68438C44BC0E5F) == 0x000070, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::LS_16_D8FACB8D4E519033FF68438C44BC0E5F' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, WoolenHeartMesh_19_90FD18434BF7EEF8858BAAADC12168CC) == 0x000078, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::WoolenHeartMesh_19_90FD18434BF7EEF8858BAAADC12168CC' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, WoolenHeartAnim_20_885C259D4E6002017A96D89D68DC0AA6) == 0x000080, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::WoolenHeartAnim_20_885C259D4E6002017A96D89D68DC0AA6' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, PerformanceType_30_D8B63D1F439953952EA06A9226D4C325) == 0x000088, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::PerformanceType_30_D8B63D1F439953952EA06A9226D4C325' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, BindingTag2Actor_34_CF876A6648D66078D173E4946CE27A3D) == 0x000090, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::BindingTag2Actor_34_CF876A6648D66078D173E4946CE27A3D' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, SharedWoolenHeartMesh_37_F1CB8CBB4315BE25B3D57FA04E0459E4) == 0x0000E0, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::SharedWoolenHeartMesh_37_F1CB8CBB4315BE25B3D57FA04E0459E4' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, SharedWoolenHeartConfig_40_30F4E7A3409796AE481FF5B6329DA31C) == 0x0000E8, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::SharedWoolenHeartConfig_40_30F4E7A3409796AE481FF5B6329DA31C' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, bPhantom_42_022903CF447074BC20628B9C43A6CF52) == 0x000100, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::bPhantom_42_022903CF447074BC20628B9C43A6CF52' has a wrong offset!");
static_assert(offsetof(FF_SimulatedWoolenHeartPerformanceInfo, SKMeshPhantomMaterials_49_E636321E4A9F3BF6887273AAA9597759) == 0x000108, "Member 'FF_SimulatedWoolenHeartPerformanceInfo::SKMeshPhantomMaterials_49_E636321E4A9F3BF6887273AAA9597759' has a wrong offset!");

}

