#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_SoundSeedInfoStruct

#include "Basic.hpp"

#include "Enum_AmbSpawnType_structs.hpp"
#include "F_SoundSeedAkEventStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_SoundSeedInfoStruct.F_SoundSeedInfoStruct
// 0x0068 (0x0068 - 0x0000)
struct FF_SoundSeedInfoStruct final
{
public:
	uint8                                         Id_18_CFD938F74A59188C68171CB8B3E10792;            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<Enum_AmbSpawnType, struct FF_SoundSeedAkEventStruct> AkEvents_27_A93D20DD4EF1F8234A4C059CB96DC22B; // 0x0008(0x0050)(Edit, BlueprintVisible)
	double                                        OffsetScale_21_8B6CDE3F40636F6BCD4DE699393C19B5;   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveRange_26_2EFEBFAC44224FDFAF85168BA931D06C;   // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_SoundSeedInfoStruct) == 0x000008, "Wrong alignment on FF_SoundSeedInfoStruct");
static_assert(sizeof(FF_SoundSeedInfoStruct) == 0x000068, "Wrong size on FF_SoundSeedInfoStruct");
static_assert(offsetof(FF_SoundSeedInfoStruct, Id_18_CFD938F74A59188C68171CB8B3E10792) == 0x000000, "Member 'FF_SoundSeedInfoStruct::Id_18_CFD938F74A59188C68171CB8B3E10792' has a wrong offset!");
static_assert(offsetof(FF_SoundSeedInfoStruct, AkEvents_27_A93D20DD4EF1F8234A4C059CB96DC22B) == 0x000008, "Member 'FF_SoundSeedInfoStruct::AkEvents_27_A93D20DD4EF1F8234A4C059CB96DC22B' has a wrong offset!");
static_assert(offsetof(FF_SoundSeedInfoStruct, OffsetScale_21_8B6CDE3F40636F6BCD4DE699393C19B5) == 0x000058, "Member 'FF_SoundSeedInfoStruct::OffsetScale_21_8B6CDE3F40636F6BCD4DE699393C19B5' has a wrong offset!");
static_assert(offsetof(FF_SoundSeedInfoStruct, ActiveRange_26_2EFEBFAC44224FDFAF85168BA931D06C) == 0x000060, "Member 'FF_SoundSeedInfoStruct::ActiveRange_26_2EFEBFAC44224FDFAF85168BA931D06C' has a wrong offset!");

}

