#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_StylizedStopAnimConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_StylizedStopAnimConfig.F_StylizedStopAnimConfig
// 0x0120 (0x0120 - 0x0000)
struct FF_StylizedStopAnimConfig final
{
public:
	bool                                          bUseAnimation_4_1D286BF64E3420894E34899C95883D18;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           Sprint_Stop_Animation_7_38AA8E994D9B1C7F8DF4B2A6B4D391E4; // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           Jog_Stop_Animation_9_227ABF904B8E7303B81E278FD1A3B0F9; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           Walk_Stop_Animation_11_E0BFD448490CCC9265EF3693119E2857; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           WalkSlow_Stop_Animation_13_4778F02E4B816B29032404BA4FB164E3; // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           Jog_StepStop_Animation_25_90053181446AE9AF3AD27DA13F496601; // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           Walk_StepStop_Animation_27_70EE78F543B06646D34F40976C55B016; // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           WalkSlow_StepStop_Animation_29_25C2FAE0405BE9A345F90EA683785F60; // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_StylizedStopAnimConfig) == 0x000008, "Wrong alignment on FF_StylizedStopAnimConfig");
static_assert(sizeof(FF_StylizedStopAnimConfig) == 0x000120, "Wrong size on FF_StylizedStopAnimConfig");
static_assert(offsetof(FF_StylizedStopAnimConfig, bUseAnimation_4_1D286BF64E3420894E34899C95883D18) == 0x000000, "Member 'FF_StylizedStopAnimConfig::bUseAnimation_4_1D286BF64E3420894E34899C95883D18' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, Sprint_Stop_Animation_7_38AA8E994D9B1C7F8DF4B2A6B4D391E4) == 0x000008, "Member 'FF_StylizedStopAnimConfig::Sprint_Stop_Animation_7_38AA8E994D9B1C7F8DF4B2A6B4D391E4' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, Jog_Stop_Animation_9_227ABF904B8E7303B81E278FD1A3B0F9) == 0x000030, "Member 'FF_StylizedStopAnimConfig::Jog_Stop_Animation_9_227ABF904B8E7303B81E278FD1A3B0F9' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, Walk_Stop_Animation_11_E0BFD448490CCC9265EF3693119E2857) == 0x000058, "Member 'FF_StylizedStopAnimConfig::Walk_Stop_Animation_11_E0BFD448490CCC9265EF3693119E2857' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, WalkSlow_Stop_Animation_13_4778F02E4B816B29032404BA4FB164E3) == 0x000080, "Member 'FF_StylizedStopAnimConfig::WalkSlow_Stop_Animation_13_4778F02E4B816B29032404BA4FB164E3' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, Jog_StepStop_Animation_25_90053181446AE9AF3AD27DA13F496601) == 0x0000A8, "Member 'FF_StylizedStopAnimConfig::Jog_StepStop_Animation_25_90053181446AE9AF3AD27DA13F496601' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, Walk_StepStop_Animation_27_70EE78F543B06646D34F40976C55B016) == 0x0000D0, "Member 'FF_StylizedStopAnimConfig::Walk_StepStop_Animation_27_70EE78F543B06646D34F40976C55B016' has a wrong offset!");
static_assert(offsetof(FF_StylizedStopAnimConfig, WalkSlow_StepStop_Animation_29_25C2FAE0405BE9A345F90EA683785F60) == 0x0000F8, "Member 'FF_StylizedStopAnimConfig::WalkSlow_StepStop_Animation_29_25C2FAE0405BE9A345F90EA683785F60' has a wrong offset!");

}

