#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_StylizedStartAnimConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_StylizedStartAnimConfig.F_StylizedStartAnimConfig
// 0x0268 (0x0268 - 0x0000)
struct FF_StylizedStartAnimConfig final
{
public:
	bool                                          bUseUpperArm_1_130D812D4BCB7D35ABA8C7932442C5F1;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           Start_Animation_4_DBE10A43469FC9E9AE91EE89163CC2F0; // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bUseSimplifiedStart_9_DC8030914E883046648615A48C6445E9; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           StartAnim_0_20_183DBE3D416FA9F6D135AE88CB2F878B;   // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_L45_21_709E610546E211856326B0859F378284; // 0x0060(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_R45_22_3931F1EF409B0BBEC80906A06EB94A2B; // 0x0088(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_L90_27_2B1F4C84416CBAE33C667DA11C030560; // 0x00B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_R90_28_E818304741AE74D427314BA2E09E0E31; // 0x00D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_L180_29_1CCB0BE3453376AB4721D09A27AD1846; // 0x0100(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartAnim_R180_30_A3F795314F30188C261FFF8043BBB7EA; // 0x0128(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_0_39_38107E3A47B185CD574401B1465BFC59; // 0x0150(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_L45_40_9C6795204090310AB3B2D2AB86F1EB15; // 0x0178(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_R45_41_486F28F14CDB31610F0F7EAFC1BAD4AB; // 0x01A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_L90_42_7BB338954C5DF26B036685AB955D8478; // 0x01C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_R90_43_27544982414806AD725A6287193260DD; // 0x01F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_L180_44_EEADE90E493B6A02ACB4449573886530; // 0x0218(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           StartSlowAnim_R180_45_D5E16B914ACA7462B3F45F9B1A94284F; // 0x0240(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_StylizedStartAnimConfig) == 0x000008, "Wrong alignment on FF_StylizedStartAnimConfig");
static_assert(sizeof(FF_StylizedStartAnimConfig) == 0x000268, "Wrong size on FF_StylizedStartAnimConfig");
static_assert(offsetof(FF_StylizedStartAnimConfig, bUseUpperArm_1_130D812D4BCB7D35ABA8C7932442C5F1) == 0x000000, "Member 'FF_StylizedStartAnimConfig::bUseUpperArm_1_130D812D4BCB7D35ABA8C7932442C5F1' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, Start_Animation_4_DBE10A43469FC9E9AE91EE89163CC2F0) == 0x000008, "Member 'FF_StylizedStartAnimConfig::Start_Animation_4_DBE10A43469FC9E9AE91EE89163CC2F0' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, bUseSimplifiedStart_9_DC8030914E883046648615A48C6445E9) == 0x000030, "Member 'FF_StylizedStartAnimConfig::bUseSimplifiedStart_9_DC8030914E883046648615A48C6445E9' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_0_20_183DBE3D416FA9F6D135AE88CB2F878B) == 0x000038, "Member 'FF_StylizedStartAnimConfig::StartAnim_0_20_183DBE3D416FA9F6D135AE88CB2F878B' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_L45_21_709E610546E211856326B0859F378284) == 0x000060, "Member 'FF_StylizedStartAnimConfig::StartAnim_L45_21_709E610546E211856326B0859F378284' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_R45_22_3931F1EF409B0BBEC80906A06EB94A2B) == 0x000088, "Member 'FF_StylizedStartAnimConfig::StartAnim_R45_22_3931F1EF409B0BBEC80906A06EB94A2B' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_L90_27_2B1F4C84416CBAE33C667DA11C030560) == 0x0000B0, "Member 'FF_StylizedStartAnimConfig::StartAnim_L90_27_2B1F4C84416CBAE33C667DA11C030560' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_R90_28_E818304741AE74D427314BA2E09E0E31) == 0x0000D8, "Member 'FF_StylizedStartAnimConfig::StartAnim_R90_28_E818304741AE74D427314BA2E09E0E31' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_L180_29_1CCB0BE3453376AB4721D09A27AD1846) == 0x000100, "Member 'FF_StylizedStartAnimConfig::StartAnim_L180_29_1CCB0BE3453376AB4721D09A27AD1846' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartAnim_R180_30_A3F795314F30188C261FFF8043BBB7EA) == 0x000128, "Member 'FF_StylizedStartAnimConfig::StartAnim_R180_30_A3F795314F30188C261FFF8043BBB7EA' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_0_39_38107E3A47B185CD574401B1465BFC59) == 0x000150, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_0_39_38107E3A47B185CD574401B1465BFC59' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_L45_40_9C6795204090310AB3B2D2AB86F1EB15) == 0x000178, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_L45_40_9C6795204090310AB3B2D2AB86F1EB15' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_R45_41_486F28F14CDB31610F0F7EAFC1BAD4AB) == 0x0001A0, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_R45_41_486F28F14CDB31610F0F7EAFC1BAD4AB' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_L90_42_7BB338954C5DF26B036685AB955D8478) == 0x0001C8, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_L90_42_7BB338954C5DF26B036685AB955D8478' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_R90_43_27544982414806AD725A6287193260DD) == 0x0001F0, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_R90_43_27544982414806AD725A6287193260DD' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_L180_44_EEADE90E493B6A02ACB4449573886530) == 0x000218, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_L180_44_EEADE90E493B6A02ACB4449573886530' has a wrong offset!");
static_assert(offsetof(FF_StylizedStartAnimConfig, StartSlowAnim_R180_45_D5E16B914ACA7462B3F45F9B1A94284F) == 0x000240, "Member 'FF_StylizedStartAnimConfig::StartSlowAnim_R180_45_D5E16B914ACA7462B3F45F9B1A94284F' has a wrong offset!");

}

