#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_StylizedPivotAnimConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_StylizedPivotAnimConfig.F_StylizedPivotAnimConfig
// 0x0058 (0x0058 - 0x0000)
struct FF_StylizedPivotAnimConfig final
{
public:
	bool                                          bBlendWithIdleArm_1_4645CC374C8F8FC44C037B8C4E5229EB; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUsePivotAnim_7_5EE9AAA748397A39DD90F19B316878F4;  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           PivotAnim_4_9201BB06467F8C39AE11D7874E3EE584;      // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PivotSlowAnim_10_90F713E349662B01B2844998B8364127; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_StylizedPivotAnimConfig) == 0x000008, "Wrong alignment on FF_StylizedPivotAnimConfig");
static_assert(sizeof(FF_StylizedPivotAnimConfig) == 0x000058, "Wrong size on FF_StylizedPivotAnimConfig");
static_assert(offsetof(FF_StylizedPivotAnimConfig, bBlendWithIdleArm_1_4645CC374C8F8FC44C037B8C4E5229EB) == 0x000000, "Member 'FF_StylizedPivotAnimConfig::bBlendWithIdleArm_1_4645CC374C8F8FC44C037B8C4E5229EB' has a wrong offset!");
static_assert(offsetof(FF_StylizedPivotAnimConfig, bUsePivotAnim_7_5EE9AAA748397A39DD90F19B316878F4) == 0x000001, "Member 'FF_StylizedPivotAnimConfig::bUsePivotAnim_7_5EE9AAA748397A39DD90F19B316878F4' has a wrong offset!");
static_assert(offsetof(FF_StylizedPivotAnimConfig, PivotAnim_4_9201BB06467F8C39AE11D7874E3EE584) == 0x000008, "Member 'FF_StylizedPivotAnimConfig::PivotAnim_4_9201BB06467F8C39AE11D7874E3EE584' has a wrong offset!");
static_assert(offsetof(FF_StylizedPivotAnimConfig, PivotSlowAnim_10_90F713E349662B01B2844998B8364127) == 0x000030, "Member 'FF_StylizedPivotAnimConfig::PivotSlowAnim_10_90F713E349662B01B2844998B8364127' has a wrong offset!");

}

