#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_SuitModifierSet

#include "Basic.hpp"

#include "F_AbilitySoftRefSet_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_SuitModifierSet.F_SuitModifierSet
// 0x0078 (0x0078 - 0x0000)
struct FF_SuitModifierSet final
{
public:
	class FString                                 Description_16_6DA04DE9444040BB3501038C3572CAA5;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FF_AbilitySoftRefSet>           AbilitySetDefault_40_A95E404E47747E6F519E0583E8272D9A; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TMap<int32, struct FF_AbilitySoftRefSet>      AbilitySetOverrideEquip_41_15915B7C4A86D3822CCDA8BB23554860; // 0x0020(0x0050)(Edit, BlueprintVisible)
	struct FGameplayTag                           SuitTag_44_72139B254AE3DBD462FAE998695B88FA;       // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_SuitModifierSet) == 0x000008, "Wrong alignment on FF_SuitModifierSet");
static_assert(sizeof(FF_SuitModifierSet) == 0x000078, "Wrong size on FF_SuitModifierSet");
static_assert(offsetof(FF_SuitModifierSet, Description_16_6DA04DE9444040BB3501038C3572CAA5) == 0x000000, "Member 'FF_SuitModifierSet::Description_16_6DA04DE9444040BB3501038C3572CAA5' has a wrong offset!");
static_assert(offsetof(FF_SuitModifierSet, AbilitySetDefault_40_A95E404E47747E6F519E0583E8272D9A) == 0x000010, "Member 'FF_SuitModifierSet::AbilitySetDefault_40_A95E404E47747E6F519E0583E8272D9A' has a wrong offset!");
static_assert(offsetof(FF_SuitModifierSet, AbilitySetOverrideEquip_41_15915B7C4A86D3822CCDA8BB23554860) == 0x000020, "Member 'FF_SuitModifierSet::AbilitySetOverrideEquip_41_15915B7C4A86D3822CCDA8BB23554860' has a wrong offset!");
static_assert(offsetof(FF_SuitModifierSet, SuitTag_44_72139B254AE3DBD462FAE998695B88FA) == 0x000070, "Member 'FF_SuitModifierSet::SuitTag_44_72139B254AE3DBD462FAE998695B88FA' has a wrong offset!");

}

