#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_TargetingPickerConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ETargetingPickerShapeType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_TargetingPickerConfig.F_TargetingPickerConfig
// 0x0050 (0x0050 - 0x0000)
struct FF_TargetingPickerConfig final
{
public:
	ETargetingPickerShapeType                     ShapeType_51_FBDA8AD149618D43FDB25BA1767098D4;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            WeightCurve_76_282045C2454E1AD57FF94C95A8B931B7;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_56_7A8D82CA484CA7253D911FAE90229E86;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HalfHeight_80_D9C4D7E6472A75C243BB309253B3827C;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle_57_F24316164FDB732A0D7FA4B787A444B3;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffset_67_3D9672F64FEC3D93FC4C778674AB7D57; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YawOffset_72_B460D415499ED5D69C09788193CB9E85;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawDebug_83_869BC8784423B3147CEBFEBCC6302FF9;    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 DebugColor_81_7285E9B04AF8406AD3DE4E8D182A57B7;    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_TargetingPickerConfig) == 0x000008, "Wrong alignment on FF_TargetingPickerConfig");
static_assert(sizeof(FF_TargetingPickerConfig) == 0x000050, "Wrong size on FF_TargetingPickerConfig");
static_assert(offsetof(FF_TargetingPickerConfig, ShapeType_51_FBDA8AD149618D43FDB25BA1767098D4) == 0x000000, "Member 'FF_TargetingPickerConfig::ShapeType_51_FBDA8AD149618D43FDB25BA1767098D4' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, WeightCurve_76_282045C2454E1AD57FF94C95A8B931B7) == 0x000008, "Member 'FF_TargetingPickerConfig::WeightCurve_76_282045C2454E1AD57FF94C95A8B931B7' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, Radius_56_7A8D82CA484CA7253D911FAE90229E86) == 0x000010, "Member 'FF_TargetingPickerConfig::Radius_56_7A8D82CA484CA7253D911FAE90229E86' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, HalfHeight_80_D9C4D7E6472A75C243BB309253B3827C) == 0x000018, "Member 'FF_TargetingPickerConfig::HalfHeight_80_D9C4D7E6472A75C243BB309253B3827C' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, Angle_57_F24316164FDB732A0D7FA4B787A444B3) == 0x000020, "Member 'FF_TargetingPickerConfig::Angle_57_F24316164FDB732A0D7FA4B787A444B3' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, LocationOffset_67_3D9672F64FEC3D93FC4C778674AB7D57) == 0x000028, "Member 'FF_TargetingPickerConfig::LocationOffset_67_3D9672F64FEC3D93FC4C778674AB7D57' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, YawOffset_72_B460D415499ED5D69C09788193CB9E85) == 0x000040, "Member 'FF_TargetingPickerConfig::YawOffset_72_B460D415499ED5D69C09788193CB9E85' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, bDrawDebug_83_869BC8784423B3147CEBFEBCC6302FF9) == 0x000048, "Member 'FF_TargetingPickerConfig::bDrawDebug_83_869BC8784423B3147CEBFEBCC6302FF9' has a wrong offset!");
static_assert(offsetof(FF_TargetingPickerConfig, DebugColor_81_7285E9B04AF8406AD3DE4E8D182A57B7) == 0x00004C, "Member 'FF_TargetingPickerConfig::DebugColor_81_7285E9B04AF8406AD3DE4E8D182A57B7' has a wrong offset!");

}

