#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WeaponNiagara

#include "Basic.hpp"

#include "EHoldItemPosition_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_WeaponNiagara.F_WeaponNiagara
// 0x00E0 (0x00E0 - 0x0000)
struct FF_WeaponNiagara final
{
public:
	EHoldItemPosition                             Position_2_AF7C5974450FE57711A2F7A952376E25;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          NiagaraSystem_9_F789310A4A1B71CD1E0B76A5DF797DE4;  // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FTransform                             RelativeTransform_8_D159AAF0428D1102095DE79701DCF48B; // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             StaticMesh_12_25262AA547938525880EC9915ACDCC22;    // 0x0090(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       StaticMeshMaterial_21_A0F43A0249ED4F56BD2FDAB90E14BF8D; // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FF_WeaponNiagara) == 0x000010, "Wrong alignment on FF_WeaponNiagara");
static_assert(sizeof(FF_WeaponNiagara) == 0x0000E0, "Wrong size on FF_WeaponNiagara");
static_assert(offsetof(FF_WeaponNiagara, Position_2_AF7C5974450FE57711A2F7A952376E25) == 0x000000, "Member 'FF_WeaponNiagara::Position_2_AF7C5974450FE57711A2F7A952376E25' has a wrong offset!");
static_assert(offsetof(FF_WeaponNiagara, NiagaraSystem_9_F789310A4A1B71CD1E0B76A5DF797DE4) == 0x000008, "Member 'FF_WeaponNiagara::NiagaraSystem_9_F789310A4A1B71CD1E0B76A5DF797DE4' has a wrong offset!");
static_assert(offsetof(FF_WeaponNiagara, RelativeTransform_8_D159AAF0428D1102095DE79701DCF48B) == 0x000030, "Member 'FF_WeaponNiagara::RelativeTransform_8_D159AAF0428D1102095DE79701DCF48B' has a wrong offset!");
static_assert(offsetof(FF_WeaponNiagara, StaticMesh_12_25262AA547938525880EC9915ACDCC22) == 0x000090, "Member 'FF_WeaponNiagara::StaticMesh_12_25262AA547938525880EC9915ACDCC22' has a wrong offset!");
static_assert(offsetof(FF_WeaponNiagara, StaticMeshMaterial_21_A0F43A0249ED4F56BD2FDAB90E14BF8D) == 0x0000B8, "Member 'FF_WeaponNiagara::StaticMeshMaterial_21_A0F43A0249ED4F56BD2FDAB90E14BF8D' has a wrong offset!");

}

