#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WeaponPose

#include "Basic.hpp"

#include "Enum_WeaponPoseType_structs.hpp"
#include "Enum_WeaponHandMode_structs.hpp"
#include "EInt32_WeaponPoseAnimType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_WeaponPose.F_WeaponPose
// 0x0008 (0x0008 - 0x0000)
struct FF_WeaponPose final
{
public:
	Enum_WeaponPoseType                           pose_type_8_9306FBC84943B4CC904586A875644B4B;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_WeaponHandMode                           weapon_hand_2_3E10EFE24728A7655428A8BFAE76F068;    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EInt32_WeaponPoseAnimType                     anim_type_9_ECCD14AD4AAD7D180953B7A2741275ED;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_WeaponPose) == 0x000004, "Wrong alignment on FF_WeaponPose");
static_assert(sizeof(FF_WeaponPose) == 0x000008, "Wrong size on FF_WeaponPose");
static_assert(offsetof(FF_WeaponPose, pose_type_8_9306FBC84943B4CC904586A875644B4B) == 0x000000, "Member 'FF_WeaponPose::pose_type_8_9306FBC84943B4CC904586A875644B4B' has a wrong offset!");
static_assert(offsetof(FF_WeaponPose, weapon_hand_2_3E10EFE24728A7655428A8BFAE76F068) == 0x000001, "Member 'FF_WeaponPose::weapon_hand_2_3E10EFE24728A7655428A8BFAE76F068' has a wrong offset!");
static_assert(offsetof(FF_WeaponPose, anim_type_9_ECCD14AD4AAD7D180953B7A2741275ED) == 0x000004, "Member 'FF_WeaponPose::anim_type_9_ECCD14AD4AAD7D180953B7A2741275ED' has a wrong offset!");

}

