#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WeaponStateOverlay

#include "Basic.hpp"

#include "EInt32PlayerPawnStateTypes_structs.hpp"
#include "EPawnAnimStateTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_WeaponStateOverlay.F_WeaponStateOverlay
// 0x0050 (0x0050 - 0x0000)
struct FF_WeaponStateOverlay final
{
public:
	TArray<EInt32PlayerPawnStateTypes>            PlayerStates_4_989FB503461E9A2C75751AA40149205A;   // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EPawnAnimStateTypes>                   AnimStates_8_84A8CE184AFF8B79944F8DAA447581A4;     // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UX6OverlayData>          OverlayData_13_1880F84A4B345A5766431EAD9F37BC78;   // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Priority_16_7AE3492C4B17398E39AEB49E12EEEC46;      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_WeaponStateOverlay) == 0x000008, "Wrong alignment on FF_WeaponStateOverlay");
static_assert(sizeof(FF_WeaponStateOverlay) == 0x000050, "Wrong size on FF_WeaponStateOverlay");
static_assert(offsetof(FF_WeaponStateOverlay, PlayerStates_4_989FB503461E9A2C75751AA40149205A) == 0x000000, "Member 'FF_WeaponStateOverlay::PlayerStates_4_989FB503461E9A2C75751AA40149205A' has a wrong offset!");
static_assert(offsetof(FF_WeaponStateOverlay, AnimStates_8_84A8CE184AFF8B79944F8DAA447581A4) == 0x000010, "Member 'FF_WeaponStateOverlay::AnimStates_8_84A8CE184AFF8B79944F8DAA447581A4' has a wrong offset!");
static_assert(offsetof(FF_WeaponStateOverlay, OverlayData_13_1880F84A4B345A5766431EAD9F37BC78) == 0x000020, "Member 'FF_WeaponStateOverlay::OverlayData_13_1880F84A4B345A5766431EAD9F37BC78' has a wrong offset!");
static_assert(offsetof(FF_WeaponStateOverlay, Priority_16_7AE3492C4B17398E39AEB49E12EEEC46) == 0x000048, "Member 'FF_WeaponStateOverlay::Priority_16_7AE3492C4B17398E39AEB49E12EEEC46' has a wrong offset!");

}

