#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WidgetProperty

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct F_WidgetProperty.F_WidgetProperty
// 0x0040 (0x0040 - 0x0000)
struct FF_WidgetProperty final
{
public:
	class FText                                   Note_11_7DAAA7D9405BF040BCBA16BE4A69DF43;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   Widget_2_E901FAFC4813CFFD38088795A244E7A5;         // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ShouldPause_5_CC2EB221419593D612CFE9BCB85A32D3;    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDesignerFullScreen_8_C370F1254B80309F6E8DA7957B8F6D2E; // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableSceneRendering_14_61C1549F485B4D1DC588BCB50340395A; // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_WidgetProperty) == 0x000008, "Wrong alignment on FF_WidgetProperty");
static_assert(sizeof(FF_WidgetProperty) == 0x000040, "Wrong size on FF_WidgetProperty");
static_assert(offsetof(FF_WidgetProperty, Note_11_7DAAA7D9405BF040BCBA16BE4A69DF43) == 0x000000, "Member 'FF_WidgetProperty::Note_11_7DAAA7D9405BF040BCBA16BE4A69DF43' has a wrong offset!");
static_assert(offsetof(FF_WidgetProperty, Widget_2_E901FAFC4813CFFD38088795A244E7A5) == 0x000010, "Member 'FF_WidgetProperty::Widget_2_E901FAFC4813CFFD38088795A244E7A5' has a wrong offset!");
static_assert(offsetof(FF_WidgetProperty, ShouldPause_5_CC2EB221419593D612CFE9BCB85A32D3) == 0x000038, "Member 'FF_WidgetProperty::ShouldPause_5_CC2EB221419593D612CFE9BCB85A32D3' has a wrong offset!");
static_assert(offsetof(FF_WidgetProperty, IsDesignerFullScreen_8_C370F1254B80309F6E8DA7957B8F6D2E) == 0x000039, "Member 'FF_WidgetProperty::IsDesignerFullScreen_8_C370F1254B80309F6E8DA7957B8F6D2E' has a wrong offset!");
static_assert(offsetof(FF_WidgetProperty, DisableSceneRendering_14_61C1549F485B4D1DC588BCB50340395A) == 0x00003A, "Member 'FF_WidgetProperty::DisableSceneRendering_14_61C1549F485B4D1DC588BCB50340395A' has a wrong offset!");

}

