#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WoolenHeartInfoCache

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_WoolenHeartInfoCache.F_WoolenHeartInfoCache
// 0x0048 (0x0048 - 0x0000)
struct FF_WoolenHeartInfoCache final
{
public:
	struct FVector                                WoolenHeartLoc_2_3824E7EF4E7AD3B7637079A9178568C8; // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WoolenHeartRot_5_05E6A8EE444497CC4F99058E04BDC4E8; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 ConfigDAPath_8_E69AA7A94D5B6016445F96BD6E3C491E;   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bShareToLocalPlayer_11_50DA02984C1ADC73117A7DB88382D43C; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayNarrowSpaceLSIfDamiao_13_87D4D8D640B63BCC0E8B289E36F23822; // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPhantom_15_C294030A4815B0276668A5B9FC622561;      // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_WoolenHeartInfoCache) == 0x000008, "Wrong alignment on FF_WoolenHeartInfoCache");
static_assert(sizeof(FF_WoolenHeartInfoCache) == 0x000048, "Wrong size on FF_WoolenHeartInfoCache");
static_assert(offsetof(FF_WoolenHeartInfoCache, WoolenHeartLoc_2_3824E7EF4E7AD3B7637079A9178568C8) == 0x000000, "Member 'FF_WoolenHeartInfoCache::WoolenHeartLoc_2_3824E7EF4E7AD3B7637079A9178568C8' has a wrong offset!");
static_assert(offsetof(FF_WoolenHeartInfoCache, WoolenHeartRot_5_05E6A8EE444497CC4F99058E04BDC4E8) == 0x000018, "Member 'FF_WoolenHeartInfoCache::WoolenHeartRot_5_05E6A8EE444497CC4F99058E04BDC4E8' has a wrong offset!");
static_assert(offsetof(FF_WoolenHeartInfoCache, ConfigDAPath_8_E69AA7A94D5B6016445F96BD6E3C491E) == 0x000030, "Member 'FF_WoolenHeartInfoCache::ConfigDAPath_8_E69AA7A94D5B6016445F96BD6E3C491E' has a wrong offset!");
static_assert(offsetof(FF_WoolenHeartInfoCache, bShareToLocalPlayer_11_50DA02984C1ADC73117A7DB88382D43C) == 0x000040, "Member 'FF_WoolenHeartInfoCache::bShareToLocalPlayer_11_50DA02984C1ADC73117A7DB88382D43C' has a wrong offset!");
static_assert(offsetof(FF_WoolenHeartInfoCache, bPlayNarrowSpaceLSIfDamiao_13_87D4D8D640B63BCC0E8B289E36F23822) == 0x000041, "Member 'FF_WoolenHeartInfoCache::bPlayNarrowSpaceLSIfDamiao_13_87D4D8D640B63BCC0E8B289E36F23822' has a wrong offset!");
static_assert(offsetof(FF_WoolenHeartInfoCache, bPhantom_15_C294030A4815B0276668A5B9FC622561) == 0x000042, "Member 'FF_WoolenHeartInfoCache::bPhantom_15_C294030A4815B0276668A5B9FC622561' has a wrong offset!");

}

