#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_WonderfulMomentStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "F_WonderfulMomentSpawnerSetting_structs.hpp"
#include "E_WonderfulMomentFinishType_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_WonderfulMomentStruct.F_WonderfulMomentStruct
// 0x00D8 (0x00D8 - 0x0000)
struct FF_WonderfulMomentStruct final
{
public:
	bool                                          EnableSafeZone_63_C3AB3E5C4A6ECE84D3A8028D353C54E6; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SafeZoneRadius_74_D1068ED743400E11DF53ACAC1D601ED2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DefaultFilter_86_3C0B978640D2D479E0C432B36712383C; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultLight_87_2BA6B36B451BC2FF46EDA68B7463B7E4;  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FF_WonderfulMomentSpawnerSetting> SpawnerIDNotInSafeZone_118_F9011C4E4C4AF1BDEB79F7A2DB5478B2; // 0x0030(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CameraActorPos_101_C50B996E4A63E1B6E2A2BA9D556F5CAE; // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraComponentPos_104_CEA5FD23483419EE097406A7C0650E09; // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotation_105_211320E94A1920171A2999A235F25AFB; // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int64                                         DefaultPose_85_66AE6B5745E8F9EF62C4DA9AA68A24BD;   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         DefaultDepth_100_15D9C30740AB91FBBD50ABA3AC1E60FF; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 AvailablePose_109_F8B4A4C4452E2119703891A322B749B6; // 0x0098(0x0010)(Edit, BlueprintVisible)
	E_WonderfulMomentFinishType                   FinishType_115_5418A2E84B4FD175A9C5AFA7D57B082E;   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanQuit_120_282DBE784FB9CFDCF7043486B528393B;     // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckRange_122_C106FFFA48B061DD4D56E1BE45EE932A;  // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RangeCenter_125_06EA191F4B3581521484039D84F68317;  // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RangeRadius_128_792ED984445B176053410AABE8156AB8;  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         GuideGroupID_131_4FD3D41B4CEDDD357FE2419F3BA3B1CB; // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_WonderfulMomentStruct) == 0x000008, "Wrong alignment on FF_WonderfulMomentStruct");
static_assert(sizeof(FF_WonderfulMomentStruct) == 0x0000D8, "Wrong size on FF_WonderfulMomentStruct");
static_assert(offsetof(FF_WonderfulMomentStruct, EnableSafeZone_63_C3AB3E5C4A6ECE84D3A8028D353C54E6) == 0x000000, "Member 'FF_WonderfulMomentStruct::EnableSafeZone_63_C3AB3E5C4A6ECE84D3A8028D353C54E6' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, SafeZoneRadius_74_D1068ED743400E11DF53ACAC1D601ED2) == 0x000008, "Member 'FF_WonderfulMomentStruct::SafeZoneRadius_74_D1068ED743400E11DF53ACAC1D601ED2' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, DefaultFilter_86_3C0B978640D2D479E0C432B36712383C) == 0x000010, "Member 'FF_WonderfulMomentStruct::DefaultFilter_86_3C0B978640D2D479E0C432B36712383C' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, DefaultLight_87_2BA6B36B451BC2FF46EDA68B7463B7E4) == 0x000020, "Member 'FF_WonderfulMomentStruct::DefaultLight_87_2BA6B36B451BC2FF46EDA68B7463B7E4' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, SpawnerIDNotInSafeZone_118_F9011C4E4C4AF1BDEB79F7A2DB5478B2) == 0x000030, "Member 'FF_WonderfulMomentStruct::SpawnerIDNotInSafeZone_118_F9011C4E4C4AF1BDEB79F7A2DB5478B2' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, CameraActorPos_101_C50B996E4A63E1B6E2A2BA9D556F5CAE) == 0x000040, "Member 'FF_WonderfulMomentStruct::CameraActorPos_101_C50B996E4A63E1B6E2A2BA9D556F5CAE' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, CameraComponentPos_104_CEA5FD23483419EE097406A7C0650E09) == 0x000058, "Member 'FF_WonderfulMomentStruct::CameraComponentPos_104_CEA5FD23483419EE097406A7C0650E09' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, CameraRotation_105_211320E94A1920171A2999A235F25AFB) == 0x000070, "Member 'FF_WonderfulMomentStruct::CameraRotation_105_211320E94A1920171A2999A235F25AFB' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, DefaultPose_85_66AE6B5745E8F9EF62C4DA9AA68A24BD) == 0x000088, "Member 'FF_WonderfulMomentStruct::DefaultPose_85_66AE6B5745E8F9EF62C4DA9AA68A24BD' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, DefaultDepth_100_15D9C30740AB91FBBD50ABA3AC1E60FF) == 0x000090, "Member 'FF_WonderfulMomentStruct::DefaultDepth_100_15D9C30740AB91FBBD50ABA3AC1E60FF' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, AvailablePose_109_F8B4A4C4452E2119703891A322B749B6) == 0x000098, "Member 'FF_WonderfulMomentStruct::AvailablePose_109_F8B4A4C4452E2119703891A322B749B6' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, FinishType_115_5418A2E84B4FD175A9C5AFA7D57B082E) == 0x0000A8, "Member 'FF_WonderfulMomentStruct::FinishType_115_5418A2E84B4FD175A9C5AFA7D57B082E' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, bCanQuit_120_282DBE784FB9CFDCF7043486B528393B) == 0x0000A9, "Member 'FF_WonderfulMomentStruct::bCanQuit_120_282DBE784FB9CFDCF7043486B528393B' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, bCheckRange_122_C106FFFA48B061DD4D56E1BE45EE932A) == 0x0000AA, "Member 'FF_WonderfulMomentStruct::bCheckRange_122_C106FFFA48B061DD4D56E1BE45EE932A' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, RangeCenter_125_06EA191F4B3581521484039D84F68317) == 0x0000B0, "Member 'FF_WonderfulMomentStruct::RangeCenter_125_06EA191F4B3581521484039D84F68317' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, RangeRadius_128_792ED984445B176053410AABE8156AB8) == 0x0000C8, "Member 'FF_WonderfulMomentStruct::RangeRadius_128_792ED984445B176053410AABE8156AB8' has a wrong offset!");
static_assert(offsetof(FF_WonderfulMomentStruct, GuideGroupID_131_4FD3D41B4CEDDD357FE2419F3BA3B1CB) == 0x0000D0, "Member 'FF_WonderfulMomentStruct::GuideGroupID_131_4FD3D41B4CEDDD357FE2419F3BA3B1CB' has a wrong offset!");

}

