#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_X6EnvsToResponseRow

#include "Basic.hpp"

#include "EX6EnvType_structs.hpp"
#include "F_X6StylizedEnvResponse_structs.hpp"
#include "F_X6EnvResponseCD_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_X6EnvsToResponseRow.F_X6EnvsToResponseRow
// 0x0080 (0x0080 - 0x0000)
struct FF_X6EnvsToResponseRow final
{
public:
	TArray<EX6EnvType>                            MatchEnvironments_49_8AA6E61A424ECC29161E8BBDC3C16723; // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FF_X6StylizedEnvResponse               Response_47_972E12DC4A375CE943DEE3A218871488;      // 0x0010(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FF_X6EnvResponseCD                     RetriggerCD_33_62255B0641DC7A4442F283905B3CA286;   // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority_21_63810ED342E1EF099FE93EA773764CFF;      // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSkipSwitchResponseCD_48_7124D5D34FCF453D757AA6BD73268D0F; // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanBeInterrupted_51_37D284954BC7A18C56DB858148C769F0; // 0x007D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_X6EnvsToResponseRow) == 0x000008, "Wrong alignment on FF_X6EnvsToResponseRow");
static_assert(sizeof(FF_X6EnvsToResponseRow) == 0x000080, "Wrong size on FF_X6EnvsToResponseRow");
static_assert(offsetof(FF_X6EnvsToResponseRow, MatchEnvironments_49_8AA6E61A424ECC29161E8BBDC3C16723) == 0x000000, "Member 'FF_X6EnvsToResponseRow::MatchEnvironments_49_8AA6E61A424ECC29161E8BBDC3C16723' has a wrong offset!");
static_assert(offsetof(FF_X6EnvsToResponseRow, Response_47_972E12DC4A375CE943DEE3A218871488) == 0x000010, "Member 'FF_X6EnvsToResponseRow::Response_47_972E12DC4A375CE943DEE3A218871488' has a wrong offset!");
static_assert(offsetof(FF_X6EnvsToResponseRow, RetriggerCD_33_62255B0641DC7A4442F283905B3CA286) == 0x000068, "Member 'FF_X6EnvsToResponseRow::RetriggerCD_33_62255B0641DC7A4442F283905B3CA286' has a wrong offset!");
static_assert(offsetof(FF_X6EnvsToResponseRow, Priority_21_63810ED342E1EF099FE93EA773764CFF) == 0x000078, "Member 'FF_X6EnvsToResponseRow::Priority_21_63810ED342E1EF099FE93EA773764CFF' has a wrong offset!");
static_assert(offsetof(FF_X6EnvsToResponseRow, bSkipSwitchResponseCD_48_7124D5D34FCF453D757AA6BD73268D0F) == 0x00007C, "Member 'FF_X6EnvsToResponseRow::bSkipSwitchResponseCD_48_7124D5D34FCF453D757AA6BD73268D0F' has a wrong offset!");
static_assert(offsetof(FF_X6EnvsToResponseRow, bCanBeInterrupted_51_37D284954BC7A18C56DB858148C769F0) == 0x00007D, "Member 'FF_X6EnvsToResponseRow::bCanBeInterrupted_51_37D284954BC7A18C56DB858148C769F0' has a wrong offset!");

}

