#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FActionPointStanceData

#include "Basic.hpp"

#include "FActionPointGestureData_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct FActionPointStanceData.FActionPointStanceData
// 0x0028 (0x0028 - 0x0000)
struct FFActionPointStanceData final
{
public:
	struct FGameplayTag                           StanceTag_9_C950EA8B4937CB090E88899007EACDCF;      // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFActionPointGestureData>       GestureList_7_C23DCBB9405B6D7C6751E3BEF1F0DFE4;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	double                                        Interval_12_257B50D847C26862598483B5238E169E;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextStanceIndex_15_CC124E0847A8BF5CB761DBA3311BFA4C; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFActionPointStanceData) == 0x000008, "Wrong alignment on FFActionPointStanceData");
static_assert(sizeof(FFActionPointStanceData) == 0x000028, "Wrong size on FFActionPointStanceData");
static_assert(offsetof(FFActionPointStanceData, StanceTag_9_C950EA8B4937CB090E88899007EACDCF) == 0x000000, "Member 'FFActionPointStanceData::StanceTag_9_C950EA8B4937CB090E88899007EACDCF' has a wrong offset!");
static_assert(offsetof(FFActionPointStanceData, GestureList_7_C23DCBB9405B6D7C6751E3BEF1F0DFE4) == 0x000008, "Member 'FFActionPointStanceData::GestureList_7_C23DCBB9405B6D7C6751E3BEF1F0DFE4' has a wrong offset!");
static_assert(offsetof(FFActionPointStanceData, Interval_12_257B50D847C26862598483B5238E169E) == 0x000018, "Member 'FFActionPointStanceData::Interval_12_257B50D847C26862598483B5238E169E' has a wrong offset!");
static_assert(offsetof(FFActionPointStanceData, NextStanceIndex_15_CC124E0847A8BF5CB761DBA3311BFA4C) == 0x000020, "Member 'FFActionPointStanceData::NextStanceIndex_15_CC124E0847A8BF5CB761DBA3311BFA4C' has a wrong offset!");

}

