#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FActionPointGestureData

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct FActionPointGestureData.FActionPointGestureData
// 0x0018 (0x0018 - 0x0000)
struct FFActionPointGestureData final
{
public:
	struct FGameplayTag                           GestureTag_3_612BA7F34B67F0D495BC729AD2A6284A;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	double                                        IntervalTime_6_3EE068C142946AA1BEBB6DB85C5A1693;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFullBodyGesture_11_8C560BD24581F359586B11B01E36AE8D; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFActionPointGestureData) == 0x000008, "Wrong alignment on FFActionPointGestureData");
static_assert(sizeof(FFActionPointGestureData) == 0x000018, "Wrong size on FFActionPointGestureData");
static_assert(offsetof(FFActionPointGestureData, GestureTag_3_612BA7F34B67F0D495BC729AD2A6284A) == 0x000000, "Member 'FFActionPointGestureData::GestureTag_3_612BA7F34B67F0D495BC729AD2A6284A' has a wrong offset!");
static_assert(offsetof(FFActionPointGestureData, IntervalTime_6_3EE068C142946AA1BEBB6DB85C5A1693) == 0x000008, "Member 'FFActionPointGestureData::IntervalTime_6_3EE068C142946AA1BEBB6DB85C5A1693' has a wrong offset!");
static_assert(offsetof(FFActionPointGestureData, bFullBodyGesture_11_8C560BD24581F359586B11B01E36AE8D) == 0x000010, "Member 'FFActionPointGestureData::bFullBodyGesture_11_8C560BD24581F359586B11B01E36AE8D' has a wrong offset!");

}

