#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCarrierClothesConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCarrierClothesConfig.FCarrierClothesConfig
// 0x00A8 (0x00A8 - 0x0000)
struct FFCarrierClothesConfig final
{
public:
	int64                                         CarrierObjID_2_1D1939A0421860B5DFBC8D9252A54414;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CarrierBPClass_17_E1D9217E4C71215032581380D4FBF562; // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           VehicleIdleAnim_19_13C524CE4DA2651F9849E9B9FC5D568D; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           NikkiIdleAnim_20_7F4AC75D49DE512E51F4DB8167A429D3; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           DamiaoIdleAnim_21_8307A64E4AC37A8591CE84B0352028A3; // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFCarrierClothesConfig) == 0x000008, "Wrong alignment on FFCarrierClothesConfig");
static_assert(sizeof(FFCarrierClothesConfig) == 0x0000A8, "Wrong size on FFCarrierClothesConfig");
static_assert(offsetof(FFCarrierClothesConfig, CarrierObjID_2_1D1939A0421860B5DFBC8D9252A54414) == 0x000000, "Member 'FFCarrierClothesConfig::CarrierObjID_2_1D1939A0421860B5DFBC8D9252A54414' has a wrong offset!");
static_assert(offsetof(FFCarrierClothesConfig, CarrierBPClass_17_E1D9217E4C71215032581380D4FBF562) == 0x000008, "Member 'FFCarrierClothesConfig::CarrierBPClass_17_E1D9217E4C71215032581380D4FBF562' has a wrong offset!");
static_assert(offsetof(FFCarrierClothesConfig, VehicleIdleAnim_19_13C524CE4DA2651F9849E9B9FC5D568D) == 0x000030, "Member 'FFCarrierClothesConfig::VehicleIdleAnim_19_13C524CE4DA2651F9849E9B9FC5D568D' has a wrong offset!");
static_assert(offsetof(FFCarrierClothesConfig, NikkiIdleAnim_20_7F4AC75D49DE512E51F4DB8167A429D3) == 0x000058, "Member 'FFCarrierClothesConfig::NikkiIdleAnim_20_7F4AC75D49DE512E51F4DB8167A429D3' has a wrong offset!");
static_assert(offsetof(FFCarrierClothesConfig, DamiaoIdleAnim_21_8307A64E4AC37A8591CE84B0352028A3) == 0x000080, "Member 'FFCarrierClothesConfig::DamiaoIdleAnim_21_8307A64E4AC37A8591CE84B0352028A3' has a wrong offset!");

}

