#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCombatAIConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCombatAIConfig.FCombatAIConfig
// 0x0060 (0x0060 - 0x0000)
struct FFCombatAIConfig final
{
public:
	class FString                                 Describe_11_2E3765FB4D791575EEC07BAEBA849901;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_Combat_AIConfig_C>   BaseAIConfig_7_F3F6F0844947F8662F40229FE34539C8;   // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_Combat_AIConfig_C>   TreasureAIConfig_8_CD23CE974660D755313A8D8438FA748D; // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFCombatAIConfig) == 0x000008, "Wrong alignment on FFCombatAIConfig");
static_assert(sizeof(FFCombatAIConfig) == 0x000060, "Wrong size on FFCombatAIConfig");
static_assert(offsetof(FFCombatAIConfig, Describe_11_2E3765FB4D791575EEC07BAEBA849901) == 0x000000, "Member 'FFCombatAIConfig::Describe_11_2E3765FB4D791575EEC07BAEBA849901' has a wrong offset!");
static_assert(offsetof(FFCombatAIConfig, BaseAIConfig_7_F3F6F0844947F8662F40229FE34539C8) == 0x000010, "Member 'FFCombatAIConfig::BaseAIConfig_7_F3F6F0844947F8662F40229FE34539C8' has a wrong offset!");
static_assert(offsetof(FFCombatAIConfig, TreasureAIConfig_8_CD23CE974660D755313A8D8438FA748D) == 0x000038, "Member 'FFCombatAIConfig::TreasureAIConfig_8_CD23CE974660D755313A8D8438FA748D' has a wrong offset!");

}

