#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeatureSequenceParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// UserDefinedStruct FeatureSequenceParams.FeatureSequenceParams
// 0x00A0 (0x00A0 - 0x0000)
struct FFeatureSequenceParams final
{
public:
	struct FTransform                             Transform_2_37FD5E7349667691FFE8ABAC4F209D11;      // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TransformActor_5_E7DE5B8D4F621651FF7531B447BE7FA6; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          bHideHUD_17_E77CBE504C485D43D9522298F49B6A66;      // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    PlaybackSetting_14_5745245C43B644B82F6B2DAB7B961797; // 0x006C(0x0028)(Edit, BlueprintVisible, NoDestructor)
	bool                                          bCanSkip_8_A788395546228607A8F8009CA756452B;       // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCinematicMode_11_11C2525346AAEAE56CBE27BC4DD3A271; // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNetSync_19_7E44EDDB4C73C1A1B1B77783B1CDB3B4;      // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNotReleaseHandHolding_22_2528EEEE42C36F2EF94645ACB2CBC5BB; // 0x0097(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFeatureSequenceParams) == 0x000010, "Wrong alignment on FFeatureSequenceParams");
static_assert(sizeof(FFeatureSequenceParams) == 0x0000A0, "Wrong size on FFeatureSequenceParams");
static_assert(offsetof(FFeatureSequenceParams, Transform_2_37FD5E7349667691FFE8ABAC4F209D11) == 0x000000, "Member 'FFeatureSequenceParams::Transform_2_37FD5E7349667691FFE8ABAC4F209D11' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, TransformActor_5_E7DE5B8D4F621651FF7531B447BE7FA6) == 0x000060, "Member 'FFeatureSequenceParams::TransformActor_5_E7DE5B8D4F621651FF7531B447BE7FA6' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, bHideHUD_17_E77CBE504C485D43D9522298F49B6A66) == 0x000068, "Member 'FFeatureSequenceParams::bHideHUD_17_E77CBE504C485D43D9522298F49B6A66' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, PlaybackSetting_14_5745245C43B644B82F6B2DAB7B961797) == 0x00006C, "Member 'FFeatureSequenceParams::PlaybackSetting_14_5745245C43B644B82F6B2DAB7B961797' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, bCanSkip_8_A788395546228607A8F8009CA756452B) == 0x000094, "Member 'FFeatureSequenceParams::bCanSkip_8_A788395546228607A8F8009CA756452B' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, bUseCinematicMode_11_11C2525346AAEAE56CBE27BC4DD3A271) == 0x000095, "Member 'FFeatureSequenceParams::bUseCinematicMode_11_11C2525346AAEAE56CBE27BC4DD3A271' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, bNetSync_19_7E44EDDB4C73C1A1B1B77783B1CDB3B4) == 0x000096, "Member 'FFeatureSequenceParams::bNetSync_19_7E44EDDB4C73C1A1B1B77783B1CDB3B4' has a wrong offset!");
static_assert(offsetof(FFeatureSequenceParams, bNotReleaseHandHolding_22_2528EEEE42C36F2EF94645ACB2CBC5BB) == 0x000097, "Member 'FFeatureSequenceParams::bNotReleaseHandHolding_22_2528EEEE42C36F2EF94645ACB2CBC5BB' has a wrong offset!");

}

