#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FFocusOnCameraParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "X6Camera_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct FFocusOnCameraParams.FFocusOnCameraParams
// 0x00B8 (0x00B8 - 0x0000)
struct FFFocusOnCameraParams final
{
public:
	struct FVector                                FocusOnOffset_7_470E1667469040444E8CA7A782591ABB;  // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FocusLocationAlpha_35_10596B524456C832655DB69985AC0B32; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECameraState                                  CameraState_10_53346B2E4E7368A58BC6B9860200CE87;   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverrideCameraParams_13_323167AD42E0AA4991849FAAAF575946; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringArmAngle_16_55CDFA094369AE192E5FB9906504AFB2; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpringArmLength_22_43A6CD8E495B7CA192951F9A94D3993F; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocationAngularSpeed_42_57156C0F4E892CC704090E8C94B18185; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseFixedTargetOffset_37_A54B5E224095D3830E7CA780AF7112EC; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetOffset_27_7CF841624A90BC157C77D39296D2B8B3;  // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverrideTransitionParams_30_750BCA124D3BEBDA9F3DF584708C6ED0; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams_33_807D27FE4B54ABFEF6C445AE26571F30; // 0x0068(0x0020)(Edit, BlueprintVisible, NoDestructor)
	bool                                          bUseSeparateExitTransitionParams_53_769D7ABC439EE6BEB038B9A1B2CBFAE0; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExitOverrideTransitionParams_49_0627B5BD4339524F64CC4EBB6584F5B8; // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            ExitTransitionParams_52_75C6144B4673674824417B92AD5FC88D; // 0x0090(0x0020)(Edit, BlueprintVisible, NoDestructor)
	double                                        RotationAngularSpeed_45_5B8E611746B42437437C5EA91E7126E4; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFFocusOnCameraParams) == 0x000008, "Wrong alignment on FFFocusOnCameraParams");
static_assert(sizeof(FFFocusOnCameraParams) == 0x0000B8, "Wrong size on FFFocusOnCameraParams");
static_assert(offsetof(FFFocusOnCameraParams, FocusOnOffset_7_470E1667469040444E8CA7A782591ABB) == 0x000000, "Member 'FFFocusOnCameraParams::FocusOnOffset_7_470E1667469040444E8CA7A782591ABB' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, FocusLocationAlpha_35_10596B524456C832655DB69985AC0B32) == 0x000018, "Member 'FFFocusOnCameraParams::FocusLocationAlpha_35_10596B524456C832655DB69985AC0B32' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, CameraState_10_53346B2E4E7368A58BC6B9860200CE87) == 0x000020, "Member 'FFFocusOnCameraParams::CameraState_10_53346B2E4E7368A58BC6B9860200CE87' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, bOverrideCameraParams_13_323167AD42E0AA4991849FAAAF575946) == 0x000021, "Member 'FFFocusOnCameraParams::bOverrideCameraParams_13_323167AD42E0AA4991849FAAAF575946' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, SpringArmAngle_16_55CDFA094369AE192E5FB9906504AFB2) == 0x000028, "Member 'FFFocusOnCameraParams::SpringArmAngle_16_55CDFA094369AE192E5FB9906504AFB2' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, SpringArmLength_22_43A6CD8E495B7CA192951F9A94D3993F) == 0x000030, "Member 'FFFocusOnCameraParams::SpringArmLength_22_43A6CD8E495B7CA192951F9A94D3993F' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, LocationAngularSpeed_42_57156C0F4E892CC704090E8C94B18185) == 0x000038, "Member 'FFFocusOnCameraParams::LocationAngularSpeed_42_57156C0F4E892CC704090E8C94B18185' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, bUseFixedTargetOffset_37_A54B5E224095D3830E7CA780AF7112EC) == 0x000040, "Member 'FFFocusOnCameraParams::bUseFixedTargetOffset_37_A54B5E224095D3830E7CA780AF7112EC' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, TargetOffset_27_7CF841624A90BC157C77D39296D2B8B3) == 0x000048, "Member 'FFFocusOnCameraParams::TargetOffset_27_7CF841624A90BC157C77D39296D2B8B3' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, bOverrideTransitionParams_30_750BCA124D3BEBDA9F3DF584708C6ED0) == 0x000060, "Member 'FFFocusOnCameraParams::bOverrideTransitionParams_30_750BCA124D3BEBDA9F3DF584708C6ED0' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, TransitionParams_33_807D27FE4B54ABFEF6C445AE26571F30) == 0x000068, "Member 'FFFocusOnCameraParams::TransitionParams_33_807D27FE4B54ABFEF6C445AE26571F30' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, bUseSeparateExitTransitionParams_53_769D7ABC439EE6BEB038B9A1B2CBFAE0) == 0x000088, "Member 'FFFocusOnCameraParams::bUseSeparateExitTransitionParams_53_769D7ABC439EE6BEB038B9A1B2CBFAE0' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, bExitOverrideTransitionParams_49_0627B5BD4339524F64CC4EBB6584F5B8) == 0x000089, "Member 'FFFocusOnCameraParams::bExitOverrideTransitionParams_49_0627B5BD4339524F64CC4EBB6584F5B8' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, ExitTransitionParams_52_75C6144B4673674824417B92AD5FC88D) == 0x000090, "Member 'FFFocusOnCameraParams::ExitTransitionParams_52_75C6144B4673674824417B92AD5FC88D' has a wrong offset!");
static_assert(offsetof(FFFocusOnCameraParams, RotationAngularSpeed_45_5B8E611746B42437437C5EA91E7126E4) == 0x0000B0, "Member 'FFFocusOnCameraParams::RotationAngularSpeed_45_5B8E611746B42437437C5EA91E7126E4' has a wrong offset!");

}

