#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FitMatchSetting

#include "Basic.hpp"

#include "E_MatchClothType_structs.hpp"


namespace SDK::Params
{

// Function FitMatchSetting.FitMatchSetting_C.GetMatchType
// 0x0024 (0x0024 - 0x0000)
struct FitMatchSetting_C_GetMatchType final
{
public:
	E_MatchClothType                              InTypeName;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Result;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result_0;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FitMatchSetting_C_GetMatchType) == 0x000004, "Wrong alignment on FitMatchSetting_C_GetMatchType");
static_assert(sizeof(FitMatchSetting_C_GetMatchType) == 0x000024, "Wrong size on FitMatchSetting_C_GetMatchType");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, InTypeName) == 0x000000, "Member 'FitMatchSetting_C_GetMatchType::InTypeName' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, Result) == 0x000004, "Member 'FitMatchSetting_C_GetMatchType::Result' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, Result_0) == 0x000008, "Member 'FitMatchSetting_C_GetMatchType::Result_0' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'FitMatchSetting_C_GetMatchType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'FitMatchSetting_C_GetMatchType::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'FitMatchSetting_C_GetMatchType::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'FitMatchSetting_C_GetMatchType::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'FitMatchSetting_C_GetMatchType::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FitMatchSetting_C_GetMatchType, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'FitMatchSetting_C_GetMatchType::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

}

