#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ForcedLODSection

#include "Basic.hpp"


namespace SDK::Params
{

// Function ForcedLODSection.ForcedLODSection_C.ExecuteUbergraph_ForcedLODSection
// 0x00F0 (0x00F0 - 0x0000)
struct ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_BindingObject_1;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  K2Node_DynamicCast_AsSkinned_Mesh_Component;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetForcedLOD_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_BindingObject;                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  K2Node_DynamicCast_AsSkinned_Mesh_Component_1;     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component_1;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection) == 0x000008, "Wrong alignment on ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection");
static_assert(sizeof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection) == 0x0000F0, "Wrong size on ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, EntryPoint) == 0x000000, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_Event_BindingObject_1) == 0x000018, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_Event_BindingObject_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsActor) == 0x000028, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Array_Get_Item) == 0x000050, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsSkinned_Mesh_Component) == 0x000058, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsSkinned_Mesh_Component' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000068, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_GetForcedLOD_ReturnValue) == 0x000074, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_GetForcedLOD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_Event_BindingObject) == 0x000088, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_Event_BindingObject' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsActor_1) == 0x000090, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x0000A0, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsSkinned_Mesh_Component_1) == 0x0000C0, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsSkinned_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_AsStatic_Mesh_Component_1) == 0x0000D0, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_AsStatic_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, K2Node_DynamicCast_bSuccess_5) == 0x0000D8, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Array_Length_ReturnValue_1) == 0x0000DC, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Map_Find_Value) == 0x0000E0, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Map_Find_ReturnValue) == 0x0000E4, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E5, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Map_Find_Value_1) == 0x0000E8, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection, CallFunc_Map_Find_ReturnValue_1) == 0x0000EC, "Member 'ForcedLODSection_C_ExecuteUbergraph_ForcedLODSection::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function ForcedLODSection.ForcedLODSection_C.K2_OnSectionBegin_WithBindingObject
// 0x0008 (0x0008 - 0x0000)
struct ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject final
{
public:
	class UObject*                                BindingObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject) == 0x000008, "Wrong alignment on ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject");
static_assert(sizeof(ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject) == 0x000008, "Wrong size on ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject");
static_assert(offsetof(ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject, BindingObject) == 0x000000, "Member 'ForcedLODSection_C_K2_OnSectionBegin_WithBindingObject::BindingObject' has a wrong offset!");

// Function ForcedLODSection.ForcedLODSection_C.K2_OnSectionEnd_WithBindingObject
// 0x0008 (0x0008 - 0x0000)
struct ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject final
{
public:
	class UObject*                                BindingObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject) == 0x000008, "Wrong alignment on ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject");
static_assert(sizeof(ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject) == 0x000008, "Wrong size on ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject");
static_assert(offsetof(ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject, BindingObject) == 0x000000, "Member 'ForcedLODSection_C_K2_OnSectionEnd_WithBindingObject::BindingObject' has a wrong offset!");

}

