#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSM_AnimalClusterMemberBase

#include "Basic.hpp"

#include "F_AnimalClusterBehaviorAssignmentInfo_structs.hpp"


namespace SDK::Params
{

// Function FSM_AnimalClusterMemberBase.FSM_AnimalClusterMemberBase_C.OnMemberBehaviorReceived
// 0x0060 (0x0060 - 0x0000)
struct FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived final
{
public:
	struct FF_AnimalClusterBehaviorAssignmentInfo AssignmentInfo;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived) == 0x000008, "Wrong alignment on FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived");
static_assert(sizeof(FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived) == 0x000060, "Wrong size on FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived, AssignmentInfo) == 0x000000, "Member 'FSM_AnimalClusterMemberBase_C_OnMemberBehaviorReceived::AssignmentInfo' has a wrong offset!");

// Function FSM_AnimalClusterMemberBase.FSM_AnimalClusterMemberBase_C.OnJoinGroup
// 0x0028 (0x0028 - 0x0000)
struct FSM_AnimalClusterMemberBase_C_OnJoinGroup final
{
public:
	class ABP_AnimalClusterBase_C*                Cluster_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USMStateMachineComponent*               CallFunc_GetComponentOwner_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AnimalBase_Complete_C*              K2Node_DynamicCast_AsBP_Animal_Base_Complete;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_AnimalClusterMemberBase_C_OnJoinGroup) == 0x000008, "Wrong alignment on FSM_AnimalClusterMemberBase_C_OnJoinGroup");
static_assert(sizeof(FSM_AnimalClusterMemberBase_C_OnJoinGroup) == 0x000028, "Wrong size on FSM_AnimalClusterMemberBase_C_OnJoinGroup");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnJoinGroup, Cluster_0) == 0x000000, "Member 'FSM_AnimalClusterMemberBase_C_OnJoinGroup::Cluster_0' has a wrong offset!");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnJoinGroup, CallFunc_GetComponentOwner_ReturnValue) == 0x000008, "Member 'FSM_AnimalClusterMemberBase_C_OnJoinGroup::CallFunc_GetComponentOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnJoinGroup, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'FSM_AnimalClusterMemberBase_C_OnJoinGroup::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnJoinGroup, K2Node_DynamicCast_AsBP_Animal_Base_Complete) == 0x000018, "Member 'FSM_AnimalClusterMemberBase_C_OnJoinGroup::K2Node_DynamicCast_AsBP_Animal_Base_Complete' has a wrong offset!");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_OnJoinGroup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FSM_AnimalClusterMemberBase_C_OnJoinGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FSM_AnimalClusterMemberBase.FSM_AnimalClusterMemberBase_C.ExecuteUbergraph_FSM_AnimalClusterMemberBase
// 0x0004 (0x0004 - 0x0000)
struct FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase) == 0x000004, "Wrong alignment on FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase");
static_assert(sizeof(FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase) == 0x000004, "Wrong size on FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase");
static_assert(offsetof(FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase, EntryPoint) == 0x000000, "Member 'FSM_AnimalClusterMemberBase_C_ExecuteUbergraph_FSM_AnimalClusterMemberBase::EntryPoint' has a wrong offset!");

}

