#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSM_AnimalClusterMemberBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_AnimalClusterBehaviorAssignmentInfo_structs.hpp"
#include "SMSystem_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass FSM_AnimalClusterMemberBase.FSM_AnimalClusterMemberBase_C
// 0x00E8 (0x06E0 - 0x05F8)
class UFSM_AnimalClusterMemberBase_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_AnimalClusterBase_C*                Cluster;                                           // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UFSM_AnimalClusterMemberBase_C* FSMInstance, const struct FF_AnimalClusterBehaviorAssignmentInfo& AssignmentInfo)> OnAssignmentInfoReceived; // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FF_AnimalClusterBehaviorAssignmentInfo LatestAssignmentInfo;                              // 0x0618(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_AnimalBase_Complete_C*              Animal;                                            // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FF_AnimalClusterBehaviorAssignmentInfo RunningBehaviorAssignmentInfo;                     // 0x0680(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnStateMachineStart();
	void OnMemberBehaviorReceived(const struct FF_AnimalClusterBehaviorAssignmentInfo& AssignmentInfo);
	void OnJoinGroup(class ABP_AnimalClusterBase_C* Cluster_0);
	void ExecuteUbergraph_FSM_AnimalClusterMemberBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FSM_AnimalClusterMemberBase_C">();
	}
	static class UFSM_AnimalClusterMemberBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFSM_AnimalClusterMemberBase_C>();
	}
};
static_assert(alignof(UFSM_AnimalClusterMemberBase_C) == 0x000008, "Wrong alignment on UFSM_AnimalClusterMemberBase_C");
static_assert(sizeof(UFSM_AnimalClusterMemberBase_C) == 0x0006E0, "Wrong size on UFSM_AnimalClusterMemberBase_C");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, UberGraphFrame) == 0x0005F8, "Member 'UFSM_AnimalClusterMemberBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, Cluster) == 0x000600, "Member 'UFSM_AnimalClusterMemberBase_C::Cluster' has a wrong offset!");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, OnAssignmentInfoReceived) == 0x000608, "Member 'UFSM_AnimalClusterMemberBase_C::OnAssignmentInfoReceived' has a wrong offset!");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, LatestAssignmentInfo) == 0x000618, "Member 'UFSM_AnimalClusterMemberBase_C::LatestAssignmentInfo' has a wrong offset!");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, Animal) == 0x000678, "Member 'UFSM_AnimalClusterMemberBase_C::Animal' has a wrong offset!");
static_assert(offsetof(UFSM_AnimalClusterMemberBase_C, RunningBehaviorAssignmentInfo) == 0x000680, "Member 'UFSM_AnimalClusterMemberBase_C::RunningBehaviorAssignmentInfo' has a wrong offset!");

}

