#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSM_QuadrupedAnimalReaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "EQuadrupedAnimalReactionState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C
// 0x1B18 (0x2110 - 0x05F8)
class UFSM_QuadrupedAnimalReaction_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_AnyState_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_3; // 0x0600(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_AnyState_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_2; // 0x0740(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_AnyState_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_1; // 0x0880(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_AnyState_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop; // 0x09C0(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_10; // 0x0B00(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_9; // 0x0C40(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_8; // 0x0D80(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_7; // 0x0EC0(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_6; // 0x1000(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_5; // 0x1140(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_4; // 0x1280(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_3; // 0x13C0(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_2; // 0x1500(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_1; // 0x1640(0x0140)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop; // 0x1780(0x0140)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_5; // 0x18C0(0x0100)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_4; // 0x19C0(0x0100)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_3; // 0x1AC0(0x0100)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_2; // 0x1BC0(0x0100)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop_1; // 0x1CC0(0x0100)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBF695D848A31221905EBE8EEA8A25FB_LD_Prop; // 0x1DC0(0x0100)()
	EQuadrupedAnimalReactionState                 LastState;                                         // 0x1EC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC1[0x7];                                     // 0x1EC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, EQuadrupedAnimalReactionState> Name2StateMap;                                  // 0x1EC8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	EQuadrupedAnimalReactionState                 DesiredState;                                      // 0x1F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuadrupedAnimalReactionState                 CurrentState;                                      // 0x1F19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTransitionStateDirty;                             // 0x1F1A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1B[0x5];                                     // 0x1F1B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       EnterAlertCollision;                               // 0x1F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bMoveFinish;                                       // 0x1F28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F29[0x7];                                     // 0x1F29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x1F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             OwnerAsCharacter;                                  // 0x1F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_QuadrupedAnimalReactionDefinition_C* DataAsset;                                        // 0x1F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNikkiInLeaveAlertRange;                         // 0x1F48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNikkiInEnterAlertRange;                         // 0x1F49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTurningByCurve;                                 // 0x1F4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4B[0x5];                                     // 0x1F4B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CurrentTurnCurve;                                  // 0x1F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TurnAngle;                                         // 0x1F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTurnByCurveTime;                            // 0x1F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnStartYaw;                                      // 0x1F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInTurnCoolDown;                                 // 0x1F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F71[0x7];                                     // 0x1F71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TurnCoolDownFinishTimerHandle;                     // 0x1F78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EQuadrupedAnimalReactionState NewState)> OnReactionStateChange;    // 0x1F80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USphereComponent*                       LeaveAlertCollision;                               // 0x1F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertStanceTag;                                    // 0x1F98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CuriousStanceTag;                                  // 0x1FA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DesiredStanceTag;                                  // 0x1FA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RequestedStanceTag;                                // 0x1FB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTurnAnimPosition;                           // 0x1FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTurnByAnimScale;                            // 0x1FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CurrentTurnAnimSoftRef;                            // 0x1FC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         PlayerState_Moving;                                // 0x1FF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FF4[0x4];                                     // 0x1FF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameplayTag& StanceTag)> OnAnimTransitionEnd;        // 0x1FF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ReachAlertMaxDurationTimer;                        // 0x2008(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AX6AIController*                        X6AIController;                                    // 0x2010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StimuliSourceActor;                                // 0x2018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorOrigin;                                       // 0x2020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNikkiInFleeRange;                               // 0x2038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2039[0x7];                                     // 0x2039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       FleeCollision;                                     // 0x2040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UX6TaskAsyncBase*                       StartStanceTask;                                   // 0x2048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CuriousCollision;                                  // 0x2050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantsToCurious;                                   // 0x2058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2059[0x7];                                     // 0x2059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bTurnByCurve)> OnTurnFinish;                                  // 0x2060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsTurningByAnim;                                  // 0x2070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2071[0x7];                                     // 0x2071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          AnimInstance;                                      // 0x2078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bReachAlertMaxDuration;                            // 0x2080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2081[0x3];                                     // 0x2081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AlertTurn90LTag;                                   // 0x2084(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertTurn90RTag;                                   // 0x208C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertTurn180LTag;                                  // 0x2094(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertTurn180RTag;                                  // 0x209C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A4[0x4];                                     // 0x20A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bInterrupt, const struct FGameplayTag& Tag)> OnGestureEnd;    // 0x20A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTag                           CurrentTurnTag;                                    // 0x20B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              PreloadAnimSequences;                              // 0x20C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CuriousTurn90LTag;                                 // 0x20D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CuriousTurn90RTag;                                 // 0x20D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CuriousTurn180LTag;                                // 0x20E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CuriousTurn180RTag;                                // 0x20E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TurnNearlyFinishTimer;                             // 0x20F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTransitionTimer;                             // 0x20F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          AfterFleeBT;                                       // 0x2100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          FleeBT;                                            // 0x2108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void WantedStanceTransitonStart_B2F1FD674D016BAA6C715DA17E929405();
	void WantedStanceTransitonStart_51B4524846EAD7E8757D4D8F3326AF1B();
	void WantedStanceTransitonEnd_B2F1FD674D016BAA6C715DA17E929405();
	void WantedStanceTransitonEnd_51B4524846EAD7E8757D4D8F3326AF1B();
	void UpdateTurnByMontage(double DeltaTime);
	void UpdateTurnByCurve(double DeltaTime);
	void UpdateTransitionState();
	void TryStartInitTurn_Curious();
	void TryStartInitTurn_Alert();
	void TryStartCuriousTurn(bool* bTurnStarted);
	void TryStartAlertTurn(bool* bTurnStarted);
	void TryFleeForReachMaxAlertDuration_OnTurnFinish(bool bTurnByCurve);
	void TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd(const struct FGameplayTag& StanceTag);
	void TryEnterState(EQuadrupedAnimalReactionState NewState, bool* bSuccess);
	void TaskFail_B2F1FD674D016BAA6C715DA17E929405();
