#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSM_QuadrupedAnimalReaction

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "EQuadrupedAnimalReactionState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK::Params
{

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.UpdateTurnByMontage
// 0x0230 (0x0230 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CurrentTurnAnim;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         OldMontagePosition;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ExtractRootMotionFromAnimation_ReturnValue; // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x0110(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Min_ImplicitCast;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_RotatorFloat_B_ImplicitCast;     // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ExtractRootMotionFromAnimation_EndTime_ImplicitCast; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_OldMontagePosition_ImplicitCast; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage) == 0x000010, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage) == 0x000230, "Wrong size on FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, DeltaTime) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::DeltaTime' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CurrentTurnAnim) == 0x000008, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CurrentTurnAnim' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, OldMontagePosition) == 0x000010, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::OldMontagePosition' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_GetPlayLength_ReturnValue) == 0x000014, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000020, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x000028, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_ExtractRootMotionFromAnimation_ReturnValue) == 0x000050, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_ExtractRootMotionFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_BreakTransform_Rotation) == 0x0000C8, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_BreakTransform_Scale) == 0x0000E0, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x0000F8, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_K2_AddActorWorldRotation_SweepHitResult) == 0x000110, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_K2_AddActorWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_FClamp_Max_ImplicitCast) == 0x000208, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_FClamp_Min_ImplicitCast) == 0x000210, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_FClamp_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_Multiply_RotatorFloat_B_ImplicitCast) == 0x000218, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_Multiply_RotatorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, CallFunc_ExtractRootMotionFromAnimation_EndTime_ImplicitCast) == 0x00021C, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::CallFunc_ExtractRootMotionFromAnimation_EndTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage, K2Node_VariableSet_OldMontagePosition_ImplicitCast) == 0x000220, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByMontage::K2Node_VariableSet_OldMontagePosition_ImplicitCast' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.UpdateTurnByCurve
// 0x0068 (0x0068 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve) == 0x000068, "Wrong size on FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, DeltaTime) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::DeltaTime' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_GetFloatValue_ReturnValue) == 0x000008, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_GetTimeRange_MinTime) == 0x000040, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_GetTimeRange_MaxTime) == 0x000044, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000049, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x00004C, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000058, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'FSM_QuadrupedAnimalReaction_C_UpdateTurnByCurve::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TryStartCuriousTurn
// 0x0140 (0x0140 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn final
{
public:
	bool                                          bTurnStarted;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TurnAngle_local;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef;      // 0x0020(0x0028)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1;    // 0x0058(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2;    // 0x0088(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3;    // 0x00B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetLookAtTargetTurnAngle_TurnAngle;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn) == 0x000140, "Wrong size on FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, bTurnStarted) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::bTurnStarted' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, TurnAngle_local) == 0x000008, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::TurnAngle_local' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000018, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef) == 0x000020, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000048, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000050, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1) == 0x000058, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000080, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2) == 0x000088, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0000B0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3) == 0x0000B8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0000E0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000F8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000100, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_GetAnimInstance_ReturnValue_3) == 0x000108, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000110, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000111, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000120, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_GetLookAtTargetTurnAngle_TurnAngle) == 0x000128, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_GetLookAtTargetTurnAngle_TurnAngle' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000130, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000138, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartCuriousTurn::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TryStartAlertTurn
// 0x0120 (0x0120 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn final
{
public:
	bool                                          bTurnStarted;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TurnAngle_local;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef;      // 0x0010(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1;    // 0x0040(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2;    // 0x0070(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3;    // 0x00A8(0x0028)(HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetLookAtTargetTurnAngle_TurnAngle;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn) == 0x000120, "Wrong size on FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, bTurnStarted) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::bTurnStarted' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, TurnAngle_local) == 0x000008, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::TurnAngle_local' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef) == 0x000010, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000038, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1) == 0x000040, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000068, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2) == 0x000070, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000098, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0000A0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3) == 0x0000A8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_BP_GetGestureSoftRef_GestureSoftRef_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0000D8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000E0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000E9, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000F8, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000100, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_GetLookAtTargetTurnAngle_TurnAngle) == 0x000108, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_GetLookAtTargetTurnAngle_TurnAngle' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'FSM_QuadrupedAnimalReaction_C_TryStartAlertTurn::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TryFleeForReachMaxAlertDuration_OnTurnFinish
// 0x0001 (0x0001 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish final
{
public:
	bool                                          bTurnByCurve;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish) == 0x000001, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish) == 0x000001, "Wrong size on FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish, bTurnByCurve) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnTurnFinish::bTurnByCurve' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd
// 0x0008 (0x0008 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd final
{
public:
	struct FGameplayTag                           StanceTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd) == 0x000004, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd) == 0x000008, "Wrong size on FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd, StanceTag) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TryFleeForReachMaxAlertDuration_OnAnimTransitionEnd::StanceTag' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TryEnterState
// 0x0004 (0x0004 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TryEnterState final
{
public:
	EQuadrupedAnimalReactionState                 NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuadrupedAnimalReactionState                 CallFunc_GetCurrentState_State;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TryEnterState) == 0x000001, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TryEnterState");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TryEnterState) == 0x000004, "Wrong size on FSM_QuadrupedAnimalReaction_C_TryEnterState");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryEnterState, NewState) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TryEnterState::NewState' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryEnterState, bSuccess) == 0x000001, "Member 'FSM_QuadrupedAnimalReaction_C_TryEnterState::bSuccess' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryEnterState, CallFunc_GetCurrentState_State) == 0x000002, "Member 'FSM_QuadrupedAnimalReaction_C_TryEnterState::CallFunc_GetCurrentState_State' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TryEnterState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'FSM_QuadrupedAnimalReaction_C_TryEnterState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TaskBegin_B2F1FD674D016BAA6C715DA17E929405
// 0x0008 (0x0008 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405 final
{
public:
	class UX6TaskAsyncBase*                       Task;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405) == 0x000008, "Wrong size on FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405, Task) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TaskBegin_B2F1FD674D016BAA6C715DA17E929405::Task' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B
// 0x0008 (0x0008 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B final
{
public:
	class UX6TaskAsyncBase*                       Task;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B) == 0x000008, "Wrong size on FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B, Task) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_TaskBegin_51B4524846EAD7E8757D4D8F3326AF1B::Task' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.StartTurnCoolDown
// 0x0030 (0x0030 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown final
{
public:
	double                                        CoolDown;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TurnCoolDown;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown) == 0x000030, "Wrong size on FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, CoolDown) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::CoolDown' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, TurnCoolDown) == 0x000008, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::TurnCoolDown' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00002C, "Member 'FSM_QuadrupedAnimalReaction_C_StartTurnCoolDown::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.StartCuriousStance
// 0x0001 (0x0001 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_StartCuriousStance final
{
public:
	bool                                          bFastTransition;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_StartCuriousStance) == 0x000001, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_StartCuriousStance");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_StartCuriousStance) == 0x000001, "Wrong size on FSM_QuadrupedAnimalReaction_C_StartCuriousStance");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartCuriousStance, bFastTransition) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_StartCuriousStance::bFastTransition' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.StartAlertStance
// 0x0001 (0x0001 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_StartAlertStance final
{
public:
	bool                                          bFastTransition;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_StartAlertStance) == 0x000001, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_StartAlertStance");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_StartAlertStance) == 0x000001, "Wrong size on FSM_QuadrupedAnimalReaction_C_StartAlertStance");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_StartAlertStance, bFastTransition) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_StartAlertStance::bFastTransition' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF
// 0x0004 (0x0004 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF) == 0x000004, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF) == 0x000004, "Wrong size on FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF, DeltaSeconds) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Curious_EA5D754F46FCB72AEA1264B0593EA4EF::DeltaSeconds' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194
// 0x0004 (0x0004 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194 final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194) == 0x000004, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194) == 0x000004, "Wrong size on FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194, DeltaSeconds) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_SMGraphK2Node_StateUpdateNode_DBF695D848A31221905EBE8EEA8A25FB_Alert_B03E0BFC4F2299D81B147ABF5ED89194::DeltaSeconds' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.SetDataAsset
// 0x0008 (0x0008 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_SetDataAsset final
{
public:
	class UBP_QuadrupedAnimalReactionDefinition_C* DataAsset_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_SetDataAsset) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_SetDataAsset");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_SetDataAsset) == 0x000008, "Wrong size on FSM_QuadrupedAnimalReaction_C_SetDataAsset");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_SetDataAsset, DataAsset_0) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_SetDataAsset::DataAsset_0' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.PostAIObjectInit
// 0x0003 (0x0003 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_PostAIObjectInit final
{
public:
	bool                                          CallFunc_HasStarted_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuadrupedAnimalReactionState                 CallFunc_GetCurrentState_State;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_PostAIObjectInit) == 0x000001, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_PostAIObjectInit");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_PostAIObjectInit) == 0x000003, "Wrong size on FSM_QuadrupedAnimalReaction_C_PostAIObjectInit");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_PostAIObjectInit, CallFunc_HasStarted_ReturnValue) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_PostAIObjectInit::CallFunc_HasStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_PostAIObjectInit, CallFunc_GetCurrentState_State) == 0x000001, "Member 'FSM_QuadrupedAnimalReaction_C_PostAIObjectInit::CallFunc_GetCurrentState_State' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_PostAIObjectInit, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'FSM_QuadrupedAnimalReaction_C_PostAIObjectInit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.OnTurnCoolDownFinished
// 0x0008 (0x0008 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished final
{
public:
	double                                        TurnCoolDown;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished) == 0x000008, "Wrong size on FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished, TurnCoolDown) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_OnTurnCoolDownFinished::TurnCoolDown' has a wrong offset!");

// Function FSM_QuadrupedAnimalReaction.FSM_QuadrupedAnimalReaction_C.OnStateMachineStateChanged
// 0x0100 (0x0100 - 0x0000)
struct FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged final
{
public:
	struct FSMStateInfo                           ToState;                                           // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSMStateInfo                           FromState;                                         // 0x0080(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged) == 0x000008, "Wrong alignment on FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged");
static_assert(sizeof(FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged) == 0x000100, "Wrong size on FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged, ToState) == 0x000000, "Member 'FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged::ToState' has a wrong offset!");
static_assert(offsetof(FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged, FromState) == 0x000080, "Member 'FSM_QuadrupedAnimalReaction_C_OnStateMachineStateChanged::FromState' has a wrong offset!");

