#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FStylizedSimplyStartState

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FStylizedSimplyStartState.FStylizedSimplyStartState
// 0x0078 (0x0078 - 0x0000)
struct FFStylizedSimplyStartState final
{
public:
	bool                                          bUseSimplifiedStart_1_13EDAB7C45DF3709ED0FCA997B51ED40; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          StartAnim_0_4_76400A2D41B09BE89CED3ABA87E21DE2;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_L45_6_FE1EC87245A269712AB86AB2B72BA37D;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_R45_8_507448DF47B35F8EA1102BBEC576AACE;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_L90_10_F315FF474E5CFF9453C11B9B4162798A; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_R90_12_D9ABC3594E2B003EB446599F5FFD68CC; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_L180_14_0F34E8DF4DFA7A546C0CB78A90AFC7ED; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnim_R180_16_8027C6EC4A0986D032624C94033BDDB0; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_0_19_20D5777F45426E41FB0088B9877CE307; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_L45_27_11BA90D74750A63B855C10ACF1AE1273; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_R45_28_43952F9C4435E785F901748306BCB7D9; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_L90_29_23E2E8C548B45860ED532E97EEF32719; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_R90_30_1304175840D01A0628442BAA7DA0B77B; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_L180_31_7F5F094C42ADF937B2921291344C13A9; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartSlowAnim_R180_32_B44D4119412D8468C586EF9D132BFEC3; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFStylizedSimplyStartState) == 0x000008, "Wrong alignment on FFStylizedSimplyStartState");
static_assert(sizeof(FFStylizedSimplyStartState) == 0x000078, "Wrong size on FFStylizedSimplyStartState");
static_assert(offsetof(FFStylizedSimplyStartState, bUseSimplifiedStart_1_13EDAB7C45DF3709ED0FCA997B51ED40) == 0x000000, "Member 'FFStylizedSimplyStartState::bUseSimplifiedStart_1_13EDAB7C45DF3709ED0FCA997B51ED40' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_0_4_76400A2D41B09BE89CED3ABA87E21DE2) == 0x000008, "Member 'FFStylizedSimplyStartState::StartAnim_0_4_76400A2D41B09BE89CED3ABA87E21DE2' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_L45_6_FE1EC87245A269712AB86AB2B72BA37D) == 0x000010, "Member 'FFStylizedSimplyStartState::StartAnim_L45_6_FE1EC87245A269712AB86AB2B72BA37D' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_R45_8_507448DF47B35F8EA1102BBEC576AACE) == 0x000018, "Member 'FFStylizedSimplyStartState::StartAnim_R45_8_507448DF47B35F8EA1102BBEC576AACE' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_L90_10_F315FF474E5CFF9453C11B9B4162798A) == 0x000020, "Member 'FFStylizedSimplyStartState::StartAnim_L90_10_F315FF474E5CFF9453C11B9B4162798A' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_R90_12_D9ABC3594E2B003EB446599F5FFD68CC) == 0x000028, "Member 'FFStylizedSimplyStartState::StartAnim_R90_12_D9ABC3594E2B003EB446599F5FFD68CC' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_L180_14_0F34E8DF4DFA7A546C0CB78A90AFC7ED) == 0x000030, "Member 'FFStylizedSimplyStartState::StartAnim_L180_14_0F34E8DF4DFA7A546C0CB78A90AFC7ED' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartAnim_R180_16_8027C6EC4A0986D032624C94033BDDB0) == 0x000038, "Member 'FFStylizedSimplyStartState::StartAnim_R180_16_8027C6EC4A0986D032624C94033BDDB0' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_0_19_20D5777F45426E41FB0088B9877CE307) == 0x000040, "Member 'FFStylizedSimplyStartState::StartSlowAnim_0_19_20D5777F45426E41FB0088B9877CE307' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_L45_27_11BA90D74750A63B855C10ACF1AE1273) == 0x000048, "Member 'FFStylizedSimplyStartState::StartSlowAnim_L45_27_11BA90D74750A63B855C10ACF1AE1273' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_R45_28_43952F9C4435E785F901748306BCB7D9) == 0x000050, "Member 'FFStylizedSimplyStartState::StartSlowAnim_R45_28_43952F9C4435E785F901748306BCB7D9' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_L90_29_23E2E8C548B45860ED532E97EEF32719) == 0x000058, "Member 'FFStylizedSimplyStartState::StartSlowAnim_L90_29_23E2E8C548B45860ED532E97EEF32719' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_R90_30_1304175840D01A0628442BAA7DA0B77B) == 0x000060, "Member 'FFStylizedSimplyStartState::StartSlowAnim_R90_30_1304175840D01A0628442BAA7DA0B77B' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_L180_31_7F5F094C42ADF937B2921291344C13A9) == 0x000068, "Member 'FFStylizedSimplyStartState::StartSlowAnim_L180_31_7F5F094C42ADF937B2921291344C13A9' has a wrong offset!");
static_assert(offsetof(FFStylizedSimplyStartState, StartSlowAnim_R180_32_B44D4119412D8468C586EF9D132BFEC3) == 0x000070, "Member 'FFStylizedSimplyStartState::StartSlowAnim_R180_32_B44D4119412D8468C586EF9D132BFEC3' has a wrong offset!");

}

