#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSubtitleWidgetListStruct

#include "Basic.hpp"

#include "ESubtitleUIType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSubtitleWidgetListStruct.FSubtitleWidgetListStruct
// 0x0050 (0x0050 - 0x0000)
struct FFSubtitleWidgetListStruct final
{
public:
	class FString                                 Name_2_C2BE8BBF4F0BF4FAF1F9489F79EC773A;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Description_6_794D4D10438F445991CFF6AFEC6D1564;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	ESubtitleUIType                               SubtitleUIType_11_EEAD9A95413EBEE69B23CA84289C3EFF; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SubtitleWidget_8_FB7EF40147D7F96C58B6718A6AB32753; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FFSubtitleWidgetListStruct) == 0x000008, "Wrong alignment on FFSubtitleWidgetListStruct");
static_assert(sizeof(FFSubtitleWidgetListStruct) == 0x000050, "Wrong size on FFSubtitleWidgetListStruct");
static_assert(offsetof(FFSubtitleWidgetListStruct, Name_2_C2BE8BBF4F0BF4FAF1F9489F79EC773A) == 0x000000, "Member 'FFSubtitleWidgetListStruct::Name_2_C2BE8BBF4F0BF4FAF1F9489F79EC773A' has a wrong offset!");
static_assert(offsetof(FFSubtitleWidgetListStruct, Description_6_794D4D10438F445991CFF6AFEC6D1564) == 0x000010, "Member 'FFSubtitleWidgetListStruct::Description_6_794D4D10438F445991CFF6AFEC6D1564' has a wrong offset!");
static_assert(offsetof(FFSubtitleWidgetListStruct, SubtitleUIType_11_EEAD9A95413EBEE69B23CA84289C3EFF) == 0x000020, "Member 'FFSubtitleWidgetListStruct::SubtitleUIType_11_EEAD9A95413EBEE69B23CA84289C3EFF' has a wrong offset!");
static_assert(offsetof(FFSubtitleWidgetListStruct, SubtitleWidget_8_FB7EF40147D7F96C58B6718A6AB32753) == 0x000028, "Member 'FFSubtitleWidgetListStruct::SubtitleWidget_8_FB7EF40147D7F96C58B6718A6AB32753' has a wrong offset!");

}

