#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSubtileSourceTypePriority

#include "Basic.hpp"

#include "ESubtitleSourceType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSubtileSourceTypePriority.FSubtileSourceTypePriority
// 0x000C (0x000C - 0x0000)
struct FFSubtileSourceTypePriority final
{
public:
	ESubtitleSourceType                           SubtitleSourceType_2_3320D0C646985F6B1CC81FAC7570700A; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority_5_5698D795453E2725402BB199883C7CE4;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBreakByGD_8_CEF6E0594A55CA4F291A90856F6F39D0;     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFSubtileSourceTypePriority) == 0x000004, "Wrong alignment on FFSubtileSourceTypePriority");
static_assert(sizeof(FFSubtileSourceTypePriority) == 0x00000C, "Wrong size on FFSubtileSourceTypePriority");
static_assert(offsetof(FFSubtileSourceTypePriority, SubtitleSourceType_2_3320D0C646985F6B1CC81FAC7570700A) == 0x000000, "Member 'FFSubtileSourceTypePriority::SubtitleSourceType_2_3320D0C646985F6B1CC81FAC7570700A' has a wrong offset!");
static_assert(offsetof(FFSubtileSourceTypePriority, Priority_5_5698D795453E2725402BB199883C7CE4) == 0x000004, "Member 'FFSubtileSourceTypePriority::Priority_5_5698D795453E2725402BB199883C7CE4' has a wrong offset!");
static_assert(offsetof(FFSubtileSourceTypePriority, bBreakByGD_8_CEF6E0594A55CA4F291A90856F6F39D0) == 0x000008, "Member 'FFSubtileSourceTypePriority::bBreakByGD_8_CEF6E0594A55CA4F291A90856F6F39D0' has a wrong offset!");

}

