#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FunctionLibrary_WeatherSys

#include "Basic.hpp"

#include "S_Candela_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_DeLightType_structs.hpp"


namespace SDK::Params
{

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.StorageTodsysActor
// 0x0028 (0x0028 - 0x0000)
struct FunctionLibrary_WeatherSys_C_StorageTodsysActor final
{
public:
	class AActor*                                 OwnerClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSys_C*                         ref_TodSys;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_DyEnvSys_C*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_StorageTodsysActor) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_StorageTodsysActor");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_StorageTodsysActor) == 0x000028, "Wrong size on FunctionLibrary_WeatherSys_C_StorageTodsysActor");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_StorageTodsysActor, OwnerClass) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_StorageTodsysActor::OwnerClass' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_StorageTodsysActor, __WorldContext) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_StorageTodsysActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_StorageTodsysActor, ref_TodSys) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_StorageTodsysActor::ref_TodSys' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_StorageTodsysActor, CallFunc_GetActorOfClass_ReturnValue) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_StorageTodsysActor::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_StorageTodsysActor, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_StorageTodsysActor::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.FillVolumeTimeSpanList
// 0x0018 (0x0018 - 0x0000)
struct FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ADynamicWeatherVolume*>          WeatherVolumes;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList) == 0x000018, "Wrong size on FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList, __WorldContext) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList, WeatherVolumes) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_FillVolumeTimeSpanList::WeatherVolumes' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.IsEditor Mode
// 0x0028 (0x0028 - 0x0000)
struct FunctionLibrary_WeatherSys_C_IsEditor_Mode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          inEditor;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningCommandletMode_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingInEditor_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_IsEditor_Mode) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_IsEditor_Mode");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_IsEditor_Mode) == 0x000028, "Wrong size on FunctionLibrary_WeatherSys_C_IsEditor_Mode");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, __WorldContext) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, inEditor) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::inEditor' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_IsRunningCommandletMode_ReturnValue) == 0x000009, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_IsRunningCommandletMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_IsPlayingInEditor_ReturnValue) == 0x000022, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_IsPlayingInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_BooleanOR_ReturnValue_1) == 0x000024, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_BooleanOR_ReturnValue_2) == 0x000025, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsEditor_Mode, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'FunctionLibrary_WeatherSys_C_IsEditor_Mode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Set Members in PPSettings
// 0x2150 (0x2150 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings final
{
public:
	struct FPostProcessSettings                   StructRef;                                         // 0x0000(0x0850)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0850(0x0850)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x10A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A8[0x8];                                     // 0x10A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   StructOut;                                         // 0x10B0(0x0850)(Parm, OutParm)
	struct FPostProcessSettings                   K2Node_SetFieldsInStruct_StructOut;                // 0x1900(0x0850)()
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings) == 0x000010, "Wrong alignment on FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings) == 0x002150, "Wrong size on FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings, StructRef) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings::StructRef' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings, PostProcessSettings) == 0x000850, "Member 'FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings, __WorldContext) == 0x0010A0, "Member 'FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings, StructOut) == 0x0010B0, "Member 'FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings::StructOut' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings, K2Node_SetFieldsInStruct_StructOut) == 0x001900, "Member 'FunctionLibrary_WeatherSys_C_Set_Members_in_PPSettings::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.DoesTodSysExist
// 0x0020 (0x0020 - 0x0000)
struct FunctionLibrary_WeatherSys_C_DoesTodSysExist final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Ready;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_DoesTodSysExist) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_DoesTodSysExist");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_DoesTodSysExist) == 0x000020, "Wrong size on FunctionLibrary_WeatherSys_C_DoesTodSysExist");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DoesTodSysExist, __WorldContext) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_DoesTodSysExist::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DoesTodSysExist, Ready) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_DoesTodSysExist::Ready' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DoesTodSysExist, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00000C, "Member 'FunctionLibrary_WeatherSys_C_DoesTodSysExist::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DoesTodSysExist, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_DoesTodSysExist::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DoesTodSysExist, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_DoesTodSysExist::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Stage Lighting
// 0x0038 (0x0038 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Stage_Lighting final
{
public:
	E_DeLightType                                 LightType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        LightComp;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Stage_Lighting) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_Stage_Lighting");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Stage_Lighting) == 0x000038, "Wrong size on FunctionLibrary_WeatherSys_C_Stage_Lighting");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, LightType) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::LightType' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, LightComp) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::LightComp' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, __WorldContext) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x00001C, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000021, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Stage_Lighting, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'FunctionLibrary_WeatherSys_C_Stage_Lighting::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Check Weather Volume State
// 0x0018 (0x0018 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State final
{
public:
	class ADynamicWeatherVolume*                  DESVolume;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State) == 0x000018, "Wrong size on FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State, DESVolume) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State::DESVolume' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State, __WorldContext) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000014, "Member 'FunctionLibrary_WeatherSys_C_Check_Weather_Volume_State::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Is PC Platform Low
// 0x0018 (0x0018 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low) == 0x000018, "Wrong size on FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low, __WorldContext) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low, ReturnValue) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low::ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x00000C, "Member 'FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_Is_PC_Platform_Low::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.IsGamePlayerInVolume
// 0x0078 (0x0078 - 0x0000)
struct FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoxExtent;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          InVolume;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetLocalPlayerPawn_LocalPlayerPawn;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBox_ReturnValue;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume) == 0x000078, "Wrong size on FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, Target) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::Target' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, BoxExtent) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::BoxExtent' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, __WorldContext) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, InVolume) == 0x000028, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::InVolume' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_GetLocalPlayerPawn_LocalPlayerPawn) == 0x000050, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_GetLocalPlayerPawn_LocalPlayerPawn' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_IsOverlappingActor_ReturnValue) == 0x000070, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_IsPointInBox_ReturnValue) == 0x000071, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_IsPointInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume, CallFunc_BooleanOR_ReturnValue) == 0x000072, "Member 'FunctionLibrary_WeatherSys_C_IsGamePlayerInVolume::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.WriteTextureWithOverride
// 0x00E0 (0x00E0 - 0x0000)
struct FunctionLibrary_WeatherSys_C_WriteTextureWithOverride final
{
public:
	class FString                                 TexturePath;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETextureCompressionSettings                   CompressionSettings;                               // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0080(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x00A0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_WriteTextureWithOverride");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride) == 0x0000E0, "Wrong size on FunctionLibrary_WeatherSys_C_WriteTextureWithOverride");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, TexturePath) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::TexturePath' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, RenderTarget) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::RenderTarget' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CompressionSettings) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CompressionSettings' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, __WorldContext) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, ReturnValue) == 0x000028, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Split_LeftS) == 0x000030, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Split_RightS) == 0x000040, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Split_ReturnValue) == 0x000050, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue) == 0x000058, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_RenderTargetCreateStaticTexture2DEditorOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000080, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x0000A0, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000C8, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, K2Node_DynamicCast_AsTexture_2D) == 0x0000D0, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_WriteTextureWithOverride, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'FunctionLibrary_WeatherSys_C_WriteTextureWithOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.DrawSourceCurve
// 0x02D8 (0x02D8 - 0x0000)
struct FunctionLibrary_WeatherSys_C_DrawSourceCurve final
{
public:
	EBlendMode                                    BlendMode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Row;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeCurveLinearColor               RuntimeCurve;                                      // 0x0010(0x0208)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTextureRenderTarget2D*                 TextureRenderTarget;                               // 0x0218(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Texel_X_Time;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0248(0x0010)(NoDestructor)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CurveStepSize_StepSize;                   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRuntimeCurveLinearColorValue_ReturnValue; // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRuntimeCurveLinearColorValue_InTime_ImplicitCast; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_DrawSourceCurve) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_DrawSourceCurve");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_DrawSourceCurve) == 0x0002D8, "Wrong size on FunctionLibrary_WeatherSys_C_DrawSourceCurve");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, BlendMode) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::BlendMode' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, Row) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::Row' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, RuntimeCurve) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::RuntimeCurve' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, TextureRenderTarget) == 0x000218, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::TextureRenderTarget' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, __WorldContext) == 0x000220, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, Texel_X_Time) == 0x000228, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::Texel_X_Time' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000230, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000238, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000248, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_BreakVector2D_X) == 0x000258, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_BreakVector2D_Y) == 0x000260, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_CurveStepSize_StepSize) == 0x000268, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_CurveStepSize_StepSize' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_FTrunc_ReturnValue) == 0x000270, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_Subtract_IntInt_ReturnValue) == 0x000274, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_MakeVector2D_ReturnValue) == 0x000278, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, Temp_int_Variable) == 0x000288, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000290, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000298, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_MakeVector2D_ReturnValue_1) == 0x0002A0, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002B0, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_Add_IntInt_ReturnValue) == 0x0002B4, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002B8, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_GetRuntimeCurveLinearColorValue_ReturnValue) == 0x0002C0, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_GetRuntimeCurveLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_DrawSourceCurve, CallFunc_GetRuntimeCurveLinearColorValue_InTime_ImplicitCast) == 0x0002D0, "Member 'FunctionLibrary_WeatherSys_C_DrawSourceCurve::CallFunc_GetRuntimeCurveLinearColorValue_InTime_ImplicitCast' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.CurveStepSize
// 0x0028 (0x0028 - 0x0000)
struct FunctionLibrary_WeatherSys_C_CurveStepSize final
{
public:
	double                                        U_Size;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        StepSize;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_CurveStepSize) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_CurveStepSize");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_CurveStepSize) == 0x000028, "Wrong size on FunctionLibrary_WeatherSys_C_CurveStepSize");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_CurveStepSize, U_Size) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_CurveStepSize::U_Size' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_CurveStepSize, __WorldContext) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_CurveStepSize::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_CurveStepSize, StepSize) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_CurveStepSize::StepSize' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_CurveStepSize, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_CurveStepSize::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_CurveStepSize, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_CurveStepSize::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Update Compute Fog To Final
// 0x0068 (0x0068 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0030(0x0010)(NoDestructor)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_1;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_1;  // 0x0058(0x0010)(NoDestructor)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final) == 0x000068, "Wrong size on FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, __WorldContext) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000018, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000030, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1) == 0x000040, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Size_1) == 0x000048, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Size_1' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final, CallFunc_BeginDrawCanvasToRenderTarget_Context_1) == 0x000058, "Member 'FunctionLibrary_WeatherSys_C_Update_Compute_Fog_To_Final::CallFunc_BeginDrawCanvasToRenderTarget_Context_1' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.UpdateFillLight
// 0x0030 (0x0030 - 0x0000)
struct FunctionLibrary_WeatherSys_C_UpdateFillLight final
{
public:
	class ULightComponent*                        LightComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_UpdateFillLight) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_UpdateFillLight");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_UpdateFillLight) == 0x000030, "Wrong size on FunctionLibrary_WeatherSys_C_UpdateFillLight");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_UpdateFillLight, LightComp) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_UpdateFillLight::LightComp' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_UpdateFillLight, __WorldContext) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_UpdateFillLight::__WorldContext' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_UpdateFillLight, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000010, "Member 'FunctionLibrary_WeatherSys_C_UpdateFillLight::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_UpdateFillLight, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000020, "Member 'FunctionLibrary_WeatherSys_C_UpdateFillLight::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");

// Function FunctionLibrary_WeatherSys.FunctionLibrary_WeatherSys_C.Update Street Lamp
// 0x0020 (0x0020 - 0x0000)
struct FunctionLibrary_WeatherSys_C_Update_Street_Lamp final
{
public:
	class ULightComponent*                        LightComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FunctionLibrary_WeatherSys_C_Update_Street_Lamp) == 0x000008, "Wrong alignment on FunctionLibrary_WeatherSys_C_Update_Street_Lamp");
static_assert(sizeof(FunctionLibrary_WeatherSys_C_Update_Street_Lamp) == 0x000020, "Wrong size on FunctionLibrary_WeatherSys_C_Update_Street_Lamp");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Street_Lamp, LightComp) == 0x000000, "Member 'FunctionLibrary_WeatherSys_C_Update_Street_Lamp::LightComp' has a wrong offset!");
static_assert(offsetof(FunctionLibrary_WeatherSys_C_Update_Street_Lamp, __WorldContext) == 0x000008, "Member 'FunctionLibrary_WeatherSys_C_Update_Street_Lamp::__WorldContext' has a wrong offset!");
