#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AbilityTargetingPreset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_AbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AbilityTargetingPreset.GA_AbilityTargetingPreset_C
// 0x0030 (0x0570 - 0x0540)
class UGA_AbilityTargetingPreset_C : public UGA_AbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_AbilityTargetingPreset_C;        // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTargetingPreset*                       BP_TargetingPreset;                                // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuffConfig_C*                       BP_AddBuff;                                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BP_NSConfig;                                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 BP_NSLocationSocket;                               // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_AbilityTargetingPreset(int32 EntryPoint);
	void K2_ActivateAbility();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_AbilityTargetingPreset_C">();
	}
	static class UGA_AbilityTargetingPreset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AbilityTargetingPreset_C>();
	}
};
static_assert(alignof(UGA_AbilityTargetingPreset_C) == 0x000008, "Wrong alignment on UGA_AbilityTargetingPreset_C");
static_assert(sizeof(UGA_AbilityTargetingPreset_C) == 0x000570, "Wrong size on UGA_AbilityTargetingPreset_C");
static_assert(offsetof(UGA_AbilityTargetingPreset_C, UberGraphFrame_GA_AbilityTargetingPreset_C) == 0x000540, "Member 'UGA_AbilityTargetingPreset_C::UberGraphFrame_GA_AbilityTargetingPreset_C' has a wrong offset!");
static_assert(offsetof(UGA_AbilityTargetingPreset_C, BP_TargetingPreset) == 0x000548, "Member 'UGA_AbilityTargetingPreset_C::BP_TargetingPreset' has a wrong offset!");
static_assert(offsetof(UGA_AbilityTargetingPreset_C, BP_AddBuff) == 0x000550, "Member 'UGA_AbilityTargetingPreset_C::BP_AddBuff' has a wrong offset!");
static_assert(offsetof(UGA_AbilityTargetingPreset_C, BP_NSConfig) == 0x000558, "Member 'UGA_AbilityTargetingPreset_C::BP_NSConfig' has a wrong offset!");
static_assert(offsetof(UGA_AbilityTargetingPreset_C, BP_NSLocationSocket) == 0x000560, "Member 'UGA_AbilityTargetingPreset_C::BP_NSLocationSocket' has a wrong offset!");

}

