#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Nikki_RecoveryJumpPlunge_Start_V2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_AbilityMontageBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Nikki_RecoveryJumpPlunge_Start_V2.GA_Nikki_RecoveryJumpPlunge_Start_V2_C
// 0x0068 (0x0600 - 0x0598)
class UGA_Nikki_RecoveryJumpPlunge_Start_V2_C final : public UGA_AbilityMontageBase_C
{
public:
	int32                                         CrashLimitHeight;                                  // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrentLocation;                                   // 0x05A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Capsule_Half_Height;                               // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Capsule_Radius;                                    // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            MovementComp;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EventTag;                                          // 0x05C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WaterEffect;                                       // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         StartCheckHeight;                                  // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDuration;                                       // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BigRangeTag;                                       // 0x05E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TraceLength;                                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SplashIntensityCurve;                              // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Nikki_RecoveryJumpPlunge_Start_V2_C">();
	}
	static class UGA_Nikki_RecoveryJumpPlunge_Start_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Nikki_RecoveryJumpPlunge_Start_V2_C>();
	}
};
static_assert(alignof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C) == 0x000008, "Wrong alignment on UGA_Nikki_RecoveryJumpPlunge_Start_V2_C");
static_assert(sizeof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C) == 0x000600, "Wrong size on UGA_Nikki_RecoveryJumpPlunge_Start_V2_C");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, CrashLimitHeight) == 0x000598, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::CrashLimitHeight' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, CurrentLocation) == 0x0005A0, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::CurrentLocation' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, Capsule_Half_Height) == 0x0005B8, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::Capsule_Half_Height' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, Capsule_Radius) == 0x0005BC, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::Capsule_Radius' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, MovementComp) == 0x0005C0, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::MovementComp' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, EventTag) == 0x0005C8, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::EventTag' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, WaterEffect) == 0x0005D0, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::WaterEffect' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, StartCheckHeight) == 0x0005D8, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::StartCheckHeight' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, MaxDuration) == 0x0005E0, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::MaxDuration' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, BigRangeTag) == 0x0005E8, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::BigRangeTag' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, TraceLength) == 0x0005F0, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::TraceLength' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryJumpPlunge_Start_V2_C, SplashIntensityCurve) == 0x0005F8, "Member 'UGA_Nikki_RecoveryJumpPlunge_Start_V2_C::SplashIntensityCurve' has a wrong offset!");

}

