#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Nikki_Recovery_Click_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_AbilityMontageBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Nikki_Recovery_Click_V2.GA_Nikki_Recovery_Click_V2_C
// 0x0020 (0x05B8 - 0x0598)
class UGA_Nikki_Recovery_Click_V2_C : public UGA_AbilityMontageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Nikki_Recovery_Click_V2_C;       // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           PlayAM;                                            // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_BulletDataAsset_C*                  BP_BulletData;                                     // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FullBodyAM;                                        // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_SelectBulletData();
	void BP_SelectMontage();
	void ExecuteUbergraph_GA_Nikki_Recovery_Click_V2(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnCancelled_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnCompleted_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnInterrupted_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnNotifyBegin_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnNotifyEnd_42AD0B504F33814AD33F57B64A3C1C89(class FName NotifyName);
	void OnSpawnFailed_4EDF40B54A050B43BBC0CCAE07E0E111();
	void OnSpawnFinished_4EDF40B54A050B43BBC0CCAE07E0E111(class AActor* ReturnActor);
	void PlayFullBodyMontage();
	void Shoot(class FName NotifyName);
	void StopFullBodyMontage();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Nikki_Recovery_Click_V2_C">();
	}
	static class UGA_Nikki_Recovery_Click_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Nikki_Recovery_Click_V2_C>();
	}
};
static_assert(alignof(UGA_Nikki_Recovery_Click_V2_C) == 0x000008, "Wrong alignment on UGA_Nikki_Recovery_Click_V2_C");
static_assert(sizeof(UGA_Nikki_Recovery_Click_V2_C) == 0x0005B8, "Wrong size on UGA_Nikki_Recovery_Click_V2_C");
static_assert(offsetof(UGA_Nikki_Recovery_Click_V2_C, UberGraphFrame_GA_Nikki_Recovery_Click_V2_C) == 0x000598, "Member 'UGA_Nikki_Recovery_Click_V2_C::UberGraphFrame_GA_Nikki_Recovery_Click_V2_C' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_Recovery_Click_V2_C, PlayAM) == 0x0005A0, "Member 'UGA_Nikki_Recovery_Click_V2_C::PlayAM' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_Recovery_Click_V2_C, BP_BulletData) == 0x0005A8, "Member 'UGA_Nikki_Recovery_Click_V2_C::BP_BulletData' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_Recovery_Click_V2_C, FullBodyAM) == 0x0005B0, "Member 'UGA_Nikki_Recovery_Click_V2_C::FullBodyAM' has a wrong offset!");

}

