#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Nikki_JumpPlunge_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Nikki_JumpPlunge_2.GA_Nikki_JumpPlunge_2_C.ExecuteUbergraph_GA_Nikki_JumpPlunge_2
// 0x0004 (0x0004 - 0x0000)
struct GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2) == 0x000004, "Wrong alignment on GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2");
static_assert(sizeof(GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2) == 0x000004, "Wrong size on GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2");
static_assert(offsetof(GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2, EntryPoint) == 0x000000, "Member 'GA_Nikki_JumpPlunge_2_C_ExecuteUbergraph_GA_Nikki_JumpPlunge_2::EntryPoint' has a wrong offset!");

// Function GA_Nikki_JumpPlunge_2.GA_Nikki_JumpPlunge_2_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct GA_Nikki_JumpPlunge_2_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_Nikki_JumpPlunge_2_C_GetModuleName) == 0x000008, "Wrong alignment on GA_Nikki_JumpPlunge_2_C_GetModuleName");
static_assert(sizeof(GA_Nikki_JumpPlunge_2_C_GetModuleName) == 0x000010, "Wrong size on GA_Nikki_JumpPlunge_2_C_GetModuleName");
static_assert(offsetof(GA_Nikki_JumpPlunge_2_C_GetModuleName, ReturnValue) == 0x000000, "Member 'GA_Nikki_JumpPlunge_2_C_GetModuleName::ReturnValue' has a wrong offset!");

}

