#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Nikki_RecoveryPre_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_AbilityMontageBase_classes.hpp"
#include "Enum_Recovery_BulletEffect_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Nikki_RecoveryPre_Base.GA_Nikki_RecoveryPre_Base_C
// 0x0060 (0x05F8 - 0x0598)
class UGA_Nikki_RecoveryPre_Base_C final : public UGA_AbilityMontageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Nikki_RecoveryPre_Base_C;        // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           PlayAM;                                            // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChargedEventTag;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           UnChargeEventTag;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeTime;                                        // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalChargeTime;                                   // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FXGCTag;                                           // 0x05C0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	Enum_Recovery_BulletEffect                    BulletEffect;                                      // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RecoveryPreDataAsset_C*             PreConfigs;                                        // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDOFFstop_Default;                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDOFFocalDistance_Default;                    // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CameraDOFFocalDisCurve;                            // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PlayAM_FB;                                         // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AssignmentByPerfume();
	void BP_PostActivateAbility();
	void BP_SelectMontage();
	void ChargedTargetingPresetSelect();
	void ExecuteUbergraph_GA_Nikki_RecoveryPre_Base(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ModifyChargeTime();
	void OnBlendOut_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void OnCancelled_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void OnChargeUpFailed_D113857F4A278EE6D34C499F52817D4B(float CurTime);
	void OnChargeUpFinish_D113857F4A278EE6D34C499F52817D4B(float CurTime);
	void OnChargeUpPhaseComplete_D113857F4A278EE6D34C499F52817D4B(float CurTime);
	void OnCompleted_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void OnInterrupted_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void OnNotifyBegin_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void OnNotifyEnd_AE6E0E1740D6961EEAF473B4FD02F05E(class FName NotifyName);
	void PlayFullBodyMontage();
	void StopFullBodyMontage();
	void VariableAssignment();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Nikki_RecoveryPre_Base_C">();
	}
	static class UGA_Nikki_RecoveryPre_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Nikki_RecoveryPre_Base_C>();
	}
};
static_assert(alignof(UGA_Nikki_RecoveryPre_Base_C) == 0x000008, "Wrong alignment on UGA_Nikki_RecoveryPre_Base_C");
static_assert(sizeof(UGA_Nikki_RecoveryPre_Base_C) == 0x0005F8, "Wrong size on UGA_Nikki_RecoveryPre_Base_C");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, UberGraphFrame_GA_Nikki_RecoveryPre_Base_C) == 0x000598, "Member 'UGA_Nikki_RecoveryPre_Base_C::UberGraphFrame_GA_Nikki_RecoveryPre_Base_C' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, PlayAM) == 0x0005A0, "Member 'UGA_Nikki_RecoveryPre_Base_C::PlayAM' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, ChargedEventTag) == 0x0005A8, "Member 'UGA_Nikki_RecoveryPre_Base_C::ChargedEventTag' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, UnChargeEventTag) == 0x0005B0, "Member 'UGA_Nikki_RecoveryPre_Base_C::UnChargeEventTag' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, ChargeTime) == 0x0005B8, "Member 'UGA_Nikki_RecoveryPre_Base_C::ChargeTime' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, FinalChargeTime) == 0x0005BC, "Member 'UGA_Nikki_RecoveryPre_Base_C::FinalChargeTime' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, FXGCTag) == 0x0005C0, "Member 'UGA_Nikki_RecoveryPre_Base_C::FXGCTag' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, BulletEffect) == 0x0005C8, "Member 'UGA_Nikki_RecoveryPre_Base_C::BulletEffect' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, PreConfigs) == 0x0005D0, "Member 'UGA_Nikki_RecoveryPre_Base_C::PreConfigs' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, CameraDOFFstop_Default) == 0x0005D8, "Member 'UGA_Nikki_RecoveryPre_Base_C::CameraDOFFstop_Default' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, CameraDOFFocalDistance_Default) == 0x0005E0, "Member 'UGA_Nikki_RecoveryPre_Base_C::CameraDOFFocalDistance_Default' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, CameraDOFFocalDisCurve) == 0x0005E8, "Member 'UGA_Nikki_RecoveryPre_Base_C::CameraDOFFocalDisCurve' has a wrong offset!");
static_assert(offsetof(UGA_Nikki_RecoveryPre_Base_C, PlayAM_FB) == 0x0005F0, "Member 'UGA_Nikki_RecoveryPre_Base_C::PlayAM_FB' has a wrong offset!");

}

