#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlayComboAnimByTag

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_PlayComboAnimByTag.GA_PlayComboAnimByTag_C.ExecuteUbergraph_GA_PlayComboAnimByTag
// 0x00B8 (0x00B8 - 0x0000)
struct GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
};
static_assert(alignof(GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag) == 0x000008, "Wrong alignment on GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag");
static_assert(sizeof(GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag) == 0x0000B8, "Wrong size on GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag");
static_assert(offsetof(GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag, EntryPoint) == 0x000000, "Member 'GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag, K2Node_Event_EventData) == 0x000008, "Member 'GA_PlayComboAnimByTag_C_ExecuteUbergraph_GA_PlayComboAnimByTag::K2Node_Event_EventData' has a wrong offset!");

// Function GA_PlayComboAnimByTag.GA_PlayComboAnimByTag_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_PlayComboAnimByTag_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_PlayComboAnimByTag.GA_PlayComboAnimByTag_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct GA_PlayComboAnimByTag_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayComboAnimByTag_C_GetModuleName) == 0x000008, "Wrong alignment on GA_PlayComboAnimByTag_C_GetModuleName");
static_assert(sizeof(GA_PlayComboAnimByTag_C_GetModuleName) == 0x000010, "Wrong size on GA_PlayComboAnimByTag_C_GetModuleName");
static_assert(offsetof(GA_PlayComboAnimByTag_C_GetModuleName, ReturnValue) == 0x000000, "Member 'GA_PlayComboAnimByTag_C_GetModuleName::ReturnValue' has a wrong offset!");

}

