#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePadExtensions

#include "Basic.hpp"


namespace SDK::Params
{

// Function GamePadExtensions.GamePadBlueprintFunctionLibrary.SetGamePadAudioState
// 0x0001 (0x0001 - 0x0000)
struct GamePadBlueprintFunctionLibrary_SetGamePadAudioState final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadBlueprintFunctionLibrary_SetGamePadAudioState) == 0x000001, "Wrong alignment on GamePadBlueprintFunctionLibrary_SetGamePadAudioState");
static_assert(sizeof(GamePadBlueprintFunctionLibrary_SetGamePadAudioState) == 0x000001, "Wrong size on GamePadBlueprintFunctionLibrary_SetGamePadAudioState");
static_assert(offsetof(GamePadBlueprintFunctionLibrary_SetGamePadAudioState, IsOpen) == 0x000000, "Member 'GamePadBlueprintFunctionLibrary_SetGamePadAudioState::IsOpen' has a wrong offset!");

// Function GamePadExtensions.GamePadBlueprintFunctionLibrary.SetGamePadMotionState
// 0x0001 (0x0001 - 0x0000)
struct GamePadBlueprintFunctionLibrary_SetGamePadMotionState final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadBlueprintFunctionLibrary_SetGamePadMotionState) == 0x000001, "Wrong alignment on GamePadBlueprintFunctionLibrary_SetGamePadMotionState");
static_assert(sizeof(GamePadBlueprintFunctionLibrary_SetGamePadMotionState) == 0x000001, "Wrong size on GamePadBlueprintFunctionLibrary_SetGamePadMotionState");
static_assert(offsetof(GamePadBlueprintFunctionLibrary_SetGamePadMotionState, IsOpen) == 0x000000, "Member 'GamePadBlueprintFunctionLibrary_SetGamePadMotionState::IsOpen' has a wrong offset!");

// Function GamePadExtensions.GamePadBlueprintFunctionLibrary.SetGamePadTriggerState
// 0x0001 (0x0001 - 0x0000)
struct GamePadBlueprintFunctionLibrary_SetGamePadTriggerState final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadBlueprintFunctionLibrary_SetGamePadTriggerState) == 0x000001, "Wrong alignment on GamePadBlueprintFunctionLibrary_SetGamePadTriggerState");
static_assert(sizeof(GamePadBlueprintFunctionLibrary_SetGamePadTriggerState) == 0x000001, "Wrong size on GamePadBlueprintFunctionLibrary_SetGamePadTriggerState");
static_assert(offsetof(GamePadBlueprintFunctionLibrary_SetGamePadTriggerState, IsOpen) == 0x000000, "Member 'GamePadBlueprintFunctionLibrary_SetGamePadTriggerState::IsOpen' has a wrong offset!");

}

