#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatures

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameFeatures.GameFeatureData.GetPluginName
// 0x0018 (0x0018 - 0x0000)
struct GameFeatureData_GetPluginName final
{
public:
	const class UGameFeatureData*                 GFD;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PluginName;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameFeatureData_GetPluginName) == 0x000008, "Wrong alignment on GameFeatureData_GetPluginName");
static_assert(sizeof(GameFeatureData_GetPluginName) == 0x000018, "Wrong size on GameFeatureData_GetPluginName");
static_assert(offsetof(GameFeatureData_GetPluginName, GFD) == 0x000000, "Member 'GameFeatureData_GetPluginName::GFD' has a wrong offset!");
static_assert(offsetof(GameFeatureData_GetPluginName, PluginName) == 0x000008, "Member 'GameFeatureData_GetPluginName::PluginName' has a wrong offset!");

// Function GameFeatures.GameFeaturesSubsystem.GetActivePluginNames
// 0x0050 (0x0050 - 0x0000)
struct GameFeaturesSubsystem_GetActivePluginNames final
{
public:
	TSet<class FString>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameFeaturesSubsystem_GetActivePluginNames) == 0x000008, "Wrong alignment on GameFeaturesSubsystem_GetActivePluginNames");
static_assert(sizeof(GameFeaturesSubsystem_GetActivePluginNames) == 0x000050, "Wrong size on GameFeaturesSubsystem_GetActivePluginNames");
static_assert(offsetof(GameFeaturesSubsystem_GetActivePluginNames, ReturnValue) == 0x000000, "Member 'GameFeaturesSubsystem_GetActivePluginNames::ReturnValue' has a wrong offset!");

// Function GameFeatures.GameFeaturesSubsystem.GetRegisteredPluginNames
// 0x0010 (0x0010 - 0x0000)
struct GameFeaturesSubsystem_GetRegisteredPluginNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameFeaturesSubsystem_GetRegisteredPluginNames) == 0x000008, "Wrong alignment on GameFeaturesSubsystem_GetRegisteredPluginNames");
static_assert(sizeof(GameFeaturesSubsystem_GetRegisteredPluginNames) == 0x000010, "Wrong size on GameFeaturesSubsystem_GetRegisteredPluginNames");
static_assert(offsetof(GameFeaturesSubsystem_GetRegisteredPluginNames, ReturnValue) == 0x000000, "Member 'GameFeaturesSubsystem_GetRegisteredPluginNames::ReturnValue' has a wrong offset!");

}

