#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePadTrigger

#include "Basic.hpp"

#include "GamePadTrigger_structs.hpp"


namespace SDK::Params
{

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_FeedbackToPad
// 0x0048 (0x0048 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad final
{
public:
	struct FGamePadTriggerEffectFeedbackParam     InFeedbackParam;                                   // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad) == 0x000048, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad, InFeedbackParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad::InFeedbackParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad, ReturnValue) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_FeedbackToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_MultiPosFeedbackToPad
// 0x0050 (0x0050 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad final
{
public:
	struct FGamePadTriggerEffectMultiPositionFeedbackParam InMultiPosFeedbackParam;                  // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad) == 0x000050, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad, InMultiPosFeedbackParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad::InMultiPosFeedbackParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad, ReturnValue) == 0x000010, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_MultiPosFeedbackToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_MultiPosVibrationToPad
// 0x0058 (0x0058 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad final
{
public:
	struct FGamePadTriggerEffectMultiPositionVibrationParam InMultiPosVibrationParam;                // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0018(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad) == 0x000058, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad, InMultiPosVibrationParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad::InMultiPosVibrationParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad, ReturnValue) == 0x000018, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_MultiPosVibrationToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_OffToPad
// 0x0048 (0x0048 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_OffToPad final
{
public:
	struct FGamePadTriggerEffectOffParam          InOffParam;                                        // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_OffToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_OffToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_OffToPad) == 0x000048, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_OffToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_OffToPad, InOffParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_OffToPad::InOffParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_OffToPad, ReturnValue) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_OffToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_SlopeFeedbackToPad
// 0x0048 (0x0048 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad final
{
public:
	struct FGamePadTriggerEffectSlopeFeedbackParam InSlopeFeedbackParam;                             // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad) == 0x000048, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad, InSlopeFeedbackParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad::InSlopeFeedbackParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad, ReturnValue) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_SlopeFeedbackToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_VibrationToPad
// 0x0048 (0x0048 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad final
{
public:
	struct FGamePadTriggerEffectVibrationParam    InVibrationParam;                                  // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad) == 0x000048, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad, InVibrationParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad::InVibrationParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad, ReturnValue) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_VibrationToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.ConvParam_WeaponToPad
// 0x0048 (0x0048 - 0x0000)
struct GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad final
{
public:
	struct FGamePadTriggerEffectWeaponParam       InWeaponParam;                                     // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad) == 0x000048, "Wrong size on GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad, InWeaponParam) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad::InWeaponParam' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad, ReturnValue) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_ConvParam_WeaponToPad::ReturnValue' has a wrong offset!");

// Function GamePadTrigger.GamePadTriggerBlueprintLibrary.SetGamePadTriggerEffect
// 0x0050 (0x0050 - 0x0000)
struct GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect final
{
public:
	EGamePadTriggerIndex                          InTriggerIndex;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGamePadTriggerEffectMode                     InMode;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGamePadTriggerEffectParams            InParams;                                          // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect) == 0x000008, "Wrong alignment on GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect");
static_assert(sizeof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect) == 0x000050, "Wrong size on GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect, InTriggerIndex) == 0x000000, "Member 'GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect::InTriggerIndex' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect, InMode) == 0x000001, "Member 'GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect::InMode' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect, InParams) == 0x000008, "Member 'GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect::InParams' has a wrong offset!");
static_assert(offsetof(GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect, ReturnValue) == 0x000048, "Member 'GamePadTriggerBlueprintLibrary_SetGamePadTriggerEffect::ReturnValue' has a wrong offset!");

}

