#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_NikkiChargeFX_SphereBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_NikkiChargeFX_SphereBullet.GC_NikkiChargeFX_SphereBullet_C
// 0x0048 (0x0460 - 0x0418)
class AGC_NikkiChargeFX_SphereBullet_C : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX;                                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SystemTemplate_Sphere;                             // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraModifierClass;                               // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VFXOffset;                                         // 0x0440(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachPointName;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_NikkiChargeFX_SphereBullet(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayFX(class ACharacter* Char);
	void RemoveFX(class ACharacter* Char);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_NikkiChargeFX_SphereBullet_C">();
	}
	static class AGC_NikkiChargeFX_SphereBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_NikkiChargeFX_SphereBullet_C>();
	}
};
static_assert(alignof(AGC_NikkiChargeFX_SphereBullet_C) == 0x000008, "Wrong alignment on AGC_NikkiChargeFX_SphereBullet_C");
static_assert(sizeof(AGC_NikkiChargeFX_SphereBullet_C) == 0x000460, "Wrong size on AGC_NikkiChargeFX_SphereBullet_C");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, UberGraphFrame) == 0x000418, "Member 'AGC_NikkiChargeFX_SphereBullet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, DefaultSceneRoot) == 0x000420, "Member 'AGC_NikkiChargeFX_SphereBullet_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, FX) == 0x000428, "Member 'AGC_NikkiChargeFX_SphereBullet_C::FX' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, SystemTemplate_Sphere) == 0x000430, "Member 'AGC_NikkiChargeFX_SphereBullet_C::SystemTemplate_Sphere' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, CameraModifierClass) == 0x000438, "Member 'AGC_NikkiChargeFX_SphereBullet_C::CameraModifierClass' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, VFXOffset) == 0x000440, "Member 'AGC_NikkiChargeFX_SphereBullet_C::VFXOffset' has a wrong offset!");
static_assert(offsetof(AGC_NikkiChargeFX_SphereBullet_C, AttachPointName) == 0x000458, "Member 'AGC_NikkiChargeFX_SphereBullet_C::AttachPointName' has a wrong offset!");

}

