#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_OutlineBase

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_OutlineBase.GC_OutlineBase_C.BP_AddMeshEffect
// 0x0008 (0x0008 - 0x0000)
struct GC_OutlineBase_C_BP_AddMeshEffect final
{
public:
	class UMeshComponent*                         EffectMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_OutlineBase_C_BP_AddMeshEffect) == 0x000008, "Wrong alignment on GC_OutlineBase_C_BP_AddMeshEffect");
static_assert(sizeof(GC_OutlineBase_C_BP_AddMeshEffect) == 0x000008, "Wrong size on GC_OutlineBase_C_BP_AddMeshEffect");
static_assert(offsetof(GC_OutlineBase_C_BP_AddMeshEffect, EffectMesh) == 0x000000, "Member 'GC_OutlineBase_C_BP_AddMeshEffect::EffectMesh' has a wrong offset!");

// Function GC_OutlineBase.GC_OutlineBase_C.BP_RemoveEffect
// 0x0008 (0x0008 - 0x0000)
struct GC_OutlineBase_C_BP_RemoveEffect final
{
public:
	class UMeshComponent*                         EffectMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_OutlineBase_C_BP_RemoveEffect) == 0x000008, "Wrong alignment on GC_OutlineBase_C_BP_RemoveEffect");
static_assert(sizeof(GC_OutlineBase_C_BP_RemoveEffect) == 0x000008, "Wrong size on GC_OutlineBase_C_BP_RemoveEffect");
static_assert(offsetof(GC_OutlineBase_C_BP_RemoveEffect, EffectMesh) == 0x000000, "Member 'GC_OutlineBase_C_BP_RemoveEffect::EffectMesh' has a wrong offset!");

// Function GC_OutlineBase.GC_OutlineBase_C.OnActive
// 0x00F0 (0x00F0 - 0x0000)
struct GC_OutlineBase_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Element;                                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_OutlineBase_C_OnActive) == 0x000008, "Wrong alignment on GC_OutlineBase_C_OnActive");
static_assert(sizeof(GC_OutlineBase_C_OnActive) == 0x0000F0, "Wrong size on GC_OutlineBase_C_OnActive");
static_assert(offsetof(GC_OutlineBase_C_OnActive, MyTarget) == 0x000000, "Member 'GC_OutlineBase_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnActive, Parameters) == 0x000008, "Member 'GC_OutlineBase_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_OutlineBase_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnActive, Element) == 0x0000E8, "Member 'GC_OutlineBase_C_OnActive::Element' has a wrong offset!");

// Function GC_OutlineBase.GC_OutlineBase_C.OnRemove
// 0x00F0 (0x00F0 - 0x0000)
struct GC_OutlineBase_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Element;                                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_OutlineBase_C_OnRemove) == 0x000008, "Wrong alignment on GC_OutlineBase_C_OnRemove");
static_assert(sizeof(GC_OutlineBase_C_OnRemove) == 0x0000F0, "Wrong size on GC_OutlineBase_C_OnRemove");
static_assert(offsetof(GC_OutlineBase_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_OutlineBase_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnRemove, Parameters) == 0x000008, "Member 'GC_OutlineBase_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_OutlineBase_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_OutlineBase_C_OnRemove, Element) == 0x0000E8, "Member 'GC_OutlineBase_C_OnRemove::Element' has a wrong offset!");

// Function GC_OutlineBase.GC_OutlineBase_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct GC_OutlineBase_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(GC_OutlineBase_C_GetModuleName) == 0x000008, "Wrong alignment on GC_OutlineBase_C_GetModuleName");
static_assert(sizeof(GC_OutlineBase_C_GetModuleName) == 0x000010, "Wrong size on GC_OutlineBase_C_GetModuleName");
static_assert(offsetof(GC_OutlineBase_C_GetModuleName, ReturnValue) == 0x000000, "Member 'GC_OutlineBase_C_GetModuleName::ReturnValue' has a wrong offset!");

}

