#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSRTUModule

#include "Basic.hpp"

#include "GSRTUModule_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GSRTUModule.GSRSettings
// 0x0010 (0x0048 - 0x0038)
class UGSRSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoExposure;                                      // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EGSRQualityMode                               QualityMode;                                       // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSRHistoryFormat                             HistoryFormat;                                     // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AdjustMipBias;                                     // 0x0044(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceVertexDeformationOutputsVelocity;             // 0x0045(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSRSettings">();
	}
	static class UGSRSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSRSettings>();
	}
};
static_assert(alignof(UGSRSettings) == 0x000008, "Wrong alignment on UGSRSettings");
static_assert(sizeof(UGSRSettings) == 0x000048, "Wrong size on UGSRSettings");
static_assert(offsetof(UGSRSettings, bEnabled) == 0x000038, "Member 'UGSRSettings::bEnabled' has a wrong offset!");
static_assert(offsetof(UGSRSettings, AutoExposure) == 0x000039, "Member 'UGSRSettings::AutoExposure' has a wrong offset!");
static_assert(offsetof(UGSRSettings, QualityMode) == 0x00003C, "Member 'UGSRSettings::QualityMode' has a wrong offset!");
static_assert(offsetof(UGSRSettings, HistoryFormat) == 0x000040, "Member 'UGSRSettings::HistoryFormat' has a wrong offset!");
static_assert(offsetof(UGSRSettings, AdjustMipBias) == 0x000044, "Member 'UGSRSettings::AdjustMipBias' has a wrong offset!");
static_assert(offsetof(UGSRSettings, ForceVertexDeformationOutputsVelocity) == 0x000045, "Member 'UGSRSettings::ForceVertexDeformationOutputsVelocity' has a wrong offset!");

}

