#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JewelrySystemComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_X6ActorComponent_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass JewelrySystemComponent.JewelrySystemComponent_C
// 0x00B0 (0x0158 - 0x00A8)
class UJewelrySystemComponent_C final : public UBP_X6ActorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComp;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_AnimalJewelryPoint;                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_AnimalJewelryCloth;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ScissorVFX;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ScissorPossibility;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          NormalAudio;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SpecialAudio;                                      // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SpecialScissorVFX;                                 // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_AnimalJewelryWing;                              // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         GodMotherVFX;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OtherStaticMeshComp;                               // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         GodMotherExplodeStarVFX;                           // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         GodMotherWingShowVFX;                              // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMontageBlendSettings                  BlendInSettings;                                   // 0x0118(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMontageBlendSettings                  BlendOutSettings;                                  // 0x0138(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ReceiveTick(float DeltaSeconds);
	void OnLoaded_1E76F6A4429CBBD606DFEAB37F5F62D8(class UObject* Loaded);
	void OnLoaded_13B6375E47D76253214C44A3E6AAE80B(class UObject* Loaded);
	void ExecuteUbergraph_JewelrySystemComponent(int32 EntryPoint);
	void BP_StopAnimalActionInfo(class UAnimInstance* AnimInstance);
	void BP_ShowOtherJewelry(TSoftObjectPtr<class UStaticMesh> mesh, const struct FTransform& Transform, const class FString& SocketName);
	void BP_ShowJewelry(TSoftObjectPtr<class UStaticMesh> mesh, const struct FTransform& Transform, const class FString& SocketName);
	void BP_SetJewelryShow(bool isNeedShow);
	void BP_PlayAudio(class AActor* Actor, class UAkAudioEvent* Audio);
	void BP_HideJewelry();
	void BP_AddNiagaraToMesh(class UNiagaraSystem* Niagara, class FName SocketName, class UStaticMeshComponent* StaticMeshComponent);
	void BP_AddNiagara(class UNiagaraSystem* Niagara, class FName SocketName, int32 AnimalIndex, int32 ColorIndex, class UNiagaraComponent** NiagaraComponent);
	void BP_AddCommonNiagara(class UNiagaraSystem* Niagara, class FName SocketName, int32 AnimalIndex);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JewelrySystemComponent_C">();
	}
	static class UJewelrySystemComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJewelrySystemComponent_C>();
	}
};
static_assert(alignof(UJewelrySystemComponent_C) == 0x000008, "Wrong alignment on UJewelrySystemComponent_C");
static_assert(sizeof(UJewelrySystemComponent_C) == 0x000158, "Wrong size on UJewelrySystemComponent_C");
static_assert(offsetof(UJewelrySystemComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UJewelrySystemComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, StaticMeshComp) == 0x0000B0, "Member 'UJewelrySystemComponent_C::StaticMeshComp' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, DT_AnimalJewelryPoint) == 0x0000B8, "Member 'UJewelrySystemComponent_C::DT_AnimalJewelryPoint' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, DT_AnimalJewelryCloth) == 0x0000C0, "Member 'UJewelrySystemComponent_C::DT_AnimalJewelryCloth' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, ScissorVFX) == 0x0000C8, "Member 'UJewelrySystemComponent_C::ScissorVFX' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, ScissorPossibility) == 0x0000D0, "Member 'UJewelrySystemComponent_C::ScissorPossibility' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, NormalAudio) == 0x0000D8, "Member 'UJewelrySystemComponent_C::NormalAudio' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, SpecialAudio) == 0x0000E0, "Member 'UJewelrySystemComponent_C::SpecialAudio' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, SpecialScissorVFX) == 0x0000E8, "Member 'UJewelrySystemComponent_C::SpecialScissorVFX' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, DT_AnimalJewelryWing) == 0x0000F0, "Member 'UJewelrySystemComponent_C::DT_AnimalJewelryWing' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, GodMotherVFX) == 0x0000F8, "Member 'UJewelrySystemComponent_C::GodMotherVFX' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, OtherStaticMeshComp) == 0x000100, "Member 'UJewelrySystemComponent_C::OtherStaticMeshComp' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, GodMotherExplodeStarVFX) == 0x000108, "Member 'UJewelrySystemComponent_C::GodMotherExplodeStarVFX' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, GodMotherWingShowVFX) == 0x000110, "Member 'UJewelrySystemComponent_C::GodMotherWingShowVFX' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, BlendInSettings) == 0x000118, "Member 'UJewelrySystemComponent_C::BlendInSettings' has a wrong offset!");
static_assert(offsetof(UJewelrySystemComponent_C, BlendOutSettings) == 0x000138, "Member 'UJewelrySystemComponent_C::BlendOutSettings' has a wrong offset!");

}

