#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoystickWidgetAnimated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "UTCControlTypeEnum_structs.hpp"
#include "EUTCJoystickMode_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoystickWidgetAnimated.JoystickWidgetAnimated_C
// 0x0040 (0x0330 - 0x02F0)
class UJoystickWidgetAnimated_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUTCJoystickComponent_C*                UTCJoystickComponent;                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUTCControlTypeEnum                           ControlType;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_ICustomJoystick_C> customJoystick;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isJoystickValid;                                   // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CustomWidget;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerUTCInputComponent_C*          playerUtcComp;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidgetProperty();
	void SetUTCJoystickComponent(class UUTCJoystickComponent_C* InUTCJoystickComponent);
	void SetCustomJoystick(TScriptInterface<class IBP_ICustomJoystick_C> customJoystick_0);
	void Set_Size(const struct FVector2D& Size);
	void Set_Max_Size(double Value);
	void RefreshJoystickConfig();
	void On_Y_Axis_Changed(double Value);
	void On_X_Axis_Changed(double Value);
	void On_Viewport_Size_Changed(const struct FVector2D& Previous_Size, const struct FVector2D& Updated_Size);
	void On_Picker_Location_Changed(const struct FVector& Location);
	void On_Joystick_Released(const struct FVector& Location);
	void On_Joystick_Pressed(const struct FVector& Location);
	void On_Joystick_Location_Changed(const struct FVector& Location);
	void On_Axes_Changed(double X_Axis_Value, double Y_Axis_Value, const struct FVector& Direction);
	void GetCustomJotstick(TScriptInterface<class IBP_ICustomJoystick_C>* customJoystick_0);
	void ExecuteUbergraph_JoystickWidgetAnimated(int32 EntryPoint);
	void Construct();
	void BP_Private_InitTouch(class APlayerController* Pawn, bool* Ret);
	void BP_Private_GetPossessPawn(class APawn** Pawn);

	class FString GetModuleName() const;
	void Get_Max_Size(double* Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoystickWidgetAnimated_C">();
	}
	static class UJoystickWidgetAnimated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoystickWidgetAnimated_C>();
	}
};
static_assert(alignof(UJoystickWidgetAnimated_C) == 0x000008, "Wrong alignment on UJoystickWidgetAnimated_C");
static_assert(sizeof(UJoystickWidgetAnimated_C) == 0x000330, "Wrong size on UJoystickWidgetAnimated_C");
static_assert(offsetof(UJoystickWidgetAnimated_C, UberGraphFrame) == 0x0002F0, "Member 'UJoystickWidgetAnimated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, UTCJoystickComponent) == 0x0002F8, "Member 'UJoystickWidgetAnimated_C::UTCJoystickComponent' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, ControlType) == 0x000300, "Member 'UJoystickWidgetAnimated_C::ControlType' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, customJoystick) == 0x000308, "Member 'UJoystickWidgetAnimated_C::customJoystick' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, isJoystickValid) == 0x000318, "Member 'UJoystickWidgetAnimated_C::isJoystickValid' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, CustomWidget) == 0x000320, "Member 'UJoystickWidgetAnimated_C::CustomWidget' has a wrong offset!");
static_assert(offsetof(UJoystickWidgetAnimated_C, playerUtcComp) == 0x000328, "Member 'UJoystickWidgetAnimated_C::playerUtcComp' has a wrong offset!");

}

