#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LaunchLogin

#include "Basic.hpp"


namespace SDK::Params
{

// Function LaunchLogin.LaunchLogin_C.ExecuteUbergraph_LaunchLogin
// 0x0008 (0x0008 - 0x0000)
struct LaunchLogin_C_ExecuteUbergraph_LaunchLogin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckNeedLoad_bNeedLoaded;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LaunchLogin_C_ExecuteUbergraph_LaunchLogin) == 0x000004, "Wrong alignment on LaunchLogin_C_ExecuteUbergraph_LaunchLogin");
static_assert(sizeof(LaunchLogin_C_ExecuteUbergraph_LaunchLogin) == 0x000008, "Wrong size on LaunchLogin_C_ExecuteUbergraph_LaunchLogin");
static_assert(offsetof(LaunchLogin_C_ExecuteUbergraph_LaunchLogin, EntryPoint) == 0x000000, "Member 'LaunchLogin_C_ExecuteUbergraph_LaunchLogin::EntryPoint' has a wrong offset!");
static_assert(offsetof(LaunchLogin_C_ExecuteUbergraph_LaunchLogin, CallFunc_CheckNeedLoad_bNeedLoaded) == 0x000004, "Member 'LaunchLogin_C_ExecuteUbergraph_LaunchLogin::CallFunc_CheckNeedLoad_bNeedLoaded' has a wrong offset!");

// Function LaunchLogin.LaunchLogin_C.CheckNeedLoad
// 0x0001 (0x0001 - 0x0000)
struct LaunchLogin_C_CheckNeedLoad final
{
public:
	bool                                          bNeedLoaded;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LaunchLogin_C_CheckNeedLoad) == 0x000001, "Wrong alignment on LaunchLogin_C_CheckNeedLoad");
static_assert(sizeof(LaunchLogin_C_CheckNeedLoad) == 0x000001, "Wrong size on LaunchLogin_C_CheckNeedLoad");
static_assert(offsetof(LaunchLogin_C_CheckNeedLoad, bNeedLoaded) == 0x000000, "Member 'LaunchLogin_C_CheckNeedLoad::bNeedLoaded' has a wrong offset!");

// Function LaunchLogin.LaunchLogin_C.SetupBG
// 0x0008 (0x0008 - 0x0000)
struct LaunchLogin_C_SetupBG final
{
public:
	class UWBP_Login_BG_C*                        CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LaunchLogin_C_SetupBG) == 0x000008, "Wrong alignment on LaunchLogin_C_SetupBG");
static_assert(sizeof(LaunchLogin_C_SetupBG) == 0x000008, "Wrong size on LaunchLogin_C_SetupBG");
static_assert(offsetof(LaunchLogin_C_SetupBG, CallFunc_Create_ReturnValue) == 0x000000, "Member 'LaunchLogin_C_SetupBG::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function LaunchLogin.LaunchLogin_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct LaunchLogin_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(LaunchLogin_C_GetModuleName) == 0x000008, "Wrong alignment on LaunchLogin_C_GetModuleName");
static_assert(sizeof(LaunchLogin_C_GetModuleName) == 0x000010, "Wrong size on LaunchLogin_C_GetModuleName");
static_assert(offsetof(LaunchLogin_C_GetModuleName, ReturnValue) == 0x000000, "Member 'LaunchLogin_C_GetModuleName::ReturnValue' has a wrong offset!");

}

