#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchClothObject

#include "Basic.hpp"

#include "FMatchClothParaArray_structs.hpp"
#include "Struct_ClothMatchNameArray_structs.hpp"
#include "E_MatchClothType_structs.hpp"
#include "Struct_ClothMatchSkelMap_structs.hpp"
#include "NikkiFitCloth_structs.hpp"
#include "Struct_ClothMatchStrsArray_structs.hpp"
#include "Struct_OrnamentPair_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_ClothMatchCombineParam_structs.hpp"


namespace SDK::Params
{

// Function MatchClothObject.MatchClothObject_C.AllResetData
// 0x0050 (0x0050 - 0x0000)
struct MatchClothObject_C_AllResetData final
{
public:
	TArray<class FName>                           InMatchPartStrs;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_MatchClothType                              InMatchType;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchClothObject_C_AllResetData) == 0x000008, "Wrong alignment on MatchClothObject_C_AllResetData");
static_assert(sizeof(MatchClothObject_C_AllResetData) == 0x000050, "Wrong size on MatchClothObject_C_AllResetData");
static_assert(offsetof(MatchClothObject_C_AllResetData, InMatchPartStrs) == 0x000000, "Member 'MatchClothObject_C_AllResetData::InMatchPartStrs' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, InMatchType) == 0x000010, "Member 'MatchClothObject_C_AllResetData::InMatchType' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, Temp_int_Array_Index_Variable) == 0x000014, "Member 'MatchClothObject_C_AllResetData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MatchClothObject_C_AllResetData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Array_Get_Item) == 0x00001C, "Member 'MatchClothObject_C_AllResetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'MatchClothObject_C_AllResetData::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'MatchClothObject_C_AllResetData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Map_Find_Value) == 0x000040, "Member 'MatchClothObject_C_AllResetData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'MatchClothObject_C_AllResetData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'MatchClothObject_C_AllResetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_AllResetData, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'MatchClothObject_C_AllResetData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MatchClothObject.MatchClothObject_C.ApplyMatchDataV2
// 0x0340 (0x0340 - 0x0000)
struct MatchClothObject_C_ApplyMatchDataV2 final
{
public:
	class USkeletalMesh*                          OuterSkelMesh1;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          InnerSkelMesh1;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewLocalVar;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_AI_AnimBones;                                 // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Temp_AI_ColliderBones;                             // 0x0028(0x0010)(Edit, BlueprintVisible)
	class USkeletalMeshComponent*                 OuterSkelComp;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 InnerSkelComp;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones; // 0x00B0(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones;  // 0x00C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue;   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchNameArray            K2Node_MakeStruct_Struct_ClothMatchNameArray;      // 0x00D8(0x0010)(HasGetValueTypeHash)
	struct FStruct_ClothMatchNameArray            K2Node_MakeStruct_Struct_ClothMatchNameArray_1;    // 0x00E8(0x0010)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchNameArray            CallFunc_Map_Find_Value_1;                         // 0x0110(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasNikkiPhysicsNode_ReturnValue;          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_2;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_3;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones_1; // 0x0148(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones_1; // 0x0158(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue_1; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue_1;       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FStruct_ClothMatchNameArray            K2Node_MakeStruct_Struct_ClothMatchNameArray_2;    // 0x0180(0x0010)(HasGetValueTypeHash)
	struct FStruct_ClothMatchNameArray            K2Node_MakeStruct_Struct_ClothMatchNameArray_3;    // 0x0190(0x0010)(HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetPostProcessInstance_ReturnValue_1;     // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_4;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchNameArray            CallFunc_Map_Find_Value_5;                         // 0x01B8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchNameArray            CallFunc_Map_Find_Value_6;                         // 0x01D0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasNikkiPhysicsNode_ReturnValue_1;        // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimInstance*>                  CallFunc_Map_Keys_Keys;                            // 0x01E8(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x01F8(0x0010)(ReferenceParm)
	class UAnimInstance*                          CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStruct_ClothMatchNameArray            CallFunc_Map_Find_Value_7;                         // 0x0220(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchSkelMap              CallFunc_Map_Find_Value_8;                         // 0x0238(0x0050)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_8;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchNameArray            CallFunc_Map_Find_Value_9;                         // 0x0290(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_9;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMesh*>                  CallFunc_Map_Keys_Keys_2;                          // 0x02A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Array_Get_Item_2;                         // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Map_Find_Value_10;                        // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_10;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_11;                        // 0x02E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_11;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Map_Find_Value_12;                        // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_12;                  // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Map_Find_Value_13;                        // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_13;                  // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     K2Node_Select_Default;                             // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x031C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchClothObject_C_ApplyMatchDataV2) == 0x000008, "Wrong alignment on MatchClothObject_C_ApplyMatchDataV2");
static_assert(sizeof(MatchClothObject_C_ApplyMatchDataV2) == 0x000340, "Wrong size on MatchClothObject_C_ApplyMatchDataV2");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, OuterSkelMesh1) == 0x000000, "Member 'MatchClothObject_C_ApplyMatchDataV2::OuterSkelMesh1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, InnerSkelMesh1) == 0x000008, "Member 'MatchClothObject_C_ApplyMatchDataV2::InnerSkelMesh1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, NewLocalVar) == 0x000010, "Member 'MatchClothObject_C_ApplyMatchDataV2::NewLocalVar' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_AI_AnimBones) == 0x000018, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_AI_AnimBones' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_AI_ColliderBones) == 0x000028, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_AI_ColliderBones' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, OuterSkelComp) == 0x000038, "Member 'MatchClothObject_C_ApplyMatchDataV2::OuterSkelComp' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, InnerSkelComp) == 0x000040, "Member 'MatchClothObject_C_ApplyMatchDataV2::InnerSkelComp' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Array_Index_Variable) == 0x000048, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetObjectName_ReturnValue) == 0x000060, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetObjectName_ReturnValue_1) == 0x000070, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue) == 0x0000A8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones) == 0x0000B0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones) == 0x0000C0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue) == 0x0000D0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, K2Node_MakeStruct_Struct_ClothMatchNameArray) == 0x0000D8, "Member 'MatchClothObject_C_ApplyMatchDataV2::K2Node_MakeStruct_Struct_ClothMatchNameArray' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, K2Node_MakeStruct_Struct_ClothMatchNameArray_1) == 0x0000E8, "Member 'MatchClothObject_C_ApplyMatchDataV2::K2Node_MakeStruct_Struct_ClothMatchNameArray_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Loop_Counter_Variable_2) == 0x0000F8, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetPostProcessInstance_ReturnValue) == 0x000100, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetPostProcessInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Add_IntInt_ReturnValue_2) == 0x000108, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_1) == 0x000110, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_1) == 0x000120, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_HasNikkiPhysicsNode_ReturnValue) == 0x000121, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_HasNikkiPhysicsNode_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_2) == 0x000128, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_2) == 0x000130, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_3) == 0x000138, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_3) == 0x000140, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_int_Array_Index_Variable_2) == 0x000144, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones_1) == 0x000148, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_OutColliderBones_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones_1) == 0x000158, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_OutAnimBones_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue_1) == 0x000168, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetNikkiPhysicsBoneWeights_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000170, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetSkeletalMeshAsset_ReturnValue_1) == 0x000178, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetSkeletalMeshAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, K2Node_MakeStruct_Struct_ClothMatchNameArray_2) == 0x000180, "Member 'MatchClothObject_C_ApplyMatchDataV2::K2Node_MakeStruct_Struct_ClothMatchNameArray_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, K2Node_MakeStruct_Struct_ClothMatchNameArray_3) == 0x000190, "Member 'MatchClothObject_C_ApplyMatchDataV2::K2Node_MakeStruct_Struct_ClothMatchNameArray_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_GetPostProcessInstance_ReturnValue_1) == 0x0001A0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_GetPostProcessInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_4) == 0x0001A8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_4) == 0x0001B0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_5) == 0x0001B8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_5) == 0x0001C8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_6) == 0x0001D0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_6) == 0x0001E0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_BooleanAND_ReturnValue) == 0x0001E1, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_HasNikkiPhysicsNode_ReturnValue_1) == 0x0001E2, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_HasNikkiPhysicsNode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Keys_Keys) == 0x0001E8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Keys_Keys_1) == 0x0001F8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Get_Item) == 0x000208, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Get_Item_1) == 0x000210, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_7) == 0x000220, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_7) == 0x000230, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_8) == 0x000238, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_8' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_8) == 0x000288, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_9) == 0x000290, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_9' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_9) == 0x0002A0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_IsNotEmpty_ReturnValue) == 0x0002A1, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Keys_Keys_2) == 0x0002A8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Length_ReturnValue) == 0x0002B8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Get_Item_2) == 0x0002C0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Less_IntInt_ReturnValue) == 0x0002C8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_10) == 0x0002D0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_10' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_10) == 0x0002D8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Length_ReturnValue_1) == 0x0002DC, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Length_ReturnValue_2) == 0x0002E0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Greater_IntInt_ReturnValue) == 0x0002E4, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E5, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, Temp_bool_Variable) == 0x0002E6, "Member 'MatchClothObject_C_ApplyMatchDataV2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_11) == 0x0002E7, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_11' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_11) == 0x0002E8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_12) == 0x0002F0, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_12' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_12) == 0x0002F8, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_BooleanAND_ReturnValue_1) == 0x0002F9, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_BooleanAND_ReturnValue_2) == 0x0002FA, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_Value_13) == 0x000300, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_Value_13' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Map_Find_ReturnValue_13) == 0x000308, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Map_Find_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, K2Node_Select_Default) == 0x000310, "Member 'MatchClothObject_C_ApplyMatchDataV2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_BooleanAND_ReturnValue_3) == 0x000318, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Get_Item_3) == 0x00031C, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Length_ReturnValue_3) == 0x000324, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_AddUnique_ReturnValue) == 0x000328, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Less_IntInt_ReturnValue_2) == 0x00032C, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Contains_ReturnValue) == 0x00032D, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x00032E, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00032F, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_Contains_ReturnValue_1) == 0x000330, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000334, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchClothObject_C_ApplyMatchDataV2, CallFunc_Not_PreBool_ReturnValue) == 0x000338, "Member 'MatchClothObject_C_ApplyMatchDataV2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function MatchClothObject.MatchClothObject_C.ComputeClothesCombineV2
// 0x0470 (0x0470 - 0x0000)
struct MatchClothObject_C_ComputeClothesCombineV2 final
{
public:
	TArray<class USkeletalMesh*>                  InSkelMeshArray;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	E_MatchClothType                              InMatchType;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMesh*>                  SkelMesh_temp;                                     // 0x0018(0x0010)(Edit, BlueprintVisible)
	struct FStruct_ClothMatchStrsArray            Local_CombineStrs;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USkeletalMesh*                          OuterSkelMesh;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          InnerSkelMesh;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_CopyObject_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     K2Node_DynamicCast_AsFit_Match_Setting;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_CopyObject_ReturnValue_1;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFitMatchSetting_C*                     K2Node_DynamicCast_AsFit_Match_Setting_1;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_2;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_3;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_4;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_5;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_6;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_7;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_8;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_8;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_9;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_9;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0121(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_10;                        // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_10;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFitMatchSetting_C*                     CallFunc_Map_Find_Value_11;                        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_11;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetObjectName_ReturnValue_2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_3;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_AsData_Table;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ClothMatchCombineParam         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0218(0x00E0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_12;                        // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_12;                  // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
