#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MaterialShaderQualitySettings

#include "Basic.hpp"


namespace SDK
{

// Enum MaterialShaderQualitySettings.EMobileShadowQuality
// NumValues: 0x0005
enum class EMobileShadowQuality : uint8
{
	NoFiltering                              = 0,
	PCF_1x1                                  = 1,
	PCF_3x3                                  = 2,
	PCF_5x5                                  = 3,
	EMobileShadowQuality_MAX                 = 4,
};

// Enum MaterialShaderQualitySettings.EMobileOITQuality
// NumValues: 0x0004
enum class EMobileOITQuality : uint8
{
	NoLayers                                 = 0,
	TwoLayers                                = 1,
	ThreeLayers                              = 2,
	EMobileOITQuality_MAX                    = 3,
};

// Enum MaterialShaderQualitySettings.EMobileLocalLightQuality
// NumValues: 0x0004
enum class EMobileLocalLightQuality : uint8
{
	Disable                                  = 0,
	NoShadows                                = 1,
	WithShadows                              = 2,
	EMobileLocalLightQuality_MAX             = 3,
};

// Enum MaterialShaderQualitySettings.EMobileSSRQuality
// NumValues: 0x0005
enum class EMobileSSRQuality : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	EMobileSSRQuality_MAX                    = 4,
};

// Enum MaterialShaderQualitySettings.EVirtualTextureMaterialQuality
// NumValues: 0x0004
enum class EVirtualTextureMaterialQuality : uint8
{
	OneRT                                    = 1,
	TwoRT                                    = 2,
	ThreeRT                                  = 3,
	EVirtualTextureMaterialQuality_MAX       = 4,
};

// ScriptStruct MaterialShaderQualitySettings.MaterialQualityOverrides
// 0x000C (0x000C - 0x0000)
struct FMaterialQualityOverrides final
{
public:
	bool                                          bDiscardQualityDuringCook;                         // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOverride;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceFullyRough;                                  // 0x0002(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNonMetal;                                    // 0x0003(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDisableLMDirectionality;                     // 0x0004(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDisablePreintegratedGF;                      // 0x0005(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableMaterialNormalCalculation;                 // 0x0006(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMobileShadowQuality                          MobileShadowQuality;                               // 0x0007(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMobileOITQuality                             MobileOITQuality;                                  // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMobileLocalLightQuality                      MobileLocalLightQuality;                           // 0x0009(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMobileSSRQuality                             MobileSSRQuality;                                  // 0x000A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVirtualTextureMaterialQuality                MobileVTQuality;                                   // 0x000B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaterialQualityOverrides) == 0x000001, "Wrong alignment on FMaterialQualityOverrides");
static_assert(sizeof(FMaterialQualityOverrides) == 0x00000C, "Wrong size on FMaterialQualityOverrides");
static_assert(offsetof(FMaterialQualityOverrides, bDiscardQualityDuringCook) == 0x000000, "Member 'FMaterialQualityOverrides::bDiscardQualityDuringCook' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bEnableOverride) == 0x000001, "Member 'FMaterialQualityOverrides::bEnableOverride' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bForceFullyRough) == 0x000002, "Member 'FMaterialQualityOverrides::bForceFullyRough' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bForceNonMetal) == 0x000003, "Member 'FMaterialQualityOverrides::bForceNonMetal' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bForceDisableLMDirectionality) == 0x000004, "Member 'FMaterialQualityOverrides::bForceDisableLMDirectionality' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bForceDisablePreintegratedGF) == 0x000005, "Member 'FMaterialQualityOverrides::bForceDisablePreintegratedGF' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, bDisableMaterialNormalCalculation) == 0x000006, "Member 'FMaterialQualityOverrides::bDisableMaterialNormalCalculation' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, MobileShadowQuality) == 0x000007, "Member 'FMaterialQualityOverrides::MobileShadowQuality' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, MobileOITQuality) == 0x000008, "Member 'FMaterialQualityOverrides::MobileOITQuality' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, MobileLocalLightQuality) == 0x000009, "Member 'FMaterialQualityOverrides::MobileLocalLightQuality' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, MobileSSRQuality) == 0x00000A, "Member 'FMaterialQualityOverrides::MobileSSRQuality' has a wrong offset!");
static_assert(offsetof(FMaterialQualityOverrides, MobileVTQuality) == 0x00000B, "Member 'FMaterialQualityOverrides::MobileVTQuality' has a wrong offset!");

}

