#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshandIndex

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct MeshandIndex.MeshAndIndex
// 0x0020 (0x0020 - 0x0000)
struct FMeshAndIndex final
{
public:
	bool                                          bIsInstancedMesh_10_7DE50BC1419FE90B6F50BCAE5724027D; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          InstancedStaticMesh_14_E29E800E4DC82901DBC1718737E5F83D; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_5_3D43B87F47F2449127731A8CBDF7A65D;          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 StaticOrSkeletalMeshActor_18_E46ADF6043ECF10A245BA8B2DE2FD500; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FMeshAndIndex) == 0x000008, "Wrong alignment on FMeshAndIndex");
static_assert(sizeof(FMeshAndIndex) == 0x000020, "Wrong size on FMeshAndIndex");
static_assert(offsetof(FMeshAndIndex, bIsInstancedMesh_10_7DE50BC1419FE90B6F50BCAE5724027D) == 0x000000, "Member 'FMeshAndIndex::bIsInstancedMesh_10_7DE50BC1419FE90B6F50BCAE5724027D' has a wrong offset!");
static_assert(offsetof(FMeshAndIndex, InstancedStaticMesh_14_E29E800E4DC82901DBC1718737E5F83D) == 0x000008, "Member 'FMeshAndIndex::InstancedStaticMesh_14_E29E800E4DC82901DBC1718737E5F83D' has a wrong offset!");
static_assert(offsetof(FMeshAndIndex, Index_5_3D43B87F47F2449127731A8CBDF7A65D) == 0x000010, "Member 'FMeshAndIndex::Index_5_3D43B87F47F2449127731A8CBDF7A65D' has a wrong offset!");
static_assert(offsetof(FMeshAndIndex, StaticOrSkeletalMeshActor_18_E46ADF6043ECF10A245BA8B2DE2FD500) == 0x000018, "Member 'FMeshAndIndex::StaticOrSkeletalMeshActor_18_E46ADF6043ECF10A245BA8B2DE2FD500' has a wrong offset!");

}

