#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraUIRenderer

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class NiagaraUIRenderer.NiagaraSystemWidget
// 0x00B0 (0x0238 - 0x0188)
class UNiagaraSystemWidget final : public UWidget
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NiagaraSystemReference;                            // 0x0188(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UMaterialInterface*, class UMaterialInterface*> MaterialRemapList;                    // 0x01B0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          AutoActivate;                                      // 0x0200(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x0201(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FakeDepthScale;                                    // 0x0202(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FakeDepthScaleDistance;                            // 0x0204(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowDebugSystemInWorld;                            // 0x0208(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableWarnings;                                   // 0x0209(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PlayParticle;                                      // 0x020A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTimerDestroy;                               // 0x020B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x14];                                     // 0x020C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    NiagaraComponent;                                  // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNiagaraSystem*                         NiagaraSystemAsset;                                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 ReDefinedTickDependency;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UNiagaraUIComponent* GetNiagaraComponent();
	void HandleNiagaraSystemFinished(class UNiagaraComponent* Comp);
	void SetPlayParticle(bool InPlayParticle, bool InResetOnActive);
	void SetTickDependency(class AActor* InNewActor);
	void UpdateNiagaraSystemReference(class UNiagaraSystem* NewNiagaraSystem);
	void UpdateTickWhenPaused(bool NewTickWhenPaused);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraSystemWidget">();
	}
	static class UNiagaraSystemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSystemWidget>();
	}
};
static_assert(alignof(UNiagaraSystemWidget) == 0x000008, "Wrong alignment on UNiagaraSystemWidget");
static_assert(sizeof(UNiagaraSystemWidget) == 0x000238, "Wrong size on UNiagaraSystemWidget");
static_assert(offsetof(UNiagaraSystemWidget, NiagaraSystemReference) == 0x000188, "Member 'UNiagaraSystemWidget::NiagaraSystemReference' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, MaterialRemapList) == 0x0001B0, "Member 'UNiagaraSystemWidget::MaterialRemapList' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, AutoActivate) == 0x000200, "Member 'UNiagaraSystemWidget::AutoActivate' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, TickWhenPaused) == 0x000201, "Member 'UNiagaraSystemWidget::TickWhenPaused' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, FakeDepthScale) == 0x000202, "Member 'UNiagaraSystemWidget::FakeDepthScale' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, FakeDepthScaleDistance) == 0x000204, "Member 'UNiagaraSystemWidget::FakeDepthScaleDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, ShowDebugSystemInWorld) == 0x000208, "Member 'UNiagaraSystemWidget::ShowDebugSystemInWorld' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, DisableWarnings) == 0x000209, "Member 'UNiagaraSystemWidget::DisableWarnings' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, PlayParticle) == 0x00020A, "Member 'UNiagaraSystemWidget::PlayParticle' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, bIgnoreTimerDestroy) == 0x00020B, "Member 'UNiagaraSystemWidget::bIgnoreTimerDestroy' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, NiagaraComponent) == 0x000220, "Member 'UNiagaraSystemWidget::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, NiagaraSystemAsset) == 0x000228, "Member 'UNiagaraSystemWidget::NiagaraSystemAsset' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, ReDefinedTickDependency) == 0x000230, "Member 'UNiagaraSystemWidget::ReDefinedTickDependency' has a wrong offset!");

// Class NiagaraUIRenderer.NiagaraUIActor
// 0x0000 (0x03A8 - 0x03A8)
class ANiagaraUIActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraUIActor">();
	}
	static class ANiagaraUIActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraUIActor>();
	}
};
static_assert(alignof(ANiagaraUIActor) == 0x000008, "Wrong alignment on ANiagaraUIActor");
static_assert(sizeof(ANiagaraUIActor) == 0x0003A8, "Wrong size on ANiagaraUIActor");

// Class NiagaraUIRenderer.NiagaraUIComponent
// 0x0010 (0x0830 - 0x0820)
class UNiagaraUIComponent final : public UNiagaraComponent
{
public:
	uint8                                         Pad_820[0x10];                                     // 0x0820(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraUIComponent">();
	}
	static class UNiagaraUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraUIComponent>();
	}
};
static_assert(alignof(UNiagaraUIComponent) == 0x000010, "Wrong alignment on UNiagaraUIComponent");
static_assert(sizeof(UNiagaraUIComponent) == 0x000830, "Wrong size on UNiagaraUIComponent");

// Class NiagaraUIRenderer.NiagaraUIRendererSettings
// 0x0008 (0x0030 - 0x0028)
class UNiagaraUIRendererSettings final : public UObject
{
public:
	float                                         NiagaraUIDestroyTickInterval;                      // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraUIRendererSettings">();
	}
	static class UNiagaraUIRendererSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraUIRendererSettings>();
	}
};
static_assert(alignof(UNiagaraUIRendererSettings) == 0x000008, "Wrong alignment on UNiagaraUIRendererSettings");
static_assert(sizeof(UNiagaraUIRendererSettings) == 0x000030, "Wrong size on UNiagaraUIRendererSettings");
static_assert(offsetof(UNiagaraUIRendererSettings, NiagaraUIDestroyTickInterval) == 0x000028, "Member 'UNiagaraUIRendererSettings::NiagaraUIDestroyTickInterval' has a wrong offset!");

// Class NiagaraUIRenderer.NiagaraWidgetSubsystem
// 0x0040 (0x0070 - 0x0030)
class UNiagaraWidgetSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraWidgetSubsystem">();
	}
	static class UNiagaraWidgetSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraWidgetSubsystem>();
	}
};
static_assert(alignof(UNiagaraWidgetSubsystem) == 0x000008, "Wrong alignment on UNiagaraWidgetSubsystem");
static_assert(sizeof(UNiagaraWidgetSubsystem) == 0x000070, "Wrong size on UNiagaraWidgetSubsystem");

}

