#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NikkiAnim_BPNew

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "NikkiAnim_BPNew_structs.hpp"
#include "Engine_structs.hpp"
#include "FEmotionPartBlendWeight_structs.hpp"
#include "NikkiPhysics_structs.hpp"
#include "X6Game_structs.hpp"
#include "X6Game_classes.hpp"
#include "X6Animation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "EPlayerGamePlayMovementMode_structs.hpp"
#include "EPlayerMovementScenarios_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NikkiAnim_BPNew.NikkiAnim_BPNew_C
// 0xCE80 (0xD300 - 0x0480)
class UNikkiAnim_BPNew_C final : public UX6NikkiMainAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct NikkiAnim_BPNew::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x0488(0x0048)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x04D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04D8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x04E0(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0588(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0590(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0648(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0668(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0720(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0740(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x07F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0818(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x08D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x08F0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x09A8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x09C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x09E8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0AA0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0AC0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0AE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0B00(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0B48(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0B68(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0C20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0C40(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0CF8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0D18(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0DD0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0DF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0E10(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0E30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0E50(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0E98(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0EB8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0F00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0F20(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0F68(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0F88(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0FD0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0FF0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x10A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x10C8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1180(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x11A0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x11E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1208(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x12C0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x1340(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x13C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0x13E0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x1408(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0x1488(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0x14B0(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x14D8(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x1510(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x1590(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x15B8(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x15E0(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x1618(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x1698(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0x1788(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0x17B0(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x17D8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x18A8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x1928(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0x19A8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x19D0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0x1A98(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x1AC0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x1B40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x1B68(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x1B90(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1C80(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x1D48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x1D70(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x1D98(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x1E68(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x1E90(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x1F10(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x2000(0x0028)()
	struct FAnimNode_X6PoseFilter                 AnimGraphNode_X6PoseFilter_1;                      // 0x2028(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2060(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x2118(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x2140(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x2168(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x2190(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x2260(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x22E0(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0x23B0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x2478(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x24A0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0x24C8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x2590(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x2680(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x26A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x26D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x26F8(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x2720(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x27F0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x2870(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x2898(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x2960(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x2988(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x29B0(0x00F0)()
	struct FAnimNode_X6PoseFilter                 AnimGraphNode_X6PoseFilter;                        // 0x2AA0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x2AD8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2B20(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x2B40(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x2C30(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x2C58(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x2CD8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x2D20(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x2E10(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x2E58(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x2ED8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x2F00(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2F48(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x2F90(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x2FD8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x3058(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x30A0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x3120(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x3168(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x3190(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0x3210(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0x32D8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0x33A0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0x3468(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0x3530(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0x35F8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x36C0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x36E8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x37B0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x37D8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x3CA8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x3D28(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x3DA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x3DD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x3DF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x3E20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x3E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x3E70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x3E98(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x3EC0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x3EE0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x3F08(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x3F28(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x3FF0(0x0080)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x4070(0x0450)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x44C0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x4508(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x45D0(0x0010)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x45E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x4608(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x4630(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x46B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x46D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x4700(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x4780(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x47A8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x47F0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x48B8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x4900(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0x49C8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x4E98(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x4F60(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x4FE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x5008(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0x5030(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x5500(0x0080)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x5580(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x5A50(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x5A78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x5AC0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x5AE8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x5FB8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x5FD8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x60A0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x6120(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x6148(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x6190(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x6280(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x6300(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x6328(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x6350(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x63D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x63F8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x6420(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x6468(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x6490(0x0080)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x6510(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x69E0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x6AA8(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x6AD0(0x0120)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x6BF0(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x6CE0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x6D28(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x6DF0(0x0010)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x6E00(0x0010)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x6E10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x6E38(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x6E60(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x7330(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x7420(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x7510(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x7600(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x7620(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x7640(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x7688(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x7708(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x7730(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x7758(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x77D0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x78C0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x7908(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x7988(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x79B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x79D8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x7A20(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x7A48(0x00F0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x7B38(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x8008(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x84D8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x85A0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x8668(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x86E8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x87B0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x8878(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x88F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x8920(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x8948(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x8990(0x00C8)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x8A58(0x00D8)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend_5;                    // 0x8B30(0x0258)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x8D88(0x0048)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend_4;                    // 0x8DD0(0x0258)()
	uint8                                         Pad_9028[0x8];                                     // 0x9028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_PoseMatchRecorder            AnimGraphNode_PoseMatchRecorder;                   // 0x9030(0x0150)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x9180(0x0048)()
	struct FAnimNode_X6AnimContext                AnimGraphNode_X6AnimContext;                       // 0x91C8(0x00C0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x9288(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x9340(0x0028)()
	struct FAnimNode_X6StylizedOverlayBlend       AnimGraphNode_X6OverlayBlend_Stylized_1;           // 0x9368(0x0268)()
	struct FAnimNode_X6StateMachineMarker         AnimGraphNode_X6StateMachineMarker;                // 0x95D0(0x0090)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x9660(0x0080)()
	struct FAnimNode_X6StylizedOverlayBlend       AnimGraphNode_X6OverlayBlend_Stylized;             // 0x96E0(0x0268)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x9948(0x0028)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend_3;                    // 0x9970(0x0258)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x9BC8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x9BF0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x9C38(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x9C80(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x9D00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x9D28(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x9D50(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x9E40(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x9F08(0x00F0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x9FF8(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xA008(0x00F0)()
	uint8                                         Pad_A0F8[0x8];                                     // 0xA0F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0xA100(0x0280)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xA380(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0xA3A0(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xA490(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0xA4B0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xA530(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0xA578(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0xA5A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0xA5C8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0xA5F0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0xA670(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0xA698(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xA6C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xA708(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0xA750(0x0010)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xA760(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0xA7E0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xA808(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0xA888(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xA8B0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xA8F8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0xA9E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0xAA10(0x0028)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0xAA38(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xAB28(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0xAB48(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0xAC38(0x00F0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xAD28(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0xAD48(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0xAE38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0xAE60(0x0028)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend_2;                    // 0xAE88(0x0258)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0xB0E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xB108(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xB150(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0xB218(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0xB298(0x0028)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend_1;                    // 0xB2C0(0x0258)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0xB518(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xB560(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xB588(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xB5D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xB650(0x0028)()
	struct FAnimNode_X6OverlayBlend               AnimGraphNode_X6OverlayBlend;                      // 0xB678(0x0258)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xB8D0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0xB918(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0xB960(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xB988(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xB9D0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0xB9F8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xBAC0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xBB40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xBB68(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0xBB90(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xBC58(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0xBC80(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xBD48(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xBD70(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xBDF0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0xBE18(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xBEE0(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xBF08(0x04D0)(ContainsInstancedReference)
	bool                                          K2Node_PropertyAccess_9;                           // 0xC3D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_8;                           // 0xC3D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_7;                           // 0xC3DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_6;                           // 0xC3DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3DC[0x4];                                     // 0xC3DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_LHandIKRotation_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC3E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_LHandIKPosition_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC3F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_RHandIKRotation_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_RHandIKPosition_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableRHandIKPosition_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableRHandIKRotation_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableLHandIKPosition_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableLHandIKRotation_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableHandIK_FD6CE1A041C9D5E5C2C5CE8FFA07334E; // 0xC444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C445[0x3];                                     // 0xC445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_LHandIKRotation_A83644064C79A024AB8C7D8A45082E28; // 0xC448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_LHandIKPosition_A83644064C79A024AB8C7D8A45082E28; // 0xC460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_RHandIKRotation_A83644064C79A024AB8C7D8A45082E28; // 0xC478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_RHandIKPosition_A83644064C79A024AB8C7D8A45082E28; // 0xC490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableRHandIKPosition_A83644064C79A024AB8C7D8A45082E28; // 0xC4A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableRHandIKRotation_A83644064C79A024AB8C7D8A45082E28; // 0xC4A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableLHandIKPosition_A83644064C79A024AB8C7D8A45082E28; // 0xC4AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableLHandIKRotation_A83644064C79A024AB8C7D8A45082E28; // 0xC4AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableHandIK_A83644064C79A024AB8C7D8A45082E28; // 0xC4AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4AD[0x3];                                     // 0xC4AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFootIKFeatureTargetDataV2             K2Node_PropertyAccess_5;                           // 0xC4B0(0x00A0)(NoDestructor)
	bool                                          __CustomProperty_bForceInitFootPlacementIKParam_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C551[0x7];                                     // 0xC551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_SlopeAngle_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootRotationWeight_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootRotationWeight_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootTranslationWeight_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootTranslationWeight_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_PelvisWeight_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_PelvisOffset_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_AnkleRightOffsetRotation_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC5A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               __CustomProperty_AnkleLeftOffsetRotation_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC5B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_AnkleRightOffsetLocation_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC5D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AnkleLeftOffsetLocation_8087071C41AA2CE0A35BC08B4DC64E49; // 0xC5E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFootIKFeatureTargetDataV2             K2Node_PropertyAccess_4;                           // 0xC600(0x00A0)(NoDestructor)
	bool                                          K2Node_PropertyAccess_3;                           // 0xC6A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6A1[0x7];                                     // 0xC6A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_PropertyAccess_2;                           // 0xC6A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0xC6B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0xC6B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6B2[0x6];                                     // 0xC6B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_HeelHeight_BB387FD742265B193B50A88A47DACE2E; // 0xC6B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableRightHandIK_BB387FD742265B193B50A88A47DACE2E; // 0xC6C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableLeftHandIK_BB387FD742265B193B50A88A47DACE2E; // 0xC6C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C2[0x6];                                     // 0xC6C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_HighHeelToeHeight_14776D5546D97ADC8A72698C13E7F85B; // 0xC6C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_ToesRotaionYawOffset_14776D5546D97ADC8A72698C13E7F85B; // 0xC6D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_AnkleRotaionYawOffset_14776D5546D97ADC8A72698C13E7F85B; // 0xC6D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_HighHeelHeight_14776D5546D97ADC8A72698C13E7F85B; // 0xC6E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Clothes_Thickness_WristR_14776D5546D97ADC8A72698C13E7F85B; // 0xC6E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Clothes_Thickness_WristL_14776D5546D97ADC8A72698C13E7F85B; // 0xC700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Clothes_Thickness_RootM_14776D5546D97ADC8A72698C13E7F85B; // 0xC718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Curve_IKAlpha_14776D5546D97ADC8A72698C13E7F85B; // 0xC730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C738[0x8];                                     // 0xC738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_AnkleRightCompTransform_14776D5546D97ADC8A72698C13E7F85B; // 0xC740(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_AnkleLeftCompTransform_14776D5546D97ADC8A72698C13E7F85B; // 0xC7A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_RootMCompTransform_14776D5546D97ADC8A72698C13E7F85B; // 0xC800(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RootM_Alpha_14776D5546D97ADC8A72698C13E7F85B; // 0xC860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bForceInitFootPlacementIKParam_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C869[0x7];                                     // 0xC869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_Velocity_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC870(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SlopeAngle_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootRotationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootRotationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightFootTranslationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftFootTranslationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_PelvisWeight_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_PelvisOffset_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_AnkleRightOffsetRotation_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               __CustomProperty_AnkleLeftOffsetRotation_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC8E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_AnkleRightOffsetLocation_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC900(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AnkleLeftOffsetLocation_9C3CB6104FEEB92C4E76B49E09A60DE1; // 0xC918(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_HighHeel_Ankle_Angle_362258464F4E0990712B6C89FDD06BD0; // 0xC930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C938[0x8];                                     // 0xC938(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  __CustomProperty_FootRotationR_362258464F4E0990712B6C89FDD06BD0; // 0xC940(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  __CustomProperty_FootRotationL_362258464F4E0990712B6C89FDD06BD0; // 0xC960(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_FootAlphaR_362258464F4E0990712B6C89FDD06BD0; // 0xC980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_FootAlphaL_362258464F4E0990712B6C89FDD06BD0; // 0xC988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_FootPositionR_362258464F4E0990712B6C89FDD06BD0; // 0xC990(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_FootPostionL_362258464F4E0990712B6C89FDD06BD0; // 0xC9A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_Lock_R_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xC9C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_isLock_R_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xC9D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9D9[0x7];                                     // 0xC9D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_Lock_R_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xC9E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_isLock_R_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xC9F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9F9[0x7];                                     // 0xC9F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Lock_L_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_isLock_L_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA19[0x7];                                     // 0xCA19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_Lock_L_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_isLock_L_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA39[0x7];                                     // 0xCA39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Offset_R_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_isOffset_R_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA59[0x7];                                     // 0xCA59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Offset_L_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_isOffset_L_Hand_IK_Rotation_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA79[0x7];                                     // 0xCA79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_Offset_R_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_isOffset_R_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCA98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA99[0x7];                                     // 0xCA99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_Offset_L_Hand_IK_Position_4CAA693F4D458C4D1C9B5B9AE3D03FA9; // 0xCAA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
