#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NikkiPlayerState_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NikkiPlayerState_BP.NikkiPlayerState_BP_C
// 0x0048 (0x04A8 - 0x0460)
class ANikkiPlayerState_BP_C final : public APlayerState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractiveWhitePointComponent_C*   BP_InteractiveWhitePointComponent;                 // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnScreenFadeIn;                                    // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_X6FadingWidget_C*                  FadeWidget;                                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnShowMessage;                                     // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_NikkiPlayerState_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NikkiPlayerState_BP_C">();
	}
	static class ANikkiPlayerState_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANikkiPlayerState_BP_C>();
	}
};
static_assert(alignof(ANikkiPlayerState_BP_C) == 0x000008, "Wrong alignment on ANikkiPlayerState_BP_C");
static_assert(sizeof(ANikkiPlayerState_BP_C) == 0x0004A8, "Wrong size on ANikkiPlayerState_BP_C");
static_assert(offsetof(ANikkiPlayerState_BP_C, UberGraphFrame) == 0x000460, "Member 'ANikkiPlayerState_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, BP_InteractiveWhitePointComponent) == 0x000468, "Member 'ANikkiPlayerState_BP_C::BP_InteractiveWhitePointComponent' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, Audio) == 0x000470, "Member 'ANikkiPlayerState_BP_C::Audio' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, DefaultSceneRoot) == 0x000478, "Member 'ANikkiPlayerState_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, OnScreenFadeIn) == 0x000480, "Member 'ANikkiPlayerState_BP_C::OnScreenFadeIn' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, FadeWidget) == 0x000490, "Member 'ANikkiPlayerState_BP_C::FadeWidget' has a wrong offset!");
static_assert(offsetof(ANikkiPlayerState_BP_C, OnShowMessage) == 0x000498, "Member 'ANikkiPlayerState_BP_C::OnShowMessage' has a wrong offset!");

}

