#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NikkiGameInstance_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NikkiGameInstance_BP.NikkiGameInstance_BP_C
// 0x0038 (0x0650 - 0x0618)
class UNikkiGameInstance_BP_C final : public UX6GameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSoftClassPath                         BP_FuncLibClassPath;                               // 0x0620(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_SystemStateNotifyManager_C*         SystemStateNotifyManager;                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            WBP_Loading;                                       // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NikkiGameInstance_BP(int32 EntryPoint);
	void GetDirLightVecFromDyEnv(struct FVector* LightVector);
	void GetLoadingUI(class UUserWidget** LoadingUI);
	void GetSystemStateNotifyManager(class ABP_SystemStateNotifyManager_C** SystemStateNotifyMgr);
	void GetTODTime(double* Progress);
	void ReceiveInit();
	void SetLoadingUI(class UUserWidget* LoadingUI);
	void SetSystemStateNotifyManager(class ABP_SystemStateNotifyManager_C* SystemStateNotifyMgr);
	void SetTODTime(double Progress);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NikkiGameInstance_BP_C">();
	}
	static class UNikkiGameInstance_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNikkiGameInstance_BP_C>();
	}
};
static_assert(alignof(UNikkiGameInstance_BP_C) == 0x000008, "Wrong alignment on UNikkiGameInstance_BP_C");
static_assert(sizeof(UNikkiGameInstance_BP_C) == 0x000650, "Wrong size on UNikkiGameInstance_BP_C");
static_assert(offsetof(UNikkiGameInstance_BP_C, UberGraphFrame) == 0x000618, "Member 'UNikkiGameInstance_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNikkiGameInstance_BP_C, BP_FuncLibClassPath) == 0x000620, "Member 'UNikkiGameInstance_BP_C::BP_FuncLibClassPath' has a wrong offset!");
static_assert(offsetof(UNikkiGameInstance_BP_C, SystemStateNotifyManager) == 0x000640, "Member 'UNikkiGameInstance_BP_C::SystemStateNotifyManager' has a wrong offset!");
static_assert(offsetof(UNikkiGameInstance_BP_C, WBP_Loading) == 0x000648, "Member 'UNikkiGameInstance_BP_C::WBP_Loading' has a wrong offset!");

}

