#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NikkiAnim_BPNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "F_PawnStateToOverlayData_structs.hpp"
#include "F_StylizedClothAnimRow_structs.hpp"
#include "X6Animation_structs.hpp"
#include "NikkiPhysics_structs.hpp"


namespace SDK::Params
{

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimationLayer_BaseMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimationLayer_BaseMovement final
{
public:
	struct FPoseLink                              AnimationLayer_BaseMovement_0;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimationLayer_BaseMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimationLayer_BaseMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimationLayer_BaseMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimationLayer_BaseMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimationLayer_BaseMovement, AnimationLayer_BaseMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimationLayer_BaseMovement::AnimationLayer_BaseMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimGraph) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimGraph");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimGraph) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimGraph");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_AimOffset
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_AimOffset final
{
public:
	struct FPoseLink                              InPoseForAimOffset;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_AimOffset_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_AimOffset) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_AimOffset");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_AimOffset) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_AimOffset");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_AimOffset, InPoseForAimOffset) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_AimOffset::InPoseForAimOffset' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_AimOffset, AnimLayer_AimOffset_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_AimOffset::AnimLayer_AimOffset_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_AttractorBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior final
{
public:
	struct FPoseLink                              InPose_AttractorBehavior;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_AttractorBehavior_0;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior, InPose_AttractorBehavior) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior::InPose_AttractorBehavior' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior, AnimLayer_AttractorBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_AttractorBehavior::AnimLayer_AttractorBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_BehaviorAdditiveMode
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode final
{
public:
	struct FPoseLink                              InPoseForPlayerBehavior;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_BehaviorAdditiveMode_0;                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode, InPoseForPlayerBehavior) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode::InPoseForPlayerBehavior' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode, AnimLayer_BehaviorAdditiveMode_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_BehaviorAdditiveMode::AnimLayer_BehaviorAdditiveMode_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_BehaviorConnectionMode
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode final
{
public:
	struct FPoseLink                              InPoseToConnectionMode;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_BehaviorConnectionMode_0;                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode, InPoseToConnectionMode) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode::InPoseToConnectionMode' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode, AnimLayer_BehaviorConnectionMode_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_BehaviorConnectionMode::AnimLayer_BehaviorConnectionMode_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_CombatMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_CombatMovement final
{
public:
	struct FPoseLink                              AnimLayer_CombatMovement_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_CombatMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_CombatMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_CombatMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_CombatMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_CombatMovement, AnimLayer_CombatMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_CombatMovement::AnimLayer_CombatMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_CustomBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_CustomBehavior final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_CustomBehavior_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_CustomBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_CustomBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_CustomBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_CustomBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_CustomBehavior, InPose) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_CustomBehavior::InPose' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_CustomBehavior, AnimLayer_CustomBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_CustomBehavior::AnimLayer_CustomBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_DialogueBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior final
{
public:
	struct FPoseLink                              InPose_DIalogueBehavior;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_DialogueBehavior_0;                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior, InPose_DIalogueBehavior) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior::InPose_DIalogueBehavior' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior, AnimLayer_DialogueBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_DialogueBehavior::AnimLayer_DialogueBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_EquipmentAdditiveMode
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode final
{
public:
	struct FPoseLink                              InPoseForEquipment;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_EquipmentAdditiveMode_0;                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode, InPoseForEquipment) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode::InPoseForEquipment' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode, AnimLayer_EquipmentAdditiveMode_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_EquipmentAdditiveMode::AnimLayer_EquipmentAdditiveMode_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_InteractionPerformanceBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior final
{
public:
	struct FPoseLink                              InPose_InterationPerformance;                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_InteractionPerformanceBehavior_0;        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior, InPose_InterationPerformance) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior::InPose_InterationPerformance' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior, AnimLayer_InteractionPerformanceBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_InteractionPerformanceBehavior::AnimLayer_InteractionPerformanceBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_Jump
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_Jump final
{
public:
	struct FPoseLink                              AnimLayer_Jump_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_Jump) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_Jump");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_Jump) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_Jump");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_Jump, AnimLayer_Jump_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_Jump::AnimLayer_Jump_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_Land
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_Land final
{
public:
	struct FPoseLink                              AnimLayer_Land_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_Land) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_Land");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_Land) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_Land");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_Land, AnimLayer_Land_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_Land::AnimLayer_Land_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_MovementDependObject
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_MovementDependObject final
{
public:
	struct FPoseLink                              AnimLayer_MovementDependObject_0;                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_MovementDependObject) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_MovementDependObject");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_MovementDependObject) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_MovementDependObject");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_MovementDependObject, AnimLayer_MovementDependObject_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_MovementDependObject::AnimLayer_MovementDependObject_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_NPCAdditiveBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_NPCAdditiveBehavior_0;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior, InPose) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior::InPose' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior, AnimLayer_NPCAdditiveBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_NPCAdditiveBehavior::AnimLayer_NPCAdditiveBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_NPCBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_NPCBehavior final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_NPCBehavior_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_NPCBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_NPCBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_NPCBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_NPCBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_NPCBehavior, InPose_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_NPCBehavior::InPose_0' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_NPCBehavior, AnimLayer_NPCBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_NPCBehavior::AnimLayer_NPCBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_PlayerControllingTool
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool final
{
public:
	struct FPoseLink                              AnimLayer_PlayerControllingTool_0;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool, AnimLayer_PlayerControllingTool_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_PlayerControllingTool::AnimLayer_PlayerControllingTool_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_PlayerRegularMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement final
{
public:
	struct FPoseLink                              AnimLayer_PlayerRegularMovement_0;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement, AnimLayer_PlayerRegularMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_PlayerRegularMovement::AnimLayer_PlayerRegularMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_SituationFeedbackBehavior
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior final
{
public:
	struct FPoseLink                              InPose_SituationFeedback;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_SituationFeedbackBehavior_0;             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior, InPose_SituationFeedback) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior::InPose_SituationFeedback' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior, AnimLayer_SituationFeedbackBehavior_0) == 0x000010, "Member 'NikkiAnim_BPNew_C_AnimLayer_SituationFeedbackBehavior::AnimLayer_SituationFeedbackBehavior_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_SpecialSurfaceMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement final
{
public:
	struct FPoseLink                              AnimLayer_SpecialSurfaceMovement_0;                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement, AnimLayer_SpecialSurfaceMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_SpecialSurfaceMovement::AnimLayer_SpecialSurfaceMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_StrafeMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_StrafeMovement final
{
public:
	struct FPoseLink                              AnimLayer_StrafeMovement_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_StrafeMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_StrafeMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_StrafeMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_StrafeMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_StrafeMovement, AnimLayer_StrafeMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_StrafeMovement::AnimLayer_StrafeMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_UsingCarrierMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement final
{
public:
	struct FPoseLink                              AnimLayer_UsingCarrierMovement_0;                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement, AnimLayer_UsingCarrierMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_UsingCarrierMovement::AnimLayer_UsingCarrierMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.AnimLayer_WhiteBoxMovement
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement final
{
public:
	struct FPoseLink                              AnimLayer_WhiteBoxMovement_0;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement");
static_assert(sizeof(NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement");
static_assert(offsetof(NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement, AnimLayer_WhiteBoxMovement_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_AnimLayer_WhiteBoxMovement::AnimLayer_WhiteBoxMovement_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.BasePoseForAdditive
// 0x0010 (0x0010 - 0x0000)
struct NikkiAnim_BPNew_C_BasePoseForAdditive final
{
public:
	struct FPoseLink                              BasePoseForAdditive_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_BasePoseForAdditive) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_BasePoseForAdditive");
static_assert(sizeof(NikkiAnim_BPNew_C_BasePoseForAdditive) == 0x000010, "Wrong size on NikkiAnim_BPNew_C_BasePoseForAdditive");
static_assert(offsetof(NikkiAnim_BPNew_C_BasePoseForAdditive, BasePoseForAdditive_0) == 0x000000, "Member 'NikkiAnim_BPNew_C_BasePoseForAdditive::BasePoseForAdditive_0' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong alignment on NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong size on NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'NikkiAnim_BPNew_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct NikkiAnim_BPNew_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NikkiAnim_BPNew_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on NikkiAnim_BPNew_C_BlueprintUpdateAnimation");
static_assert(sizeof(NikkiAnim_BPNew_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on NikkiAnim_BPNew_C_BlueprintUpdateAnimation");
static_assert(offsetof(NikkiAnim_BPNew_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'NikkiAnim_BPNew_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.CanUseDialogPerformance
// 0x0003 (0x0003 - 0x0000)
struct NikkiAnim_BPNew_C_CanUseDialogPerformance final
{
public:
	bool                                          bRet;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NikkiAnim_BPNew_C_CanUseDialogPerformance) == 0x000001, "Wrong alignment on NikkiAnim_BPNew_C_CanUseDialogPerformance");
static_assert(sizeof(NikkiAnim_BPNew_C_CanUseDialogPerformance) == 0x000003, "Wrong size on NikkiAnim_BPNew_C_CanUseDialogPerformance");
static_assert(offsetof(NikkiAnim_BPNew_C_CanUseDialogPerformance, bRet) == 0x000000, "Member 'NikkiAnim_BPNew_C_CanUseDialogPerformance::bRet' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_CanUseDialogPerformance, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'NikkiAnim_BPNew_C_CanUseDialogPerformance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_CanUseDialogPerformance, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'NikkiAnim_BPNew_C_CanUseDialogPerformance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.ClearInertialization
// 0x0020 (0x0020 - 0x0000)
struct NikkiAnim_BPNew_C_ClearInertialization final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(NikkiAnim_BPNew_C_ClearInertialization) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_ClearInertialization");
static_assert(sizeof(NikkiAnim_BPNew_C_ClearInertialization) == 0x000020, "Wrong size on NikkiAnim_BPNew_C_ClearInertialization");
static_assert(offsetof(NikkiAnim_BPNew_C_ClearInertialization, Context) == 0x000000, "Member 'NikkiAnim_BPNew_C_ClearInertialization::Context' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ClearInertialization, Node) == 0x000010, "Member 'NikkiAnim_BPNew_C_ClearInertialization::Node' has a wrong offset!");

// Function NikkiAnim_BPNew.NikkiAnim_BPNew_C.ExecuteUbergraph_NikkiAnim_BPNew
// 0x0238 (0x0238 - 0x0000)
struct NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceInitFootPlacementIKParam_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseDialogPerformance_bRet;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6OverlayFrameSettings*                CallFunc_SpawnObject_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValueWithDefault_OutValue;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurveValueWithDefault_ReturnValue;     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValueWithDefault_OutValue_1;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurveValueWithDefault_ReturnValue_1;   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6OverlayFrameSettings*                CallFunc_SpawnObject_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_6;       // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetForceInitFootPlacementIKParam_ReturnValue_1; // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerAnimStatesComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEnableEmotionPerformance_EnableEmotionPerformance; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Delta;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerRegularInAirMovementComp_C*   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckActorHasBegunPlay_ReturnValue;       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_3;            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_7;       // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_8;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_4;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UX6CharacterMovementComponent*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue_1;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet___CustomProperty_PelvisWeight_9C3CB6104FEEB92C4E76B49E09A60DE1_ImplicitCast; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet___CustomProperty_LeftFootTranslationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1_ImplicitCast; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet___CustomProperty_LeftFootRotationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1_ImplicitCast; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet___CustomProperty_RightFootTranslationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1_ImplicitCast; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet___CustomProperty_RightFootRotationWeight_9C3CB6104FEEB92C4E76B49E09A60DE1_ImplicitCast; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x01DC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateIKDatas_Delta_ImplicitCast;         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateDefaultEmotionRatio_DeltaSeconds_ImplicitCast; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateFootPlacementIKAlpha_DeltaSeconds_ImplicitCast; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_FacialSlotBlendAlpha_ImplicitCast; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_EyeBlinkWeight_ImplicitCast;    // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_2;       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_3;       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew) == 0x000008, "Wrong alignment on NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew");
static_assert(sizeof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew) == 0x000238, "Wrong size on NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, EntryPoint) == 0x000000, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetForceInitFootPlacementIKParam_ReturnValue) == 0x000004, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetForceInitFootPlacementIKParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000005, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetCurveValue_ReturnValue) == 0x000008, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00000C, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000010, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_CanUseDialogPerformance_bRet) == 0x00002C, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_CanUseDialogPerformance_bRet' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00002D, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000038, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_SpawnObject_ReturnValue) == 0x000050, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetCurveValueWithDefault_OutValue) == 0x000058, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetCurveValueWithDefault_OutValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetCurveValueWithDefault_ReturnValue) == 0x00005C, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetCurveValueWithDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetCurveValueWithDefault_OutValue_1) == 0x000060, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetCurveValueWithDefault_OutValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetCurveValueWithDefault_ReturnValue_1) == 0x000064, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetCurveValueWithDefault_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_SpawnObject_ReturnValue_1) == 0x000068, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000070, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000071, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x000073, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_SelectFloat_ReturnValue_1) == 0x000078, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_BooleanAND_ReturnValue_1) == 0x000080, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x000081, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000082, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_Greater_DoubleDouble_ReturnValue_6) == 0x000083, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_Greater_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_BooleanAND_ReturnValue_2) == 0x000084, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_BooleanAND_ReturnValue_3) == 0x000085, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000086, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_GetForceInitFootPlacementIKParam_ReturnValue_1) == 0x000087, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_GetForceInitFootPlacementIKParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, K2Node_Event_DeltaTimeX) == 0x000088, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000090, "Member 'NikkiAnim_BPNew_C_ExecuteUbergraph_NikkiAnim_BPNew::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
