#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NikkiPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Enum NikkiPhysics.EControlBoneAxis
// NumValues: 0x0004
enum class EControlBoneAxis : uint32
{
	Default                                  = 0,
	Positive                                 = 1,
	Opposite                                 = 2,
	EControlBoneAxis_MAX                     = 3,
};

// Enum NikkiPhysics.EControlBoneMethod
// NumValues: 0x0006
enum class EControlBoneMethod : uint32
{
	Default                                  = 0,
	FollowRefBones                           = 1,
	AdaptiveFollowAndSplay                   = 2,
	RBFInterpolation                         = 3,
	JustFirstBone                            = 4,
	EControlBoneMethod_MAX                   = 5,
};

// Enum NikkiPhysics.EControlBoneAlphaMethod
// NumValues: 0x0004
enum class EControlBoneAlphaMethod : uint32
{
	UpdatePerFrame                           = 0,
	PreInitAuto                              = 1,
	PreInitWithSettingBone                   = 2,
	EControlBoneAlphaMethod_MAX              = 3,
};

// Enum NikkiPhysics.EControlBoneType
// NumValues: 0x0003
enum class EControlBoneType : uint8
{
	Follow                                   = 0,
	Splay                                    = 1,
	EControlBoneType_MAX                     = 2,
};

// Enum NikkiPhysics.ERBFDistMethod
// NumValues: 0x0004
enum class ERBFDistMethod : uint32
{
	Default                                  = 0,
	Euclidean                                = 1,
	Quaternion                               = 2,
	ERBFDistMethod_MAX                       = 3,
};

// Enum NikkiPhysics.ENikki_ClothType
// NumValues: 0x0010
enum class ENikki_ClothType : uint32
{
	Null                                     = 0,
	InnermostCloth                           = 100,
	Shoes                                    = 200,
	FootAccessories                          = 300,
	BottomCloth                              = 400,
	Dress                                    = 500,
	WaistAccessories                         = 600,
	HandAccessories                          = 700,
	HandWeapon                               = 750,
	UpperCloth                               = 800,
	Coat                                     = 900,
	UpperAccessories                         = 1000,
	Hair                                     = 1100,
	HairAccessories                          = 1200,
	OutermostCloth                           = 2000,
	ENikki_MAX                               = 2001,
};

// Enum NikkiPhysics.ENikki_ParticleType
// NumValues: 0x0006
enum class ENikki_ParticleType : uint8
{
	Normal                                   = 0,
	Root                                     = 1,
	Trunk                                    = 2,
	Virtual                                  = 3,
	Fixed                                    = 4,
	ENikki_MAX                               = 5,
};

// Enum NikkiPhysics.ENikki_SpringType
// NumValues: 0x0004
enum class ENikki_SpringType : uint8
{
	Normal                                   = 0,
	Compress                                 = 1,
	Stretch                                  = 2,
	ENikki_MAX                               = 3,
};

// Enum NikkiPhysics.ENikki_SolverType
// NumValues: 0x0003
enum class ENikki_SolverType : uint8
{
	BaseSolver                               = 0,
	RopeSolver                               = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_PartColMethod
// NumValues: 0x0004
enum class ENikki_PartColMethod : uint8
{
	Off                                      = 0,
	PartCollider                             = 1,
	LayeringConstraint                       = 2,
	ENikki_MAX                               = 3,
};

// Enum NikkiPhysics.ENikki_HumanColMethod
// NumValues: 0x0005
enum class ENikki_HumanColMethod : uint8
{
	MaintainSideOrCapsuleCollision           = 0,
	MaintainSideAndCapsuleCollision          = 1,
	CapsuleCollisionOnly                     = 2,
	NoCollision                              = 3,
	ENikki_MAX                               = 4,
};

// Enum NikkiPhysics.ENikki_CapColMethod
// NumValues: 0x0007
enum class ENikki_CapColMethod : uint8
{
	SwitchClosestDirAndNormal                = 0,
	AlwaysClosestDir                         = 1,
	AlwaysNormal                             = 2,
	PureParticleCollision                    = 3,
	PredictContact                           = 4,
	SwitchBindDirAndNormal                   = 5,
	ENikki_MAX                               = 6,
};

// Enum NikkiPhysics.ENikki_RotCorrectRef
// NumValues: 0x0003
enum class ENikki_RotCorrectRef : uint8
{
	AnimPose                                 = 0,
	AnimPoseWithSpring                       = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_HeightFieldMethod
// NumValues: 0x0006
enum class ENikki_HeightFieldMethod : uint8
{
	Off                                      = 0,
	LineTrace                                = 1,
	HeightMap                                = 2,
	EnvGeometry                              = 3,
	HeightMapAndEnvGeometry                  = 4,
	ENikki_MAX                               = 5,
};

// Enum NikkiPhysics.ENikki_LengthConstraintType
// NumValues: 0x0005
enum class ENikki_LengthConstraintType : uint8
{
	SoftLength                               = 0,
	SoftOneSide                              = 1,
	HardLength                               = 2,
	HardOneSide                              = 3,
	ENikki_MAX                               = 4,
};

// Enum NikkiPhysics.ENikki_ShapeMethod
// NumValues: 0x0003
enum class ENikki_ShapeMethod : uint8
{
	ParentFixed                              = 0,
	DynamicRotCenter                         = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_ParticleColliderType
// NumValues: 0x0004
enum class ENikki_ParticleColliderType : uint8
{
	NotACollider                             = 0,
	SphereCollider                           = 1,
	CapsuleCollider                          = 2,
	ENikki_MAX                               = 3,
};

// Enum NikkiPhysics.ENikki_ColliderType
// NumValues: 0x0005
enum class ENikki_ColliderType : uint8
{
	Sphere                                   = 0,
	Box                                      = 1,
	Capsule                                  = 2,
	Polygon                                  = 3,
	ENikki_MAX                               = 4,
};

// Enum NikkiPhysics.ENikki_GravityType
// NumValues: 0x0003
enum class ENikki_GravityType : uint8
{
	ComponentSpace                           = 0,
	WorldSpace                               = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_LayeredBoneBlendMode
// NumValues: 0x0003
enum class ENikki_LayeredBoneBlendMode : uint8
{
	BranchFilter                             = 0,
	BlendMask                                = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.FNikki_CellType
// NumValues: 0x0004
enum class EFNikki_CellType : uint8
{
	FNikkiHeightField_CELL_Null              = 0,
	FNikkiHeightField_CELL_Flat              = 1,
	FNikkiHeightField_CELL_Block             = 2,
	FNikkiHeightField_CELL_MAX               = 3,
};

// Enum NikkiPhysics.ENikki_PoseDriverType
// NumValues: 0x0003
enum class ENikki_PoseDriverType : uint32
{
	NormalDirection                          = 0,
	BoneSpaceCertainAxis                     = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_SimplePhySimSpace
// NumValues: 0x0003
enum class ENikki_SimplePhySimSpace : uint32
{
	ComponentSpace                           = 0,
	SpecificBoneSpace                        = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_SleeveRigFollowArm
// NumValues: 0x0003
enum class ENikki_SleeveRigFollowArm : uint32
{
	UpperArm                                 = 0,
	LowerArm                                 = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_SimSpaceType
// NumValues: 0x0004
enum class ENikki_SimSpaceType : uint8
{
	ComponentSpace                           = 0,
	RootMSpace                               = 1,
	SpecificBoneSpace                        = 2,
	ENikki_MAX                               = 3,
};

// Enum NikkiPhysics.ENikki_SpaceType
// NumValues: 0x0003
enum class ENikki_SpaceType : uint8
{
	ComponentSpace                           = 0,
	WorldSpace                               = 1,
	ENikki_MAX                               = 2,
};

// Enum NikkiPhysics.ENikki_WindAccumType
// NumValues: 0x0003
enum class ENikki_WindAccumType : uint8
{
	Add                                      = 0,
	Replace                                  = 1,
	ENikki_MAX                               = 2,
};

// ScriptStruct NikkiPhysics.Nikki_ArmSkirtRig_FollowBone
// 0x0068 (0x0068 - 0x0000)
struct FNikki_ArmSkirtRig_FollowBone final
{
public:
	struct FBoneReference                         BoneRef;                                           // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FollowRatio;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TposeDirection;                                    // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateDirInverse;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x37];                                      // 0x0031(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_ArmSkirtRig_FollowBone) == 0x000008, "Wrong alignment on FNikki_ArmSkirtRig_FollowBone");
static_assert(sizeof(FNikki_ArmSkirtRig_FollowBone) == 0x000068, "Wrong size on FNikki_ArmSkirtRig_FollowBone");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBone, BoneRef) == 0x000000, "Member 'FNikki_ArmSkirtRig_FollowBone::BoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBone, FollowRatio) == 0x000010, "Member 'FNikki_ArmSkirtRig_FollowBone::FollowRatio' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBone, TposeDirection) == 0x000018, "Member 'FNikki_ArmSkirtRig_FollowBone::TposeDirection' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBone, bRotateDirInverse) == 0x000030, "Member 'FNikki_ArmSkirtRig_FollowBone::bRotateDirInverse' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_ArmSkirtRig_FollowBoneDistHelper
// 0x0014 (0x0014 - 0x0000)
struct FNikki_ArmSkirtRig_FollowBoneDistHelper final
{
public:
	struct FBoneReference                         BoneRef;                                           // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CriticalDistance;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikki_ArmSkirtRig_FollowBoneDistHelper) == 0x000004, "Wrong alignment on FNikki_ArmSkirtRig_FollowBoneDistHelper");
static_assert(sizeof(FNikki_ArmSkirtRig_FollowBoneDistHelper) == 0x000014, "Wrong size on FNikki_ArmSkirtRig_FollowBoneDistHelper");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBoneDistHelper, BoneRef) == 0x000000, "Member 'FNikki_ArmSkirtRig_FollowBoneDistHelper::BoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_FollowBoneDistHelper, CriticalDistance) == 0x000010, "Member 'FNikki_ArmSkirtRig_FollowBoneDistHelper::CriticalDistance' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_ArmSkirtRig_AxisBone
// 0x00A0 (0x00A0 - 0x0000)
struct FNikki_ArmSkirtRig_AxisBone final
{
public:
	struct FBoneReference                         BoneRef;                                           // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FrontDir;                                          // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotAxis;                                           // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpAxis;                                            // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x48];                                      // 0x0058(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_ArmSkirtRig_AxisBone) == 0x000008, "Wrong alignment on FNikki_ArmSkirtRig_AxisBone");
static_assert(sizeof(FNikki_ArmSkirtRig_AxisBone) == 0x0000A0, "Wrong size on FNikki_ArmSkirtRig_AxisBone");
static_assert(offsetof(FNikki_ArmSkirtRig_AxisBone, BoneRef) == 0x000000, "Member 'FNikki_ArmSkirtRig_AxisBone::BoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_AxisBone, FrontDir) == 0x000010, "Member 'FNikki_ArmSkirtRig_AxisBone::FrontDir' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_AxisBone, RotAxis) == 0x000028, "Member 'FNikki_ArmSkirtRig_AxisBone::RotAxis' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_AxisBone, UpAxis) == 0x000040, "Member 'FNikki_ArmSkirtRig_AxisBone::UpAxis' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_ArmSkirtRig_ModifiedBone
// 0x01D0 (0x01D0 - 0x0000)
struct FNikki_ArmSkirtRig_ModifiedBone final
{
public:
	struct FBoneReference                         BoneRef;                                           // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartFollowAngle;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNikki_ArmSkirtRig_AxisBone            AxisBone;                                          // 0x0018(0x00A0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNikki_ArmSkirtRig_FollowBone          FollowStrictBone;                                  // 0x00B8(0x0068)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNikki_ArmSkirtRig_FollowBoneDistHelper DistHelper;                                       // 0x0120(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LastBoneRef;                                       // 0x0134(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     ChildRotCurve;                                     // 0x0148(0x0088)(Edit, Config, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikki_ArmSkirtRig_ModifiedBone) == 0x000008, "Wrong alignment on FNikki_ArmSkirtRig_ModifiedBone");
static_assert(sizeof(FNikki_ArmSkirtRig_ModifiedBone) == 0x0001D0, "Wrong size on FNikki_ArmSkirtRig_ModifiedBone");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, BoneRef) == 0x000000, "Member 'FNikki_ArmSkirtRig_ModifiedBone::BoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, StartFollowAngle) == 0x000010, "Member 'FNikki_ArmSkirtRig_ModifiedBone::StartFollowAngle' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, AxisBone) == 0x000018, "Member 'FNikki_ArmSkirtRig_ModifiedBone::AxisBone' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, FollowStrictBone) == 0x0000B8, "Member 'FNikki_ArmSkirtRig_ModifiedBone::FollowStrictBone' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, DistHelper) == 0x000120, "Member 'FNikki_ArmSkirtRig_ModifiedBone::DistHelper' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, LastBoneRef) == 0x000134, "Member 'FNikki_ArmSkirtRig_ModifiedBone::LastBoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_ArmSkirtRig_ModifiedBone, ChildRotCurve) == 0x000148, "Member 'FNikki_ArmSkirtRig_ModifiedBone::ChildRotCurve' has a wrong offset!");

// ScriptStruct NikkiPhysics.AnimNode_NikkiArmSkirtRig
// 0x0050 (0x0060 - 0x0010)
struct FAnimNode_NikkiArmSkirtRig final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDraw;                                        // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNikki_ArmSkirtRig_ModifiedBone> ModifiedBones;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_NikkiArmSkirtRig) == 0x000008, "Wrong alignment on FAnimNode_NikkiArmSkirtRig");
static_assert(sizeof(FAnimNode_NikkiArmSkirtRig) == 0x000060, "Wrong size on FAnimNode_NikkiArmSkirtRig");
static_assert(offsetof(FAnimNode_NikkiArmSkirtRig, Source) == 0x000010, "Member 'FAnimNode_NikkiArmSkirtRig::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiArmSkirtRig, alpha) == 0x000020, "Member 'FAnimNode_NikkiArmSkirtRig::alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiArmSkirtRig, bDebugDraw) == 0x000024, "Member 'FAnimNode_NikkiArmSkirtRig::bDebugDraw' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiArmSkirtRig, ModifiedBones) == 0x000028, "Member 'FAnimNode_NikkiArmSkirtRig::ModifiedBones' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_SpineControlTarget
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x10) FNikki_SpineControlTarget final
{
public:
	struct FBoneReference                         bone;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBoneAxis                                     BodyRefAxis;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ControlledAlpha;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x68];                                      // 0x0018(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_SpineControlTarget) == 0x000010, "Wrong alignment on FNikki_SpineControlTarget");
static_assert(sizeof(FNikki_SpineControlTarget) == 0x000080, "Wrong size on FNikki_SpineControlTarget");
static_assert(offsetof(FNikki_SpineControlTarget, bone) == 0x000000, "Member 'FNikki_SpineControlTarget::bone' has a wrong offset!");
static_assert(offsetof(FNikki_SpineControlTarget, BodyRefAxis) == 0x000010, "Member 'FNikki_SpineControlTarget::BodyRefAxis' has a wrong offset!");
static_assert(offsetof(FNikki_SpineControlTarget, ControlledAlpha) == 0x000014, "Member 'FNikki_SpineControlTarget::ControlledAlpha' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_BagDrivenParameters
// 0x0014 (0x0014 - 0x0000)
struct FNikki_BagDrivenParameters final
{
public:
	EBoneAxis                                     RotationAxisToRefer;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneAxis                                     RotationAxis;                                      // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAngle;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAngle;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikki_BagDrivenParameters) == 0x000004, "Wrong alignment on FNikki_BagDrivenParameters");
static_assert(sizeof(FNikki_BagDrivenParameters) == 0x000014, "Wrong size on FNikki_BagDrivenParameters");
static_assert(offsetof(FNikki_BagDrivenParameters, RotationAxisToRefer) == 0x000000, "Member 'FNikki_BagDrivenParameters::RotationAxisToRefer' has a wrong offset!");
static_assert(offsetof(FNikki_BagDrivenParameters, RotationAxis) == 0x000001, "Member 'FNikki_BagDrivenParameters::RotationAxis' has a wrong offset!");
static_assert(offsetof(FNikki_BagDrivenParameters, MaxAngle) == 0x000004, "Member 'FNikki_BagDrivenParameters::MaxAngle' has a wrong offset!");
static_assert(offsetof(FNikki_BagDrivenParameters, MinAngle) == 0x000008, "Member 'FNikki_BagDrivenParameters::MinAngle' has a wrong offset!");
static_assert(offsetof(FNikki_BagDrivenParameters, StartAngle) == 0x00000C, "Member 'FNikki_BagDrivenParameters::StartAngle' has a wrong offset!");
static_assert(offsetof(FNikki_BagDrivenParameters, Multiplier) == 0x000010, "Member 'FNikki_BagDrivenParameters::Multiplier' has a wrong offset!");

// ScriptStruct NikkiPhysics.AnimNode_NikkiBagRig
// 0x0088 (0x0098 - 0x0010)
struct FAnimNode_NikkiBagRig final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         DrivenBone;                                        // 0x0024(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         DriverBone;                                        // 0x0034(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNikki_BagDrivenParameters>     DrivenParameters;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         BodyMainBone;                                      // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNikki_SpineControlTarget>      ModifiedBones;                                     // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x20];                                      // 0x0078(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_NikkiBagRig) == 0x000008, "Wrong alignment on FAnimNode_NikkiBagRig");
static_assert(sizeof(FAnimNode_NikkiBagRig) == 0x000098, "Wrong size on FAnimNode_NikkiBagRig");
static_assert(offsetof(FAnimNode_NikkiBagRig, Source) == 0x000010, "Member 'FAnimNode_NikkiBagRig::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, alpha) == 0x000020, "Member 'FAnimNode_NikkiBagRig::alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, DrivenBone) == 0x000024, "Member 'FAnimNode_NikkiBagRig::DrivenBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, DriverBone) == 0x000034, "Member 'FAnimNode_NikkiBagRig::DriverBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, DrivenParameters) == 0x000048, "Member 'FAnimNode_NikkiBagRig::DrivenParameters' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, BodyMainBone) == 0x000058, "Member 'FAnimNode_NikkiBagRig::BodyMainBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiBagRig, ModifiedBones) == 0x000068, "Member 'FAnimNode_NikkiBagRig::ModifiedBones' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_DrivenParameters
// 0x000C (0x000C - 0x0000)
struct FNikki_DrivenParameters final
{
public:
	EBoneAxis                                     RotationAxisToRefer;                               // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneAxis                                     RotationAxis;                                      // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EControlBoneAxis                              RotationLimit;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikki_DrivenParameters) == 0x000004, "Wrong alignment on FNikki_DrivenParameters");
static_assert(sizeof(FNikki_DrivenParameters) == 0x00000C, "Wrong size on FNikki_DrivenParameters");
static_assert(offsetof(FNikki_DrivenParameters, RotationAxisToRefer) == 0x000000, "Member 'FNikki_DrivenParameters::RotationAxisToRefer' has a wrong offset!");
static_assert(offsetof(FNikki_DrivenParameters, RotationAxis) == 0x000001, "Member 'FNikki_DrivenParameters::RotationAxis' has a wrong offset!");
static_assert(offsetof(FNikki_DrivenParameters, RotationLimit) == 0x000004, "Member 'FNikki_DrivenParameters::RotationLimit' has a wrong offset!");
static_assert(offsetof(FNikki_DrivenParameters, Multiplier) == 0x000008, "Member 'FNikki_DrivenParameters::Multiplier' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_BodyControlTarget
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x10) FNikki_BodyControlTarget final
{
public:
	struct FBoneReference                         bone;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBoneAxis                                     BodyRefAxis;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ControlledAlpha;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x68];                                      // 0x0018(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_BodyControlTarget) == 0x000010, "Wrong alignment on FNikki_BodyControlTarget");
static_assert(sizeof(FNikki_BodyControlTarget) == 0x000080, "Wrong size on FNikki_BodyControlTarget");
static_assert(offsetof(FNikki_BodyControlTarget, bone) == 0x000000, "Member 'FNikki_BodyControlTarget::bone' has a wrong offset!");
static_assert(offsetof(FNikki_BodyControlTarget, BodyRefAxis) == 0x000010, "Member 'FNikki_BodyControlTarget::BodyRefAxis' has a wrong offset!");
static_assert(offsetof(FNikki_BodyControlTarget, ControlledAlpha) == 0x000014, "Member 'FNikki_BodyControlTarget::ControlledAlpha' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_ControlledClockBone
// 0x0030 (0x0030 - 0x0000)
struct FNikki_ControlledClockBone final
{
public:
	struct FBoneReference                         SourceBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNikki_DrivenParameters>        DrivenParameters;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikki_ControlledClockBone) == 0x000008, "Wrong alignment on FNikki_ControlledClockBone");
static_assert(sizeof(FNikki_ControlledClockBone) == 0x000030, "Wrong size on FNikki_ControlledClockBone");
static_assert(offsetof(FNikki_ControlledClockBone, SourceBone) == 0x000000, "Member 'FNikki_ControlledClockBone::SourceBone' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledClockBone, TargetBone) == 0x000010, "Member 'FNikki_ControlledClockBone::TargetBone' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledClockBone, DrivenParameters) == 0x000020, "Member 'FNikki_ControlledClockBone::DrivenParameters' has a wrong offset!");

// ScriptStruct NikkiPhysics.AnimNode_NikkiCloakRig
// 0x0068 (0x0078 - 0x0010)
struct FAnimNode_NikkiCloakRig final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNikki_ControlledClockBone>     ControlledBones;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         BodyMainBone;                                      // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FNikki_BodyControlTarget>       ModifiedBones;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_NikkiCloakRig) == 0x000008, "Wrong alignment on FAnimNode_NikkiCloakRig");
static_assert(sizeof(FAnimNode_NikkiCloakRig) == 0x000078, "Wrong size on FAnimNode_NikkiCloakRig");
static_assert(offsetof(FAnimNode_NikkiCloakRig, Source) == 0x000010, "Member 'FAnimNode_NikkiCloakRig::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiCloakRig, alpha) == 0x000020, "Member 'FAnimNode_NikkiCloakRig::alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiCloakRig, ControlledBones) == 0x000028, "Member 'FAnimNode_NikkiCloakRig::ControlledBones' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiCloakRig, BodyMainBone) == 0x000038, "Member 'FAnimNode_NikkiCloakRig::BodyMainBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiCloakRig, ModifiedBones) == 0x000048, "Member 'FAnimNode_NikkiCloakRig::ModifiedBones' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_TargetBone
// 0x0058 (0x0058 - 0x0000)
struct FNikki_TargetBone final
{
public:
	struct FBoneReference                         BoneRef;                                           // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ControlBoneNum;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 JointedAlphas;                                     // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ApartAlphas;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimpleAlpha;                                       // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInit;                                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x17];                                      // 0x0041(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_TargetBone) == 0x000008, "Wrong alignment on FNikki_TargetBone");
static_assert(sizeof(FNikki_TargetBone) == 0x000058, "Wrong size on FNikki_TargetBone");
static_assert(offsetof(FNikki_TargetBone, BoneRef) == 0x000000, "Member 'FNikki_TargetBone::BoneRef' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, ControlBoneNum) == 0x000010, "Member 'FNikki_TargetBone::ControlBoneNum' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, JointedAlphas) == 0x000018, "Member 'FNikki_TargetBone::JointedAlphas' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, ApartAlphas) == 0x000028, "Member 'FNikki_TargetBone::ApartAlphas' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, StartAngle) == 0x000038, "Member 'FNikki_TargetBone::StartAngle' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, SimpleAlpha) == 0x00003C, "Member 'FNikki_TargetBone::SimpleAlpha' has a wrong offset!");
static_assert(offsetof(FNikki_TargetBone, bInit) == 0x000040, "Member 'FNikki_TargetBone::bInit' has a wrong offset!");

// ScriptStruct NikkiPhysics.Nikki_ControlledBone
// 0x0108 (0x0108 - 0x0000)
struct FNikki_ControlledBone final
{
public:
	struct FBoneReference                         ChainDirBone;                                      // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FNikki_TargetBone                      First;                                             // 0x0010(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNikki_TargetBone                      Second;                                            // 0x0068(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                BSBoneDir;                                         // 0x00C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormDir;                                           // 0x00D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ApartFollowRatio;                                  // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplayMark;                                        // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplayAlpha;                                        // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplayStartAngle;                                   // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplayMaxAngle;                                     // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseChainDirWhenSplaying;                          // 0x0104(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarkStopFirstRotate;                              // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNikki_ControlledBone) == 0x000008, "Wrong alignment on FNikki_ControlledBone");
static_assert(sizeof(FNikki_ControlledBone) == 0x000108, "Wrong size on FNikki_ControlledBone");
static_assert(offsetof(FNikki_ControlledBone, ChainDirBone) == 0x000000, "Member 'FNikki_ControlledBone::ChainDirBone' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, First) == 0x000010, "Member 'FNikki_ControlledBone::First' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, Second) == 0x000068, "Member 'FNikki_ControlledBone::Second' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, BSBoneDir) == 0x0000C0, "Member 'FNikki_ControlledBone::BSBoneDir' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, NormDir) == 0x0000D8, "Member 'FNikki_ControlledBone::NormDir' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, ApartFollowRatio) == 0x0000F0, "Member 'FNikki_ControlledBone::ApartFollowRatio' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, bSplayMark) == 0x0000F4, "Member 'FNikki_ControlledBone::bSplayMark' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, SplayAlpha) == 0x0000F8, "Member 'FNikki_ControlledBone::SplayAlpha' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, SplayStartAngle) == 0x0000FC, "Member 'FNikki_ControlledBone::SplayStartAngle' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, SplayMaxAngle) == 0x000100, "Member 'FNikki_ControlledBone::SplayMaxAngle' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, bUseChainDirWhenSplaying) == 0x000104, "Member 'FNikki_ControlledBone::bUseChainDirWhenSplaying' has a wrong offset!");
static_assert(offsetof(FNikki_ControlledBone, bMarkStopFirstRotate) == 0x000105, "Member 'FNikki_ControlledBone::bMarkStopFirstRotate' has a wrong offset!");

// ScriptStruct NikkiPhysics.HorizontalRigProxySim
// 0x00E0 (0x00E0 - 0x0000)
struct alignas(0x10) FHorizontalRigProxySim final
{
public:
	struct FBoneReference                         TargetBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FixStiffness;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xCC];                                      // 0x0014(0x00CC)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHorizontalRigProxySim) == 0x000010, "Wrong alignment on FHorizontalRigProxySim");
static_assert(sizeof(FHorizontalRigProxySim) == 0x0000E0, "Wrong size on FHorizontalRigProxySim");
static_assert(offsetof(FHorizontalRigProxySim, TargetBone) == 0x000000, "Member 'FHorizontalRigProxySim::TargetBone' has a wrong offset!");
static_assert(offsetof(FHorizontalRigProxySim, FixStiffness) == 0x000010, "Member 'FHorizontalRigProxySim::FixStiffness' has a wrong offset!");

// ScriptStruct NikkiPhysics.HorizontalRigCorrectProxy
// 0x0200 (0x0200 - 0x0000)
struct alignas(0x10) FHorizontalRigCorrectProxy final
{
public:
	struct FBoneReference                         TargetBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityStiffness;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damping;                                           // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x1D0];                                     // 0x0030(0x01D0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHorizontalRigCorrectProxy) == 0x000010, "Wrong alignment on FHorizontalRigCorrectProxy");
static_assert(sizeof(FHorizontalRigCorrectProxy) == 0x000200, "Wrong size on FHorizontalRigCorrectProxy");
static_assert(offsetof(FHorizontalRigCorrectProxy, TargetBone) == 0x000000, "Member 'FHorizontalRigCorrectProxy::TargetBone' has a wrong offset!");
static_assert(offsetof(FHorizontalRigCorrectProxy, Gravity) == 0x000010, "Member 'FHorizontalRigCorrectProxy::Gravity' has a wrong offset!");
static_assert(offsetof(FHorizontalRigCorrectProxy, GravityStiffness) == 0x000028, "Member 'FHorizontalRigCorrectProxy::GravityStiffness' has a wrong offset!");
static_assert(offsetof(FHorizontalRigCorrectProxy, Damping) == 0x00002C, "Member 'FHorizontalRigCorrectProxy::Damping' has a wrong offset!");

// ScriptStruct NikkiPhysics.RBFPose
// 0x0010 (0x0010 - 0x0000)
struct FRBFPose final
{
public:
	TArray<float>                                 Values;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRBFPose) == 0x000008, "Wrong alignment on FRBFPose");
static_assert(sizeof(FRBFPose) == 0x000010, "Wrong size on FRBFPose");
static_assert(offsetof(FRBFPose, Values) == 0x000000, "Member 'FRBFPose::Values' has a wrong offset!");

// ScriptStruct NikkiPhysics.RBFSolver
// 0x0004 (0x0004 - 0x0000)
struct FRBFSolver final
{
public:
	ERBFDistMethod                                DistanceMethod;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRBFSolver) == 0x000004, "Wrong alignment on FRBFSolver");
static_assert(sizeof(FRBFSolver) == 0x000004, "Wrong size on FRBFSolver");
static_assert(offsetof(FRBFSolver, DistanceMethod) == 0x000000, "Member 'FRBFSolver::DistanceMethod' has a wrong offset!");

// ScriptStruct NikkiPhysics.AnimNode_NikkiHorizontalRig
// 0x05D0 (0x05E0 - 0x0010)
struct FAnimNode_NikkiHorizontalRig final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         HipRadius;                                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KneeRadius;                                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HipFollowSpeed;                                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KneeFollowSpeed;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HipFollowAngleFactor;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KneeFollowAngleFactor;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RefBoneDirectionInfluence;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrontJointedAlpha;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BackJointedAlpha;                                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlBoneType                              ExcuteType;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EControlBoneMethod                            Method;                                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlBoneAlphaMethod                       RelativeAlphaGenMethod;                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplayBoneDistributionSoften;                       // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixBodyRot;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         ClothBodyBone;                                     // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         FootBodyBone;                                      // 0x006C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FrontDirection;                                    // 0x0080(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftBone;                                          // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftSecondBone;                                    // 0x00A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LeftBoneDir;                                       // 0x00B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightBone;                                         // 0x00D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightSecondBone;                                   // 0x00E0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RightBoneDir;                                      // 0x00F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNormalize;                                  // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSmoothing;                                  // 0x0109(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothRatio;                                       // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothCenter;                                      // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         ControlledLeftBone;                                // 0x0114(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         ControlledRightBone;                               // 0x0124(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNikki_ControlledBone>          ControlledBones;                                   // 0x0138(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 FixedBones;                                        // 0x0148(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x0158(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHorizontalRigProxySim                 ProxySimSystem;                                    // 0x0170(0x00E0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHorizontalRigCorrectProxy             GravityProxy;                                      // 0x0250(0x0200)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCheckRefBoneComponentSpace;                       // 0x0450(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGetAngleComponentSpace;                           // 0x0451(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawDebugInfo;                                    // 0x0452(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawControlledBones;                              // 0x0453(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBFPose>                       LeftPoses;                                         // 0x0458(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRBFPose>                       RightPoses;                                        // 0x0468(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRBFSolver                             RBFSolver;                                         // 0x0478(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBFPose                               Poses;                                             // 0x0480(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_490[0x150];                                    // 0x0490(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_NikkiHorizontalRig) == 0x000010, "Wrong alignment on FAnimNode_NikkiHorizontalRig");
static_assert(sizeof(FAnimNode_NikkiHorizontalRig) == 0x0005E0, "Wrong size on FAnimNode_NikkiHorizontalRig");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, Source) == 0x000010, "Member 'FAnimNode_NikkiHorizontalRig::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, HipRadius) == 0x000020, "Member 'FAnimNode_NikkiHorizontalRig::HipRadius' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, KneeRadius) == 0x000024, "Member 'FAnimNode_NikkiHorizontalRig::KneeRadius' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, HipFollowSpeed) == 0x000028, "Member 'FAnimNode_NikkiHorizontalRig::HipFollowSpeed' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, KneeFollowSpeed) == 0x00002C, "Member 'FAnimNode_NikkiHorizontalRig::KneeFollowSpeed' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, HipFollowAngleFactor) == 0x000030, "Member 'FAnimNode_NikkiHorizontalRig::HipFollowAngleFactor' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, KneeFollowAngleFactor) == 0x000034, "Member 'FAnimNode_NikkiHorizontalRig::KneeFollowAngleFactor' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, RefBoneDirectionInfluence) == 0x000038, "Member 'FAnimNode_NikkiHorizontalRig::RefBoneDirectionInfluence' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, FrontJointedAlpha) == 0x00003C, "Member 'FAnimNode_NikkiHorizontalRig::FrontJointedAlpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, BackJointedAlpha) == 0x000040, "Member 'FAnimNode_NikkiHorizontalRig::BackJointedAlpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, alpha) == 0x000044, "Member 'FAnimNode_NikkiHorizontalRig::alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, ExcuteType) == 0x000048, "Member 'FAnimNode_NikkiHorizontalRig::ExcuteType' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, Method) == 0x00004C, "Member 'FAnimNode_NikkiHorizontalRig::Method' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, RelativeAlphaGenMethod) == 0x000050, "Member 'FAnimNode_NikkiHorizontalRig::RelativeAlphaGenMethod' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, SplayBoneDistributionSoften) == 0x000054, "Member 'FAnimNode_NikkiHorizontalRig::SplayBoneDistributionSoften' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, bFixBodyRot) == 0x000058, "Member 'FAnimNode_NikkiHorizontalRig::bFixBodyRot' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, ClothBodyBone) == 0x00005C, "Member 'FAnimNode_NikkiHorizontalRig::ClothBodyBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, FootBodyBone) == 0x00006C, "Member 'FAnimNode_NikkiHorizontalRig::FootBodyBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, FrontDirection) == 0x000080, "Member 'FAnimNode_NikkiHorizontalRig::FrontDirection' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, LeftBone) == 0x000098, "Member 'FAnimNode_NikkiHorizontalRig::LeftBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, LeftSecondBone) == 0x0000A8, "Member 'FAnimNode_NikkiHorizontalRig::LeftSecondBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_NikkiHorizontalRig, LeftBoneDir) == 0x0000B8, "Member 'FAnimNode_NikkiHorizontalRig::LeftBoneDir' has a wrong offset!");
