#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperRipples

#include "Basic.hpp"

#include "PaperRipples_structs.hpp"


namespace SDK::Params
{

// Function PaperRipples.RainRipplesComponent.SetRippleCount
// 0x0004 (0x0004 - 0x0000)
struct RainRipplesComponent_SetRippleCount final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RainRipplesComponent_SetRippleCount) == 0x000004, "Wrong alignment on RainRipplesComponent_SetRippleCount");
static_assert(sizeof(RainRipplesComponent_SetRippleCount) == 0x000004, "Wrong size on RainRipplesComponent_SetRippleCount");
static_assert(offsetof(RainRipplesComponent_SetRippleCount, NewValue) == 0x000000, "Member 'RainRipplesComponent_SetRippleCount::NewValue' has a wrong offset!");

// Function PaperRipples.RainRipplesComponent.UpdateRipplesConfig
// 0x0018 (0x0018 - 0x0000)
struct RainRipplesComponent_UpdateRipplesConfig final
{
public:
	struct FRipplesConfigParameters               NewRipples;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RainRipplesComponent_UpdateRipplesConfig) == 0x000004, "Wrong alignment on RainRipplesComponent_UpdateRipplesConfig");
static_assert(sizeof(RainRipplesComponent_UpdateRipplesConfig) == 0x000018, "Wrong size on RainRipplesComponent_UpdateRipplesConfig");
static_assert(offsetof(RainRipplesComponent_UpdateRipplesConfig, NewRipples) == 0x000000, "Member 'RainRipplesComponent_UpdateRipplesConfig::NewRipples' has a wrong offset!");

}

