#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperClothLODBodySectionFix

#include "Basic.hpp"

#include "PaperClothLODBodySectionFix_structs.hpp"


namespace SDK::Params
{

// Function PaperClothLODBodySectionFix.ClothLODBodySectionFixBlueprintLiabrary.FixClothBodyLODSection
// 0x0050 (0x0050 - 0x0000)
struct ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection final
{
public:
	class USkeletalMesh*                          InCloth;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          InBody;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InBodyMatSlotNameLOD0;                             // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InClothMatSlotNameLOD0;                            // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InBodyMatSlotNameLOD;                              // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InClothMatSlotNameLOD;                             // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InBodyLODIndex;                                    // 0x0030(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InClothLODIndex;                                   // 0x0034(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodySectionFixOfClothParameter        InParam;                                           // 0x0038(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection) == 0x000008, "Wrong alignment on ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection");
static_assert(sizeof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection) == 0x000050, "Wrong size on ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InCloth) == 0x000000, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InCloth' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InBody) == 0x000008, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InBody' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InBodyMatSlotNameLOD0) == 0x000010, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InBodyMatSlotNameLOD0' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InClothMatSlotNameLOD0) == 0x000018, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InClothMatSlotNameLOD0' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InBodyMatSlotNameLOD) == 0x000020, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InBodyMatSlotNameLOD' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InClothMatSlotNameLOD) == 0x000028, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InClothMatSlotNameLOD' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InBodyLODIndex) == 0x000030, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InBodyLODIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InClothLODIndex) == 0x000034, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InClothLODIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection, InParam) == 0x000038, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothBodyLODSection::InParam' has a wrong offset!");

// Function PaperClothLODBodySectionFix.ClothLODBodySectionFixBlueprintLiabrary.FixClothLODBodySection
// 0x0030 (0x0030 - 0x0000)
struct ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection final
{
public:
	class USkeletalMesh*                          InCloth;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          InBody;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InBodyMatSlotName;                                 // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodySectionFixOfClothParameter        InParam;                                           // 0x0018(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection) == 0x000008, "Wrong alignment on ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection");
static_assert(sizeof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection) == 0x000030, "Wrong size on ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection, InCloth) == 0x000000, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection::InCloth' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection, InBody) == 0x000008, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection::InBody' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection, InBodyMatSlotName) == 0x000010, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection::InBodyMatSlotName' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection, InParam) == 0x000018, "Member 'ClothLODBodySectionFixBlueprintLiabrary_FixClothLODBodySection::InParam' has a wrong offset!");

// Function PaperClothLODBodySectionFix.ClothLODBodySectionFixBlueprintLiabrary.GetInnerMeshVertices
// 0x0038 (0x0038 - 0x0000)
struct ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices final
{
public:
	class USkeletalMesh*                          InnerMesh;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          OuterMesh;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InnerLODIndex;                                     // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InnerSectionIndex;                                 // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OuterLODIndex;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OuterSectionIndex;                                 // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCullSectionParameter                  InParam;                                           // 0x0020(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices) == 0x000008, "Wrong alignment on ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices");
static_assert(sizeof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices) == 0x000038, "Wrong size on ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, InnerMesh) == 0x000000, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::InnerMesh' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, OuterMesh) == 0x000008, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::OuterMesh' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, InnerLODIndex) == 0x000010, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::InnerLODIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, InnerSectionIndex) == 0x000014, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::InnerSectionIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, OuterLODIndex) == 0x000018, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::OuterLODIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, OuterSectionIndex) == 0x00001C, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::OuterSectionIndex' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, InParam) == 0x000020, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::InParam' has a wrong offset!");
static_assert(offsetof(ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices, ReturnValue) == 0x000028, "Member 'ClothLODBodySectionFixBlueprintLiabrary_GetInnerMeshVertices::ReturnValue' has a wrong offset!");

}

