#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperMeshGrass

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct PaperMeshGrass.PaperMeshGrassMeshInstanceData
// 0x0110 (0x0290 - 0x0180)
struct FPaperMeshGrassMeshInstanceData final : public FStaticMeshComponentInstanceData
{
public:
	bool                                          bHasCachedTransform;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       LastGeneratedBoxSphereBound;                       // 0x0180(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastCachedTransform;                               // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              PackedResolution;                                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint16>                                PackedHeightData;                                  // 0x0228(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                PackedGrassEncodedWeightData;                      // 0x0238(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                PackedGrassEncodedDisturbData;                     // 0x0248(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ULandscapeGrassType*>            PackedGrassTypes;                                  // 0x0258(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 PackedWeightIndices;                               // 0x0268(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 PackedDisturbIndices;                              // 0x0278(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperMeshGrassMeshInstanceData) == 0x000010, "Wrong alignment on FPaperMeshGrassMeshInstanceData");
static_assert(sizeof(FPaperMeshGrassMeshInstanceData) == 0x000290, "Wrong size on FPaperMeshGrassMeshInstanceData");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, bHasCachedTransform) == 0x000178, "Member 'FPaperMeshGrassMeshInstanceData::bHasCachedTransform' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, LastGeneratedBoxSphereBound) == 0x000180, "Member 'FPaperMeshGrassMeshInstanceData::LastGeneratedBoxSphereBound' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, LastCachedTransform) == 0x0001C0, "Member 'FPaperMeshGrassMeshInstanceData::LastCachedTransform' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedResolution) == 0x000220, "Member 'FPaperMeshGrassMeshInstanceData::PackedResolution' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedHeightData) == 0x000228, "Member 'FPaperMeshGrassMeshInstanceData::PackedHeightData' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedGrassEncodedWeightData) == 0x000238, "Member 'FPaperMeshGrassMeshInstanceData::PackedGrassEncodedWeightData' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedGrassEncodedDisturbData) == 0x000248, "Member 'FPaperMeshGrassMeshInstanceData::PackedGrassEncodedDisturbData' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedGrassTypes) == 0x000258, "Member 'FPaperMeshGrassMeshInstanceData::PackedGrassTypes' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedWeightIndices) == 0x000268, "Member 'FPaperMeshGrassMeshInstanceData::PackedWeightIndices' has a wrong offset!");
static_assert(offsetof(FPaperMeshGrassMeshInstanceData, PackedDisturbIndices) == 0x000278, "Member 'FPaperMeshGrassMeshInstanceData::PackedDisturbIndices' has a wrong offset!");

}

