#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperClothLODBodySectionFix

#include "Basic.hpp"


namespace SDK
{

// Enum PaperClothLODBodySectionFix.EBodySectionFixProjectType
// NumValues: 0x0004
enum class EBodySectionFixProjectType : uint8
{
	InSection                                = 0,
	NearEdge                                 = 1,
	OutSection                               = 2,
	EBodySectionFixProjectType_MAX           = 3,
};

// Enum PaperClothLODBodySectionFix.EBodySectionFixMethodType
// NumValues: 0x0003
enum class EBodySectionFixMethodType : uint8
{
	AnyInSection                             = 0,
	AllInSection                             = 1,
	EBodySectionFixMethodType_MAX            = 2,
};

// ScriptStruct PaperClothLODBodySectionFix.BodySectionFixOfClothParameter
// 0x0014 (0x0014 - 0x0000)
struct FBodySectionFixOfClothParameter final
{
public:
	float                                         MeshToMeshWeightThreshold;                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBodySectionFixMethodType                     ProjectMethodType;                                 // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsiderDistance;                                 // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MeshToMeshDistanceThreshold;                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshToMeshDistanceRatioThreshold;                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteObj;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBodySectionFixOfClothParameter) == 0x000004, "Wrong alignment on FBodySectionFixOfClothParameter");
static_assert(sizeof(FBodySectionFixOfClothParameter) == 0x000014, "Wrong size on FBodySectionFixOfClothParameter");
static_assert(offsetof(FBodySectionFixOfClothParameter, MeshToMeshWeightThreshold) == 0x000000, "Member 'FBodySectionFixOfClothParameter::MeshToMeshWeightThreshold' has a wrong offset!");
static_assert(offsetof(FBodySectionFixOfClothParameter, ProjectMethodType) == 0x000004, "Member 'FBodySectionFixOfClothParameter::ProjectMethodType' has a wrong offset!");
static_assert(offsetof(FBodySectionFixOfClothParameter, bConsiderDistance) == 0x000005, "Member 'FBodySectionFixOfClothParameter::bConsiderDistance' has a wrong offset!");
static_assert(offsetof(FBodySectionFixOfClothParameter, MeshToMeshDistanceThreshold) == 0x000008, "Member 'FBodySectionFixOfClothParameter::MeshToMeshDistanceThreshold' has a wrong offset!");
static_assert(offsetof(FBodySectionFixOfClothParameter, MeshToMeshDistanceRatioThreshold) == 0x00000C, "Member 'FBodySectionFixOfClothParameter::MeshToMeshDistanceRatioThreshold' has a wrong offset!");
static_assert(offsetof(FBodySectionFixOfClothParameter, bWriteObj) == 0x000010, "Member 'FBodySectionFixOfClothParameter::bWriteObj' has a wrong offset!");

// ScriptStruct PaperClothLODBodySectionFix.CullSectionParameter
// 0x0008 (0x0008 - 0x0000)
struct FCullSectionParameter final
{
public:
	int32                                         NumInsideThreshold;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteObj;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCullSectionParameter) == 0x000004, "Wrong alignment on FCullSectionParameter");
static_assert(sizeof(FCullSectionParameter) == 0x000008, "Wrong size on FCullSectionParameter");
static_assert(offsetof(FCullSectionParameter, NumInsideThreshold) == 0x000000, "Member 'FCullSectionParameter::NumInsideThreshold' has a wrong offset!");
static_assert(offsetof(FCullSectionParameter, bWriteObj) == 0x000004, "Member 'FCullSectionParameter::bWriteObj' has a wrong offset!");

}

