#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperDialogue

#include "Basic.hpp"

#include "CinematicCamera_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum PaperDialogue.EPaperDialogueCameraType
// NumValues: 0x0003
enum class EPaperDialogueCameraType : uint8
{
	Preset                                   = 0,
	Fbx                                      = 1,
	EPaperDialogueCameraType_MAX             = 2,
};

// Enum PaperDialogue.EHeadAnim
// NumValues: 0x0005
enum class EHeadAnim : uint8
{
	Express                                  = 1,
	Eye                                      = 2,
	Neck                                     = 4,
	Hair                                     = 8,
	EHeadAnim_MAX                            = 9,
};

// Enum PaperDialogue.EDialogueDynamicActor
// NumValues: 0x000C
enum class EDialogueDynamicActor : uint8
{
	EMainCharacter                           = 0,
	ECharacter0                              = 1,
	ECharacter1                              = 2,
	ECharacter2                              = 3,
	ECharacter3                              = 4,
	ECharacter4                              = 5,
	ECharacter5                              = 6,
	ECharacter6                              = 7,
	ECharacter7                              = 8,
	ECharacter8                              = 9,
	ECharacter9                              = 10,
	EDialogueDynamicActor_MAX                = 11,
};

// Enum PaperDialogue.DynamicBindType
// NumValues: 0x0004
enum class EDynamicBindType : uint32
{
	KeepCurrentTransfrom                     = 0,
	KeepSlotTransfrom                        = 1,
	KeepWorldTransfrom                       = 2,
	DynamicBindType_MAX                      = 3,
};

// Enum PaperDialogue.FDialogueCameraType2
// NumValues: 0x0003
enum class EFDialogueCameraType2 : uint8
{
	Dynamic                                  = 0,
	Fixed                                    = 1,
	FDialogueCameraType2_MAX                 = 2,
};

// Enum PaperDialogue.EPaperDialogueLineType
// NumValues: 0x0003
enum class EPaperDialogueLineType : uint8
{
	LineText                                 = 0,
	LineBreak                                = 1,
	EPaperDialogueLineType_MAX               = 2,
};

// Enum PaperDialogue.ELookAtType
// NumValues: 0x0005
enum class ELookAtType : uint32
{
	TargetForward                            = 0,
	WorldPosition                            = 1,
	ActorPosition                            = 2,
	ActorBone                                = 3,
	ELookAtType_MAX                          = 4,
};

// Enum PaperDialogue.EPaperProjectType
// NumValues: 0x0005
enum class EPaperProjectType : uint8
{
	X6Project                                = 0,
	X7Project                                = 1,
	X12Project                               = 2,
	Invalid                                  = 3,
	EPaperProjectType_MAX                    = 4,
};

// Enum PaperDialogue.EDialogueCharacterSlotType
// NumValues: 0x0003
enum class EDialogueCharacterSlotType : uint8
{
	CharacterSlot                            = 0,
	WalkPoint                                = 1,
	EDialogueCharacterSlotType_MAX           = 2,
};

// Enum PaperDialogue.EDialogueGraphStatus
// NumValues: 0x0005
enum class EDialogueGraphStatus : uint32
{
	Dirty                                    = 0,
	Error                                    = 1,
	Good                                     = 2,
	Warning                                  = 3,
	EDialogueGraphStatus_MAX                 = 4,
};

// Enum PaperDialogue.EDialogueKeyAlignType
// NumValues: 0x0004
enum class EDialogueKeyAlignType : uint8
{
	Begin                                    = 0,
	Mid                                      = 1,
	End                                      = 2,
	EDialogueKeyAlignType_MAX                = 3,
};

// Enum PaperDialogue.EDialogueTransformRangeType
// NumValues: 0x0004
enum class EDialogueTransformRangeType : uint8
{
	ERelayCamera                             = 0,
	AffectCamera                             = 1,
	NotAffectCamera                          = 2,
	EDialogueTransformRangeType_MAX          = 3,
};

// Enum PaperDialogue.EPaperDialogueChoiceConditionPurpose
// NumValues: 0x0003
enum class EPaperDialogueChoiceConditionPurpose : uint8
{
	ShowChoice                               = 0,
	HideChoice                               = 1,
	EPaperDialogueChoiceConditionPurpose_MAX = 2,
};

// Enum PaperDialogue.EPaperDialogueLanguage
// NumValues: 0x0005
enum class EPaperDialogueLanguage : uint8
{
	ZH                                       = 0,
	EN                                       = 1,
	JP                                       = 2,
	KR                                       = 3,
	Max                                      = 4,
};

// Enum PaperDialogue.EPaperDialogueVoiceType
// NumValues: 0x0003
enum class EPaperDialogueVoiceType : uint8
{
	PDVT_3D                                  = 0,
	PDVT_2D                                  = 1,
	PDVT_MAX                                 = 2,
};

// Enum PaperDialogue.EDialogueSetWalkPointExecuteType
// NumValues: 0x0003
enum class EDialogueSetWalkPointExecuteType : uint8
{
	MoveTransform                            = 0,
	KeepTransform                            = 1,
	EDialogueSetWalkPointExecuteType_MAX     = 2,
};

// Enum PaperDialogue.EDialogueSetWalkPointVisibility
// NumValues: 0x0003
enum class EDialogueSetWalkPointVisibility : uint8
{
	UnHandle                                 = 0,
	ForceInvisible                           = 1,
	EDialogueSetWalkPointVisibility_MAX      = 2,
};

// Enum PaperDialogue.EPaperDialogueFadeType
// NumValues: 0x0004
enum class EPaperDialogueFadeType : uint8
{
	Head                                     = 0,
	Tail                                     = 1,
	Both                                     = 2,
	EPaperDialogueFadeType_MAX               = 3,
};

// Enum PaperDialogue.EPaperDialogueWalkType
// NumValues: 0x0003
enum class EPaperDialogueWalkType : uint8
{
	WalkIn                                   = 0,
	WalkOut                                  = 1,
	EPaperDialogueWalkType_MAX               = 2,
};

// Enum PaperDialogue.EPCDLightGenerateRule
// NumValues: 0x0004
enum class EPCDLightGenerateRule : uint8
{
	Always_TurnOn                            = 0,
	By_Lines                                 = 1,
	By_Camera_Beta                           = 2,
	EPCDLightGenerateRule_MAX                = 3,
};

// Enum PaperDialogue.EPaperDialogueGenerationRootMotionDirectin
// NumValues: 0x0003
enum class EPaperDialogueGenerationRootMotionDirectin : uint8
{
	RoleYaw                                  = 0,
	StartPointToEndPoint                     = 1,
	EPaperDialogueGenerationRootMotionDirectin_MAX = 2,
};

// Enum PaperDialogue.EPaperDialogueType
// NumValues: 0x0004
enum class EPaperDialogueType : uint8
{
	PDT_CinematicDialogue                    = 0,
	PDT_OrdinaryDialogue                     = 1,
	PDT_GameplayDialogue                     = 2,
	PDT_MAX                                  = 3,
};

// Enum PaperDialogue.EPCDSequenceExternalActorHandleType
// NumValues: 0x0004
enum class EPCDSequenceExternalActorHandleType : uint8
{
	UnHandled                                = 0,
	RemoveBeforeNextSequence                 = 1,
	RemoveAtEnd                              = 2,
	EPCDSequenceExternalActorHandleType_MAX  = 3,
};

// Enum PaperDialogue.EPaperDialogueUpdateRuntimeTransformMode
// NumValues: 0x0004
enum class EPaperDialogueUpdateRuntimeTransformMode : uint8
{
	ManualSelection                          = 0,
	AutoSelection_ReplaceWithPreviewTransform = 1,
	AutoSelection_MaintainRuntimeTransform   = 2,
	Max                                      = 3,
};

// Enum PaperDialogue.FDialogueUserWidgetState
// NumValues: 0x0009
enum class EFDialogueUserWidgetState : uint8
{
	PDUW_Nothing                             = 0,
	PDUW_ShowLine                            = 1,
	PDUW_ShowMenu                            = 2,
	PDUW_Condition                           = 3,
	PDUW_Persistent                          = 4,
	PDUW_Blueprint                           = 5,
	PDUW_Function                            = 6,
	PDUW_LevelSequence                       = 7,
	PDUW_MAX                                 = 8,
};

// ScriptStruct PaperDialogue.DialogueFbxCameraShot
// 0x0070 (0x0070 - 0x0000)
struct FDialogueFbxCameraShot final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocalLength;                                       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Aperture;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDialogueFbxCameraShot) == 0x000010, "Wrong alignment on FDialogueFbxCameraShot");
static_assert(sizeof(FDialogueFbxCameraShot) == 0x000070, "Wrong size on FDialogueFbxCameraShot");
static_assert(offsetof(FDialogueFbxCameraShot, Transform) == 0x000000, "Member 'FDialogueFbxCameraShot::Transform' has a wrong offset!");
static_assert(offsetof(FDialogueFbxCameraShot, FocalLength) == 0x000060, "Member 'FDialogueFbxCameraShot::FocalLength' has a wrong offset!");
static_assert(offsetof(FDialogueFbxCameraShot, Aperture) == 0x000064, "Member 'FDialogueFbxCameraShot::Aperture' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueTrackItem
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FPaperDialogueTrackItem
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  LinkedGuid;                                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitDuration;                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitTimeOffset;                                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueTrackItem) == 0x000008, "Wrong alignment on FPaperDialogueTrackItem");
static_assert(sizeof(FPaperDialogueTrackItem) == 0x000040, "Wrong size on FPaperDialogueTrackItem");
static_assert(offsetof(FPaperDialogueTrackItem, Guid) == 0x000008, "Member 'FPaperDialogueTrackItem::Guid' has a wrong offset!");
static_assert(offsetof(FPaperDialogueTrackItem, LinkedGuid) == 0x000018, "Member 'FPaperDialogueTrackItem::LinkedGuid' has a wrong offset!");
static_assert(offsetof(FPaperDialogueTrackItem, InitDuration) == 0x000028, "Member 'FPaperDialogueTrackItem::InitDuration' has a wrong offset!");
static_assert(offsetof(FPaperDialogueTrackItem, InitTimeOffset) == 0x00002C, "Member 'FPaperDialogueTrackItem::InitTimeOffset' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueTransform
// 0x00D0 (0x0110 - 0x0040)
struct FPaperDialogueTransform final : public FPaperDialogueTrackItem
{
public:
	bool                                          IsEnable;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BeginTrans;                                        // 0x0050(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             EndTrans;                                          // 0x00B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueTransform) == 0x000010, "Wrong alignment on FPaperDialogueTransform");
static_assert(sizeof(FPaperDialogueTransform) == 0x000110, "Wrong size on FPaperDialogueTransform");
static_assert(offsetof(FPaperDialogueTransform, IsEnable) == 0x000040, "Member 'FPaperDialogueTransform::IsEnable' has a wrong offset!");
static_assert(offsetof(FPaperDialogueTransform, BeginTrans) == 0x000050, "Member 'FPaperDialogueTransform::BeginTrans' has a wrong offset!");
static_assert(offsetof(FPaperDialogueTransform, EndTrans) == 0x0000B0, "Member 'FPaperDialogueTransform::EndTrans' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueLine
// 0x0000 (0x0040 - 0x0040)
struct FPaperDialogueLine final : public FPaperDialogueTrackItem
{
};
static_assert(alignof(FPaperDialogueLine) == 0x000008, "Wrong alignment on FPaperDialogueLine");
static_assert(sizeof(FPaperDialogueLine) == 0x000040, "Wrong size on FPaperDialogueLine");

// ScriptStruct PaperDialogue.PaperDialogueLookAtInit
// 0x0040 (0x0080 - 0x0040)
struct FPaperDialogueLookAtInit : public FPaperDialogueTrackItem
{
public:
	bool                                          IsEnable;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ELookAtType                                   Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActorName;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PosOffset;                                         // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Forward;                                           // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueLookAtInit) == 0x000008, "Wrong alignment on FPaperDialogueLookAtInit");
static_assert(sizeof(FPaperDialogueLookAtInit) == 0x000080, "Wrong size on FPaperDialogueLookAtInit");
static_assert(offsetof(FPaperDialogueLookAtInit, IsEnable) == 0x000040, "Member 'FPaperDialogueLookAtInit::IsEnable' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAtInit, Type) == 0x000044, "Member 'FPaperDialogueLookAtInit::Type' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAtInit, ActorName) == 0x000048, "Member 'FPaperDialogueLookAtInit::ActorName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAtInit, BoneName) == 0x000050, "Member 'FPaperDialogueLookAtInit::BoneName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAtInit, PosOffset) == 0x000058, "Member 'FPaperDialogueLookAtInit::PosOffset' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAtInit, Forward) == 0x000070, "Member 'FPaperDialogueLookAtInit::Forward' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueLookAt
// 0x0008 (0x0088 - 0x0080)
struct FPaperDialogueLookAt final : public FPaperDialogueLookAtInit
{
public:
	float                                         TimeOffset;                                        // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueLookAt) == 0x000008, "Wrong alignment on FPaperDialogueLookAt");
static_assert(sizeof(FPaperDialogueLookAt) == 0x000088, "Wrong size on FPaperDialogueLookAt");
static_assert(offsetof(FPaperDialogueLookAt, TimeOffset) == 0x000080, "Member 'FPaperDialogueLookAt::TimeOffset' has a wrong offset!");
static_assert(offsetof(FPaperDialogueLookAt, Time) == 0x000084, "Member 'FPaperDialogueLookAt::Time' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueAudio
// 0x0068 (0x00A8 - 0x0040)
struct FPaperDialogueAudio final : public FPaperDialogueTrackItem
{
public:
	class FName                                   VoiceoverID;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs3DAudioType;                                    // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundBase;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTime;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        VoicePath;                                         // 0x0068(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        RobotVoicePath;                                    // 0x0088(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FPaperDialogueAudio) == 0x000008, "Wrong alignment on FPaperDialogueAudio");
static_assert(sizeof(FPaperDialogueAudio) == 0x0000A8, "Wrong size on FPaperDialogueAudio");
static_assert(offsetof(FPaperDialogueAudio, VoiceoverID) == 0x000040, "Member 'FPaperDialogueAudio::VoiceoverID' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, AudioEvent) == 0x000048, "Member 'FPaperDialogueAudio::AudioEvent' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, bIs3DAudioType) == 0x000050, "Member 'FPaperDialogueAudio::bIs3DAudioType' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, SoundBase) == 0x000058, "Member 'FPaperDialogueAudio::SoundBase' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, DurationTime) == 0x000060, "Member 'FPaperDialogueAudio::DurationTime' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, VoicePath) == 0x000068, "Member 'FPaperDialogueAudio::VoicePath' has a wrong offset!");
static_assert(offsetof(FPaperDialogueAudio, RobotVoicePath) == 0x000088, "Member 'FPaperDialogueAudio::RobotVoicePath' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueActorAnimations
// 0x02A0 (0x02A0 - 0x0000)
struct FPaperDialogueActorAnimations final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StringID;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TempNameTitleId;                                   // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPaperDialogueTransform                TransfromAnim;                                     // 0x0020(0x0110)(Edit, NativeAccessSpecifierPublic)
	struct FPaperDialogueLine                     Line;                                              // 0x0130(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FPaperDialogueLookAt                   LookAt;                                            // 0x0170(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FPaperDialogueAudio                    DialogueAudio;                                     // 0x01F8(0x00A8)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueActorAnimations) == 0x000010, "Wrong alignment on FPaperDialogueActorAnimations");
static_assert(sizeof(FPaperDialogueActorAnimations) == 0x0002A0, "Wrong size on FPaperDialogueActorAnimations");
static_assert(offsetof(FPaperDialogueActorAnimations, ActorName) == 0x000000, "Member 'FPaperDialogueActorAnimations::ActorName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, StringID) == 0x000008, "Member 'FPaperDialogueActorAnimations::StringID' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, TempNameTitleId) == 0x000010, "Member 'FPaperDialogueActorAnimations::TempNameTitleId' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, TransfromAnim) == 0x000020, "Member 'FPaperDialogueActorAnimations::TransfromAnim' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, Line) == 0x000130, "Member 'FPaperDialogueActorAnimations::Line' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, LookAt) == 0x000170, "Member 'FPaperDialogueActorAnimations::LookAt' has a wrong offset!");
static_assert(offsetof(FPaperDialogueActorAnimations, DialogueAudio) == 0x0001F8, "Member 'FPaperDialogueActorAnimations::DialogueAudio' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationSetupFadeStruct
// 0x0038 (0x0038 - 0x0000)
struct FPaperDialogueGenerationSetupFadeStruct final
{
public:
	TSoftClassPtr<class UClass>                   OverrideFaceTrackClass;                            // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPaperDialogueFadeType                        FadeType;                                          // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceClearFadeSection;                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddBreak;                                         // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakAllowSkip;                                   // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakAutoPlayNextPart;                            // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeCompletionMode;                             // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneCompletionMode                     CompletionMode;                                    // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueGenerationSetupFadeStruct) == 0x000008, "Wrong alignment on FPaperDialogueGenerationSetupFadeStruct");
static_assert(sizeof(FPaperDialogueGenerationSetupFadeStruct) == 0x000038, "Wrong size on FPaperDialogueGenerationSetupFadeStruct");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, OverrideFaceTrackClass) == 0x000000, "Member 'FPaperDialogueGenerationSetupFadeStruct::OverrideFaceTrackClass' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, FadeType) == 0x000028, "Member 'FPaperDialogueGenerationSetupFadeStruct::FadeType' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, FadeTime) == 0x00002C, "Member 'FPaperDialogueGenerationSetupFadeStruct::FadeTime' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, bForceClearFadeSection) == 0x000030, "Member 'FPaperDialogueGenerationSetupFadeStruct::bForceClearFadeSection' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, bAddBreak) == 0x000031, "Member 'FPaperDialogueGenerationSetupFadeStruct::bAddBreak' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, bBreakAllowSkip) == 0x000032, "Member 'FPaperDialogueGenerationSetupFadeStruct::bBreakAllowSkip' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, bBreakAutoPlayNextPart) == 0x000033, "Member 'FPaperDialogueGenerationSetupFadeStruct::bBreakAutoPlayNextPart' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, bChangeCompletionMode) == 0x000034, "Member 'FPaperDialogueGenerationSetupFadeStruct::bChangeCompletionMode' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupFadeStruct, CompletionMode) == 0x000035, "Member 'FPaperDialogueGenerationSetupFadeStruct::CompletionMode' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationCameraShakeTracks
// 0x0030 (0x0030 - 0x0000)
struct FPaperDialogueGenerationCameraShakeTracks final
{
public:
	bool                                          bRecreateCameraShakeTracks;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CameraShakeBP;                                     // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationCameraShakeTracks) == 0x000008, "Wrong alignment on FPaperDialogueGenerationCameraShakeTracks");
static_assert(sizeof(FPaperDialogueGenerationCameraShakeTracks) == 0x000030, "Wrong size on FPaperDialogueGenerationCameraShakeTracks");
static_assert(offsetof(FPaperDialogueGenerationCameraShakeTracks, bRecreateCameraShakeTracks) == 0x000000, "Member 'FPaperDialogueGenerationCameraShakeTracks::bRecreateCameraShakeTracks' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationCameraShakeTracks, CameraShakeBP) == 0x000008, "Member 'FPaperDialogueGenerationCameraShakeTracks::CameraShakeBP' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationAnimationTrackConfig
// 0x0014 (0x0014 - 0x0000)
struct FPaperDialogueGenerationAnimationTrackConfig final
{
public:
	class FName                                   OverrideCharacterMeshName;                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TrackAndSlotName;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecreateAnimTracks;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueGenerationAnimationTrackConfig) == 0x000004, "Wrong alignment on FPaperDialogueGenerationAnimationTrackConfig");
static_assert(sizeof(FPaperDialogueGenerationAnimationTrackConfig) == 0x000014, "Wrong size on FPaperDialogueGenerationAnimationTrackConfig");
static_assert(offsetof(FPaperDialogueGenerationAnimationTrackConfig, OverrideCharacterMeshName) == 0x000000, "Member 'FPaperDialogueGenerationAnimationTrackConfig::OverrideCharacterMeshName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationAnimationTrackConfig, TrackAndSlotName) == 0x000008, "Member 'FPaperDialogueGenerationAnimationTrackConfig::TrackAndSlotName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationAnimationTrackConfig, bRecreateAnimTracks) == 0x000010, "Member 'FPaperDialogueGenerationAnimationTrackConfig::bRecreateAnimTracks' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationAnimationTracks
// 0x0020 (0x0020 - 0x0000)
struct FPaperDialogueGenerationAnimationTracks final
{
public:
	bool                                          bCreateCharacterMesh;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharacterMeshName;                                 // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPaperDialogueGenerationAnimationTrackConfig> TrackAndSlotConfigs;                 // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationAnimationTracks) == 0x000008, "Wrong alignment on FPaperDialogueGenerationAnimationTracks");
static_assert(sizeof(FPaperDialogueGenerationAnimationTracks) == 0x000020, "Wrong size on FPaperDialogueGenerationAnimationTracks");
static_assert(offsetof(FPaperDialogueGenerationAnimationTracks, bCreateCharacterMesh) == 0x000000, "Member 'FPaperDialogueGenerationAnimationTracks::bCreateCharacterMesh' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationAnimationTracks, CharacterMeshName) == 0x000004, "Member 'FPaperDialogueGenerationAnimationTracks::CharacterMeshName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationAnimationTracks, TrackAndSlotConfigs) == 0x000010, "Member 'FPaperDialogueGenerationAnimationTracks::TrackAndSlotConfigs' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationRootMotionTracks
// 0x0008 (0x0008 - 0x0000)
struct FPaperDialogueGenerationRootMotionTracks final
{
public:
	EMovieSceneBlendType                          RootMotionSectionBlendType;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPaperDialogueGenerationRootMotionDirectin    RootMotionDirectin;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseManualDegree;                                  // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ManualDegree;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationRootMotionTracks) == 0x000004, "Wrong alignment on FPaperDialogueGenerationRootMotionTracks");
static_assert(sizeof(FPaperDialogueGenerationRootMotionTracks) == 0x000008, "Wrong size on FPaperDialogueGenerationRootMotionTracks");
static_assert(offsetof(FPaperDialogueGenerationRootMotionTracks, RootMotionSectionBlendType) == 0x000000, "Member 'FPaperDialogueGenerationRootMotionTracks::RootMotionSectionBlendType' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationRootMotionTracks, RootMotionDirectin) == 0x000001, "Member 'FPaperDialogueGenerationRootMotionTracks::RootMotionDirectin' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationRootMotionTracks, bReverse) == 0x000002, "Member 'FPaperDialogueGenerationRootMotionTracks::bReverse' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationRootMotionTracks, bUseManualDegree) == 0x000003, "Member 'FPaperDialogueGenerationRootMotionTracks::bUseManualDegree' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationRootMotionTracks, ManualDegree) == 0x000004, "Member 'FPaperDialogueGenerationRootMotionTracks::ManualDegree' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationFullBodyStruct
// 0x0024 (0x0024 - 0x0000)
struct FPaperDialogueGenerationFullBodyStruct final
{
public:
	bool                                          bCreateCharacterMesh;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharacterMeshName;                                 // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultSlotName;                                   // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultSlotEmotionName;                            // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultSlotFacialName;                             // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationFullBodyStruct) == 0x000004, "Wrong alignment on FPaperDialogueGenerationFullBodyStruct");
static_assert(sizeof(FPaperDialogueGenerationFullBodyStruct) == 0x000024, "Wrong size on FPaperDialogueGenerationFullBodyStruct");
static_assert(offsetof(FPaperDialogueGenerationFullBodyStruct, bCreateCharacterMesh) == 0x000000, "Member 'FPaperDialogueGenerationFullBodyStruct::bCreateCharacterMesh' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationFullBodyStruct, CharacterMeshName) == 0x000004, "Member 'FPaperDialogueGenerationFullBodyStruct::CharacterMeshName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationFullBodyStruct, DefaultSlotName) == 0x00000C, "Member 'FPaperDialogueGenerationFullBodyStruct::DefaultSlotName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationFullBodyStruct, DefaultSlotEmotionName) == 0x000014, "Member 'FPaperDialogueGenerationFullBodyStruct::DefaultSlotEmotionName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationFullBodyStruct, DefaultSlotFacialName) == 0x00001C, "Member 'FPaperDialogueGenerationFullBodyStruct::DefaultSlotFacialName' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationCameraFramingLevelStruct
// 0x0018 (0x0018 - 0x0000)
struct FPaperDialogueGenerationCameraFramingLevelStruct final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaximumUse;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueGenerationCameraFramingLevelStruct) == 0x000008, "Wrong alignment on FPaperDialogueGenerationCameraFramingLevelStruct");
static_assert(sizeof(FPaperDialogueGenerationCameraFramingLevelStruct) == 0x000018, "Wrong size on FPaperDialogueGenerationCameraFramingLevelStruct");
static_assert(offsetof(FPaperDialogueGenerationCameraFramingLevelStruct, Name) == 0x000000, "Member 'FPaperDialogueGenerationCameraFramingLevelStruct::Name' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationCameraFramingLevelStruct, MaximumUse) == 0x000010, "Member 'FPaperDialogueGenerationCameraFramingLevelStruct::MaximumUse' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationSetupCameraStruct
// 0x0020 (0x0020 - 0x0000)
struct FPaperDialogueGenerationSetupCameraStruct final
{
public:
	bool                                          bForceClearCameraTrack;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCameraRule;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bX6SimplifiedCameraRule;                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombineNeighborCameras;                           // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPaperDialogueGenerationCameraFramingLevelStruct> CameraFramingLevelMax;           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueGenerationSetupCameraStruct) == 0x000008, "Wrong alignment on FPaperDialogueGenerationSetupCameraStruct");
static_assert(sizeof(FPaperDialogueGenerationSetupCameraStruct) == 0x000020, "Wrong size on FPaperDialogueGenerationSetupCameraStruct");
static_assert(offsetof(FPaperDialogueGenerationSetupCameraStruct, bForceClearCameraTrack) == 0x000000, "Member 'FPaperDialogueGenerationSetupCameraStruct::bForceClearCameraTrack' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupCameraStruct, bUseCameraRule) == 0x000001, "Member 'FPaperDialogueGenerationSetupCameraStruct::bUseCameraRule' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupCameraStruct, bX6SimplifiedCameraRule) == 0x000002, "Member 'FPaperDialogueGenerationSetupCameraStruct::bX6SimplifiedCameraRule' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupCameraStruct, bCombineNeighborCameras) == 0x000003, "Member 'FPaperDialogueGenerationSetupCameraStruct::bCombineNeighborCameras' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationSetupCameraStruct, CameraFramingLevelMax) == 0x000008, "Member 'FPaperDialogueGenerationSetupCameraStruct::CameraFramingLevelMax' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationIdleAnimationStruct
// 0x0020 (0x0020 - 0x0000)
struct FPaperDialogueGenerationIdleAnimationStruct final
{
public:
	bool                                          bCreateCharacterMesh;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharacterMeshName;                                 // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultIdleAnimationTag;                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationIdleAnimationStruct) == 0x000008, "Wrong alignment on FPaperDialogueGenerationIdleAnimationStruct");
static_assert(sizeof(FPaperDialogueGenerationIdleAnimationStruct) == 0x000020, "Wrong size on FPaperDialogueGenerationIdleAnimationStruct");
static_assert(offsetof(FPaperDialogueGenerationIdleAnimationStruct, bCreateCharacterMesh) == 0x000000, "Member 'FPaperDialogueGenerationIdleAnimationStruct::bCreateCharacterMesh' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationIdleAnimationStruct, CharacterMeshName) == 0x000004, "Member 'FPaperDialogueGenerationIdleAnimationStruct::CharacterMeshName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationIdleAnimationStruct, DefaultIdleAnimationTag) == 0x000010, "Member 'FPaperDialogueGenerationIdleAnimationStruct::DefaultIdleAnimationTag' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationLightTracks
// 0x0014 (0x0014 - 0x0000)
struct FPaperDialogueGenerationLightTracks final
{
public:
	bool                                          bRecreateVisibilityTrack;                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeConsequentVisibilityFrame;                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachToTargetActor;                              // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneCompletionMode                     CompletionMode;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCDLightGenerateRule                         GenerateRule;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlaceInFolder;                                    // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FolderName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 FolderColor;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationLightTracks) == 0x000004, "Wrong alignment on FPaperDialogueGenerationLightTracks");
static_assert(sizeof(FPaperDialogueGenerationLightTracks) == 0x000014, "Wrong size on FPaperDialogueGenerationLightTracks");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, bRecreateVisibilityTrack) == 0x000000, "Member 'FPaperDialogueGenerationLightTracks::bRecreateVisibilityTrack' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, bMergeConsequentVisibilityFrame) == 0x000001, "Member 'FPaperDialogueGenerationLightTracks::bMergeConsequentVisibilityFrame' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, bAttachToTargetActor) == 0x000002, "Member 'FPaperDialogueGenerationLightTracks::bAttachToTargetActor' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, CompletionMode) == 0x000003, "Member 'FPaperDialogueGenerationLightTracks::CompletionMode' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, GenerateRule) == 0x000004, "Member 'FPaperDialogueGenerationLightTracks::GenerateRule' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, bPlaceInFolder) == 0x000005, "Member 'FPaperDialogueGenerationLightTracks::bPlaceInFolder' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, FolderName) == 0x000008, "Member 'FPaperDialogueGenerationLightTracks::FolderName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLightTracks, FolderColor) == 0x000010, "Member 'FPaperDialogueGenerationLightTracks::FolderColor' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationCustomTrackConfig
// 0x0090 (0x0090 - 0x0000)
struct FPaperDialogueGenerationCustomTrackConfig final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TrackAndSlotName;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecreateTracks;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateSectionAtBegining;                          // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CustomTrackClass;                                  // 0x0040(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x28];                                      // 0x0068(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPaperDialogueGenerationCustomTrackConfig) == 0x000008, "Wrong alignment on FPaperDialogueGenerationCustomTrackConfig");
static_assert(sizeof(FPaperDialogueGenerationCustomTrackConfig) == 0x000090, "Wrong size on FPaperDialogueGenerationCustomTrackConfig");
static_assert(offsetof(FPaperDialogueGenerationCustomTrackConfig, TrackAndSlotName) == 0x000030, "Member 'FPaperDialogueGenerationCustomTrackConfig::TrackAndSlotName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationCustomTrackConfig, bRecreateTracks) == 0x000038, "Member 'FPaperDialogueGenerationCustomTrackConfig::bRecreateTracks' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationCustomTrackConfig, bCreateSectionAtBegining) == 0x000039, "Member 'FPaperDialogueGenerationCustomTrackConfig::bCreateSectionAtBegining' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationCustomTrackConfig, CustomTrackClass) == 0x000040, "Member 'FPaperDialogueGenerationCustomTrackConfig::CustomTrackClass' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationCustomTracks
// 0x0010 (0x0010 - 0x0000)
struct FPaperDialogueGenerationCustomTracks final
{
public:
	TArray<struct FPaperDialogueGenerationCustomTrackConfig> TrackAndSlotConfigs;                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationCustomTracks) == 0x000008, "Wrong alignment on FPaperDialogueGenerationCustomTracks");
static_assert(sizeof(FPaperDialogueGenerationCustomTracks) == 0x000010, "Wrong size on FPaperDialogueGenerationCustomTracks");
static_assert(offsetof(FPaperDialogueGenerationCustomTracks, TrackAndSlotConfigs) == 0x000000, "Member 'FPaperDialogueGenerationCustomTracks::TrackAndSlotConfigs' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationLookAtAutoKeyValue
// 0x0048 (0x0048 - 0x0000)
struct FPaperDialogueGenerationLookAtAutoKeyValue final
{
public:
	bool                                          bAutoKeyFrames;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EnableLookAtPropertyName;                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LookAtTargetPropertyName;                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LookAtTargetSocketPropertyName;                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LookAtTargetSocketName;                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationLookAtAutoKeyValue) == 0x000008, "Wrong alignment on FPaperDialogueGenerationLookAtAutoKeyValue");
static_assert(sizeof(FPaperDialogueGenerationLookAtAutoKeyValue) == 0x000048, "Wrong size on FPaperDialogueGenerationLookAtAutoKeyValue");
static_assert(offsetof(FPaperDialogueGenerationLookAtAutoKeyValue, bAutoKeyFrames) == 0x000000, "Member 'FPaperDialogueGenerationLookAtAutoKeyValue::bAutoKeyFrames' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtAutoKeyValue, EnableLookAtPropertyName) == 0x000008, "Member 'FPaperDialogueGenerationLookAtAutoKeyValue::EnableLookAtPropertyName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtAutoKeyValue, LookAtTargetPropertyName) == 0x000018, "Member 'FPaperDialogueGenerationLookAtAutoKeyValue::LookAtTargetPropertyName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtAutoKeyValue, LookAtTargetSocketPropertyName) == 0x000028, "Member 'FPaperDialogueGenerationLookAtAutoKeyValue::LookAtTargetSocketPropertyName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtAutoKeyValue, LookAtTargetSocketName) == 0x000038, "Member 'FPaperDialogueGenerationLookAtAutoKeyValue::LookAtTargetSocketName' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationLookAtExtraSettings
// 0x0040 (0x0040 - 0x0000)
struct FPaperDialogueGenerationLookAtExtraSettings final
{
public:
	bool                                          bAttachToActor;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExposeAppointProperty;                            // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyToExpose;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPaperDialogueGenerationLookAtExtraSettings) == 0x000008, "Wrong alignment on FPaperDialogueGenerationLookAtExtraSettings");
static_assert(sizeof(FPaperDialogueGenerationLookAtExtraSettings) == 0x000040, "Wrong size on FPaperDialogueGenerationLookAtExtraSettings");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, bAttachToActor) == 0x000000, "Member 'FPaperDialogueGenerationLookAtExtraSettings::bAttachToActor' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, BoneName) == 0x000004, "Member 'FPaperDialogueGenerationLookAtExtraSettings::BoneName' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, Direction) == 0x000010, "Member 'FPaperDialogueGenerationLookAtExtraSettings::Direction' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, Distance) == 0x000028, "Member 'FPaperDialogueGenerationLookAtExtraSettings::Distance' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, bExposeAppointProperty) == 0x00002C, "Member 'FPaperDialogueGenerationLookAtExtraSettings::bExposeAppointProperty' has a wrong offset!");
static_assert(offsetof(FPaperDialogueGenerationLookAtExtraSettings, PropertyToExpose) == 0x000030, "Member 'FPaperDialogueGenerationLookAtExtraSettings::PropertyToExpose' has a wrong offset!");

// ScriptStruct PaperDialogue.PaperDialogueGenerationLookAtTracks
// 0x00B8 (0x00B8 - 0x0000)
struct FPaperDialogueGenerationLookAtTracks final
{
public:
	struct FSoftClassPath                         LookAtActorClass;                                  // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x1];                                       // 0x0020(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlaceInFolder;                                    // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FolderName;                                        // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
