#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperLuaToolKit

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class PaperLuaToolKit.ToolKitControlWidget
// 0x0030 (0x0320 - 0x02F0)
class UToolKitControlWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x30];                                     // 0x02F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolKitControlWidget">();
	}
	static class UToolKitControlWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolKitControlWidget>();
	}
};
static_assert(alignof(UToolKitControlWidget) == 0x000008, "Wrong alignment on UToolKitControlWidget");
static_assert(sizeof(UToolKitControlWidget) == 0x000320, "Wrong size on UToolKitControlWidget");

// Class PaperLuaToolKit.ToolKitRuntimeSettings
// 0x0048 (0x0070 - 0x0028)
class UToolKitRuntimeSettings final : public UObject
{
public:
	class FString                                 GameId;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameKey;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProxyServerUrl;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnablePaperLuaToolKit;                             // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x17];                                      // 0x0059(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolKitRuntimeSettings">();
	}
	static class UToolKitRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolKitRuntimeSettings>();
	}
};
static_assert(alignof(UToolKitRuntimeSettings) == 0x000008, "Wrong alignment on UToolKitRuntimeSettings");
static_assert(sizeof(UToolKitRuntimeSettings) == 0x000070, "Wrong size on UToolKitRuntimeSettings");
static_assert(offsetof(UToolKitRuntimeSettings, GameId) == 0x000028, "Member 'UToolKitRuntimeSettings::GameId' has a wrong offset!");
static_assert(offsetof(UToolKitRuntimeSettings, GameKey) == 0x000038, "Member 'UToolKitRuntimeSettings::GameKey' has a wrong offset!");
static_assert(offsetof(UToolKitRuntimeSettings, ProxyServerUrl) == 0x000048, "Member 'UToolKitRuntimeSettings::ProxyServerUrl' has a wrong offset!");
static_assert(offsetof(UToolKitRuntimeSettings, EnablePaperLuaToolKit) == 0x000058, "Member 'UToolKitRuntimeSettings::EnablePaperLuaToolKit' has a wrong offset!");

// Class PaperLuaToolKit.ToolKitWidget
// 0x0048 (0x0338 - 0x02F0)
class UToolKitWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x48];                                     // 0x02F0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSubmitButtonClick();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ToolKitWidget">();
	}
	static class UToolKitWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolKitWidget>();
	}
};
static_assert(alignof(UToolKitWidget) == 0x000008, "Wrong alignment on UToolKitWidget");
static_assert(sizeof(UToolKitWidget) == 0x000338, "Wrong size on UToolKitWidget");

}

