#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperDialogueProvider

#include "Basic.hpp"

#include "PaperDialogueProvider_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.BindOnGroupSectionSetup
// 0x0010 (0x0010 - 0x0000)
struct PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup final
{
public:
	TDelegate<void(const class FName& SpeakerTag, const class FName& LineId, bool bLineBreak, bool bAllowSkip, bool bShowText, const struct FPCDGroupSetupStatus& Status)> OnGroupSectionSetup; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup");
static_assert(sizeof(PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup) == 0x000010, "Wrong size on PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup");
static_assert(offsetof(PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup, OnGroupSectionSetup) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_BindOnGroupSectionSetup::OnGroupSectionSetup' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.BindOnGroupSectionStopped
// 0x0010 (0x0010 - 0x0000)
struct PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped final
{
public:
	TDelegate<void(bool bAutoPlayNextPart)>       OnGroupSectionStopped;                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped");
static_assert(sizeof(PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped) == 0x000010, "Wrong size on PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped");
static_assert(offsetof(PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped, OnGroupSectionStopped) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_BindOnGroupSectionStopped::OnGroupSectionStopped' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.BindOnIdleTrackSectionExecuted
// 0x0010 (0x0010 - 0x0000)
struct PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted final
{
public:
	TDelegate<void(const class FName& SpeakerTag, const class FName& IdleAnimationTag)> OnIdleTrackSectionExecuted; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted");
static_assert(sizeof(PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted) == 0x000010, "Wrong size on PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted");
static_assert(offsetof(PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted, OnIdleTrackSectionExecuted) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_BindOnIdleTrackSectionExecuted::OnIdleTrackSectionExecuted' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.BindOnLineSectionStopped
// 0x0010 (0x0010 - 0x0000)
struct PaperDialogueProviderBPLibrary_BindOnLineSectionStopped final
{
public:
	TDelegate<void()>                             OnLineSectionStopped;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_BindOnLineSectionStopped) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_BindOnLineSectionStopped");
static_assert(sizeof(PaperDialogueProviderBPLibrary_BindOnLineSectionStopped) == 0x000010, "Wrong size on PaperDialogueProviderBPLibrary_BindOnLineSectionStopped");
static_assert(offsetof(PaperDialogueProviderBPLibrary_BindOnLineSectionStopped, OnLineSectionStopped) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_BindOnLineSectionStopped::OnLineSectionStopped' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.CallOnGroupSectionSetup
// 0x0018 (0x0018 - 0x0000)
struct PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup final
{
public:
	class FName                                   SpeakerTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LineId;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLineBreak;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSkip;                                        // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowText;                                         // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCDGroupSetupStatus                   InStatus;                                          // 0x0013(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup");
static_assert(sizeof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup) == 0x000018, "Wrong size on PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, SpeakerTag) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::SpeakerTag' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, LineId) == 0x000008, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::LineId' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, bLineBreak) == 0x000010, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::bLineBreak' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, bAllowSkip) == 0x000011, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::bAllowSkip' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, bShowText) == 0x000012, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::bShowText' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup, InStatus) == 0x000013, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionSetup::InStatus' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.CallOnGroupSectionStopped
// 0x0001 (0x0001 - 0x0000)
struct PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped final
{
public:
	bool                                          bAutoPlayNextPart;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped) == 0x000001, "Wrong alignment on PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped");
static_assert(sizeof(PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped) == 0x000001, "Wrong size on PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped, bAutoPlayNextPart) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_CallOnGroupSectionStopped::bAutoPlayNextPart' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.CallOnIdleTrackSectionExecuted
// 0x0010 (0x0010 - 0x0000)
struct PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted final
{
public:
	class FName                                   InSpeakerTag;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IdleAnimationTag;                                  // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted) == 0x000004, "Wrong alignment on PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted");
static_assert(sizeof(PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted) == 0x000010, "Wrong size on PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted, InSpeakerTag) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted::InSpeakerTag' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted, IdleAnimationTag) == 0x000008, "Member 'PaperDialogueProviderBPLibrary_CallOnIdleTrackSectionExecuted::IdleAnimationTag' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.GetDialogueActorName
// 0x0018 (0x0018 - 0x0000)
struct PaperDialogueProviderBPLibrary_GetDialogueActorName final
{
public:
	class FName                                   ActorTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_GetDialogueActorName) == 0x000008, "Wrong alignment on PaperDialogueProviderBPLibrary_GetDialogueActorName");
static_assert(sizeof(PaperDialogueProviderBPLibrary_GetDialogueActorName) == 0x000018, "Wrong size on PaperDialogueProviderBPLibrary_GetDialogueActorName");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueActorName, ActorTag) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_GetDialogueActorName::ActorTag' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueActorName, ReturnValue) == 0x000008, "Member 'PaperDialogueProviderBPLibrary_GetDialogueActorName::ReturnValue' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.GetDialogueActorTransformOffset
// 0x0070 (0x0070 - 0x0000)
struct PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset final
{
public:
	class FName                                   ActorTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset) == 0x000010, "Wrong alignment on PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset");
static_assert(sizeof(PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset) == 0x000070, "Wrong size on PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset, ActorTag) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset::ActorTag' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset, ReturnValue) == 0x000010, "Member 'PaperDialogueProviderBPLibrary_GetDialogueActorTransformOffset::ReturnValue' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.GetDialogueLineTextById
// 0x0018 (0x0018 - 0x0000)
struct PaperDialogueProviderBPLibrary_GetDialogueLineTextById final
{
public:
	class FName                                   InTextId;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperDialogueProviderBPLibrary_GetDialogueLineTextById) == 0x000008, "Wrong alignment on PaperDialogueProviderBPLibrary_GetDialogueLineTextById");
static_assert(sizeof(PaperDialogueProviderBPLibrary_GetDialogueLineTextById) == 0x000018, "Wrong size on PaperDialogueProviderBPLibrary_GetDialogueLineTextById");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueLineTextById, InTextId) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_GetDialogueLineTextById::InTextId' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetDialogueLineTextById, ReturnValue) == 0x000008, "Member 'PaperDialogueProviderBPLibrary_GetDialogueLineTextById::ReturnValue' has a wrong offset!");

// Function PaperDialogueProvider.PaperDialogueProviderBPLibrary.GetX6DialogueData
// 0x00A8 (0x00A8 - 0x0000)
struct PaperDialogueProviderBPLibrary_GetX6DialogueData final
{
public:
	class FName                                   LineId;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCDX6DialogueData                     PCDX6DialogueData;                                 // 0x0008(0x0098)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperDialogueProviderBPLibrary_GetX6DialogueData) == 0x000008, "Wrong alignment on PaperDialogueProviderBPLibrary_GetX6DialogueData");
static_assert(sizeof(PaperDialogueProviderBPLibrary_GetX6DialogueData) == 0x0000A8, "Wrong size on PaperDialogueProviderBPLibrary_GetX6DialogueData");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetX6DialogueData, LineId) == 0x000000, "Member 'PaperDialogueProviderBPLibrary_GetX6DialogueData::LineId' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetX6DialogueData, PCDX6DialogueData) == 0x000008, "Member 'PaperDialogueProviderBPLibrary_GetX6DialogueData::PCDX6DialogueData' has a wrong offset!");
static_assert(offsetof(PaperDialogueProviderBPLibrary_GetX6DialogueData, ReturnValue) == 0x0000A0, "Member 'PaperDialogueProviderBPLibrary_GetX6DialogueData::ReturnValue' has a wrong offset!");

}

