#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperSkelMeshBaker

#include "Basic.hpp"

#include "PaperSkelMeshBaker_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PaperSkelMeshBaker.PaperMeshBakeMaterialParameterCollection
// 0x0010 (0x0040 - 0x0030)
class UPaperMeshBakeMaterialParameterCollection final : public UDataAsset
{
public:
	TArray<struct FPaperMeshBakeMaterialParameter> Parameters;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperMeshBakeMaterialParameterCollection">();
	}
	static class UPaperMeshBakeMaterialParameterCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperMeshBakeMaterialParameterCollection>();
	}
};
static_assert(alignof(UPaperMeshBakeMaterialParameterCollection) == 0x000008, "Wrong alignment on UPaperMeshBakeMaterialParameterCollection");
static_assert(sizeof(UPaperMeshBakeMaterialParameterCollection) == 0x000040, "Wrong size on UPaperMeshBakeMaterialParameterCollection");
static_assert(offsetof(UPaperMeshBakeMaterialParameterCollection, Parameters) == 0x000030, "Member 'UPaperMeshBakeMaterialParameterCollection::Parameters' has a wrong offset!");

// Class PaperSkelMeshBaker.PaperSkelMeshBakeLibrary
// 0x0000 (0x0028 - 0x0028)
class UPaperSkelMeshBakeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ForceRefreshAnimation(class USkeletalMeshComponent* InSkeletalMeshComponent);
	static class USkeletalMesh* MergeSkeletalMeshComponentsAndSave(const class FString& PackageName, const struct FPaperSkelMeshMergeParams& Params_0, bool bIsNeedSave);
	static void SwitchMergedMaterialBetweenMaskAndOpaque(class USkeletalMeshComponent* Component, bool bSwitchToMask);
	static void UpdateSkeletalMesh(class USkeletalMeshComponent* TargetComponent, class USkeletalMesh* InSkeletalMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperSkelMeshBakeLibrary">();
	}
	static class UPaperSkelMeshBakeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSkelMeshBakeLibrary>();
	}
};
static_assert(alignof(UPaperSkelMeshBakeLibrary) == 0x000008, "Wrong alignment on UPaperSkelMeshBakeLibrary");
static_assert(sizeof(UPaperSkelMeshBakeLibrary) == 0x000028, "Wrong size on UPaperSkelMeshBakeLibrary");

}

