#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperMultiCurve

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct PaperMultiCurve.MultiCurveData
// 0x0098 (0x0098 - 0x0000)
struct FMultiCurveData final
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRichCurve                             Curve;                                             // 0x0018(0x0080)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FMultiCurveData) == 0x000008, "Wrong alignment on FMultiCurveData");
static_assert(sizeof(FMultiCurveData) == 0x000098, "Wrong size on FMultiCurveData");
static_assert(offsetof(FMultiCurveData, Color) == 0x000000, "Member 'FMultiCurveData::Color' has a wrong offset!");
static_assert(offsetof(FMultiCurveData, Name) == 0x000008, "Member 'FMultiCurveData::Name' has a wrong offset!");
static_assert(offsetof(FMultiCurveData, Curve) == 0x000018, "Member 'FMultiCurveData::Curve' has a wrong offset!");

}

