#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperNavMesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function PaperNavMesh.NavWaterDepthComponent.SetAreaClass
// 0x0008 (0x0008 - 0x0000)
struct NavWaterDepthComponent_SetAreaClass final
{
public:
	TSubclassOf<class UNavArea>                   NewAreaClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavWaterDepthComponent_SetAreaClass) == 0x000008, "Wrong alignment on NavWaterDepthComponent_SetAreaClass");
static_assert(sizeof(NavWaterDepthComponent_SetAreaClass) == 0x000008, "Wrong size on NavWaterDepthComponent_SetAreaClass");
static_assert(offsetof(NavWaterDepthComponent_SetAreaClass, NewAreaClass) == 0x000000, "Member 'NavWaterDepthComponent_SetAreaClass::NewAreaClass' has a wrong offset!");

// Function PaperNavMesh.NavWaterDepthManager.OnNavDataGenerationFinished
// 0x0008 (0x0008 - 0x0000)
struct NavWaterDepthManager_OnNavDataGenerationFinished final
{
public:
	class ANavigationData*                        NavData;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavWaterDepthManager_OnNavDataGenerationFinished) == 0x000008, "Wrong alignment on NavWaterDepthManager_OnNavDataGenerationFinished");
static_assert(sizeof(NavWaterDepthManager_OnNavDataGenerationFinished) == 0x000008, "Wrong size on NavWaterDepthManager_OnNavDataGenerationFinished");
static_assert(offsetof(NavWaterDepthManager_OnNavDataGenerationFinished, NavData) == 0x000000, "Member 'NavWaterDepthManager_OnNavDataGenerationFinished::NavData' has a wrong offset!");

// Function PaperNavMesh.NavWaterDepthManager.OnNavDataGenerationStart
// 0x0008 (0x0008 - 0x0000)
struct NavWaterDepthManager_OnNavDataGenerationStart final
{
public:
	class ANavigationData*                        NavData;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavWaterDepthManager_OnNavDataGenerationStart) == 0x000008, "Wrong alignment on NavWaterDepthManager_OnNavDataGenerationStart");
static_assert(sizeof(NavWaterDepthManager_OnNavDataGenerationStart) == 0x000008, "Wrong size on NavWaterDepthManager_OnNavDataGenerationStart");
static_assert(offsetof(NavWaterDepthManager_OnNavDataGenerationStart, NavData) == 0x000000, "Member 'NavWaterDepthManager_OnNavDataGenerationStart::NavData' has a wrong offset!");

}

