#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperRipples

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct PaperRipples.RipplesConfigParameters
// 0x0018 (0x0018 - 0x0000)
struct FRipplesConfigParameters final
{
public:
	int32                                         TexSize;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaveSpeed;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaveDamp;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalIntensity;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalTiling;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRipplesConfigParameters) == 0x000004, "Wrong alignment on FRipplesConfigParameters");
static_assert(sizeof(FRipplesConfigParameters) == 0x000018, "Wrong size on FRipplesConfigParameters");
static_assert(offsetof(FRipplesConfigParameters, TexSize) == 0x000000, "Member 'FRipplesConfigParameters::TexSize' has a wrong offset!");
static_assert(offsetof(FRipplesConfigParameters, Count) == 0x000004, "Member 'FRipplesConfigParameters::Count' has a wrong offset!");
static_assert(offsetof(FRipplesConfigParameters, WaveSpeed) == 0x000008, "Member 'FRipplesConfigParameters::WaveSpeed' has a wrong offset!");
static_assert(offsetof(FRipplesConfigParameters, WaveDamp) == 0x00000C, "Member 'FRipplesConfigParameters::WaveDamp' has a wrong offset!");
static_assert(offsetof(FRipplesConfigParameters, NormalIntensity) == 0x000010, "Member 'FRipplesConfigParameters::NormalIntensity' has a wrong offset!");
static_assert(offsetof(FRipplesConfigParameters, NormalTiling) == 0x000014, "Member 'FRipplesConfigParameters::NormalTiling' has a wrong offset!");

}

