#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperAvatar

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class PaperAvatar.LookAtTarget
// 0x0018 (0x03C0 - 0x03A8)
class ALookAtTarget final : public AActor
{
public:
	class AActor*                                 LookFromActor;                                     // 0x03A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnableLookAt;                                    // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0xF];                                      // 0x03B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LookAtTarget">();
	}
	static class ALookAtTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALookAtTarget>();
	}
};
static_assert(alignof(ALookAtTarget) == 0x000008, "Wrong alignment on ALookAtTarget");
static_assert(sizeof(ALookAtTarget) == 0x0003C0, "Wrong size on ALookAtTarget");
static_assert(offsetof(ALookAtTarget, LookFromActor) == 0x0003A8, "Member 'ALookAtTarget::LookFromActor' has a wrong offset!");
static_assert(offsetof(ALookAtTarget, IsEnableLookAt) == 0x0003B0, "Member 'ALookAtTarget::IsEnableLookAt' has a wrong offset!");

// Class PaperAvatar.PaperAvatarBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UPaperAvatarBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ForceToStopSlotAnimation(class UAnimInstance* AnimInstance, float InBlendOutTime, class FName SlotNodeName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PaperAvatarBPLibrary">();
	}
	static class UPaperAvatarBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperAvatarBPLibrary>();
	}
};
static_assert(alignof(UPaperAvatarBPLibrary) == 0x000008, "Wrong alignment on UPaperAvatarBPLibrary");
static_assert(sizeof(UPaperAvatarBPLibrary) == 0x000028, "Wrong size on UPaperAvatarBPLibrary");

}

