#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperLuaFrameworkBase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "PaperLuaFrameworkBase_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PaperLuaFrameworkBase.BinMMapMgr.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct BinMMapMgr_GetInstance final
{
public:
	class UBinMMapMgr*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BinMMapMgr_GetInstance) == 0x000008, "Wrong alignment on BinMMapMgr_GetInstance");
static_assert(sizeof(BinMMapMgr_GetInstance) == 0x000008, "Wrong size on BinMMapMgr_GetInstance");
static_assert(offsetof(BinMMapMgr_GetInstance, ReturnValue) == 0x000000, "Member 'BinMMapMgr_GetInstance::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.BinMMapMgr.AddBuffer
// 0x0010 (0x0010 - 0x0000)
struct BinMMapMgr_AddBuffer final
{
public:
	class FString                                 InBinName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BinMMapMgr_AddBuffer) == 0x000008, "Wrong alignment on BinMMapMgr_AddBuffer");
static_assert(sizeof(BinMMapMgr_AddBuffer) == 0x000010, "Wrong size on BinMMapMgr_AddBuffer");
static_assert(offsetof(BinMMapMgr_AddBuffer, InBinName) == 0x000000, "Member 'BinMMapMgr_AddBuffer::InBinName' has a wrong offset!");

// Function PaperLuaFrameworkBase.BinMMapMgr.SetMMapTag
// 0x0001 (0x0001 - 0x0000)
struct BinMMapMgr_SetMMapTag final
{
public:
	bool                                          InMMapTag;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BinMMapMgr_SetMMapTag) == 0x000001, "Wrong alignment on BinMMapMgr_SetMMapTag");
static_assert(sizeof(BinMMapMgr_SetMMapTag) == 0x000001, "Wrong size on BinMMapMgr_SetMMapTag");
static_assert(offsetof(BinMMapMgr_SetMMapTag, InMMapTag) == 0x000000, "Member 'BinMMapMgr_SetMMapTag::InMMapTag' has a wrong offset!");

// Function PaperLuaFrameworkBase.BinMMapMgr.SetRootDir
// 0x0010 (0x0010 - 0x0000)
struct BinMMapMgr_SetRootDir final
{
public:
	class FString                                 InRootDir;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BinMMapMgr_SetRootDir) == 0x000008, "Wrong alignment on BinMMapMgr_SetRootDir");
static_assert(sizeof(BinMMapMgr_SetRootDir) == 0x000010, "Wrong size on BinMMapMgr_SetRootDir");
static_assert(offsetof(BinMMapMgr_SetRootDir, InRootDir) == 0x000000, "Member 'BinMMapMgr_SetRootDir::InRootDir' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct PaperAssetManager_GetInstance final
{
public:
	class UPaperAssetManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperAssetManager_GetInstance) == 0x000008, "Wrong alignment on PaperAssetManager_GetInstance");
static_assert(sizeof(PaperAssetManager_GetInstance) == 0x000008, "Wrong size on PaperAssetManager_GetInstance");
static_assert(offsetof(PaperAssetManager_GetInstance, ReturnValue) == 0x000000, "Member 'PaperAssetManager_GetInstance::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.AsyncLoadPrimaryAssetEx
// 0x0018 (0x0018 - 0x0000)
struct PaperAssetManager_AsyncLoadPrimaryAssetEx final
{
public:
	TArray<class FString>                         InAssetsToLoad;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InTimeLimit;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperAssetManager_AsyncLoadPrimaryAssetEx) == 0x000008, "Wrong alignment on PaperAssetManager_AsyncLoadPrimaryAssetEx");
static_assert(sizeof(PaperAssetManager_AsyncLoadPrimaryAssetEx) == 0x000018, "Wrong size on PaperAssetManager_AsyncLoadPrimaryAssetEx");
static_assert(offsetof(PaperAssetManager_AsyncLoadPrimaryAssetEx, InAssetsToLoad) == 0x000000, "Member 'PaperAssetManager_AsyncLoadPrimaryAssetEx::InAssetsToLoad' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_AsyncLoadPrimaryAssetEx, InTimeLimit) == 0x000010, "Member 'PaperAssetManager_AsyncLoadPrimaryAssetEx::InTimeLimit' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_AsyncLoadPrimaryAssetEx, ReturnValue) == 0x000014, "Member 'PaperAssetManager_AsyncLoadPrimaryAssetEx::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.CancelAsyncLoadingWithAsyncID
// 0x0004 (0x0004 - 0x0000)
struct PaperAssetManager_CancelAsyncLoadingWithAsyncID final
{
public:
	int32                                         AsyncId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperAssetManager_CancelAsyncLoadingWithAsyncID) == 0x000004, "Wrong alignment on PaperAssetManager_CancelAsyncLoadingWithAsyncID");
static_assert(sizeof(PaperAssetManager_CancelAsyncLoadingWithAsyncID) == 0x000004, "Wrong size on PaperAssetManager_CancelAsyncLoadingWithAsyncID");
static_assert(offsetof(PaperAssetManager_CancelAsyncLoadingWithAsyncID, AsyncId) == 0x000000, "Member 'PaperAssetManager_CancelAsyncLoadingWithAsyncID::AsyncId' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.GetAsyncLoadingProgessWithAsyncID
// 0x0008 (0x0008 - 0x0000)
struct PaperAssetManager_GetAsyncLoadingProgessWithAsyncID final
{
public:
	int32                                         AsyncId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperAssetManager_GetAsyncLoadingProgessWithAsyncID) == 0x000004, "Wrong alignment on PaperAssetManager_GetAsyncLoadingProgessWithAsyncID");
static_assert(sizeof(PaperAssetManager_GetAsyncLoadingProgessWithAsyncID) == 0x000008, "Wrong size on PaperAssetManager_GetAsyncLoadingProgessWithAsyncID");
static_assert(offsetof(PaperAssetManager_GetAsyncLoadingProgessWithAsyncID, AsyncId) == 0x000000, "Member 'PaperAssetManager_GetAsyncLoadingProgessWithAsyncID::AsyncId' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_GetAsyncLoadingProgessWithAsyncID, ReturnValue) == 0x000004, "Member 'PaperAssetManager_GetAsyncLoadingProgessWithAsyncID::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.GetCurrentAsyncID
// 0x0004 (0x0004 - 0x0000)
struct PaperAssetManager_GetCurrentAsyncID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperAssetManager_GetCurrentAsyncID) == 0x000004, "Wrong alignment on PaperAssetManager_GetCurrentAsyncID");
static_assert(sizeof(PaperAssetManager_GetCurrentAsyncID) == 0x000004, "Wrong size on PaperAssetManager_GetCurrentAsyncID");
static_assert(offsetof(PaperAssetManager_GetCurrentAsyncID, ReturnValue) == 0x000000, "Member 'PaperAssetManager_GetCurrentAsyncID::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.NormalizeAssetPathAndResolve
// 0x0018 (0x0018 - 0x0000)
struct PaperAssetManager_NormalizeAssetPathAndResolve final
{
public:
	class FString                                 InAssetPath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperAssetManager_NormalizeAssetPathAndResolve) == 0x000008, "Wrong alignment on PaperAssetManager_NormalizeAssetPathAndResolve");
static_assert(sizeof(PaperAssetManager_NormalizeAssetPathAndResolve) == 0x000018, "Wrong size on PaperAssetManager_NormalizeAssetPathAndResolve");
static_assert(offsetof(PaperAssetManager_NormalizeAssetPathAndResolve, InAssetPath) == 0x000000, "Member 'PaperAssetManager_NormalizeAssetPathAndResolve::InAssetPath' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_NormalizeAssetPathAndResolve, ReturnValue) == 0x000010, "Member 'PaperAssetManager_NormalizeAssetPathAndResolve::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperAssetManager.SyncLoadPrimaryAssetEx
// 0x0018 (0x0018 - 0x0000)
struct PaperAssetManager_SyncLoadPrimaryAssetEx final
{
public:
	TArray<class FString>                         InAssetsToLoad;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InTimeLimit;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperAssetManager_SyncLoadPrimaryAssetEx) == 0x000008, "Wrong alignment on PaperAssetManager_SyncLoadPrimaryAssetEx");
static_assert(sizeof(PaperAssetManager_SyncLoadPrimaryAssetEx) == 0x000018, "Wrong size on PaperAssetManager_SyncLoadPrimaryAssetEx");
static_assert(offsetof(PaperAssetManager_SyncLoadPrimaryAssetEx, InAssetsToLoad) == 0x000000, "Member 'PaperAssetManager_SyncLoadPrimaryAssetEx::InAssetsToLoad' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_SyncLoadPrimaryAssetEx, InTimeLimit) == 0x000010, "Member 'PaperAssetManager_SyncLoadPrimaryAssetEx::InTimeLimit' has a wrong offset!");
static_assert(offsetof(PaperAssetManager_SyncLoadPrimaryAssetEx, ReturnValue) == 0x000014, "Member 'PaperAssetManager_SyncLoadPrimaryAssetEx::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperConsoleManager.RegisterLuaCommand
// 0x0020 (0x0020 - 0x0000)
struct PaperConsoleManager_RegisterLuaCommand final
{
public:
	class FString                                 Cmd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperConsoleManager_RegisterLuaCommand) == 0x000008, "Wrong alignment on PaperConsoleManager_RegisterLuaCommand");
static_assert(sizeof(PaperConsoleManager_RegisterLuaCommand) == 0x000020, "Wrong size on PaperConsoleManager_RegisterLuaCommand");
static_assert(offsetof(PaperConsoleManager_RegisterLuaCommand, Cmd) == 0x000000, "Member 'PaperConsoleManager_RegisterLuaCommand::Cmd' has a wrong offset!");
static_assert(offsetof(PaperConsoleManager_RegisterLuaCommand, Help) == 0x000010, "Member 'PaperConsoleManager_RegisterLuaCommand::Help' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperConsoleManager.UnregisterLuaCommand
// 0x0010 (0x0010 - 0x0000)
struct PaperConsoleManager_UnregisterLuaCommand final
{
public:
	class FString                                 Cmd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperConsoleManager_UnregisterLuaCommand) == 0x000008, "Wrong alignment on PaperConsoleManager_UnregisterLuaCommand");
static_assert(sizeof(PaperConsoleManager_UnregisterLuaCommand) == 0x000010, "Wrong size on PaperConsoleManager_UnregisterLuaCommand");
static_assert(offsetof(PaperConsoleManager_UnregisterLuaCommand, Cmd) == 0x000000, "Member 'PaperConsoleManager_UnregisterLuaCommand::Cmd' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindAnalogInputEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindAnalogInputEvent final
{
public:
	TDelegate<void(const struct FAnalogInputEvent& AnalogInputEvent)> InOnAnalogInput;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindAnalogInputEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindAnalogInputEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindAnalogInputEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindAnalogInputEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindAnalogInputEvent, InOnAnalogInput) == 0x000000, "Member 'PaperInputProcessorHelper_BindAnalogInputEvent::InOnAnalogInput' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindAnalogInputEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindAnalogInputEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindGestureEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindGestureEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnGesture;                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindGestureEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindGestureEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindGestureEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindGestureEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindGestureEvent, InOnGesture) == 0x000000, "Member 'PaperInputProcessorHelper_BindGestureEvent::InOnGesture' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindGestureEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindGestureEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindInputDeviceEvent
// 0x0010 (0x0010 - 0x0000)
struct PaperInputProcessorHelper_BindInputDeviceEvent final
{
public:
	TDelegate<void(EPaperInputDeviceKeyType InputDeviceKeyType)> InOnInputDevice;                    // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindInputDeviceEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindInputDeviceEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindInputDeviceEvent) == 0x000010, "Wrong size on PaperInputProcessorHelper_BindInputDeviceEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindInputDeviceEvent, InOnInputDevice) == 0x000000, "Member 'PaperInputProcessorHelper_BindInputDeviceEvent::InOnInputDevice' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindKeyDownEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindKeyDownEvent final
{
public:
	TDelegate<void(const struct FKeyEvent& KeyEvent)> InOnKeyDown;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindKeyDownEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindKeyDownEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindKeyDownEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindKeyDownEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindKeyDownEvent, InOnKeyDown) == 0x000000, "Member 'PaperInputProcessorHelper_BindKeyDownEvent::InOnKeyDown' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindKeyDownEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindKeyDownEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindKeyUpEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindKeyUpEvent final
{
public:
	TDelegate<void(const struct FKeyEvent& KeyEvent)> InOnKeyUp;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindKeyUpEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindKeyUpEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindKeyUpEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindKeyUpEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindKeyUpEvent, InOnKeyUp) == 0x000000, "Member 'PaperInputProcessorHelper_BindKeyUpEvent::InOnKeyUp' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindKeyUpEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindKeyUpEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMotionDetectedEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMotionDetectedEvent final
{
public:
	TDelegate<void(const struct FMotionEvent& MotionEvent)> InOnMotionDetected;                      // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMotionDetectedEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMotionDetectedEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMotionDetectedEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMotionDetectedEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMotionDetectedEvent, InOnMotionDetected) == 0x000000, "Member 'PaperInputProcessorHelper_BindMotionDetectedEvent::InOnMotionDetected' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMotionDetectedEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMotionDetectedEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMouseButtonDoubleClickEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonDoubleClick;              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent, InOnMouseButtonDoubleClick) == 0x000000, "Member 'PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent::InOnMouseButtonDoubleClick' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMouseButtonDoubleClickEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMouseButtonDownEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMouseButtonDownEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonDown;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMouseButtonDownEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMouseButtonDownEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMouseButtonDownEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMouseButtonDownEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonDownEvent, InOnMouseButtonDown) == 0x000000, "Member 'PaperInputProcessorHelper_BindMouseButtonDownEvent::InOnMouseButtonDown' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonDownEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMouseButtonDownEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMouseButtonUpEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMouseButtonUpEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonUp;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMouseButtonUpEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMouseButtonUpEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMouseButtonUpEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMouseButtonUpEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonUpEvent, InOnMouseButtonUp) == 0x000000, "Member 'PaperInputProcessorHelper_BindMouseButtonUpEvent::InOnMouseButtonUp' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseButtonUpEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMouseButtonUpEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMouseMoveEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMouseMoveEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseMove;                           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMouseMoveEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMouseMoveEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMouseMoveEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMouseMoveEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseMoveEvent, InOnMouseMove) == 0x000000, "Member 'PaperInputProcessorHelper_BindMouseMoveEvent::InOnMouseMove' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseMoveEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMouseMoveEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.BindMouseWheelEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_BindMouseWheelEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseWheel;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_BindMouseWheelEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_BindMouseWheelEvent");
static_assert(sizeof(PaperInputProcessorHelper_BindMouseWheelEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_BindMouseWheelEvent");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseWheelEvent, InOnMouseWheel) == 0x000000, "Member 'PaperInputProcessorHelper_BindMouseWheelEvent::InOnMouseWheel' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_BindMouseWheelEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_BindMouseWheelEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.GetCurInputDeviceKeyType
// 0x0001 (0x0001 - 0x0000)
struct PaperInputProcessorHelper_GetCurInputDeviceKeyType final
{
public:
	EPaperInputDeviceKeyType                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_GetCurInputDeviceKeyType) == 0x000001, "Wrong alignment on PaperInputProcessorHelper_GetCurInputDeviceKeyType");
static_assert(sizeof(PaperInputProcessorHelper_GetCurInputDeviceKeyType) == 0x000001, "Wrong size on PaperInputProcessorHelper_GetCurInputDeviceKeyType");
static_assert(offsetof(PaperInputProcessorHelper_GetCurInputDeviceKeyType, ReturnValue) == 0x000000, "Member 'PaperInputProcessorHelper_GetCurInputDeviceKeyType::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.GetMouseResponseDisabled
// 0x0001 (0x0001 - 0x0000)
struct PaperInputProcessorHelper_GetMouseResponseDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_GetMouseResponseDisabled) == 0x000001, "Wrong alignment on PaperInputProcessorHelper_GetMouseResponseDisabled");
static_assert(sizeof(PaperInputProcessorHelper_GetMouseResponseDisabled) == 0x000001, "Wrong size on PaperInputProcessorHelper_GetMouseResponseDisabled");
static_assert(offsetof(PaperInputProcessorHelper_GetMouseResponseDisabled, ReturnValue) == 0x000000, "Member 'PaperInputProcessorHelper_GetMouseResponseDisabled::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.SetInputDeviceIgnoreValue
// 0x0004 (0x0004 - 0x0000)
struct PaperInputProcessorHelper_SetInputDeviceIgnoreValue final
{
public:
	float                                         InInputDeviceIgnoreValue;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_SetInputDeviceIgnoreValue) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_SetInputDeviceIgnoreValue");
static_assert(sizeof(PaperInputProcessorHelper_SetInputDeviceIgnoreValue) == 0x000004, "Wrong size on PaperInputProcessorHelper_SetInputDeviceIgnoreValue");
static_assert(offsetof(PaperInputProcessorHelper_SetInputDeviceIgnoreValue, InInputDeviceIgnoreValue) == 0x000000, "Member 'PaperInputProcessorHelper_SetInputDeviceIgnoreValue::InInputDeviceIgnoreValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.SetMouseResponseDisabled
// 0x0002 (0x0002 - 0x0000)
struct PaperInputProcessorHelper_SetMouseResponseDisabled final
{
public:
	bool                                          bDisable;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_SetMouseResponseDisabled) == 0x000001, "Wrong alignment on PaperInputProcessorHelper_SetMouseResponseDisabled");
static_assert(sizeof(PaperInputProcessorHelper_SetMouseResponseDisabled) == 0x000002, "Wrong size on PaperInputProcessorHelper_SetMouseResponseDisabled");
static_assert(offsetof(PaperInputProcessorHelper_SetMouseResponseDisabled, bDisable) == 0x000000, "Member 'PaperInputProcessorHelper_SetMouseResponseDisabled::bDisable' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_SetMouseResponseDisabled, ReturnValue) == 0x000001, "Member 'PaperInputProcessorHelper_SetMouseResponseDisabled::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindAnalogInputEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindAnalogInputEvent final
{
public:
	TDelegate<void(const struct FAnalogInputEvent& AnalogInputEvent)> InOnAnalogInput;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindAnalogInputEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindAnalogInputEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindAnalogInputEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindAnalogInputEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindAnalogInputEvent, InOnAnalogInput) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindAnalogInputEvent::InOnAnalogInput' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindAnalogInputEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindAnalogInputEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindGestureEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindGestureEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnGesture;                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindGestureEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindGestureEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindGestureEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindGestureEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindGestureEvent, InOnGesture) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindGestureEvent::InOnGesture' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindGestureEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindGestureEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindInputDeviceEvent
// 0x0010 (0x0010 - 0x0000)
struct PaperInputProcessorHelper_UnbindInputDeviceEvent final
{
public:
	TDelegate<void(EPaperInputDeviceKeyType InputDeviceKeyType)> InOnInputDevice;                    // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindInputDeviceEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindInputDeviceEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindInputDeviceEvent) == 0x000010, "Wrong size on PaperInputProcessorHelper_UnbindInputDeviceEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindInputDeviceEvent, InOnInputDevice) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindInputDeviceEvent::InOnInputDevice' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindKeyDownEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindKeyDownEvent final
{
public:
	TDelegate<void(const struct FKeyEvent& KeyEvent)> InOnKeyDown;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindKeyDownEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindKeyDownEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindKeyDownEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindKeyDownEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindKeyDownEvent, InOnKeyDown) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindKeyDownEvent::InOnKeyDown' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindKeyDownEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindKeyDownEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindKeyUpEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindKeyUpEvent final
{
public:
	TDelegate<void(const struct FKeyEvent& KeyEvent)> InOnKeyUp;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindKeyUpEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindKeyUpEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindKeyUpEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindKeyUpEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindKeyUpEvent, InOnKeyUp) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindKeyUpEvent::InOnKeyUp' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindKeyUpEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindKeyUpEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMotionDetectedEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMotionDetectedEvent final
{
public:
	TDelegate<void(const struct FMotionEvent& MotionEvent)> InOnMotionDetected;                      // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMotionDetectedEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMotionDetectedEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMotionDetectedEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMotionDetectedEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMotionDetectedEvent, InOnMotionDetected) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMotionDetectedEvent::InOnMotionDetected' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMotionDetectedEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMotionDetectedEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMouseButtonDoubleClickEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonDoubleClick;              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent, InOnMouseButtonDoubleClick) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent::InOnMouseButtonDoubleClick' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMouseButtonDoubleClickEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMouseButtonDownEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMouseButtonDownEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonDown;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMouseButtonDownEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMouseButtonDownEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMouseButtonDownEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMouseButtonDownEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonDownEvent, InOnMouseButtonDown) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMouseButtonDownEvent::InOnMouseButtonDown' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonDownEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMouseButtonDownEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMouseButtonUpEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMouseButtonUpEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseButtonUp;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMouseButtonUpEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMouseButtonUpEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMouseButtonUpEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMouseButtonUpEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonUpEvent, InOnMouseButtonUp) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMouseButtonUpEvent::InOnMouseButtonUp' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseButtonUpEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMouseButtonUpEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMouseMoveEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMouseMoveEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseMove;                           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMouseMoveEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMouseMoveEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMouseMoveEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMouseMoveEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseMoveEvent, InOnMouseMove) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMouseMoveEvent::InOnMouseMove' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseMoveEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMouseMoveEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperInputProcessorHelper.UnbindMouseWheelEvent
// 0x0014 (0x0014 - 0x0000)
struct PaperInputProcessorHelper_UnbindMouseWheelEvent final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> InOnMouseWheel;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperInputProcessorHelper_UnbindMouseWheelEvent) == 0x000004, "Wrong alignment on PaperInputProcessorHelper_UnbindMouseWheelEvent");
static_assert(sizeof(PaperInputProcessorHelper_UnbindMouseWheelEvent) == 0x000014, "Wrong size on PaperInputProcessorHelper_UnbindMouseWheelEvent");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseWheelEvent, InOnMouseWheel) == 0x000000, "Member 'PaperInputProcessorHelper_UnbindMouseWheelEvent::InOnMouseWheel' has a wrong offset!");
static_assert(offsetof(PaperInputProcessorHelper_UnbindMouseWheelEvent, InPriority) == 0x000010, "Member 'PaperInputProcessorHelper_UnbindMouseWheelEvent::InPriority' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.ClearPersistentLevel
// 0x0010 (0x0010 - 0x0000)
struct PaperLevelMgr_ClearPersistentLevel final
{
public:
	class FString                                 LevelPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLevelMgr_ClearPersistentLevel) == 0x000008, "Wrong alignment on PaperLevelMgr_ClearPersistentLevel");
static_assert(sizeof(PaperLevelMgr_ClearPersistentLevel) == 0x000010, "Wrong size on PaperLevelMgr_ClearPersistentLevel");
static_assert(offsetof(PaperLevelMgr_ClearPersistentLevel, LevelPath) == 0x000000, "Member 'PaperLevelMgr_ClearPersistentLevel::LevelPath' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.DungeonTeleportPlayer
// 0x0020 (0x0020 - 0x0000)
struct PaperLevelMgr_DungeonTeleportPlayer final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_DungeonTeleportPlayer) == 0x000008, "Wrong alignment on PaperLevelMgr_DungeonTeleportPlayer");
static_assert(sizeof(PaperLevelMgr_DungeonTeleportPlayer) == 0x000020, "Wrong size on PaperLevelMgr_DungeonTeleportPlayer");
static_assert(offsetof(PaperLevelMgr_DungeonTeleportPlayer, TargetLocation) == 0x000000, "Member 'PaperLevelMgr_DungeonTeleportPlayer::TargetLocation' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_DungeonTeleportPlayer, ReturnValue) == 0x000018, "Member 'PaperLevelMgr_DungeonTeleportPlayer::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.GetCurrentWorldPath
// 0x0010 (0x0010 - 0x0000)
struct PaperLevelMgr_GetCurrentWorldPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLevelMgr_GetCurrentWorldPath) == 0x000008, "Wrong alignment on PaperLevelMgr_GetCurrentWorldPath");
static_assert(sizeof(PaperLevelMgr_GetCurrentWorldPath) == 0x000010, "Wrong size on PaperLevelMgr_GetCurrentWorldPath");
static_assert(offsetof(PaperLevelMgr_GetCurrentWorldPath, ReturnValue) == 0x000000, "Member 'PaperLevelMgr_GetCurrentWorldPath::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.GetLevelStreaming
// 0x0018 (0x0018 - 0x0000)
struct PaperLevelMgr_GetLevelStreaming final
{
public:
	class FString                                 LevelPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreaming*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLevelMgr_GetLevelStreaming) == 0x000008, "Wrong alignment on PaperLevelMgr_GetLevelStreaming");
static_assert(sizeof(PaperLevelMgr_GetLevelStreaming) == 0x000018, "Wrong size on PaperLevelMgr_GetLevelStreaming");
static_assert(offsetof(PaperLevelMgr_GetLevelStreaming, LevelPath) == 0x000000, "Member 'PaperLevelMgr_GetLevelStreaming::LevelPath' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_GetLevelStreaming, ReturnValue) == 0x000010, "Member 'PaperLevelMgr_GetLevelStreaming::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.LoadLevelToWorld
// 0x0048 (0x0048 - 0x0000)
struct PaperLevelMgr_LoadLevelToWorld final
{
public:
	class FString                                 LevelPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LoadLocation;                                      // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlayerPosition;                                    // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WithoutProgress;                                   // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_LoadLevelToWorld) == 0x000008, "Wrong alignment on PaperLevelMgr_LoadLevelToWorld");
static_assert(sizeof(PaperLevelMgr_LoadLevelToWorld) == 0x000048, "Wrong size on PaperLevelMgr_LoadLevelToWorld");
static_assert(offsetof(PaperLevelMgr_LoadLevelToWorld, LevelPath) == 0x000000, "Member 'PaperLevelMgr_LoadLevelToWorld::LevelPath' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadLevelToWorld, LoadLocation) == 0x000010, "Member 'PaperLevelMgr_LoadLevelToWorld::LoadLocation' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadLevelToWorld, PlayerPosition) == 0x000028, "Member 'PaperLevelMgr_LoadLevelToWorld::PlayerPosition' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadLevelToWorld, WithoutProgress) == 0x000040, "Member 'PaperLevelMgr_LoadLevelToWorld::WithoutProgress' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadLevelToWorld, ReturnValue) == 0x000041, "Member 'PaperLevelMgr_LoadLevelToWorld::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.LoadSubLevelToWorld
// 0x0030 (0x0030 - 0x0000)
struct PaperLevelMgr_LoadSubLevelToWorld final
{
public:
	class FString                                 SubLevelPath;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LoadLocation;                                      // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_LoadSubLevelToWorld) == 0x000008, "Wrong alignment on PaperLevelMgr_LoadSubLevelToWorld");
static_assert(sizeof(PaperLevelMgr_LoadSubLevelToWorld) == 0x000030, "Wrong size on PaperLevelMgr_LoadSubLevelToWorld");
static_assert(offsetof(PaperLevelMgr_LoadSubLevelToWorld, SubLevelPath) == 0x000000, "Member 'PaperLevelMgr_LoadSubLevelToWorld::SubLevelPath' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadSubLevelToWorld, LoadLocation) == 0x000010, "Member 'PaperLevelMgr_LoadSubLevelToWorld::LoadLocation' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_LoadSubLevelToWorld, ReturnValue) == 0x000028, "Member 'PaperLevelMgr_LoadSubLevelToWorld::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.OpenNewWorld
// 0x0040 (0x0040 - 0x0000)
struct PaperLevelMgr_OpenNewWorld final
{
public:
	class FString                                 WorldPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlayerPosition;                                    // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Option;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_OpenNewWorld) == 0x000008, "Wrong alignment on PaperLevelMgr_OpenNewWorld");
static_assert(sizeof(PaperLevelMgr_OpenNewWorld) == 0x000040, "Wrong size on PaperLevelMgr_OpenNewWorld");
static_assert(offsetof(PaperLevelMgr_OpenNewWorld, WorldPath) == 0x000000, "Member 'PaperLevelMgr_OpenNewWorld::WorldPath' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_OpenNewWorld, PlayerPosition) == 0x000010, "Member 'PaperLevelMgr_OpenNewWorld::PlayerPosition' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_OpenNewWorld, Option) == 0x000028, "Member 'PaperLevelMgr_OpenNewWorld::Option' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_OpenNewWorld, ReturnValue) == 0x000038, "Member 'PaperLevelMgr_OpenNewWorld::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.ReturnToWorld
// 0x0020 (0x0020 - 0x0000)
struct PaperLevelMgr_ReturnToWorld final
{
public:
	struct FVector                                LoadLocation;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_ReturnToWorld) == 0x000008, "Wrong alignment on PaperLevelMgr_ReturnToWorld");
static_assert(sizeof(PaperLevelMgr_ReturnToWorld) == 0x000020, "Wrong size on PaperLevelMgr_ReturnToWorld");
static_assert(offsetof(PaperLevelMgr_ReturnToWorld, LoadLocation) == 0x000000, "Member 'PaperLevelMgr_ReturnToWorld::LoadLocation' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_ReturnToWorld, ReturnValue) == 0x000018, "Member 'PaperLevelMgr_ReturnToWorld::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.SetPersistentLevel
// 0x0010 (0x0010 - 0x0000)
struct PaperLevelMgr_SetPersistentLevel final
{
public:
	class FString                                 LevelPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperLevelMgr_SetPersistentLevel) == 0x000008, "Wrong alignment on PaperLevelMgr_SetPersistentLevel");
static_assert(sizeof(PaperLevelMgr_SetPersistentLevel) == 0x000010, "Wrong size on PaperLevelMgr_SetPersistentLevel");
static_assert(offsetof(PaperLevelMgr_SetPersistentLevel, LevelPath) == 0x000000, "Member 'PaperLevelMgr_SetPersistentLevel::LevelPath' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLevelMgr.TeleportPlayer
// 0x0020 (0x0020 - 0x0000)
struct PaperLevelMgr_TeleportPlayer final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperLevelMgr_TeleportPlayer) == 0x000008, "Wrong alignment on PaperLevelMgr_TeleportPlayer");
static_assert(sizeof(PaperLevelMgr_TeleportPlayer) == 0x000020, "Wrong size on PaperLevelMgr_TeleportPlayer");
static_assert(offsetof(PaperLevelMgr_TeleportPlayer, TargetLocation) == 0x000000, "Member 'PaperLevelMgr_TeleportPlayer::TargetLocation' has a wrong offset!");
static_assert(offsetof(PaperLevelMgr_TeleportPlayer, ReturnValue) == 0x000018, "Member 'PaperLevelMgr_TeleportPlayer::ReturnValue' has a wrong offset!");

// Function PaperLuaFrameworkBase.PaperLuaBlueprintLibrary.DeserializeComponent
// 0x0078 (0x0078 - 0x0000)
struct PaperLuaBlueprintLibrary_DeserializeComponent final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
