#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperGPUDrivenFoliage

#include "Basic.hpp"


namespace SDK::Params
{

// Function PaperGPUDrivenFoliage.PaperGPUDrivenFoliageManager.Get
// 0x0010 (0x0010 - 0x0000)
struct PaperGPUDrivenFoliageManager_Get final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APaperGPUDrivenFoliageManager*          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperGPUDrivenFoliageManager_Get) == 0x000008, "Wrong alignment on PaperGPUDrivenFoliageManager_Get");
static_assert(sizeof(PaperGPUDrivenFoliageManager_Get) == 0x000010, "Wrong size on PaperGPUDrivenFoliageManager_Get");
static_assert(offsetof(PaperGPUDrivenFoliageManager_Get, WorldContextObject) == 0x000000, "Member 'PaperGPUDrivenFoliageManager_Get::WorldContextObject' has a wrong offset!");
static_assert(offsetof(PaperGPUDrivenFoliageManager_Get, ReturnValue) == 0x000008, "Member 'PaperGPUDrivenFoliageManager_Get::ReturnValue' has a wrong offset!");

// Function PaperGPUDrivenFoliage.PaperGPUDrivenFoliageManager.IsInTeleportStreaming
// 0x0001 (0x0001 - 0x0000)
struct PaperGPUDrivenFoliageManager_IsInTeleportStreaming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperGPUDrivenFoliageManager_IsInTeleportStreaming) == 0x000001, "Wrong alignment on PaperGPUDrivenFoliageManager_IsInTeleportStreaming");
static_assert(sizeof(PaperGPUDrivenFoliageManager_IsInTeleportStreaming) == 0x000001, "Wrong size on PaperGPUDrivenFoliageManager_IsInTeleportStreaming");
static_assert(offsetof(PaperGPUDrivenFoliageManager_IsInTeleportStreaming, ReturnValue) == 0x000000, "Member 'PaperGPUDrivenFoliageManager_IsInTeleportStreaming::ReturnValue' has a wrong offset!");

// Function PaperGPUDrivenFoliage.PaperGPUDrivenFoliageStreamingSubsystem.Instance
// 0x0008 (0x0008 - 0x0000)
struct PaperGPUDrivenFoliageStreamingSubsystem_Instance final
{
public:
	class UPaperGPUDrivenFoliageStreamingSubsystem* ReturnValue;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PaperGPUDrivenFoliageStreamingSubsystem_Instance) == 0x000008, "Wrong alignment on PaperGPUDrivenFoliageStreamingSubsystem_Instance");
static_assert(sizeof(PaperGPUDrivenFoliageStreamingSubsystem_Instance) == 0x000008, "Wrong size on PaperGPUDrivenFoliageStreamingSubsystem_Instance");
static_assert(offsetof(PaperGPUDrivenFoliageStreamingSubsystem_Instance, ReturnValue) == 0x000000, "Member 'PaperGPUDrivenFoliageStreamingSubsystem_Instance::ReturnValue' has a wrong offset!");

}

