#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperTopdownDepth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PaperTopdownDepth.DynamicGrassOccluder
// 0x0018 (0x03C0 - 0x03A8)
class ADynamicGrassOccluder final : public AActor
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTopdownDepthCaptureComponent*          ShadowLightComponent;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaDistance;                                     // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateEffectPosition(const struct FVector& WorldPosition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicGrassOccluder">();
	}
	static class ADynamicGrassOccluder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicGrassOccluder>();
	}
};
static_assert(alignof(ADynamicGrassOccluder) == 0x000008, "Wrong alignment on ADynamicGrassOccluder");
static_assert(sizeof(ADynamicGrassOccluder) == 0x0003C0, "Wrong size on ADynamicGrassOccluder");
static_assert(offsetof(ADynamicGrassOccluder, ShadowLightComponent) == 0x0003B0, "Member 'ADynamicGrassOccluder::ShadowLightComponent' has a wrong offset!");
static_assert(offsetof(ADynamicGrassOccluder, DeltaDistance) == 0x0003B8, "Member 'ADynamicGrassOccluder::DeltaDistance' has a wrong offset!");

// Class PaperTopdownDepth.MaterialExpressionTopdownDepth
// 0x0008 (0x00C8 - 0x00C0)
class UMaterialExpressionTopdownDepth final : public UMaterialExpression
{
public:
	int32                                         TopdownIndex;                                      // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionTopdownDepth">();
	}
	static class UMaterialExpressionTopdownDepth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionTopdownDepth>();
	}
};
static_assert(alignof(UMaterialExpressionTopdownDepth) == 0x000008, "Wrong alignment on UMaterialExpressionTopdownDepth");
static_assert(sizeof(UMaterialExpressionTopdownDepth) == 0x0000C8, "Wrong size on UMaterialExpressionTopdownDepth");
static_assert(offsetof(UMaterialExpressionTopdownDepth, TopdownIndex) == 0x0000C0, "Member 'UMaterialExpressionTopdownDepth::TopdownIndex' has a wrong offset!");

// Class PaperTopdownDepth.MaterialExpressionTopdownDepthDistance
// 0x0030 (0x00F0 - 0x00C0)
class UMaterialExpressionTopdownDepthDistance final : public UMaterialExpression
{
public:
	int32                                         TopdownIndex;                                      // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Input;                                             // 0x00C8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionTopdownDepthDistance">();
	}
	static class UMaterialExpressionTopdownDepthDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionTopdownDepthDistance>();
	}
};
static_assert(alignof(UMaterialExpressionTopdownDepthDistance) == 0x000008, "Wrong alignment on UMaterialExpressionTopdownDepthDistance");
static_assert(sizeof(UMaterialExpressionTopdownDepthDistance) == 0x0000F0, "Wrong size on UMaterialExpressionTopdownDepthDistance");
static_assert(offsetof(UMaterialExpressionTopdownDepthDistance, TopdownIndex) == 0x0000C0, "Member 'UMaterialExpressionTopdownDepthDistance::TopdownIndex' has a wrong offset!");
static_assert(offsetof(UMaterialExpressionTopdownDepthDistance, Input) == 0x0000C8, "Member 'UMaterialExpressionTopdownDepthDistance::Input' has a wrong offset!");

// Class PaperTopdownDepth.TopdownDepthCapture
// 0x0008 (0x03C0 - 0x03B8)
class ATopdownDepthCapture final : public ALight
{
public:
	class UTopdownDepthCaptureComponent*          ShadowLightComponent;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TopdownDepthCapture">();
	}
	static class ATopdownDepthCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATopdownDepthCapture>();
	}
};
static_assert(alignof(ATopdownDepthCapture) == 0x000008, "Wrong alignment on ATopdownDepthCapture");
static_assert(sizeof(ATopdownDepthCapture) == 0x0003C0, "Wrong size on ATopdownDepthCapture");
static_assert(offsetof(ATopdownDepthCapture, ShadowLightComponent) == 0x0003B8, "Member 'ATopdownDepthCapture::ShadowLightComponent' has a wrong offset!");

// Class PaperTopdownDepth.TopdownDepthCaptureComponent
// 0x0010 (0x0400 - 0x03F0)
class UTopdownDepthCaptureComponent final : public ULocalLightComponent
{
public:
	float                                         SourceRadius;                                      // 0x03F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceHeight;                                      // 0x03F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsedForHeightfieldReadback;                       // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TopdownDepthCaptureComponent">();
	}
	static class UTopdownDepthCaptureComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTopdownDepthCaptureComponent>();
	}
};
static_assert(alignof(UTopdownDepthCaptureComponent) == 0x000010, "Wrong alignment on UTopdownDepthCaptureComponent");
static_assert(sizeof(UTopdownDepthCaptureComponent) == 0x000400, "Wrong size on UTopdownDepthCaptureComponent");
static_assert(offsetof(UTopdownDepthCaptureComponent, SourceRadius) == 0x0003F0, "Member 'UTopdownDepthCaptureComponent::SourceRadius' has a wrong offset!");
static_assert(offsetof(UTopdownDepthCaptureComponent, SourceHeight) == 0x0003F4, "Member 'UTopdownDepthCaptureComponent::SourceHeight' has a wrong offset!");
static_assert(offsetof(UTopdownDepthCaptureComponent, bUsedForHeightfieldReadback) == 0x0003F8, "Member 'UTopdownDepthCaptureComponent::bUsedForHeightfieldReadback' has a wrong offset!");

}

