#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperSDKCross

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "PSDKBasic_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PaperSDKCross.PSLoginUIBaseUserWidget
// 0x0098 (0x03F8 - 0x0360)
class UPSLoginUIBaseUserWidget : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x30];                                     // 0x0360(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UPSLoginUIToastTip*                     ToastTip;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x60];                                     // 0x0398(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSLoginUIBaseUserWidget">();
	}
	static class UPSLoginUIBaseUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSLoginUIBaseUserWidget>();
	}
};
static_assert(alignof(UPSLoginUIBaseUserWidget) == 0x000008, "Wrong alignment on UPSLoginUIBaseUserWidget");
static_assert(sizeof(UPSLoginUIBaseUserWidget) == 0x0003F8, "Wrong size on UPSLoginUIBaseUserWidget");
static_assert(offsetof(UPSLoginUIBaseUserWidget, ToastTip) == 0x000390, "Member 'UPSLoginUIBaseUserWidget::ToastTip' has a wrong offset!");

// Class PaperSDKCross.PCCnAgreementDialogUI
// 0x0050 (0x0448 - 0x03F8)
class UPCCnAgreementDialogUI final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         AgreementRichTextBlock;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CancelButton;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CancelButtonTextBlock;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancelButton();
	void OnCommitButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnAgreementDialogUI">();
	}
	static class UPCCnAgreementDialogUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnAgreementDialogUI>();
	}
};
static_assert(alignof(UPCCnAgreementDialogUI) == 0x000008, "Wrong alignment on UPCCnAgreementDialogUI");
static_assert(sizeof(UPCCnAgreementDialogUI) == 0x000448, "Wrong size on UPCCnAgreementDialogUI");
static_assert(offsetof(UPCCnAgreementDialogUI, OverlayImage) == 0x0003F8, "Member 'UPCCnAgreementDialogUI::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, BackgroundImage) == 0x000400, "Member 'UPCCnAgreementDialogUI::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, TitleTextBlock) == 0x000408, "Member 'UPCCnAgreementDialogUI::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, AgreementRichTextBlock) == 0x000410, "Member 'UPCCnAgreementDialogUI::AgreementRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, CommitButton) == 0x000418, "Member 'UPCCnAgreementDialogUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, CommitButtonTextBlock) == 0x000420, "Member 'UPCCnAgreementDialogUI::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, CancelButton) == 0x000428, "Member 'UPCCnAgreementDialogUI::CancelButton' has a wrong offset!");
static_assert(offsetof(UPCCnAgreementDialogUI, CancelButtonTextBlock) == 0x000430, "Member 'UPCCnAgreementDialogUI::CancelButtonTextBlock' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIBindMobile
// 0x0040 (0x0438 - 0x03F8)
class UPCCnLoginUIBindMobile final : public UPSLoginUIBaseUserWidget
{
public:
	class UTextBlock*                             GetCodeButtonTextBlock;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       MobileEditableTextBox;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       CodeEditableTextBox;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CommitButton;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                SwitchAccountButton;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CloseButton;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHorizontalBox*                         GamePadCloseTip;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_430[0x8];                                      // 0x0430(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCommitButton();
	void OnGetCodeButton();
	void OnSwitchButton();
	void TextBoxInputCodeChanged(const class FString& Text);
	void TextBoxInputMobileChanged(const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUIBindMobile">();
	}
	static class UPCCnLoginUIBindMobile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUIBindMobile>();
	}
};
static_assert(alignof(UPCCnLoginUIBindMobile) == 0x000008, "Wrong alignment on UPCCnLoginUIBindMobile");
static_assert(sizeof(UPCCnLoginUIBindMobile) == 0x000438, "Wrong size on UPCCnLoginUIBindMobile");
static_assert(offsetof(UPCCnLoginUIBindMobile, GetCodeButtonTextBlock) == 0x0003F8, "Member 'UPCCnLoginUIBindMobile::GetCodeButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, MobileEditableTextBox) == 0x000400, "Member 'UPCCnLoginUIBindMobile::MobileEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, CodeEditableTextBox) == 0x000408, "Member 'UPCCnLoginUIBindMobile::CodeEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, CommitButton) == 0x000410, "Member 'UPCCnLoginUIBindMobile::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, SwitchAccountButton) == 0x000418, "Member 'UPCCnLoginUIBindMobile::SwitchAccountButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, CloseButton) == 0x000420, "Member 'UPCCnLoginUIBindMobile::CloseButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIBindMobile, GamePadCloseTip) == 0x000428, "Member 'UPCCnLoginUIBindMobile::GamePadCloseTip' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUICode
// 0x0158 (0x0550 - 0x03F8)
class UPCCnLoginUICode final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                QrCodeButton;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImage;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextBox;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       CodeInputTextBox;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LineImage;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                GetCodeButton;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             GetCodeButtonTextBlock;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PasswordLoginButton;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PasswordLoginButtonTextBlock;                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CustomerServiceButton;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CustomerServiceButtonTextBlock;                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              CheckBox;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         AgreementRichTextBlock;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdAccountWidget;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox1;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox2;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox3;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin1;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin2;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin3;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 SwitchLoginIcon;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0x88];                                     // 0x04C8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AgreementUICloseCallback(const bool Check);
	void AgreementUICloseToQrCallback(const bool Check);
	void OnCheckedButton(bool checked);
	void OnCloseButton();
	void OnCommitButton();
	void OnCustomerServiceButton();
	void OnGetCodeButton();
	void OnPasswordLoginButton();
	void OnQrCodeButton();
	void OnThirdDelegate(bool bRes);
	void OnThirdLoginButton(int32 Index_0, bool ClickedByUser);
	void TextBoxInputAccountChanged(const class FString& NewAccount);
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputCodeChanged(const class FString& Text);
	void TextBoxInputCodeCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUICode">();
	}
	static class UPCCnLoginUICode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUICode>();
	}
};
static_assert(alignof(UPCCnLoginUICode) == 0x000008, "Wrong alignment on UPCCnLoginUICode");
static_assert(sizeof(UPCCnLoginUICode) == 0x000550, "Wrong size on UPCCnLoginUICode");
static_assert(offsetof(UPCCnLoginUICode, OverlayImage) == 0x0003F8, "Member 'UPCCnLoginUICode::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, BackgroundImage) == 0x000400, "Member 'UPCCnLoginUICode::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, QrCodeButton) == 0x000408, "Member 'UPCCnLoginUICode::QrCodeButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CloseButton) == 0x000410, "Member 'UPCCnLoginUICode::CloseButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, LogoImage) == 0x000418, "Member 'UPCCnLoginUICode::LogoImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, AccountInputTextBox) == 0x000420, "Member 'UPCCnLoginUICode::AccountInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CodeInputTextBox) == 0x000428, "Member 'UPCCnLoginUICode::CodeInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, LineImage) == 0x000430, "Member 'UPCCnLoginUICode::LineImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, GetCodeButton) == 0x000438, "Member 'UPCCnLoginUICode::GetCodeButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, GetCodeButtonTextBlock) == 0x000440, "Member 'UPCCnLoginUICode::GetCodeButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, PasswordLoginButton) == 0x000448, "Member 'UPCCnLoginUICode::PasswordLoginButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, PasswordLoginButtonTextBlock) == 0x000450, "Member 'UPCCnLoginUICode::PasswordLoginButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CustomerServiceButton) == 0x000458, "Member 'UPCCnLoginUICode::CustomerServiceButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CustomerServiceButtonTextBlock) == 0x000460, "Member 'UPCCnLoginUICode::CustomerServiceButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CommitButton) == 0x000468, "Member 'UPCCnLoginUICode::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CommitButtonTextBlock) == 0x000470, "Member 'UPCCnLoginUICode::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, CheckBox) == 0x000478, "Member 'UPCCnLoginUICode::CheckBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, AgreementRichTextBlock) == 0x000480, "Member 'UPCCnLoginUICode::AgreementRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdAccountWidget) == 0x000488, "Member 'UPCCnLoginUICode::ThirdAccountWidget' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLoginBox1) == 0x000490, "Member 'UPCCnLoginUICode::ThirdLoginBox1' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLoginBox2) == 0x000498, "Member 'UPCCnLoginUICode::ThirdLoginBox2' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLoginBox3) == 0x0004A0, "Member 'UPCCnLoginUICode::ThirdLoginBox3' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLogin1) == 0x0004A8, "Member 'UPCCnLoginUICode::ThirdLogin1' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLogin2) == 0x0004B0, "Member 'UPCCnLoginUICode::ThirdLogin2' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, ThirdLogin3) == 0x0004B8, "Member 'UPCCnLoginUICode::ThirdLogin3' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUICode, SwitchLoginIcon) == 0x0004C0, "Member 'UPCCnLoginUICode::SwitchLoginIcon' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIFast
// 0x0090 (0x0488 - 0x03F8)
class UPCCnLoginUIFast final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               SizeBox;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           ScrollCanvasPanel;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CustomerServiceButton;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImage;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWrapBox*                               ScrollWrapBox;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                OtherAccountButton;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             OtherAccountButtonTextBlock;                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 DeleteRecordImage;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x20];                                     // 0x0468(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCommitButton();
	void OnCustomerServiceButton();
	void OnDeleteItemCallback(const class FString& Account);
	void OnFocusItemChangeCallback(const class FString& Account, bool Focused);
	void OnOtherAccountButton();
	void OnSelectItemCallback(const class FString& Account);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUIFast">();
	}
	static class UPCCnLoginUIFast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUIFast>();
	}
};
static_assert(alignof(UPCCnLoginUIFast) == 0x000008, "Wrong alignment on UPCCnLoginUIFast");
static_assert(sizeof(UPCCnLoginUIFast) == 0x000488, "Wrong size on UPCCnLoginUIFast");
static_assert(offsetof(UPCCnLoginUIFast, OverlayImage) == 0x0003F8, "Member 'UPCCnLoginUIFast::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, SizeBox) == 0x000400, "Member 'UPCCnLoginUIFast::SizeBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, ScrollCanvasPanel) == 0x000408, "Member 'UPCCnLoginUIFast::ScrollCanvasPanel' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, BackgroundImage) == 0x000410, "Member 'UPCCnLoginUIFast::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, CustomerServiceButton) == 0x000418, "Member 'UPCCnLoginUIFast::CustomerServiceButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, CloseButton) == 0x000420, "Member 'UPCCnLoginUIFast::CloseButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, LogoImage) == 0x000428, "Member 'UPCCnLoginUIFast::LogoImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, ScrollBox) == 0x000430, "Member 'UPCCnLoginUIFast::ScrollBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, ScrollWrapBox) == 0x000438, "Member 'UPCCnLoginUIFast::ScrollWrapBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, CommitButton) == 0x000440, "Member 'UPCCnLoginUIFast::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, CommitButtonTextBlock) == 0x000448, "Member 'UPCCnLoginUIFast::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, OtherAccountButton) == 0x000450, "Member 'UPCCnLoginUIFast::OtherAccountButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, OtherAccountButtonTextBlock) == 0x000458, "Member 'UPCCnLoginUIFast::OtherAccountButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFast, DeleteRecordImage) == 0x000460, "Member 'UPCCnLoginUIFast::DeleteRecordImage' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIFastItem
// 0x00A8 (0x0408 - 0x0360)
class UPCCnLoginUIFastItem final : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x20];                                     // 0x0360(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 BackgroundImage;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 AccountTypeImage;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 AccountTypeLogoImage;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             AccountTextBlock;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                CommonImage;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommonTextBlock;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                LastImage;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             LastTextBlock;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             LastTimeTextBlock;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                DeleteRecordButton;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                SelectedButton;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x30];                                     // 0x03D8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDeleteRecordButton();
	void OnFocusChanged(bool HasFocus);
	void OnSelectedButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUIFastItem">();
	}
	static class UPCCnLoginUIFastItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUIFastItem>();
	}
};
static_assert(alignof(UPCCnLoginUIFastItem) == 0x000008, "Wrong alignment on UPCCnLoginUIFastItem");
static_assert(sizeof(UPCCnLoginUIFastItem) == 0x000408, "Wrong size on UPCCnLoginUIFastItem");
static_assert(offsetof(UPCCnLoginUIFastItem, BackgroundImage) == 0x000380, "Member 'UPCCnLoginUIFastItem::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, AccountTypeImage) == 0x000388, "Member 'UPCCnLoginUIFastItem::AccountTypeImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, AccountTypeLogoImage) == 0x000390, "Member 'UPCCnLoginUIFastItem::AccountTypeLogoImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, AccountTextBlock) == 0x000398, "Member 'UPCCnLoginUIFastItem::AccountTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, CommonImage) == 0x0003A0, "Member 'UPCCnLoginUIFastItem::CommonImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, CommonTextBlock) == 0x0003A8, "Member 'UPCCnLoginUIFastItem::CommonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, LastImage) == 0x0003B0, "Member 'UPCCnLoginUIFastItem::LastImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, LastTextBlock) == 0x0003B8, "Member 'UPCCnLoginUIFastItem::LastTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, LastTimeTextBlock) == 0x0003C0, "Member 'UPCCnLoginUIFastItem::LastTimeTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, DeleteRecordButton) == 0x0003C8, "Member 'UPCCnLoginUIFastItem::DeleteRecordButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIFastItem, SelectedButton) == 0x0003D0, "Member 'UPCCnLoginUIFastItem::SelectedButton' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIForgetPassword
// 0x00B0 (0x04A8 - 0x03F8)
class UPCCnLoginUIForgetPassword final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                GoBackButton;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImage;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextBox;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       CodeInputTextBox;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LineImage;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                GetCodeButton;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             GetCodeButtonTextBlock;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           PasswordTipsCanvasPanel;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 PasswordTipsBackground;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PasswordTipsTextBlock;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextBox;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              EyeCheckBox;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       RePasswordInputTextBox;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              ReEyeCheckBox;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x18];                                     // 0x0490(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCommitButton();
	void OnGetCodeButton();
	void OnGoBackCodeButton();
	void TextBoxInputAccountChanged(const class FString& NewAccount);
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputCodeChanged(const class FString& Text);
	void TextBoxInputCodeCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPasswordChanged(const class FString& Text);
	void TextBoxInputPasswordCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputRePasswordChanged(const class FString& Text);
	void TextBoxInputRePasswordCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUIForgetPassword">();
	}
	static class UPCCnLoginUIForgetPassword* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUIForgetPassword>();
	}
};
static_assert(alignof(UPCCnLoginUIForgetPassword) == 0x000008, "Wrong alignment on UPCCnLoginUIForgetPassword");
static_assert(sizeof(UPCCnLoginUIForgetPassword) == 0x0004A8, "Wrong size on UPCCnLoginUIForgetPassword");
static_assert(offsetof(UPCCnLoginUIForgetPassword, OverlayImage) == 0x0003F8, "Member 'UPCCnLoginUIForgetPassword::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, BackgroundImage) == 0x000400, "Member 'UPCCnLoginUIForgetPassword::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, GoBackButton) == 0x000408, "Member 'UPCCnLoginUIForgetPassword::GoBackButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, CloseButton) == 0x000410, "Member 'UPCCnLoginUIForgetPassword::CloseButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, LogoImage) == 0x000418, "Member 'UPCCnLoginUIForgetPassword::LogoImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, AccountInputTextBox) == 0x000420, "Member 'UPCCnLoginUIForgetPassword::AccountInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, CodeInputTextBox) == 0x000428, "Member 'UPCCnLoginUIForgetPassword::CodeInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, LineImage) == 0x000430, "Member 'UPCCnLoginUIForgetPassword::LineImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, GetCodeButton) == 0x000438, "Member 'UPCCnLoginUIForgetPassword::GetCodeButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, GetCodeButtonTextBlock) == 0x000440, "Member 'UPCCnLoginUIForgetPassword::GetCodeButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, PasswordTipsCanvasPanel) == 0x000448, "Member 'UPCCnLoginUIForgetPassword::PasswordTipsCanvasPanel' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, PasswordTipsBackground) == 0x000450, "Member 'UPCCnLoginUIForgetPassword::PasswordTipsBackground' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, PasswordTipsTextBlock) == 0x000458, "Member 'UPCCnLoginUIForgetPassword::PasswordTipsTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, PasswordInputTextBox) == 0x000460, "Member 'UPCCnLoginUIForgetPassword::PasswordInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, EyeCheckBox) == 0x000468, "Member 'UPCCnLoginUIForgetPassword::EyeCheckBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, RePasswordInputTextBox) == 0x000470, "Member 'UPCCnLoginUIForgetPassword::RePasswordInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, ReEyeCheckBox) == 0x000478, "Member 'UPCCnLoginUIForgetPassword::ReEyeCheckBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, CommitButton) == 0x000480, "Member 'UPCCnLoginUIForgetPassword::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIForgetPassword, CommitButtonTextBlock) == 0x000488, "Member 'UPCCnLoginUIForgetPassword::CommitButtonTextBlock' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIPassword
// 0x0130 (0x0528 - 0x03F8)
class UPCCnLoginUIPassword final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                QrCodeButton;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImage;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextBox;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextBox;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              EyeCheckBox;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CodeLoginButton;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CodeLoginButtonTextBlock;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ForgetPasswordButton;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ForgetPasswordButtonTextBlock;                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              CheckBox;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         AgreementRichTextBlock;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdAccountWidget;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox1;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox2;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ThirdLoginBox3;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin1;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin2;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ThirdLogin3;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 SwitchLoginIcon;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x70];                                     // 0x04B8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AgreementUICloseCallback(const bool Check);
	void AgreementUICloseToQrCallback(const bool Check);
	void OnCheckedButton(bool checked);
	void OnCloseButton();
	void OnCodeLoginButton();
	void OnCommitButton();
	void OnForgetPasswordButton();
	void OnQrCodeButton();
	void OnThirdDelegate(bool bRes);
	void OnThirdLoginButton(int32 Index_0, bool ClickedByUser);
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPasswordCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCCnLoginUIPassword">();
	}
	static class UPCCnLoginUIPassword* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCCnLoginUIPassword>();
	}
};
static_assert(alignof(UPCCnLoginUIPassword) == 0x000008, "Wrong alignment on UPCCnLoginUIPassword");
static_assert(sizeof(UPCCnLoginUIPassword) == 0x000528, "Wrong size on UPCCnLoginUIPassword");
static_assert(offsetof(UPCCnLoginUIPassword, OverlayImage) == 0x0003F8, "Member 'UPCCnLoginUIPassword::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, BackgroundImage) == 0x000400, "Member 'UPCCnLoginUIPassword::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, QrCodeButton) == 0x000408, "Member 'UPCCnLoginUIPassword::QrCodeButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CloseButton) == 0x000410, "Member 'UPCCnLoginUIPassword::CloseButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, LogoImage) == 0x000418, "Member 'UPCCnLoginUIPassword::LogoImage' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, AccountInputTextBox) == 0x000420, "Member 'UPCCnLoginUIPassword::AccountInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, PasswordInputTextBox) == 0x000428, "Member 'UPCCnLoginUIPassword::PasswordInputTextBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, EyeCheckBox) == 0x000430, "Member 'UPCCnLoginUIPassword::EyeCheckBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CodeLoginButton) == 0x000438, "Member 'UPCCnLoginUIPassword::CodeLoginButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CodeLoginButtonTextBlock) == 0x000440, "Member 'UPCCnLoginUIPassword::CodeLoginButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ForgetPasswordButton) == 0x000448, "Member 'UPCCnLoginUIPassword::ForgetPasswordButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ForgetPasswordButtonTextBlock) == 0x000450, "Member 'UPCCnLoginUIPassword::ForgetPasswordButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CommitButton) == 0x000458, "Member 'UPCCnLoginUIPassword::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CommitButtonTextBlock) == 0x000460, "Member 'UPCCnLoginUIPassword::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, CheckBox) == 0x000468, "Member 'UPCCnLoginUIPassword::CheckBox' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, AgreementRichTextBlock) == 0x000470, "Member 'UPCCnLoginUIPassword::AgreementRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdAccountWidget) == 0x000478, "Member 'UPCCnLoginUIPassword::ThirdAccountWidget' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLoginBox1) == 0x000480, "Member 'UPCCnLoginUIPassword::ThirdLoginBox1' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLoginBox2) == 0x000488, "Member 'UPCCnLoginUIPassword::ThirdLoginBox2' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLoginBox3) == 0x000490, "Member 'UPCCnLoginUIPassword::ThirdLoginBox3' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLogin1) == 0x000498, "Member 'UPCCnLoginUIPassword::ThirdLogin1' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLogin2) == 0x0004A0, "Member 'UPCCnLoginUIPassword::ThirdLogin2' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, ThirdLogin3) == 0x0004A8, "Member 'UPCCnLoginUIPassword::ThirdLogin3' has a wrong offset!");
static_assert(offsetof(UPCCnLoginUIPassword, SwitchLoginIcon) == 0x0004B0, "Member 'UPCCnLoginUIPassword::SwitchLoginIcon' has a wrong offset!");

// Class PaperSDKCross.PCCnLoginUIQr
// 0x00C8 (0x04C0 - 0x03F8)
class UPCCnLoginUIQr final : public UPSLoginUIBaseUserWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                AccountLoginButton;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PaperQrBtn;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                TapTapQrBtn;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImage;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPSdkPcCnQrCodeWidget*                  QrCodeWidget;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPSdkPcCnQrCodeWidget*                  TapTapQrCodeWidget;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        QrWidgetSwitcher;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 QrTabBkImage;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         QrTabHBox;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 SwitchLoginIcon;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
