#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperOverlayMaterial

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "PaperOverlayMaterial_structs.hpp"


namespace SDK
{

// Class PaperOverlayMaterial.OverlayMaterialBlueprintFunction
// 0x0000 (0x0028 - 0x0028)
class UOverlayMaterialBlueprintFunction final : public UBlueprintFunctionLibrary
{
public:
	static void X6SetActorEffect(class UObject* WorldContextObject, class AActor* InActor, const TMap<class FName, float>& ScalarParams, const TMap<class FName, struct FVector>& VectorParams);
	static void X6SetActorEffectEx(class UObject* WorldContextObject, class AActor* InActor, const TMap<class FName, float>& ScalarParams, const TMap<class FName, struct FVector>& VectorParams, const TArray<int32>& IgnoredSlots);
	static void X6SetComponentEffect(class UObject* WorldContextObject, class UPrimitiveComponent* InComponent, const TMap<class FName, float>& ScalarParams, const TMap<class FName, struct FVector>& VectorParams);
	static void X6SetComponentEffectEx(class UObject* WorldContextObject, class UPrimitiveComponent* InComponent, const TMap<class FName, float>& ScalarParams, const TMap<class FName, struct FVector>& VectorParams, const TArray<int32>& IgnoredSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverlayMaterialBlueprintFunction">();
	}
	static class UOverlayMaterialBlueprintFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverlayMaterialBlueprintFunction>();
	}
};
static_assert(alignof(UOverlayMaterialBlueprintFunction) == 0x000008, "Wrong alignment on UOverlayMaterialBlueprintFunction");
static_assert(sizeof(UOverlayMaterialBlueprintFunction) == 0x000028, "Wrong size on UOverlayMaterialBlueprintFunction");

// Class PaperOverlayMaterial.OverlayMaterialRegistry
// 0x0060 (0x0088 - 0x0028)
class UOverlayMaterialRegistry final : public UObject
{
public:
	TMap<class FString, struct FOverlayMaterialConfig> OverlayMeshs;                                 // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FName>                           StrategySwitchNames;                               // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OverlayMaterialRegistry">();
	}
	static class UOverlayMaterialRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverlayMaterialRegistry>();
	}
};
static_assert(alignof(UOverlayMaterialRegistry) == 0x000008, "Wrong alignment on UOverlayMaterialRegistry");
static_assert(sizeof(UOverlayMaterialRegistry) == 0x000088, "Wrong size on UOverlayMaterialRegistry");
static_assert(offsetof(UOverlayMaterialRegistry, OverlayMeshs) == 0x000028, "Member 'UOverlayMaterialRegistry::OverlayMeshs' has a wrong offset!");
static_assert(offsetof(UOverlayMaterialRegistry, StrategySwitchNames) == 0x000078, "Member 'UOverlayMaterialRegistry::StrategySwitchNames' has a wrong offset!");

}

