#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperOverlayMaterial

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PaperOverlayMaterial.OverlayMaterialBlueprintFunction.X6SetActorEffect
// 0x00B0 (0x00B0 - 0x0000)
struct OverlayMaterialBlueprintFunction_X6SetActorEffect final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ScalarParams;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             VectorParams;                                      // 0x0060(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OverlayMaterialBlueprintFunction_X6SetActorEffect) == 0x000008, "Wrong alignment on OverlayMaterialBlueprintFunction_X6SetActorEffect");
static_assert(sizeof(OverlayMaterialBlueprintFunction_X6SetActorEffect) == 0x0000B0, "Wrong size on OverlayMaterialBlueprintFunction_X6SetActorEffect");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffect, WorldContextObject) == 0x000000, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffect::WorldContextObject' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffect, InActor) == 0x000008, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffect::InActor' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffect, ScalarParams) == 0x000010, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffect::ScalarParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffect, VectorParams) == 0x000060, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffect::VectorParams' has a wrong offset!");

// Function PaperOverlayMaterial.OverlayMaterialBlueprintFunction.X6SetActorEffectEx
// 0x00C0 (0x00C0 - 0x0000)
struct OverlayMaterialBlueprintFunction_X6SetActorEffectEx final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ScalarParams;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             VectorParams;                                      // 0x0060(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 IgnoredSlots;                                      // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx) == 0x000008, "Wrong alignment on OverlayMaterialBlueprintFunction_X6SetActorEffectEx");
static_assert(sizeof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx) == 0x0000C0, "Wrong size on OverlayMaterialBlueprintFunction_X6SetActorEffectEx");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx, WorldContextObject) == 0x000000, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffectEx::WorldContextObject' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx, InActor) == 0x000008, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffectEx::InActor' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx, ScalarParams) == 0x000010, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffectEx::ScalarParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx, VectorParams) == 0x000060, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffectEx::VectorParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetActorEffectEx, IgnoredSlots) == 0x0000B0, "Member 'OverlayMaterialBlueprintFunction_X6SetActorEffectEx::IgnoredSlots' has a wrong offset!");

// Function PaperOverlayMaterial.OverlayMaterialBlueprintFunction.X6SetComponentEffect
// 0x00B0 (0x00B0 - 0x0000)
struct OverlayMaterialBlueprintFunction_X6SetComponentEffect final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    InComponent;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ScalarParams;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             VectorParams;                                      // 0x0060(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OverlayMaterialBlueprintFunction_X6SetComponentEffect) == 0x000008, "Wrong alignment on OverlayMaterialBlueprintFunction_X6SetComponentEffect");
static_assert(sizeof(OverlayMaterialBlueprintFunction_X6SetComponentEffect) == 0x0000B0, "Wrong size on OverlayMaterialBlueprintFunction_X6SetComponentEffect");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffect, WorldContextObject) == 0x000000, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffect::WorldContextObject' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffect, InComponent) == 0x000008, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffect::InComponent' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffect, ScalarParams) == 0x000010, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffect::ScalarParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffect, VectorParams) == 0x000060, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffect::VectorParams' has a wrong offset!");

// Function PaperOverlayMaterial.OverlayMaterialBlueprintFunction.X6SetComponentEffectEx
// 0x00C0 (0x00C0 - 0x0000)
struct OverlayMaterialBlueprintFunction_X6SetComponentEffectEx final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    InComponent;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ScalarParams;                                      // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             VectorParams;                                      // 0x0060(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 IgnoredSlots;                                      // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx) == 0x000008, "Wrong alignment on OverlayMaterialBlueprintFunction_X6SetComponentEffectEx");
static_assert(sizeof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx) == 0x0000C0, "Wrong size on OverlayMaterialBlueprintFunction_X6SetComponentEffectEx");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx, WorldContextObject) == 0x000000, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffectEx::WorldContextObject' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx, InComponent) == 0x000008, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffectEx::InComponent' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx, ScalarParams) == 0x000010, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffectEx::ScalarParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx, VectorParams) == 0x000060, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffectEx::VectorParams' has a wrong offset!");
static_assert(offsetof(OverlayMaterialBlueprintFunction_X6SetComponentEffectEx, IgnoredSlots) == 0x0000B0, "Member 'OverlayMaterialBlueprintFunction_X6SetComponentEffectEx::IgnoredSlots' has a wrong offset!");

}

