#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaperSDKCross

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PaperSDKCross.PCCnLoginUIBindMobile.TextBoxInputCodeChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIBindMobile_TextBoxInputCodeChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIBindMobile_TextBoxInputCodeChanged) == 0x000008, "Wrong alignment on PCCnLoginUIBindMobile_TextBoxInputCodeChanged");
static_assert(sizeof(PCCnLoginUIBindMobile_TextBoxInputCodeChanged) == 0x000010, "Wrong size on PCCnLoginUIBindMobile_TextBoxInputCodeChanged");
static_assert(offsetof(PCCnLoginUIBindMobile_TextBoxInputCodeChanged, Text) == 0x000000, "Member 'PCCnLoginUIBindMobile_TextBoxInputCodeChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIBindMobile.TextBoxInputMobileChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIBindMobile_TextBoxInputMobileChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIBindMobile_TextBoxInputMobileChanged) == 0x000008, "Wrong alignment on PCCnLoginUIBindMobile_TextBoxInputMobileChanged");
static_assert(sizeof(PCCnLoginUIBindMobile_TextBoxInputMobileChanged) == 0x000010, "Wrong size on PCCnLoginUIBindMobile_TextBoxInputMobileChanged");
static_assert(offsetof(PCCnLoginUIBindMobile_TextBoxInputMobileChanged, Text) == 0x000000, "Member 'PCCnLoginUIBindMobile_TextBoxInputMobileChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.AgreementUICloseCallback
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUICode_AgreementUICloseCallback final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_AgreementUICloseCallback) == 0x000001, "Wrong alignment on PCCnLoginUICode_AgreementUICloseCallback");
static_assert(sizeof(PCCnLoginUICode_AgreementUICloseCallback) == 0x000001, "Wrong size on PCCnLoginUICode_AgreementUICloseCallback");
static_assert(offsetof(PCCnLoginUICode_AgreementUICloseCallback, Check) == 0x000000, "Member 'PCCnLoginUICode_AgreementUICloseCallback::Check' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.AgreementUICloseToQrCallback
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUICode_AgreementUICloseToQrCallback final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_AgreementUICloseToQrCallback) == 0x000001, "Wrong alignment on PCCnLoginUICode_AgreementUICloseToQrCallback");
static_assert(sizeof(PCCnLoginUICode_AgreementUICloseToQrCallback) == 0x000001, "Wrong size on PCCnLoginUICode_AgreementUICloseToQrCallback");
static_assert(offsetof(PCCnLoginUICode_AgreementUICloseToQrCallback, Check) == 0x000000, "Member 'PCCnLoginUICode_AgreementUICloseToQrCallback::Check' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.OnCheckedButton
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUICode_OnCheckedButton final
{
public:
	bool                                          checked;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_OnCheckedButton) == 0x000001, "Wrong alignment on PCCnLoginUICode_OnCheckedButton");
static_assert(sizeof(PCCnLoginUICode_OnCheckedButton) == 0x000001, "Wrong size on PCCnLoginUICode_OnCheckedButton");
static_assert(offsetof(PCCnLoginUICode_OnCheckedButton, checked) == 0x000000, "Member 'PCCnLoginUICode_OnCheckedButton::checked' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.OnThirdDelegate
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUICode_OnThirdDelegate final
{
public:
	bool                                          bRes;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_OnThirdDelegate) == 0x000001, "Wrong alignment on PCCnLoginUICode_OnThirdDelegate");
static_assert(sizeof(PCCnLoginUICode_OnThirdDelegate) == 0x000001, "Wrong size on PCCnLoginUICode_OnThirdDelegate");
static_assert(offsetof(PCCnLoginUICode_OnThirdDelegate, bRes) == 0x000000, "Member 'PCCnLoginUICode_OnThirdDelegate::bRes' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.OnThirdLoginButton
// 0x0008 (0x0008 - 0x0000)
struct PCCnLoginUICode_OnThirdLoginButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClickedByUser;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUICode_OnThirdLoginButton) == 0x000004, "Wrong alignment on PCCnLoginUICode_OnThirdLoginButton");
static_assert(sizeof(PCCnLoginUICode_OnThirdLoginButton) == 0x000008, "Wrong size on PCCnLoginUICode_OnThirdLoginButton");
static_assert(offsetof(PCCnLoginUICode_OnThirdLoginButton, Index_0) == 0x000000, "Member 'PCCnLoginUICode_OnThirdLoginButton::Index_0' has a wrong offset!");
static_assert(offsetof(PCCnLoginUICode_OnThirdLoginButton, ClickedByUser) == 0x000004, "Member 'PCCnLoginUICode_OnThirdLoginButton::ClickedByUser' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.TextBoxInputAccountChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUICode_TextBoxInputAccountChanged final
{
public:
	class FString                                 NewAccount;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_TextBoxInputAccountChanged) == 0x000008, "Wrong alignment on PCCnLoginUICode_TextBoxInputAccountChanged");
static_assert(sizeof(PCCnLoginUICode_TextBoxInputAccountChanged) == 0x000010, "Wrong size on PCCnLoginUICode_TextBoxInputAccountChanged");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputAccountChanged, NewAccount) == 0x000000, "Member 'PCCnLoginUICode_TextBoxInputAccountChanged::NewAccount' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.TextBoxInputAccountCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUICode_TextBoxInputAccountCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUICode_TextBoxInputAccountCommit) == 0x000008, "Wrong alignment on PCCnLoginUICode_TextBoxInputAccountCommit");
static_assert(sizeof(PCCnLoginUICode_TextBoxInputAccountCommit) == 0x000018, "Wrong size on PCCnLoginUICode_TextBoxInputAccountCommit");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputAccountCommit, Text) == 0x000000, "Member 'PCCnLoginUICode_TextBoxInputAccountCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputAccountCommit, Type) == 0x000010, "Member 'PCCnLoginUICode_TextBoxInputAccountCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.TextBoxInputCodeChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUICode_TextBoxInputCodeChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUICode_TextBoxInputCodeChanged) == 0x000008, "Wrong alignment on PCCnLoginUICode_TextBoxInputCodeChanged");
static_assert(sizeof(PCCnLoginUICode_TextBoxInputCodeChanged) == 0x000010, "Wrong size on PCCnLoginUICode_TextBoxInputCodeChanged");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputCodeChanged, Text) == 0x000000, "Member 'PCCnLoginUICode_TextBoxInputCodeChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUICode.TextBoxInputCodeCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUICode_TextBoxInputCodeCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUICode_TextBoxInputCodeCommit) == 0x000008, "Wrong alignment on PCCnLoginUICode_TextBoxInputCodeCommit");
static_assert(sizeof(PCCnLoginUICode_TextBoxInputCodeCommit) == 0x000018, "Wrong size on PCCnLoginUICode_TextBoxInputCodeCommit");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputCodeCommit, Text) == 0x000000, "Member 'PCCnLoginUICode_TextBoxInputCodeCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUICode_TextBoxInputCodeCommit, Type) == 0x000010, "Member 'PCCnLoginUICode_TextBoxInputCodeCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIFast.OnDeleteItemCallback
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIFast_OnDeleteItemCallback final
{
public:
	class FString                                 Account;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIFast_OnDeleteItemCallback) == 0x000008, "Wrong alignment on PCCnLoginUIFast_OnDeleteItemCallback");
static_assert(sizeof(PCCnLoginUIFast_OnDeleteItemCallback) == 0x000010, "Wrong size on PCCnLoginUIFast_OnDeleteItemCallback");
static_assert(offsetof(PCCnLoginUIFast_OnDeleteItemCallback, Account) == 0x000000, "Member 'PCCnLoginUIFast_OnDeleteItemCallback::Account' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIFast.OnFocusItemChangeCallback
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIFast_OnFocusItemChangeCallback final
{
public:
	class FString                                 Account;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Focused;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIFast_OnFocusItemChangeCallback) == 0x000008, "Wrong alignment on PCCnLoginUIFast_OnFocusItemChangeCallback");
static_assert(sizeof(PCCnLoginUIFast_OnFocusItemChangeCallback) == 0x000018, "Wrong size on PCCnLoginUIFast_OnFocusItemChangeCallback");
static_assert(offsetof(PCCnLoginUIFast_OnFocusItemChangeCallback, Account) == 0x000000, "Member 'PCCnLoginUIFast_OnFocusItemChangeCallback::Account' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIFast_OnFocusItemChangeCallback, Focused) == 0x000010, "Member 'PCCnLoginUIFast_OnFocusItemChangeCallback::Focused' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIFast.OnSelectItemCallback
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIFast_OnSelectItemCallback final
{
public:
	class FString                                 Account;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIFast_OnSelectItemCallback) == 0x000008, "Wrong alignment on PCCnLoginUIFast_OnSelectItemCallback");
static_assert(sizeof(PCCnLoginUIFast_OnSelectItemCallback) == 0x000010, "Wrong size on PCCnLoginUIFast_OnSelectItemCallback");
static_assert(offsetof(PCCnLoginUIFast_OnSelectItemCallback, Account) == 0x000000, "Member 'PCCnLoginUIFast_OnSelectItemCallback::Account' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIFastItem.OnFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUIFastItem_OnFocusChanged final
{
public:
	bool                                          HasFocus;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIFastItem_OnFocusChanged) == 0x000001, "Wrong alignment on PCCnLoginUIFastItem_OnFocusChanged");
static_assert(sizeof(PCCnLoginUIFastItem_OnFocusChanged) == 0x000001, "Wrong size on PCCnLoginUIFastItem_OnFocusChanged");
static_assert(offsetof(PCCnLoginUIFastItem_OnFocusChanged, HasFocus) == 0x000000, "Member 'PCCnLoginUIFastItem_OnFocusChanged::HasFocus' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputAccountChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputAccountChanged final
{
public:
	class FString                                 NewAccount;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputAccountChanged) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputAccountChanged");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputAccountChanged) == 0x000010, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputAccountChanged");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputAccountChanged, NewAccount) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputAccountChanged::NewAccount' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputAccountCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputAccountCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputAccountCommit) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputAccountCommit");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputAccountCommit) == 0x000018, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputAccountCommit");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputAccountCommit, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputAccountCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputAccountCommit, Type) == 0x000010, "Member 'PCCnLoginUIForgetPassword_TextBoxInputAccountCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputCodeChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputCodeChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputCodeChanged) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputCodeChanged");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputCodeChanged) == 0x000010, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputCodeChanged");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputCodeChanged, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputCodeChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputCodeCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputCodeCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputCodeCommit) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputCodeCommit");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputCodeCommit) == 0x000018, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputCodeCommit");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputCodeCommit, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputCodeCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputCodeCommit, Type) == 0x000010, "Member 'PCCnLoginUIForgetPassword_TextBoxInputCodeCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputPasswordChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged) == 0x000010, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputPasswordChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputPasswordCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit) == 0x000018, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit, Type) == 0x000010, "Member 'PCCnLoginUIForgetPassword_TextBoxInputPasswordCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputRePasswordChanged
// 0x0010 (0x0010 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged) == 0x000010, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputRePasswordChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIForgetPassword.TextBoxInputRePasswordCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit) == 0x000008, "Wrong alignment on PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit");
static_assert(sizeof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit) == 0x000018, "Wrong size on PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit, Text) == 0x000000, "Member 'PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit, Type) == 0x000010, "Member 'PCCnLoginUIForgetPassword_TextBoxInputRePasswordCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.AgreementUICloseCallback
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUIPassword_AgreementUICloseCallback final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIPassword_AgreementUICloseCallback) == 0x000001, "Wrong alignment on PCCnLoginUIPassword_AgreementUICloseCallback");
static_assert(sizeof(PCCnLoginUIPassword_AgreementUICloseCallback) == 0x000001, "Wrong size on PCCnLoginUIPassword_AgreementUICloseCallback");
static_assert(offsetof(PCCnLoginUIPassword_AgreementUICloseCallback, Check) == 0x000000, "Member 'PCCnLoginUIPassword_AgreementUICloseCallback::Check' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.AgreementUICloseToQrCallback
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUIPassword_AgreementUICloseToQrCallback final
{
public:
	bool                                          Check;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIPassword_AgreementUICloseToQrCallback) == 0x000001, "Wrong alignment on PCCnLoginUIPassword_AgreementUICloseToQrCallback");
static_assert(sizeof(PCCnLoginUIPassword_AgreementUICloseToQrCallback) == 0x000001, "Wrong size on PCCnLoginUIPassword_AgreementUICloseToQrCallback");
static_assert(offsetof(PCCnLoginUIPassword_AgreementUICloseToQrCallback, Check) == 0x000000, "Member 'PCCnLoginUIPassword_AgreementUICloseToQrCallback::Check' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.OnCheckedButton
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUIPassword_OnCheckedButton final
{
public:
	bool                                          checked;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIPassword_OnCheckedButton) == 0x000001, "Wrong alignment on PCCnLoginUIPassword_OnCheckedButton");
static_assert(sizeof(PCCnLoginUIPassword_OnCheckedButton) == 0x000001, "Wrong size on PCCnLoginUIPassword_OnCheckedButton");
static_assert(offsetof(PCCnLoginUIPassword_OnCheckedButton, checked) == 0x000000, "Member 'PCCnLoginUIPassword_OnCheckedButton::checked' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.OnThirdDelegate
// 0x0001 (0x0001 - 0x0000)
struct PCCnLoginUIPassword_OnThirdDelegate final
{
public:
	bool                                          bRes;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIPassword_OnThirdDelegate) == 0x000001, "Wrong alignment on PCCnLoginUIPassword_OnThirdDelegate");
static_assert(sizeof(PCCnLoginUIPassword_OnThirdDelegate) == 0x000001, "Wrong size on PCCnLoginUIPassword_OnThirdDelegate");
static_assert(offsetof(PCCnLoginUIPassword_OnThirdDelegate, bRes) == 0x000000, "Member 'PCCnLoginUIPassword_OnThirdDelegate::bRes' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.OnThirdLoginButton
// 0x0008 (0x0008 - 0x0000)
struct PCCnLoginUIPassword_OnThirdLoginButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClickedByUser;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIPassword_OnThirdLoginButton) == 0x000004, "Wrong alignment on PCCnLoginUIPassword_OnThirdLoginButton");
static_assert(sizeof(PCCnLoginUIPassword_OnThirdLoginButton) == 0x000008, "Wrong size on PCCnLoginUIPassword_OnThirdLoginButton");
static_assert(offsetof(PCCnLoginUIPassword_OnThirdLoginButton, Index_0) == 0x000000, "Member 'PCCnLoginUIPassword_OnThirdLoginButton::Index_0' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIPassword_OnThirdLoginButton, ClickedByUser) == 0x000004, "Member 'PCCnLoginUIPassword_OnThirdLoginButton::ClickedByUser' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.TextBoxInputAccountCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIPassword_TextBoxInputAccountCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIPassword_TextBoxInputAccountCommit) == 0x000008, "Wrong alignment on PCCnLoginUIPassword_TextBoxInputAccountCommit");
static_assert(sizeof(PCCnLoginUIPassword_TextBoxInputAccountCommit) == 0x000018, "Wrong size on PCCnLoginUIPassword_TextBoxInputAccountCommit");
static_assert(offsetof(PCCnLoginUIPassword_TextBoxInputAccountCommit, Text) == 0x000000, "Member 'PCCnLoginUIPassword_TextBoxInputAccountCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIPassword_TextBoxInputAccountCommit, Type) == 0x000010, "Member 'PCCnLoginUIPassword_TextBoxInputAccountCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIPassword.TextBoxInputPasswordCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIPassword_TextBoxInputPasswordCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIPassword_TextBoxInputPasswordCommit) == 0x000008, "Wrong alignment on PCCnLoginUIPassword_TextBoxInputPasswordCommit");
static_assert(sizeof(PCCnLoginUIPassword_TextBoxInputPasswordCommit) == 0x000018, "Wrong size on PCCnLoginUIPassword_TextBoxInputPasswordCommit");
static_assert(offsetof(PCCnLoginUIPassword_TextBoxInputPasswordCommit, Text) == 0x000000, "Member 'PCCnLoginUIPassword_TextBoxInputPasswordCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIPassword_TextBoxInputPasswordCommit, Type) == 0x000010, "Member 'PCCnLoginUIPassword_TextBoxInputPasswordCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnCommonErrorPageRefreshButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnCommonErrorPageRefreshButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnCommonErrorPageRefreshButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnCommonErrorPageRefreshButton");
static_assert(sizeof(PCCnLoginUIQr_OnCommonErrorPageRefreshButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnCommonErrorPageRefreshButton");
static_assert(offsetof(PCCnLoginUIQr_OnCommonErrorPageRefreshButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnCommonErrorPageRefreshButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnExpirePageRefreshButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnExpirePageRefreshButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnExpirePageRefreshButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnExpirePageRefreshButton");
static_assert(sizeof(PCCnLoginUIQr_OnExpirePageRefreshButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnExpirePageRefreshButton");
static_assert(offsetof(PCCnLoginUIQr_OnExpirePageRefreshButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnExpirePageRefreshButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnGetFailedPageRetryButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnGetFailedPageRetryButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnGetFailedPageRetryButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnGetFailedPageRetryButton");
static_assert(sizeof(PCCnLoginUIQr_OnGetFailedPageRetryButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnGetFailedPageRetryButton");
static_assert(offsetof(PCCnLoginUIQr_OnGetFailedPageRetryButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnGetFailedPageRetryButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnInvalidPageRefreshButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnInvalidPageRefreshButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnInvalidPageRefreshButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnInvalidPageRefreshButton");
static_assert(sizeof(PCCnLoginUIQr_OnInvalidPageRefreshButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnInvalidPageRefreshButton");
static_assert(offsetof(PCCnLoginUIQr_OnInvalidPageRefreshButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnInvalidPageRefreshButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnNotSupportPageRetryButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnNotSupportPageRetryButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnNotSupportPageRetryButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnNotSupportPageRetryButton");
static_assert(sizeof(PCCnLoginUIQr_OnNotSupportPageRetryButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnNotSupportPageRetryButton");
static_assert(offsetof(PCCnLoginUIQr_OnNotSupportPageRetryButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnNotSupportPageRetryButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIQr.OnScanSuccessfulPageCancelButton
// 0x0004 (0x0004 - 0x0000)
struct PCCnLoginUIQr_OnScanSuccessfulPageCancelButton final
{
public:
	int32                                         QrType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCCnLoginUIQr_OnScanSuccessfulPageCancelButton) == 0x000004, "Wrong alignment on PCCnLoginUIQr_OnScanSuccessfulPageCancelButton");
static_assert(sizeof(PCCnLoginUIQr_OnScanSuccessfulPageCancelButton) == 0x000004, "Wrong size on PCCnLoginUIQr_OnScanSuccessfulPageCancelButton");
static_assert(offsetof(PCCnLoginUIQr_OnScanSuccessfulPageCancelButton, QrType) == 0x000000, "Member 'PCCnLoginUIQr_OnScanSuccessfulPageCancelButton::QrType' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIRealNameFillOut.TextBoxInputIdCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit) == 0x000008, "Wrong alignment on PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit");
static_assert(sizeof(PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit) == 0x000018, "Wrong size on PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit");
static_assert(offsetof(PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit, Text) == 0x000000, "Member 'PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit, Type) == 0x000010, "Member 'PCCnLoginUIRealNameFillOut_TextBoxInputIdCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCCnLoginUIRealNameFillOut.TextBoxInputNameCommit
// 0x0018 (0x0018 - 0x0000)
struct PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   Type;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit) == 0x000008, "Wrong alignment on PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit");
static_assert(sizeof(PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit) == 0x000018, "Wrong size on PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit");
static_assert(offsetof(PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit, Text) == 0x000000, "Member 'PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit::Text' has a wrong offset!");
static_assert(offsetof(PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit, Type) == 0x000010, "Member 'PCCnLoginUIRealNameFillOut_TextBoxInputNameCommit::Type' has a wrong offset!");

// Function PaperSDKCross.PCOverseasRealNameBrowser.HandleBeforePopup
// 0x0020 (0x0020 - 0x0000)
struct PCOverseasRealNameBrowser_HandleBeforePopup final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Frame;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCOverseasRealNameBrowser_HandleBeforePopup) == 0x000008, "Wrong alignment on PCOverseasRealNameBrowser_HandleBeforePopup");
static_assert(sizeof(PCOverseasRealNameBrowser_HandleBeforePopup) == 0x000020, "Wrong size on PCOverseasRealNameBrowser_HandleBeforePopup");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleBeforePopup, URL) == 0x000000, "Member 'PCOverseasRealNameBrowser_HandleBeforePopup::URL' has a wrong offset!");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleBeforePopup, Frame) == 0x000010, "Member 'PCOverseasRealNameBrowser_HandleBeforePopup::Frame' has a wrong offset!");

// Function PaperSDKCross.PCOverseasRealNameBrowser.HandleConsoleMessage
// 0x0028 (0x0028 - 0x0000)
struct PCOverseasRealNameBrowser_HandleConsoleMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Source;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Line;                                              // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCOverseasRealNameBrowser_HandleConsoleMessage) == 0x000008, "Wrong alignment on PCOverseasRealNameBrowser_HandleConsoleMessage");
static_assert(sizeof(PCOverseasRealNameBrowser_HandleConsoleMessage) == 0x000028, "Wrong size on PCOverseasRealNameBrowser_HandleConsoleMessage");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleConsoleMessage, Message) == 0x000000, "Member 'PCOverseasRealNameBrowser_HandleConsoleMessage::Message' has a wrong offset!");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleConsoleMessage, Source) == 0x000010, "Member 'PCOverseasRealNameBrowser_HandleConsoleMessage::Source' has a wrong offset!");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleConsoleMessage, Line) == 0x000020, "Member 'PCOverseasRealNameBrowser_HandleConsoleMessage::Line' has a wrong offset!");

// Function PaperSDKCross.PCOverseasRealNameBrowser.HandleUrlChanged
// 0x0010 (0x0010 - 0x0000)
struct PCOverseasRealNameBrowser_HandleUrlChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCOverseasRealNameBrowser_HandleUrlChanged) == 0x000008, "Wrong alignment on PCOverseasRealNameBrowser_HandleUrlChanged");
static_assert(sizeof(PCOverseasRealNameBrowser_HandleUrlChanged) == 0x000010, "Wrong size on PCOverseasRealNameBrowser_HandleUrlChanged");
static_assert(offsetof(PCOverseasRealNameBrowser_HandleUrlChanged, Text) == 0x000000, "Member 'PCOverseasRealNameBrowser_HandleUrlChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCOverseasRealNameBrowser.OnCloseButton
// 0x0018 (0x0018 - 0x0000)
struct PCOverseasRealNameBrowser_OnCloseButton final
{
public:
	bool                                          CloseType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCOverseasRealNameBrowser_OnCloseButton) == 0x000008, "Wrong alignment on PCOverseasRealNameBrowser_OnCloseButton");
static_assert(sizeof(PCOverseasRealNameBrowser_OnCloseButton) == 0x000018, "Wrong size on PCOverseasRealNameBrowser_OnCloseButton");
static_assert(offsetof(PCOverseasRealNameBrowser_OnCloseButton, CloseType) == 0x000000, "Member 'PCOverseasRealNameBrowser_OnCloseButton::CloseType' has a wrong offset!");
static_assert(offsetof(PCOverseasRealNameBrowser_OnCloseButton, msg) == 0x000008, "Member 'PCOverseasRealNameBrowser_OnCloseButton::msg' has a wrong offset!");

// Function PaperSDKCross.PCThridLoginUIBrowser.HandleBeforePopup
// 0x0020 (0x0020 - 0x0000)
struct PCThridLoginUIBrowser_HandleBeforePopup final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Frame;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCThridLoginUIBrowser_HandleBeforePopup) == 0x000008, "Wrong alignment on PCThridLoginUIBrowser_HandleBeforePopup");
static_assert(sizeof(PCThridLoginUIBrowser_HandleBeforePopup) == 0x000020, "Wrong size on PCThridLoginUIBrowser_HandleBeforePopup");
static_assert(offsetof(PCThridLoginUIBrowser_HandleBeforePopup, URL) == 0x000000, "Member 'PCThridLoginUIBrowser_HandleBeforePopup::URL' has a wrong offset!");
static_assert(offsetof(PCThridLoginUIBrowser_HandleBeforePopup, Frame) == 0x000010, "Member 'PCThridLoginUIBrowser_HandleBeforePopup::Frame' has a wrong offset!");

// Function PaperSDKCross.PCThridLoginUIBrowser.HandleConsoleMessage
// 0x0028 (0x0028 - 0x0000)
struct PCThridLoginUIBrowser_HandleConsoleMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Source;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Line;                                              // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PCThridLoginUIBrowser_HandleConsoleMessage) == 0x000008, "Wrong alignment on PCThridLoginUIBrowser_HandleConsoleMessage");
static_assert(sizeof(PCThridLoginUIBrowser_HandleConsoleMessage) == 0x000028, "Wrong size on PCThridLoginUIBrowser_HandleConsoleMessage");
static_assert(offsetof(PCThridLoginUIBrowser_HandleConsoleMessage, Message) == 0x000000, "Member 'PCThridLoginUIBrowser_HandleConsoleMessage::Message' has a wrong offset!");
static_assert(offsetof(PCThridLoginUIBrowser_HandleConsoleMessage, Source) == 0x000010, "Member 'PCThridLoginUIBrowser_HandleConsoleMessage::Source' has a wrong offset!");
static_assert(offsetof(PCThridLoginUIBrowser_HandleConsoleMessage, Line) == 0x000020, "Member 'PCThridLoginUIBrowser_HandleConsoleMessage::Line' has a wrong offset!");

// Function PaperSDKCross.PCThridLoginUIBrowser.HandleUrlChanged
// 0x0010 (0x0010 - 0x0000)
struct PCThridLoginUIBrowser_HandleUrlChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCThridLoginUIBrowser_HandleUrlChanged) == 0x000008, "Wrong alignment on PCThridLoginUIBrowser_HandleUrlChanged");
static_assert(sizeof(PCThridLoginUIBrowser_HandleUrlChanged) == 0x000010, "Wrong size on PCThridLoginUIBrowser_HandleUrlChanged");
static_assert(offsetof(PCThridLoginUIBrowser_HandleUrlChanged, Text) == 0x000000, "Member 'PCThridLoginUIBrowser_HandleUrlChanged::Text' has a wrong offset!");

// Function PaperSDKCross.PCThridLoginUIBrowser.OnCloseButton
// 0x0018 (0x0018 - 0x0000)
struct PCThridLoginUIBrowser_OnCloseButton final
{
public:
	int32                                         CloseType;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PCThridLoginUIBrowser_OnCloseButton) == 0x000008, "Wrong alignment on PCThridLoginUIBrowser_OnCloseButton");
static_assert(sizeof(PCThridLoginUIBrowser_OnCloseButton) == 0x000018, "Wrong size on PCThridLoginUIBrowser_OnCloseButton");
static_assert(offsetof(PCThridLoginUIBrowser_OnCloseButton, CloseType) == 0x000000, "Member 'PCThridLoginUIBrowser_OnCloseButton::CloseType' has a wrong offset!");
static_assert(offsetof(PCThridLoginUIBrowser_OnCloseButton, msg) == 0x000008, "Member 'PCThridLoginUIBrowser_OnCloseButton::msg' has a wrong offset!");

// Function PaperSDKCross.PS5Button.SetButtonText
// 0x0010 (0x0010 - 0x0000)
struct PS5Button_SetButtonText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5Button_SetButtonText) == 0x000008, "Wrong alignment on PS5Button_SetButtonText");
static_assert(sizeof(PS5Button_SetButtonText) == 0x000010, "Wrong size on PS5Button_SetButtonText");
static_assert(offsetof(PS5Button_SetButtonText, Text) == 0x000000, "Member 'PS5Button_SetButtonText::Text' has a wrong offset!");

// Function PaperSDKCross.PS5Button.SetTextColor
// 0x0010 (0x0010 - 0x0000)
struct PS5Button_SetTextColor final
{
public:
	class FString                                 Color;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5Button_SetTextColor) == 0x000008, "Wrong alignment on PS5Button_SetTextColor");
static_assert(sizeof(PS5Button_SetTextColor) == 0x000010, "Wrong size on PS5Button_SetTextColor");
static_assert(offsetof(PS5Button_SetTextColor, Color) == 0x000000, "Member 'PS5Button_SetTextColor::Color' has a wrong offset!");

// Function PaperSDKCross.PS5Button.SetTextFont
// 0x0018 (0x0018 - 0x0000)
struct PS5Button_SetTextFont final
{
public:
	class FString                                 FaceName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PS5Button_SetTextFont) == 0x000008, "Wrong alignment on PS5Button_SetTextFont");
static_assert(sizeof(PS5Button_SetTextFont) == 0x000018, "Wrong size on PS5Button_SetTextFont");
static_assert(offsetof(PS5Button_SetTextFont, FaceName) == 0x000000, "Member 'PS5Button_SetTextFont::FaceName' has a wrong offset!");
static_assert(offsetof(PS5Button_SetTextFont, FontSize) == 0x000010, "Member 'PS5Button_SetTextFont::FontSize' has a wrong offset!");

// Function PaperSDKCross.PS5LoginUIBase.OnGamepadButton
// 0x0040 (0x0040 - 0x0000)
struct PS5LoginUIBase_OnGamepadButton final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5LoginUIBase_OnGamepadButton) == 0x000008, "Wrong alignment on PS5LoginUIBase_OnGamepadButton");
static_assert(sizeof(PS5LoginUIBase_OnGamepadButton) == 0x000040, "Wrong size on PS5LoginUIBase_OnGamepadButton");
static_assert(offsetof(PS5LoginUIBase_OnGamepadButton, KeyEvent) == 0x000000, "Member 'PS5LoginUIBase_OnGamepadButton::KeyEvent' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton1AddedToFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton1AddedToFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton1RemovedFromFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton1RemovedFromFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton2AddedToFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton2AddedToFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton2RemovedFromFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton2RemovedFromFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton3AddedToFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton3AddedToFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton3RemovedFromFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton3RemovedFromFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton4AddedToFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton4AddedToFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCheckBoxButton4RemovedFromFocus
// 0x0008 (0x0008 - 0x0000)
struct PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus final
{
public:
	const class UPS5Button*                       Button;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus) == 0x000008, "Wrong alignment on PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus");
static_assert(sizeof(PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus) == 0x000008, "Wrong size on PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus");
static_assert(offsetof(PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus, Button) == 0x000000, "Member 'PS5CnLoginUIMain_KrOnCheckBoxButton4RemovedFromFocus::Button' has a wrong offset!");

// Function PaperSDKCross.PS5CnLoginUIMain.KrOnCreateAccountBtnAddedToFocus
// 0x0008 (0x0008 - 0x0000)
