#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartClothMeshInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PartClothMeshInfo.PartClothMeshInfo
// 0x0038 (0x0038 - 0x0000)
struct FPartClothMeshInfo final
{
public:
	class FName                                   part_11_F8575DC04EFEFC9B882BFEAB88C3399E;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         cloth_id_9_199A68B146969C7979B9C29819C08A59;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           mesh_13_5B6ECF494DAF731B250C0290ECBC7316;          // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FPartClothMeshInfo) == 0x000008, "Wrong alignment on FPartClothMeshInfo");
static_assert(sizeof(FPartClothMeshInfo) == 0x000038, "Wrong size on FPartClothMeshInfo");
static_assert(offsetof(FPartClothMeshInfo, part_11_F8575DC04EFEFC9B882BFEAB88C3399E) == 0x000000, "Member 'FPartClothMeshInfo::part_11_F8575DC04EFEFC9B882BFEAB88C3399E' has a wrong offset!");
static_assert(offsetof(FPartClothMeshInfo, cloth_id_9_199A68B146969C7979B9C29819C08A59) == 0x000008, "Member 'FPartClothMeshInfo::cloth_id_9_199A68B146969C7979B9C29819C08A59' has a wrong offset!");
static_assert(offsetof(FPartClothMeshInfo, mesh_13_5B6ECF494DAF731B250C0290ECBC7316) == 0x000010, "Member 'FPartClothMeshInfo::mesh_13_5B6ECF494DAF731B250C0290ECBC7316' has a wrong offset!");

}

