#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG_SplineMesh_MulArray

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SplineMeshInsertData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.AddHISMComponent
// 0x0130 (0x0130 - 0x0000)
struct PCG_SplineMesh_MulArray_C_AddHISMComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_1;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_HISM_Template_Base_C*               CallFunc_AddComponentByClass_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_2;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_3;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_4;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_5;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_AddHISMComponent) == 0x000010, "Wrong alignment on PCG_SplineMesh_MulArray_C_AddHISMComponent");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_AddHISMComponent) == 0x000130, "Wrong size on PCG_SplineMesh_MulArray_C_AddHISMComponent");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, Temp_struct_Variable) == 0x000010, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000078, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000090, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_1) == 0x0000F0, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponentByClass_ReturnValue) == 0x0000F8, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_2) == 0x000100, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_3) == 0x000108, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_4) == 0x000110, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_5) == 0x000118, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddHISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000120, "Member 'PCG_SplineMesh_MulArray_C_AddHISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.AddInstanceAlongSpline
// 0x02F0 (0x02F0 - 0x0000)
struct PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline final
{
public:
	double                                        Mesh_Length;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Add_Mesh;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Add_Mesh_Material;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstanceComponent;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_0;                                           // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Forward;                                           // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSidePivot_0;                                     // 0x0051(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0058(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UMaterialInterface*>             Add_Material_All;                                  // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          MeshFlip;                                          // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromY_ReturnValue;                 // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESplineMeshAxis                               Temp_byte_Variable;                                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInstancePaperCustomData_ReturnValue;   // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline) == 0x000010, "Wrong alignment on PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline) == 0x0002F0, "Wrong size on PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Mesh_Length) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Mesh_Length' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Add_Mesh) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Add_Mesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Add_Mesh_Material) == 0x000010, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Add_Mesh_Material' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, InstanceComponent) == 0x000018, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::InstanceComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Offset) == 0x000020, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Offset' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Scale_0) == 0x000038, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Scale_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Forward) == 0x000050, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Forward' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, IsSidePivot_0) == 0x000051, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::IsSidePivot_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Rotation) == 0x000058, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Rotation' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Add_Material_All) == 0x000070, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Add_Material_All' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, MeshFlip) == 0x000080, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::MeshFlip' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_SelectVector_ReturnValue) == 0x0000A0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_SelectVector_ReturnValue_1) == 0x0000E8, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Divide_VectorVector_ReturnValue) == 0x000100, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_MakeRotFromZ_ReturnValue) == 0x000118, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_SelectVector_ReturnValue_2) == 0x000130, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_MakeRotFromY_ReturnValue) == 0x000148, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_MakeRotFromY_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000160, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, Temp_byte_Variable) == 0x000178, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, K2Node_Select_Default) == 0x000180, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_ComposeRotators_ReturnValue) == 0x000198, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x0001B0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_ClampVectorSize_ReturnValue) == 0x000230, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_AddInstance_ReturnValue) == 0x000248, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_SetInstancePaperCustomData_ReturnValue) == 0x00024C, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_SetInstancePaperCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000250, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000268, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000280, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_ClampVectorSize_ReturnValue_1) == 0x000298, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x0002B0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002C8, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002E0, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0002E4, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0002E8, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0002EC, "Member 'PCG_SplineMesh_MulArray_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.AddInstancedComponent
// 0x0018 (0x0018 - 0x0000)
struct PCG_SplineMesh_MulArray_C_AddInstancedComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddHISMComponent_InstancedComponent;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_AddInstancedComponent) == 0x000008, "Wrong alignment on PCG_SplineMesh_MulArray_C_AddInstancedComponent");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_AddInstancedComponent) == 0x000018, "Wrong size on PCG_SplineMesh_MulArray_C_AddInstancedComponent");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstancedComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_AddInstancedComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstancedComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_AddInstancedComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddInstancedComponent, CallFunc_AddHISMComponent_InstancedComponent) == 0x000010, "Member 'PCG_SplineMesh_MulArray_C_AddInstancedComponent::CallFunc_AddHISMComponent_InstancedComponent' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.AddISMComponent
// 0x00D0 (0x00D0 - 0x0000)
struct PCG_SplineMesh_MulArray_C_AddISMComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Instance_Template_Base_C*           CallFunc_AddComponentByClass_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_2;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_3;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_4;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_5;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_AddISMComponent) == 0x000010, "Wrong alignment on PCG_SplineMesh_MulArray_C_AddISMComponent");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_AddISMComponent) == 0x0000D0, "Wrong size on PCG_SplineMesh_MulArray_C_AddISMComponent");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000010, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponentByClass_ReturnValue) == 0x000098, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_1) == 0x0000A0, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_2) == 0x0000A8, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_3) == 0x0000B0, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_4) == 0x0000B8, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_5) == 0x0000C0, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000C8, "Member 'PCG_SplineMesh_MulArray_C_AddISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.AddMeshAlongSpline
// 0x0450 (0x0450 - 0x0000)
struct PCG_SplineMesh_MulArray_C_AddMeshAlongSpline final
{
public:
	double                                        Mesh_Length;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Add_Mesh;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Add_Mesh_Material;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineActor_0;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale_0;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Forward;                                           // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             Add_Material_All;                                  // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue; // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x00E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_2;                            // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_3;                            // 0x01C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_3;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_4;                            // 0x0290(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_4;               // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_SplineMesh_Template_Base_C*         CallFunc_AddComponentByClass_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_5;                            // 0x0310(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_5;               // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0378(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline) == 0x000010, "Wrong alignment on PCG_SplineMesh_MulArray_C_AddMeshAlongSpline");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline) == 0x000450, "Wrong size on PCG_SplineMesh_MulArray_C_AddMeshAlongSpline");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Mesh_Length) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Mesh_Length' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Add_Mesh) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Add_Mesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Add_Mesh_Material) == 0x000010, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Add_Mesh_Material' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, SplineActor_0) == 0x000018, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::SplineActor_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Offset) == 0x000020, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Offset' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Scale_0) == 0x000038, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Scale_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Forward) == 0x000040, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Forward' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Add_Material_All) == 0x000048, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Add_Material_All' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable) == 0x000060, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue) == 0x0000C0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable_1) == 0x0000E0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue) == 0x000140, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable_2) == 0x000150, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue_1) == 0x0001B0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue_2) == 0x0001B8, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable_3) == 0x0001C0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000220, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Normal_ReturnValue) == 0x000238, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue_3) == 0x000250, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Normal_ReturnValue_1) == 0x000258, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Dot_VectorVector_ReturnValue) == 0x000270, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_DegAcos_ReturnValue) == 0x000278, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000280, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000281, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_bool_Variable) == 0x000282, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_BooleanAND_ReturnValue) == 0x000283, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_bool_Variable_1) == 0x000284, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, K2Node_Select_Default) == 0x000288, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable_4) == 0x000290, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, K2Node_Select_Default_1) == 0x0002F0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue_4) == 0x0002F8, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponentByClass_ReturnValue) == 0x000300, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, Temp_struct_Variable_5) == 0x000310, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_AddComponent_ReturnValue_5) == 0x000370, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000378, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000390, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_ClampVectorSize_ReturnValue) == 0x0003A8, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_ClampVectorSize_ReturnValue_1) == 0x0003C0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0003D8, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x0003F0, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x000408, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000420, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000438, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x00043C, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000440, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000444, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_AddMeshAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000448, "Member 'PCG_SplineMesh_MulArray_C_AddMeshAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.CustomTemplateMap
// 0x0010 (0x0010 - 0x0000)
struct PCG_SplineMesh_MulArray_C_CustomTemplateMap final
{
public:
	class UClass*                                 CallFunc_Get_Instance_CustomTemplate_ISM_Template; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Get_Instance_CustomTemplate_HISM_Template; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_CustomTemplateMap) == 0x000008, "Wrong alignment on PCG_SplineMesh_MulArray_C_CustomTemplateMap");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_CustomTemplateMap) == 0x000010, "Wrong size on PCG_SplineMesh_MulArray_C_CustomTemplateMap");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_CustomTemplateMap, CallFunc_Get_Instance_CustomTemplate_ISM_Template) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_CustomTemplateMap::CallFunc_Get_Instance_CustomTemplate_ISM_Template' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_CustomTemplateMap, CallFunc_Get_Instance_CustomTemplate_HISM_Template) == 0x000008, "Member 'PCG_SplineMesh_MulArray_C_CustomTemplateMap::CallFunc_Get_Instance_CustomTemplate_HISM_Template' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.ExecuteUbergraph_PCG_SplineMesh_MulArray
// 0x0004 (0x0004 - 0x0000)
struct PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray) == 0x000004, "Wrong alignment on PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray");
static_assert(sizeof(PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray) == 0x000004, "Wrong size on PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray");
static_assert(offsetof(PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray, EntryPoint) == 0x000000, "Member 'PCG_SplineMesh_MulArray_C_ExecuteUbergraph_PCG_SplineMesh_MulArray::EntryPoint' has a wrong offset!");

// Function PCG_SplineMesh_MulArray.PCG_SplineMesh_MulArray_C.GetMeshLengthByAxis
// 0x00E0 (0x00E0 - 0x0000)
struct PCG_SplineMesh_MulArray_C_GetMeshLengthByAxis final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Scale_0;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MeshLength;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalMeshLength;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0028(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
