#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG_SplineMesh_UE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.AddHISMComponent
// 0x00D0 (0x00D0 - 0x0000)
struct PCG_SplineMesh_UE_C_AddHISMComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_2;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_3;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_4;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* CallFunc_AddComponent_ReturnValue_5;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_AddHISMComponent) == 0x000010, "Wrong alignment on PCG_SplineMesh_UE_C_AddHISMComponent");
static_assert(sizeof(PCG_SplineMesh_UE_C_AddHISMComponent) == 0x0000D0, "Wrong size on PCG_SplineMesh_UE_C_AddHISMComponent");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000010, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_1) == 0x000098, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_2) == 0x0000A0, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_3) == 0x0000A8, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_4) == 0x0000B0, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_AddComponent_ReturnValue_5) == 0x0000B8, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddHISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0000C0, "Member 'PCG_SplineMesh_UE_C_AddHISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.AddInstanceAlongSpline
// 0x01D0 (0x01D0 - 0x0000)
struct PCG_SplineMesh_UE_C_AddInstanceAlongSpline final
{
public:
	double                                        Mesh_Length;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Add_Mesh;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Add_Mesh_Material;                                 // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstanceComponent;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale_0;                                           // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInstancePaperCustomData_ReturnValue;   // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline) == 0x000010, "Wrong alignment on PCG_SplineMesh_UE_C_AddInstanceAlongSpline");
static_assert(sizeof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline) == 0x0001D0, "Wrong size on PCG_SplineMesh_UE_C_AddInstanceAlongSpline");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, Mesh_Length) == 0x000000, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::Mesh_Length' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, Add_Mesh) == 0x000008, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::Add_Mesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, Add_Mesh_Material) == 0x000010, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::Add_Mesh_Material' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, InstanceComponent) == 0x000018, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::InstanceComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, Scale_0) == 0x000020, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::Scale_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000070, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_Divide_VectorVector_ReturnValue) == 0x000088, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_SelectVector_ReturnValue) == 0x0000A0, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_AddInstance_ReturnValue) == 0x000120, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_SetInstancePaperCustomData_ReturnValue) == 0x000124, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_SetInstancePaperCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000128, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000140, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_ClampVectorSize_ReturnValue) == 0x000158, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x000170, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x000188, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_ClampVectorSize_ReturnValue_1) == 0x0001A0, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001B8, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0001BC, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0001C0, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstanceAlongSpline, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x0001C4, "Member 'PCG_SplineMesh_UE_C_AddInstanceAlongSpline::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.AddInstancedComponent
// 0x0018 (0x0018 - 0x0000)
struct PCG_SplineMesh_UE_C_AddInstancedComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddHISMComponent_InstancedComponent;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_AddInstancedComponent) == 0x000008, "Wrong alignment on PCG_SplineMesh_UE_C_AddInstancedComponent");
static_assert(sizeof(PCG_SplineMesh_UE_C_AddInstancedComponent) == 0x000018, "Wrong size on PCG_SplineMesh_UE_C_AddInstancedComponent");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstancedComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_UE_C_AddInstancedComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstancedComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_UE_C_AddInstancedComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddInstancedComponent, CallFunc_AddHISMComponent_InstancedComponent) == 0x000010, "Member 'PCG_SplineMesh_UE_C_AddInstancedComponent::CallFunc_AddHISMComponent_InstancedComponent' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.AddISMComponent
// 0x0120 (0x0120 - 0x0000)
struct PCG_SplineMesh_UE_C_AddISMComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Instanced_Component;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_2;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_3;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_4;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_5;               // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_AddISMComponent) == 0x000010, "Wrong alignment on PCG_SplineMesh_UE_C_AddISMComponent");
static_assert(sizeof(PCG_SplineMesh_UE_C_AddISMComponent) == 0x000120, "Wrong size on PCG_SplineMesh_UE_C_AddISMComponent");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, InstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::InstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, Instanced_Component) == 0x000008, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::Instanced_Component' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, Temp_struct_Variable) == 0x000010, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000078, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000090, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_1) == 0x0000F0, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_2) == 0x0000F8, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_3) == 0x000100, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_4) == 0x000108, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_AddComponent_ReturnValue_5) == 0x000110, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddISMComponent, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000118, "Member 'PCG_SplineMesh_UE_C_AddISMComponent::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.AddSplineMesh
// 0x0410 (0x0410 - 0x0000)
struct PCG_SplineMesh_UE_C_AddSplineMesh final
{
public:
	class UStaticMesh*                            Add_Mesh;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_0;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Length_0;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0080(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_2;                            // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_3;                            // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_3;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_4;                            // 0x01C0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_5;                            // 0x0220(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_4;               // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_5;               // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_6;                            // 0x0290(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_6;               // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_7;                            // 0x0300(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_7;               // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1; // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_AddSplineMesh) == 0x000010, "Wrong alignment on PCG_SplineMesh_UE_C_AddSplineMesh");
static_assert(sizeof(PCG_SplineMesh_UE_C_AddSplineMesh) == 0x000410, "Wrong size on PCG_SplineMesh_UE_C_AddSplineMesh");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Add_Mesh) == 0x000000, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Add_Mesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Material_0) == 0x000008, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Material_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Length_0) == 0x000010, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Length_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable) == 0x000020, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_1) == 0x000080, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue) == 0x0000E0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_1) == 0x0000E8, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_2) == 0x0000F0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_3) == 0x000150, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_2) == 0x0001B0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_3) == 0x0001B8, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_4) == 0x0001C0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_5) == 0x000220, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_4) == 0x000280, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_5) == 0x000288, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_6) == 0x000290, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_6) == 0x0002F0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, Temp_struct_Variable_7) == 0x000300, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_AddComponent_ReturnValue_7) == 0x000360, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_AddComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000368, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000380, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_ClampVectorSize_ReturnValue) == 0x000398, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x0003B0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1) == 0x0003C8, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_ClampVectorSize_ReturnValue_1) == 0x0003E0, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_ClampVectorSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0003F8, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0003FC, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000400, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_AddSplineMesh, CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1) == 0x000404, "Member 'PCG_SplineMesh_UE_C_AddSplineMesh::CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast_1' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.ExecuteUbergraph_PCG_SplineMesh_UE
// 0x0004 (0x0004 - 0x0000)
struct PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE) == 0x000004, "Wrong alignment on PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE");
static_assert(sizeof(PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE) == 0x000004, "Wrong size on PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE");
static_assert(offsetof(PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE, EntryPoint) == 0x000000, "Member 'PCG_SplineMesh_UE_C_ExecuteUbergraph_PCG_SplineMesh_UE::EntryPoint' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.GetMeshLengthByAxis
// 0x00C0 (0x00C0 - 0x0000)
struct PCG_SplineMesh_UE_C_GetMeshLengthByAxis final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MeshLength;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalMeshLength;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0050(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis) == 0x000008, "Wrong alignment on PCG_SplineMesh_UE_C_GetMeshLengthByAxis");
static_assert(sizeof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis) == 0x0000C0, "Wrong size on PCG_SplineMesh_UE_C_GetMeshLengthByAxis");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, StaticMesh) == 0x000000, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::StaticMesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, MeshLength) == 0x000008, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::MeshLength' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, LocalMeshLength) == 0x000010, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::LocalMeshLength' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_GetActorScale3D_ReturnValue) == 0x000020, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_X) == 0x000038, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_Y) == 0x000040, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_Z) == 0x000048, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_GetBoundingBox_ReturnValue) == 0x000050, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_X_1) == 0x0000A0, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_Y_1) == 0x0000A8, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_BreakVector_Z_1) == 0x0000B0, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_GetMeshLengthByAxis, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'PCG_SplineMesh_UE_C_GetMeshLengthByAxis::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.Set InstanceMesh Attrib
// 0x0028 (0x0028 - 0x0000)
struct PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib final
{
public:
	class UInstancedStaticMeshComponent*          InstanceComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            AddMesh;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     AddMesh_Material;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BoundsLength;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib) == 0x000008, "Wrong alignment on PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib");
static_assert(sizeof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib) == 0x000028, "Wrong size on PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib, InstanceComponent) == 0x000000, "Member 'PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib::InstanceComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib, AddMesh) == 0x000008, "Member 'PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib::AddMesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib, AddMesh_Material) == 0x000010, "Member 'PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib::AddMesh_Material' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib, BoundsLength) == 0x000018, "Member 'PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib::BoundsLength' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'PCG_SplineMesh_UE_C_Set_InstanceMesh_Attrib::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.Set SplinMesh Attrib
// 0x0028 (0x0028 - 0x0000)
struct PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib final
{
public:
	class USplineMeshComponent*                   mesh_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Add_Mesh;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Add_Material;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BoundsLength;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib) == 0x000008, "Wrong alignment on PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib");
static_assert(sizeof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib) == 0x000028, "Wrong size on PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib, mesh_0) == 0x000000, "Member 'PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib::mesh_0' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib, Add_Mesh) == 0x000008, "Member 'PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib::Add_Mesh' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib, Add_Material) == 0x000010, "Member 'PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib::Add_Material' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib, BoundsLength) == 0x000018, "Member 'PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib::BoundsLength' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'PCG_SplineMesh_UE_C_Set_SplinMesh_Attrib::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PCG_SplineMesh_UE.PCG_SplineMesh_UE_C.Update Spline Mesh
// 0x04E8 (0x04E8 - 0x0000)
struct PCG_SplineMesh_UE_C_Update_Spline_Mesh final
{
public:
	class UInstancedStaticMeshComponent*          MainInstancedComponent;                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddInstancedComponent_InstancedComponent; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddInstancedComponent_InstancedComponent_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x00D0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult_1;       // 0x01C8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_GetMeshLengthByAxis_MeshLength;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMeshLengthByAxis_MeshLength_1;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMeshLengthByAxis_MeshLength_2;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddInstancedComponent_InstancedComponent_2; // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult_2;       // 0x0360(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_6;           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCG_SplineMesh_UE_C_Update_Spline_Mesh) == 0x000008, "Wrong alignment on PCG_SplineMesh_UE_C_Update_Spline_Mesh");
static_assert(sizeof(PCG_SplineMesh_UE_C_Update_Spline_Mesh) == 0x0004E8, "Wrong size on PCG_SplineMesh_UE_C_Update_Spline_Mesh");
static_assert(offsetof(PCG_SplineMesh_UE_C_Update_Spline_Mesh, MainInstancedComponent) == 0x000000, "Member 'PCG_SplineMesh_UE_C_Update_Spline_Mesh::MainInstancedComponent' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Update_Spline_Mesh, Temp_int_Variable) == 0x000008, "Member 'PCG_SplineMesh_UE_C_Update_Spline_Mesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Update_Spline_Mesh, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PCG_SplineMesh_UE_C_Update_Spline_Mesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCG_SplineMesh_UE_C_Update_Spline_Mesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PCG_SplineMesh_UE_C_Update_Spline_Mesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
