#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGStamp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct PCGStamp.PCGStaticMeshInfoRow
// 0x00A8 (0x00B0 - 0x0008)
struct FPCGStaticMeshInfoRow final : public FTableRowBase
{
public:
	TArray<TSoftObjectPtr<class UMaterialInstance>> LOD0;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> LOD1;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> LOD2;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> LOD3;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> LOD4;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              DiffTex;                                           // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              NormalTex;                                         // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRefreshCustomData;                           // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ForceCustomData;                                   // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGStaticMeshInfoRow) == 0x000008, "Wrong alignment on FPCGStaticMeshInfoRow");
static_assert(sizeof(FPCGStaticMeshInfoRow) == 0x0000B0, "Wrong size on FPCGStaticMeshInfoRow");
static_assert(offsetof(FPCGStaticMeshInfoRow, LOD0) == 0x000008, "Member 'FPCGStaticMeshInfoRow::LOD0' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, LOD1) == 0x000018, "Member 'FPCGStaticMeshInfoRow::LOD1' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, LOD2) == 0x000028, "Member 'FPCGStaticMeshInfoRow::LOD2' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, LOD3) == 0x000038, "Member 'FPCGStaticMeshInfoRow::LOD3' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, LOD4) == 0x000048, "Member 'FPCGStaticMeshInfoRow::LOD4' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, DiffTex) == 0x000058, "Member 'FPCGStaticMeshInfoRow::DiffTex' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, NormalTex) == 0x000080, "Member 'FPCGStaticMeshInfoRow::NormalTex' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, bForceRefreshCustomData) == 0x0000A8, "Member 'FPCGStaticMeshInfoRow::bForceRefreshCustomData' has a wrong offset!");
static_assert(offsetof(FPCGStaticMeshInfoRow, ForceCustomData) == 0x0000AC, "Member 'FPCGStaticMeshInfoRow::ForceCustomData' has a wrong offset!");

}

