#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostProcessHelpBlackActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PostProcessHelpBlackActor.PostProcessHelpBlackActor_C.ExecuteUbergraph_PostProcessHelpBlackActor
// 0x0118 (0x0118 - 0x0000)
struct PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinearColor_IsNearEqual_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinearColor_IsNearEqual_ReturnValue_1;    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_2; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinearColor_IsNearEqual_ReturnValue_2;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_3; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_FadeOutColor;                   // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LinearColor_IsNearEqual_ReturnValue_3;    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor) == 0x000008, "Wrong alignment on PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor");
static_assert(sizeof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor) == 0x000118, "Wrong size on PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, EntryPoint) == 0x000000, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000004, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000030, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_FClamp_ReturnValue_2) == 0x000040, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial) == 0x000048, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_LinearColor_IsNearEqual_ReturnValue) == 0x000050, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_LinearColor_IsNearEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_1) == 0x000058, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000060, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_LinearColor_IsNearEqual_ReturnValue_1) == 0x000071, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_LinearColor_IsNearEqual_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_2) == 0x000078, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000088, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_LinearColor_IsNearEqual_ReturnValue_2) == 0x000098, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_LinearColor_IsNearEqual_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_3) == 0x0000A0, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_GetOrAddPostProcessMaterialInstance_ReturnMaterial_3' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_IsValid_ReturnValue_3) == 0x0000A8, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, K2Node_CustomEvent_FadeOutColor) == 0x0000AC, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::K2Node_CustomEvent_FadeOutColor' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_LinearColor_IsNearEqual_ReturnValue_3) == 0x0000BC, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_LinearColor_IsNearEqual_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000E8, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F0, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000100, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000108, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00010C, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000110, "Member 'PostProcessHelpBlackActor_C_ExecuteUbergraph_PostProcessHelpBlackActor::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function PostProcessHelpBlackActor.PostProcessHelpBlackActor_C.FadeOut
// 0x0010 (0x0010 - 0x0000)
struct PostProcessHelpBlackActor_C_FadeOut final
{
public:
	struct FLinearColor                           FadeOutColor_0;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostProcessHelpBlackActor_C_FadeOut) == 0x000004, "Wrong alignment on PostProcessHelpBlackActor_C_FadeOut");
static_assert(sizeof(PostProcessHelpBlackActor_C_FadeOut) == 0x000010, "Wrong size on PostProcessHelpBlackActor_C_FadeOut");
static_assert(offsetof(PostProcessHelpBlackActor_C_FadeOut, FadeOutColor_0) == 0x000000, "Member 'PostProcessHelpBlackActor_C_FadeOut::FadeOutColor_0' has a wrong offset!");

// Function PostProcessHelpBlackActor.PostProcessHelpBlackActor_C.GetOrAddPostProcessMaterialInstance
// 0x0030 (0x0030 - 0x0000)
struct PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance) == 0x000008, "Wrong alignment on PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance");
static_assert(sizeof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance) == 0x000030, "Wrong size on PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance");
static_assert(offsetof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance, ReturnMaterial) == 0x000000, "Member 'PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance::ReturnMaterial' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance, K2Node_MakeStruct_WeightedBlendable) == 0x000008, "Member 'PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'PostProcessHelpBlackActor_C_GetOrAddPostProcessMaterialInstance::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

