#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostProcessHelpBlackActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PostProcessHelpBlackActor.PostProcessHelpBlackActor_C
// 0x0048 (0x03F0 - 0x03A8)
class APostProcessHelpBlackActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFadeOut;                                        // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFadeIn;                                         // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FadeOutTimerHandle;                                // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeInTimerHandle;                                 // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentGainValue;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FadeOutColor;                                      // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI;                                               // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PostProcessHelpBlackActor(int32 EntryPoint);
	void FadeIn();
	void FadeInAndDestroy();
	void FadeOut(const struct FLinearColor& FadeOutColor_0);
	void GetOrAddPostProcessMaterialInstance(class UMaterialInstanceDynamic** ReturnMaterial);
	void NewFunction();
	void NewFunction_0();
	void NewFunction_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostProcessHelpBlackActor_C">();
	}
	static class APostProcessHelpBlackActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APostProcessHelpBlackActor_C>();
	}
};
static_assert(alignof(APostProcessHelpBlackActor_C) == 0x000008, "Wrong alignment on APostProcessHelpBlackActor_C");
static_assert(sizeof(APostProcessHelpBlackActor_C) == 0x0003F0, "Wrong size on APostProcessHelpBlackActor_C");
static_assert(offsetof(APostProcessHelpBlackActor_C, UberGraphFrame) == 0x0003A8, "Member 'APostProcessHelpBlackActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, PostProcess) == 0x0003B0, "Member 'APostProcessHelpBlackActor_C::PostProcess' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, bIsFadeOut) == 0x0003B8, "Member 'APostProcessHelpBlackActor_C::bIsFadeOut' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, bIsFadeIn) == 0x0003B9, "Member 'APostProcessHelpBlackActor_C::bIsFadeIn' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, FadeOutTimerHandle) == 0x0003C0, "Member 'APostProcessHelpBlackActor_C::FadeOutTimerHandle' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, FadeInTimerHandle) == 0x0003C8, "Member 'APostProcessHelpBlackActor_C::FadeInTimerHandle' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, CurrentGainValue) == 0x0003D0, "Member 'APostProcessHelpBlackActor_C::CurrentGainValue' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, FadeOutColor) == 0x0003D8, "Member 'APostProcessHelpBlackActor_C::FadeOutColor' has a wrong offset!");
static_assert(offsetof(APostProcessHelpBlackActor_C, DMI) == 0x0003E8, "Member 'APostProcessHelpBlackActor_C::DMI' has a wrong offset!");

}

