#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKNetCheck

#include "Basic.hpp"


namespace SDK::Params
{

// Function PSDKNetCheck.PSNetCheckApi.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct PSNetCheckApi_GetInstance final
{
public:
	class UPSNetCheckApi*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSNetCheckApi_GetInstance) == 0x000008, "Wrong alignment on PSNetCheckApi_GetInstance");
static_assert(sizeof(PSNetCheckApi_GetInstance) == 0x000008, "Wrong size on PSNetCheckApi_GetInstance");
static_assert(offsetof(PSNetCheckApi_GetInstance, ReturnValue) == 0x000000, "Member 'PSNetCheckApi_GetInstance::ReturnValue' has a wrong offset!");

// Function PSDKNetCheck.WB_CheckChild.PlayChecingAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_CheckChild_PlayChecingAnimation final
{
public:
	bool                                          bIsStop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WB_CheckChild_PlayChecingAnimation) == 0x000001, "Wrong alignment on WB_CheckChild_PlayChecingAnimation");
static_assert(sizeof(WB_CheckChild_PlayChecingAnimation) == 0x000001, "Wrong size on WB_CheckChild_PlayChecingAnimation");
static_assert(offsetof(WB_CheckChild_PlayChecingAnimation, bIsStop) == 0x000000, "Member 'WB_CheckChild_PlayChecingAnimation::bIsStop' has a wrong offset!");

// Function PSDKNetCheck.WB_CheckChild.PlayResultAnimation
// 0x0001 (0x0001 - 0x0000)
struct WB_CheckChild_PlayResultAnimation final
{
public:
	bool                                          bIsSucceed;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WB_CheckChild_PlayResultAnimation) == 0x000001, "Wrong alignment on WB_CheckChild_PlayResultAnimation");
static_assert(sizeof(WB_CheckChild_PlayResultAnimation) == 0x000001, "Wrong size on WB_CheckChild_PlayResultAnimation");
static_assert(offsetof(WB_CheckChild_PlayResultAnimation, bIsSucceed) == 0x000000, "Member 'WB_CheckChild_PlayResultAnimation::bIsSucceed' has a wrong offset!");

}

