#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKOss

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct PSDKOss.PSOssUploadModel
// 0x0078 (0x0078 - 0x0000)
struct FPSOssUploadModel final
{
public:
	class FString                                 Nid;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelId;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SizeLimited;                                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPSOssUploadModel) == 0x000008, "Wrong alignment on FPSOssUploadModel");
static_assert(sizeof(FPSOssUploadModel) == 0x000078, "Wrong size on FPSOssUploadModel");
static_assert(offsetof(FPSOssUploadModel, Nid) == 0x000000, "Member 'FPSOssUploadModel::Nid' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, Token) == 0x000010, "Member 'FPSOssUploadModel::Token' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, ChannelId) == 0x000020, "Member 'FPSOssUploadModel::ChannelId' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, FilePath) == 0x000030, "Member 'FPSOssUploadModel::FilePath' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, Ext) == 0x000040, "Member 'FPSOssUploadModel::Ext' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, Category) == 0x000050, "Member 'FPSOssUploadModel::Category' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, Filename) == 0x000060, "Member 'FPSOssUploadModel::Filename' has a wrong offset!");
static_assert(offsetof(FPSOssUploadModel, SizeLimited) == 0x000070, "Member 'FPSOssUploadModel::SizeLimited' has a wrong offset!");

}

