#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKChannelSteam

#include "Basic.hpp"

#include "PSDKLogin_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "PSDKBasic_classes.hpp"


namespace SDK
{

// Class PSDKChannelSteam.PSdkLoginSuccessToastSteam
// 0x0020 (0x0310 - 0x02F0)
class UPSdkLoginSuccessToastSteam final : public UUserWidget
{
public:
	class UImage*                                 IconImage;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URichTextBlock*                         AccountRichTextBlock;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBorder*                                Border;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetupOnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginSuccessToastSteam">();
	}
	static class UPSdkLoginSuccessToastSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginSuccessToastSteam>();
	}
};
static_assert(alignof(UPSdkLoginSuccessToastSteam) == 0x000008, "Wrong alignment on UPSdkLoginSuccessToastSteam");
static_assert(sizeof(UPSdkLoginSuccessToastSteam) == 0x000310, "Wrong size on UPSdkLoginSuccessToastSteam");
static_assert(offsetof(UPSdkLoginSuccessToastSteam, IconImage) == 0x0002F0, "Member 'UPSdkLoginSuccessToastSteam::IconImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginSuccessToastSteam, AccountRichTextBlock) == 0x0002F8, "Member 'UPSdkLoginSuccessToastSteam::AccountRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginSuccessToastSteam, Border) == 0x000300, "Member 'UPSdkLoginSuccessToastSteam::Border' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIBaseSteam
// 0x0030 (0x0390 - 0x0360)
class UPSdkLoginUIBaseSteam : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x18];                                     // 0x0360(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UPSdkLoginUIToastTipSteam*              ToastTip;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_380[0x10];                                     // 0x0380(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIBaseSteam">();
	}
	static class UPSdkLoginUIBaseSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIBaseSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIBaseSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIBaseSteam");
static_assert(sizeof(UPSdkLoginUIBaseSteam) == 0x000390, "Wrong size on UPSdkLoginUIBaseSteam");
static_assert(offsetof(UPSdkLoginUIBaseSteam, ToastTip) == 0x000378, "Member 'UPSdkLoginUIBaseSteam::ToastTip' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIAccountNotExistSteam
// 0x0068 (0x03F8 - 0x0390)
class UPSdkLoginUIAccountNotExistSteam final : public UPSdkLoginUIBaseSteam
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContentTextBlock;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MoreOptionsTextBlock1;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         UnableLoginRichTextBlock;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MoreOptionsTextBlock2;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         RegisterRichTextBlock;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                UnableLoginButton;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RegisterButton;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E8[0x10];                                     // 0x03E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButtonClicked();
	void OnRegisterButtonClicked();
	void OnUnableLoginButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIAccountNotExistSteam">();
	}
	static class UPSdkLoginUIAccountNotExistSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIAccountNotExistSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIAccountNotExistSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIAccountNotExistSteam");
static_assert(sizeof(UPSdkLoginUIAccountNotExistSteam) == 0x0003F8, "Wrong size on UPSdkLoginUIAccountNotExistSteam");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, OverlayImage) == 0x000390, "Member 'UPSdkLoginUIAccountNotExistSteam::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, BackgroundImage) == 0x000398, "Member 'UPSdkLoginUIAccountNotExistSteam::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, CloseButton) == 0x0003A0, "Member 'UPSdkLoginUIAccountNotExistSteam::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, TitleTextBlock) == 0x0003A8, "Member 'UPSdkLoginUIAccountNotExistSteam::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, ContentTextBlock) == 0x0003B0, "Member 'UPSdkLoginUIAccountNotExistSteam::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, MoreOptionsTextBlock1) == 0x0003B8, "Member 'UPSdkLoginUIAccountNotExistSteam::MoreOptionsTextBlock1' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, UnableLoginRichTextBlock) == 0x0003C0, "Member 'UPSdkLoginUIAccountNotExistSteam::UnableLoginRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, MoreOptionsTextBlock2) == 0x0003C8, "Member 'UPSdkLoginUIAccountNotExistSteam::MoreOptionsTextBlock2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, RegisterRichTextBlock) == 0x0003D0, "Member 'UPSdkLoginUIAccountNotExistSteam::RegisterRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, UnableLoginButton) == 0x0003D8, "Member 'UPSdkLoginUIAccountNotExistSteam::UnableLoginButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAccountNotExistSteam, RegisterButton) == 0x0003E0, "Member 'UPSdkLoginUIAccountNotExistSteam::RegisterButton' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIAgreementDialogSteam
// 0x0050 (0x03E0 - 0x0390)
class UPSdkLoginUIAgreementDialogSteam final : public UPSdkLoginUIBaseSteam
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                BackgroundBorder;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         PromptRichText;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PromptTitle;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CancelTextBlock;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             AgreeTextBlock;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                AgreeButton;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CancelButton;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D0[0x10];                                     // 0x03D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAgreeButtonClicked();
	void OnCancelButtonClicked();
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIAgreementDialogSteam">();
	}
	static class UPSdkLoginUIAgreementDialogSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIAgreementDialogSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIAgreementDialogSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIAgreementDialogSteam");
static_assert(sizeof(UPSdkLoginUIAgreementDialogSteam) == 0x0003E0, "Wrong size on UPSdkLoginUIAgreementDialogSteam");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, OverlayImage) == 0x000390, "Member 'UPSdkLoginUIAgreementDialogSteam::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, BackgroundBorder) == 0x000398, "Member 'UPSdkLoginUIAgreementDialogSteam::BackgroundBorder' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, PromptRichText) == 0x0003A0, "Member 'UPSdkLoginUIAgreementDialogSteam::PromptRichText' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, PromptTitle) == 0x0003A8, "Member 'UPSdkLoginUIAgreementDialogSteam::PromptTitle' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, CancelTextBlock) == 0x0003B0, "Member 'UPSdkLoginUIAgreementDialogSteam::CancelTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, AgreeTextBlock) == 0x0003B8, "Member 'UPSdkLoginUIAgreementDialogSteam::AgreeTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, AgreeButton) == 0x0003C0, "Member 'UPSdkLoginUIAgreementDialogSteam::AgreeButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIAgreementDialogSteam, CancelButton) == 0x0003C8, "Member 'UPSdkLoginUIAgreementDialogSteam::CancelButton' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIBindExistingAccountSteam
// 0x00A8 (0x0438 - 0x0390)
class UPSdkLoginUIBindExistingAccountSteam final : public UPSdkLoginUIBaseSteam
{
public:
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 OverlayImage;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImg;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContentTextBlock;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextEdit;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextEdit;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              MaskCheckBoxBtn;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              AgreementCheckBoxBtn;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         AgreementRichTextBlock;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                BindButton;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             BindButtonTextBlock;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                OtherIdLoginButton;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             OtherIdLoginButtonTextBlock;                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                FaqButton;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             FaqButtonTextBlock;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RegisterButton;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RegisterButtonTextBlock;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void GoToRegisterUIDelegate();
	void OnBindButtonClicked();
	void OnCheckedButton(bool checked);
	void OnCloseButtonClicked();
	void OnDelegate(bool bRes);
	void OnFaqButtonClicked();
	void OnFaqButtonHovered();
	void OnFaqButtonReleased();
	void OnFaqButtonUnhovered();
	void OnOtherIdLoginButtonClicked();
	void OnRegisterButtonClicked();
	void OnRegisterButtonHovered();
	void OnRegisterButtonReleased();
	void OnRegisterButtonUnhovered();
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPasswordCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIBindExistingAccountSteam">();
	}
	static class UPSdkLoginUIBindExistingAccountSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIBindExistingAccountSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIBindExistingAccountSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIBindExistingAccountSteam");
static_assert(sizeof(UPSdkLoginUIBindExistingAccountSteam) == 0x000438, "Wrong size on UPSdkLoginUIBindExistingAccountSteam");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, OverlayImage) == 0x0003A0, "Member 'UPSdkLoginUIBindExistingAccountSteam::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, BackgroundImage) == 0x0003A8, "Member 'UPSdkLoginUIBindExistingAccountSteam::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, LogoImg) == 0x0003B0, "Member 'UPSdkLoginUIBindExistingAccountSteam::LogoImg' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, CloseButton) == 0x0003B8, "Member 'UPSdkLoginUIBindExistingAccountSteam::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, TitleTextBlock) == 0x0003C0, "Member 'UPSdkLoginUIBindExistingAccountSteam::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, ContentTextBlock) == 0x0003C8, "Member 'UPSdkLoginUIBindExistingAccountSteam::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, AccountInputTextEdit) == 0x0003D0, "Member 'UPSdkLoginUIBindExistingAccountSteam::AccountInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, PasswordInputTextEdit) == 0x0003D8, "Member 'UPSdkLoginUIBindExistingAccountSteam::PasswordInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, MaskCheckBoxBtn) == 0x0003E0, "Member 'UPSdkLoginUIBindExistingAccountSteam::MaskCheckBoxBtn' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, AgreementCheckBoxBtn) == 0x0003E8, "Member 'UPSdkLoginUIBindExistingAccountSteam::AgreementCheckBoxBtn' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, AgreementRichTextBlock) == 0x0003F0, "Member 'UPSdkLoginUIBindExistingAccountSteam::AgreementRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, BindButton) == 0x0003F8, "Member 'UPSdkLoginUIBindExistingAccountSteam::BindButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, BindButtonTextBlock) == 0x000400, "Member 'UPSdkLoginUIBindExistingAccountSteam::BindButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, OtherIdLoginButton) == 0x000408, "Member 'UPSdkLoginUIBindExistingAccountSteam::OtherIdLoginButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, OtherIdLoginButtonTextBlock) == 0x000410, "Member 'UPSdkLoginUIBindExistingAccountSteam::OtherIdLoginButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, FaqButton) == 0x000418, "Member 'UPSdkLoginUIBindExistingAccountSteam::FaqButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, FaqButtonTextBlock) == 0x000420, "Member 'UPSdkLoginUIBindExistingAccountSteam::FaqButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, RegisterButton) == 0x000428, "Member 'UPSdkLoginUIBindExistingAccountSteam::RegisterButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteam, RegisterButtonTextBlock) == 0x000430, "Member 'UPSdkLoginUIBindExistingAccountSteam::RegisterButtonTextBlock' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIBindExistingAccountSteamKr
// 0x0120 (0x04B0 - 0x0390)
class UPSdkLoginUIBindExistingAccountSteamKr final : public UPSdkLoginUIBaseSteam
{
public:
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 OverlayImage;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImg;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContentTextBlock;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextEdit;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextEdit;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              MaskCheckBoxBtn;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                BindButton;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             BindButtonTextBlock;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                OtherIdLoginButton;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             OtherIdLoginButtonTextBlock;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                FaqButton;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             FaqButtonTextBlock;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RegisterButton;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RegisterButtonTextBlock;                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 PolicyBackgroundImg;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 ImagePolicyIco;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              PolicyCheckBox1;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              PolicyCheckBox2;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              PolicyCheckBox3;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              PolicyCheckBox4;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PolicyButton1;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PolicyButton2;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PolicyButton3;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PolicyButton4;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PolicyTextBlock1;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PolicyTextBlock2;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PolicyTextBlock3;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         PolicyTextBlock4;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         PolicyTextBlock5;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PolicyTextBlock6;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PolicyTextBlock7;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void GoToRegisterUIDelegate();
	void OnBindButtonClicked();
	void OnCheckedBox1Changed();
	void OnCheckedBoxChanged();
	void OnCheckedButton(bool checked);
	void OnCloseButtonClicked();
	void OnDelegate(bool bRes);
	void OnFaqButtonClicked();
	void OnFaqButtonHovered();
	void OnFaqButtonReleased();
	void OnFaqButtonUnhovered();
	void OnOtherIdLoginButtonClicked();
	void OnPolicyButton1Clicked();
	void OnPolicyButton2Clicked();
	void OnPolicyButton3Clicked();
	void OnPolicyButton4Clicked();
	void OnRegisterButtonClicked();
	void OnRegisterButtonHovered();
	void OnRegisterButtonReleased();
	void OnRegisterButtonUnhovered();
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPasswordCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIBindExistingAccountSteamKr">();
	}
	static class UPSdkLoginUIBindExistingAccountSteamKr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIBindExistingAccountSteamKr>();
	}
};
static_assert(alignof(UPSdkLoginUIBindExistingAccountSteamKr) == 0x000008, "Wrong alignment on UPSdkLoginUIBindExistingAccountSteamKr");
static_assert(sizeof(UPSdkLoginUIBindExistingAccountSteamKr) == 0x0004B0, "Wrong size on UPSdkLoginUIBindExistingAccountSteamKr");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, OverlayImage) == 0x0003A0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, BackgroundImage) == 0x0003A8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, LogoImg) == 0x0003B0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::LogoImg' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, CloseButton) == 0x0003B8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, TitleTextBlock) == 0x0003C0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, ContentTextBlock) == 0x0003C8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, AccountInputTextEdit) == 0x0003D0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::AccountInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PasswordInputTextEdit) == 0x0003D8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PasswordInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, MaskCheckBoxBtn) == 0x0003E0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::MaskCheckBoxBtn' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, BindButton) == 0x0003E8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::BindButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, BindButtonTextBlock) == 0x0003F0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::BindButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, OtherIdLoginButton) == 0x0003F8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::OtherIdLoginButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, OtherIdLoginButtonTextBlock) == 0x000400, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::OtherIdLoginButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, FaqButton) == 0x000408, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::FaqButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, FaqButtonTextBlock) == 0x000410, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::FaqButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, RegisterButton) == 0x000418, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::RegisterButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, RegisterButtonTextBlock) == 0x000420, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::RegisterButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyBackgroundImg) == 0x000428, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyBackgroundImg' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, ImagePolicyIco) == 0x000430, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::ImagePolicyIco' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyCheckBox1) == 0x000438, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyCheckBox1' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyCheckBox2) == 0x000440, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyCheckBox2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyCheckBox3) == 0x000448, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyCheckBox3' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyCheckBox4) == 0x000450, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyCheckBox4' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyButton1) == 0x000458, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyButton1' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyButton2) == 0x000460, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyButton2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyButton3) == 0x000468, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyButton3' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyButton4) == 0x000470, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyButton4' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock1) == 0x000478, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock1' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock2) == 0x000480, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock3) == 0x000488, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock3' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock4) == 0x000490, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock4' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock5) == 0x000498, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock5' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock6) == 0x0004A0, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock6' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIBindExistingAccountSteamKr, PolicyTextBlock7) == 0x0004A8, "Member 'UPSdkLoginUIBindExistingAccountSteamKr::PolicyTextBlock7' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIExitBindSteam
// 0x0048 (0x03D8 - 0x0390)
class UPSdkLoginUIExitBindSteam final : public UPSdkLoginUIBaseSteam
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContentTextBlock;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ContinueBindButton;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContinueBindButtonTextBlock;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ExitGameButton;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ExitGameButtonButtonTextBlock;                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCloseButtonClicked();
	void OnContinueBindButtonClicked();
	void OnExitGameButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIExitBindSteam">();
	}
	static class UPSdkLoginUIExitBindSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIExitBindSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIExitBindSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIExitBindSteam");
static_assert(sizeof(UPSdkLoginUIExitBindSteam) == 0x0003D8, "Wrong size on UPSdkLoginUIExitBindSteam");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, OverlayImage) == 0x000390, "Member 'UPSdkLoginUIExitBindSteam::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, BackgroundImage) == 0x000398, "Member 'UPSdkLoginUIExitBindSteam::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, CloseButton) == 0x0003A0, "Member 'UPSdkLoginUIExitBindSteam::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, TitleTextBlock) == 0x0003A8, "Member 'UPSdkLoginUIExitBindSteam::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, ContentTextBlock) == 0x0003B0, "Member 'UPSdkLoginUIExitBindSteam::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, ContinueBindButton) == 0x0003B8, "Member 'UPSdkLoginUIExitBindSteam::ContinueBindButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, ContinueBindButtonTextBlock) == 0x0003C0, "Member 'UPSdkLoginUIExitBindSteam::ContinueBindButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, ExitGameButton) == 0x0003C8, "Member 'UPSdkLoginUIExitBindSteam::ExitGameButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIExitBindSteam, ExitGameButtonButtonTextBlock) == 0x0003D0, "Member 'UPSdkLoginUIExitBindSteam::ExitGameButtonButtonTextBlock' has a wrong offset!");

// Class PSDKChannelSteam.PSdkLoginUIRegisterAndBindSteam
// 0x00E8 (0x0478 - 0x0390)
class UPSdkLoginUIRegisterAndBindSteam final : public UPSdkLoginUIBaseSteam
{
public:
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 OverlayImage;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LogoImg;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ContentTextBlock;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       AccountInputTextEdit;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       CodeInputTextEdit;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                GetCodeButton;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             GetCodeTextBlock;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             GetCodeTextTimerBlock;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextEdit;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       PasswordInputTextEdit2;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              MaskCheckBoxBtn;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              MaskCheckBoxBtn2;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCheckBox*                              AgreementCheckBoxBtn;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         AgreementRichTextBlock;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RegisterAndBindButton;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RegisterAndBindButtonTextBlock;                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RegisterExistAccountButton;                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RegisterExistAccountButtonTextBlock;               // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                FaqButton;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             FaqButtonTextBlock;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PasswordTipsTextBlock;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                PasswordTips;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x10];                                     // 0x0468(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCheckedButton(bool checked);
	void OnCloseButtonClicked();
	void OnDelegate(bool bRes);
	void OnFaqButtonClicked();
	void OnFaqButtonHovered();
	void OnFaqButtonReleased();
	void OnFaqButtonUnhovered();
	void OnGetCodeButtonClicked();
	void OnGetCodeButtonHovered();
	void OnGetCodeButtonReleased();
	void OnGetCodeButtonUnhovered();
	void OnRegisterAndBindButtonClicked();
	void OnRegisterExistAccountButtonClicked();
	void TextBoxInputAccountCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputCodeChanged(const class FString& Text);
	void TextBoxInputCodeCommit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPassword2Changed(const class FString& Text);
	void TextBoxInputPassword2Commit(const class FString& Text, const ETextCommit Type);
	void TextBoxInputPasswordChanged(const class FString& Text);
	void TextBoxInputPasswordCommit(const class FString& Text, const ETextCommit Type);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkLoginUIRegisterAndBindSteam">();
	}
	static class UPSdkLoginUIRegisterAndBindSteam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkLoginUIRegisterAndBindSteam>();
	}
};
static_assert(alignof(UPSdkLoginUIRegisterAndBindSteam) == 0x000008, "Wrong alignment on UPSdkLoginUIRegisterAndBindSteam");
static_assert(sizeof(UPSdkLoginUIRegisterAndBindSteam) == 0x000478, "Wrong size on UPSdkLoginUIRegisterAndBindSteam");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, OverlayImage) == 0x0003A0, "Member 'UPSdkLoginUIRegisterAndBindSteam::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, BackgroundImage) == 0x0003A8, "Member 'UPSdkLoginUIRegisterAndBindSteam::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, LogoImg) == 0x0003B0, "Member 'UPSdkLoginUIRegisterAndBindSteam::LogoImg' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, CloseButton) == 0x0003B8, "Member 'UPSdkLoginUIRegisterAndBindSteam::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, TitleTextBlock) == 0x0003C0, "Member 'UPSdkLoginUIRegisterAndBindSteam::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, ContentTextBlock) == 0x0003C8, "Member 'UPSdkLoginUIRegisterAndBindSteam::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, AccountInputTextEdit) == 0x0003D0, "Member 'UPSdkLoginUIRegisterAndBindSteam::AccountInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, CodeInputTextEdit) == 0x0003D8, "Member 'UPSdkLoginUIRegisterAndBindSteam::CodeInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, GetCodeButton) == 0x0003E0, "Member 'UPSdkLoginUIRegisterAndBindSteam::GetCodeButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, GetCodeTextBlock) == 0x0003E8, "Member 'UPSdkLoginUIRegisterAndBindSteam::GetCodeTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, GetCodeTextTimerBlock) == 0x0003F0, "Member 'UPSdkLoginUIRegisterAndBindSteam::GetCodeTextTimerBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, PasswordInputTextEdit) == 0x0003F8, "Member 'UPSdkLoginUIRegisterAndBindSteam::PasswordInputTextEdit' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, PasswordInputTextEdit2) == 0x000400, "Member 'UPSdkLoginUIRegisterAndBindSteam::PasswordInputTextEdit2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, MaskCheckBoxBtn) == 0x000408, "Member 'UPSdkLoginUIRegisterAndBindSteam::MaskCheckBoxBtn' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, MaskCheckBoxBtn2) == 0x000410, "Member 'UPSdkLoginUIRegisterAndBindSteam::MaskCheckBoxBtn2' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, AgreementCheckBoxBtn) == 0x000418, "Member 'UPSdkLoginUIRegisterAndBindSteam::AgreementCheckBoxBtn' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, AgreementRichTextBlock) == 0x000420, "Member 'UPSdkLoginUIRegisterAndBindSteam::AgreementRichTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, RegisterAndBindButton) == 0x000428, "Member 'UPSdkLoginUIRegisterAndBindSteam::RegisterAndBindButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, RegisterAndBindButtonTextBlock) == 0x000430, "Member 'UPSdkLoginUIRegisterAndBindSteam::RegisterAndBindButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, RegisterExistAccountButton) == 0x000438, "Member 'UPSdkLoginUIRegisterAndBindSteam::RegisterExistAccountButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, RegisterExistAccountButtonTextBlock) == 0x000440, "Member 'UPSdkLoginUIRegisterAndBindSteam::RegisterExistAccountButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, FaqButton) == 0x000448, "Member 'UPSdkLoginUIRegisterAndBindSteam::FaqButton' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, FaqButtonTextBlock) == 0x000450, "Member 'UPSdkLoginUIRegisterAndBindSteam::FaqButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkLoginUIRegisterAndBindSteam, PasswordTipsTextBlock) == 0x000458, "Member 'UPSdkLoginUIRegisterAndBindSteam::PasswordTipsTextBlock' has a wrong offset!");
