#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKRisk

#include "Basic.hpp"

#include "PSDKBasic_classes.hpp"


namespace SDK
{

// Class PSDKRisk.PCPaperRiskCaptchaUI
// 0x0078 (0x03D8 - 0x0360)
class UPCPaperRiskCaptchaUI final : public UPSdkUIBaseWidget
{
public:
	class UPSWebBrowser*                          PSCaptchaWebBrowser;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCPaperRiskModalUI*                    PaperRiskModalView;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_370[0x68];                                     // 0x0370(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Handle(const class FString& Params_0);
	void OnCloseButton();
	void OnCloseButtonDelegate(const bool Close);
	void WebBrowerLoadCompleted();
	void WebBrowerLoadError();
	void WebBrowerLoadStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCPaperRiskCaptchaUI">();
	}
	static class UPCPaperRiskCaptchaUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCPaperRiskCaptchaUI>();
	}
};
static_assert(alignof(UPCPaperRiskCaptchaUI) == 0x000008, "Wrong alignment on UPCPaperRiskCaptchaUI");
static_assert(sizeof(UPCPaperRiskCaptchaUI) == 0x0003D8, "Wrong size on UPCPaperRiskCaptchaUI");
static_assert(offsetof(UPCPaperRiskCaptchaUI, PSCaptchaWebBrowser) == 0x000360, "Member 'UPCPaperRiskCaptchaUI::PSCaptchaWebBrowser' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskCaptchaUI, PaperRiskModalView) == 0x000368, "Member 'UPCPaperRiskCaptchaUI::PaperRiskModalView' has a wrong offset!");

// Class PSDKRisk.PCPaperRiskModalUI
// 0x0048 (0x03A8 - 0x0360)
class UPCPaperRiskModalUI final : public UPSdkUIBaseWidget
{
public:
	class UTextBlock*                             MsgTextBlock;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             OkButtonTextBlock;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_378[0x30];                                     // 0x0378(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCommitButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCPaperRiskModalUI">();
	}
	static class UPCPaperRiskModalUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCPaperRiskModalUI>();
	}
};
static_assert(alignof(UPCPaperRiskModalUI) == 0x000008, "Wrong alignment on UPCPaperRiskModalUI");
static_assert(sizeof(UPCPaperRiskModalUI) == 0x0003A8, "Wrong size on UPCPaperRiskModalUI");
static_assert(offsetof(UPCPaperRiskModalUI, MsgTextBlock) == 0x000360, "Member 'UPCPaperRiskModalUI::MsgTextBlock' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskModalUI, TitleTextBlock) == 0x000368, "Member 'UPCPaperRiskModalUI::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskModalUI, OkButtonTextBlock) == 0x000370, "Member 'UPCPaperRiskModalUI::OkButtonTextBlock' has a wrong offset!");

// Class PSDKRisk.PCPaperRiskVerifyUI
// 0x00B0 (0x0410 - 0x0360)
class UPCPaperRiskVerifyUI final : public UPSdkUIBaseWidget
{
public:
	class UTextBlock*                             GetCodeButtonTextBlock;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             MobileStartTextBlock;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             MobileEndTextBlock;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       MobileEditableTextBox;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       CodeEditableTextBox;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CommitButton;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCPaperRiskModalUI*                    PaperRiskModalView;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x78];                                     // 0x0398(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCloseButtonDelegate(const bool Close);
	void OnCommitButton();
	void OnGetCodeButton();
	void TextBoxInputCodeChanged(const class FString& Text);
	void TextBoxInputMobileChanged(const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCPaperRiskVerifyUI">();
	}
	static class UPCPaperRiskVerifyUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCPaperRiskVerifyUI>();
	}
};
static_assert(alignof(UPCPaperRiskVerifyUI) == 0x000008, "Wrong alignment on UPCPaperRiskVerifyUI");
static_assert(sizeof(UPCPaperRiskVerifyUI) == 0x000410, "Wrong size on UPCPaperRiskVerifyUI");
static_assert(offsetof(UPCPaperRiskVerifyUI, GetCodeButtonTextBlock) == 0x000360, "Member 'UPCPaperRiskVerifyUI::GetCodeButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, MobileStartTextBlock) == 0x000368, "Member 'UPCPaperRiskVerifyUI::MobileStartTextBlock' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, MobileEndTextBlock) == 0x000370, "Member 'UPCPaperRiskVerifyUI::MobileEndTextBlock' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, MobileEditableTextBox) == 0x000378, "Member 'UPCPaperRiskVerifyUI::MobileEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, CodeEditableTextBox) == 0x000380, "Member 'UPCPaperRiskVerifyUI::CodeEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, CommitButton) == 0x000388, "Member 'UPCPaperRiskVerifyUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPCPaperRiskVerifyUI, PaperRiskModalView) == 0x000390, "Member 'UPCPaperRiskVerifyUI::PaperRiskModalView' has a wrong offset!");

}

