#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKPay

#include "Basic.hpp"

#include "PSDKBasic_classes.hpp"


namespace SDK
{

// Class PSDKPay.PSdkPayOverseasSetAgeUI
// 0x00C0 (0x0420 - 0x0360)
class UPSdkPayOverseasSetAgeUI final : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x20];                                     // 0x0360(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             PromptInputDateTextBlock;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 YearBackgroundFrame;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             YearTitleTextBlock;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       YearEditableTextBox;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 MonthBackgroundFrame;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MonthTitleTextBlock;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       MonthEditableTextBox;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 DayBackgroundFrame;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             DayTitleTextBlock;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       DayEditableTextBox;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             DateErrorPromptTextBlock;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             AgreementTitleTextBlock;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             AgreementContentTextBlock;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CancelButton;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CancelButtonTextBlock;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CommitButton;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_408[0x18];                                     // 0x0408(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InputDateCommit();
	void OnCancelButton();
	void OnCommitButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkPayOverseasSetAgeUI">();
	}
	static class UPSdkPayOverseasSetAgeUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkPayOverseasSetAgeUI>();
	}
};
static_assert(alignof(UPSdkPayOverseasSetAgeUI) == 0x000008, "Wrong alignment on UPSdkPayOverseasSetAgeUI");
static_assert(sizeof(UPSdkPayOverseasSetAgeUI) == 0x000420, "Wrong size on UPSdkPayOverseasSetAgeUI");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, PromptInputDateTextBlock) == 0x000380, "Member 'UPSdkPayOverseasSetAgeUI::PromptInputDateTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, YearBackgroundFrame) == 0x000388, "Member 'UPSdkPayOverseasSetAgeUI::YearBackgroundFrame' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, YearTitleTextBlock) == 0x000390, "Member 'UPSdkPayOverseasSetAgeUI::YearTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, YearEditableTextBox) == 0x000398, "Member 'UPSdkPayOverseasSetAgeUI::YearEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, MonthBackgroundFrame) == 0x0003A0, "Member 'UPSdkPayOverseasSetAgeUI::MonthBackgroundFrame' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, MonthTitleTextBlock) == 0x0003A8, "Member 'UPSdkPayOverseasSetAgeUI::MonthTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, MonthEditableTextBox) == 0x0003B0, "Member 'UPSdkPayOverseasSetAgeUI::MonthEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, DayBackgroundFrame) == 0x0003B8, "Member 'UPSdkPayOverseasSetAgeUI::DayBackgroundFrame' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, DayTitleTextBlock) == 0x0003C0, "Member 'UPSdkPayOverseasSetAgeUI::DayTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, DayEditableTextBox) == 0x0003C8, "Member 'UPSdkPayOverseasSetAgeUI::DayEditableTextBox' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, DateErrorPromptTextBlock) == 0x0003D0, "Member 'UPSdkPayOverseasSetAgeUI::DateErrorPromptTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, AgreementTitleTextBlock) == 0x0003D8, "Member 'UPSdkPayOverseasSetAgeUI::AgreementTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, AgreementContentTextBlock) == 0x0003E0, "Member 'UPSdkPayOverseasSetAgeUI::AgreementContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, CancelButton) == 0x0003E8, "Member 'UPSdkPayOverseasSetAgeUI::CancelButton' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, CancelButtonTextBlock) == 0x0003F0, "Member 'UPSdkPayOverseasSetAgeUI::CancelButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, CommitButton) == 0x0003F8, "Member 'UPSdkPayOverseasSetAgeUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasSetAgeUI, CommitButtonTextBlock) == 0x000400, "Member 'UPSdkPayOverseasSetAgeUI::CommitButtonTextBlock' has a wrong offset!");

}

