#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKNetCheck

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "PSDKBasic_classes.hpp"


namespace SDK
{

// Class PSDKNetCheck.NetCheckCtrl
// 0x0290 (0x02B8 - 0x0028)
class UNetCheckCtrl final : public UObject
{
public:
	class UNetCheckModel*                         Model;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNetCheckMainUI*                        View;                                              // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x280];                                     // 0x0038(0x0280)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginCheckButtonClicked();
	void CloseUIButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetCheckCtrl">();
	}
	static class UNetCheckCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetCheckCtrl>();
	}
};
static_assert(alignof(UNetCheckCtrl) == 0x000008, "Wrong alignment on UNetCheckCtrl");
static_assert(sizeof(UNetCheckCtrl) == 0x0002B8, "Wrong size on UNetCheckCtrl");
static_assert(offsetof(UNetCheckCtrl, Model) == 0x000028, "Member 'UNetCheckCtrl::Model' has a wrong offset!");
static_assert(offsetof(UNetCheckCtrl, View) == 0x000030, "Member 'UNetCheckCtrl::View' has a wrong offset!");

// Class PSDKNetCheck.NetCheckLibrary
// 0x0000 (0x0028 - 0x0028)
class UNetCheckLibrary final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetCheckLibrary">();
	}
	static class UNetCheckLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetCheckLibrary>();
	}
};
static_assert(alignof(UNetCheckLibrary) == 0x000008, "Wrong alignment on UNetCheckLibrary");
static_assert(sizeof(UNetCheckLibrary) == 0x000028, "Wrong size on UNetCheckLibrary");

// Class PSDKNetCheck.NetCheckMainUI
// 0x0058 (0x03B8 - 0x0360)
class UNetCheckMainUI final : public UPSdkUIBaseWidget
{
public:
	class UWidgetAnimation*                       CheckingAnimation;                                 // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FString, class UWidget*>           Widgets;                                           // 0x0368(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void PlayCheckAnimation();
	void StopCheckAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetCheckMainUI">();
	}
	static class UNetCheckMainUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetCheckMainUI>();
	}
};
static_assert(alignof(UNetCheckMainUI) == 0x000008, "Wrong alignment on UNetCheckMainUI");
static_assert(sizeof(UNetCheckMainUI) == 0x0003B8, "Wrong size on UNetCheckMainUI");
static_assert(offsetof(UNetCheckMainUI, CheckingAnimation) == 0x000360, "Member 'UNetCheckMainUI::CheckingAnimation' has a wrong offset!");
static_assert(offsetof(UNetCheckMainUI, Widgets) == 0x000368, "Member 'UNetCheckMainUI::Widgets' has a wrong offset!");

// Class PSDKNetCheck.NetCheckModel
// 0x00B8 (0x00E0 - 0x0028)
class UNetCheckModel final : public UObject
{
public:
	uint8                                         Pad_28[0xB8];                                      // 0x0028(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetCheckModel">();
	}
	static class UNetCheckModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetCheckModel>();
	}
};
static_assert(alignof(UNetCheckModel) == 0x000008, "Wrong alignment on UNetCheckModel");
static_assert(sizeof(UNetCheckModel) == 0x0000E0, "Wrong size on UNetCheckModel");

// Class PSDKNetCheck.PSNetCheckApi
// 0x0008 (0x0030 - 0x0028)
class UPSNetCheckApi final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPSNetCheckApi* GetInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSNetCheckApi">();
	}
	static class UPSNetCheckApi* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSNetCheckApi>();
	}
};
static_assert(alignof(UPSNetCheckApi) == 0x000008, "Wrong alignment on UPSNetCheckApi");
static_assert(sizeof(UPSNetCheckApi) == 0x000030, "Wrong size on UPSNetCheckApi");

// Class PSDKNetCheck.WB_CheckChild
// 0x0000 (0x02F0 - 0x02F0)
class UWB_CheckChild final : public UUserWidget
{
public:
	void PlayChecingAnimation(bool bIsStop);
	void PlayResultAnimation(bool bIsSucceed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WB_CheckChild">();
	}
	static class UWB_CheckChild* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CheckChild>();
	}
};
static_assert(alignof(UWB_CheckChild) == 0x000008, "Wrong alignment on UWB_CheckChild");
static_assert(sizeof(UWB_CheckChild) == 0x0002F0, "Wrong size on UWB_CheckChild");

// Class PSDKNetCheck.WB_CheckContent
// 0x0000 (0x02F0 - 0x02F0)
class UWB_CheckContent final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WB_CheckContent">();
	}
	static class UWB_CheckContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CheckContent>();
	}
};
static_assert(alignof(UWB_CheckContent) == 0x000008, "Wrong alignment on UWB_CheckContent");
static_assert(sizeof(UWB_CheckContent) == 0x0002F0, "Wrong size on UWB_CheckContent");

// Class PSDKNetCheck.WB_PopupContent
// 0x0018 (0x0308 - 0x02F0)
class UWB_PopupContent final : public UUserWidget
{
public:
	class UOverlay*                               ToastOverlay;                                      // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             ToastTextBlock;                                    // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WB_PopupContent">();
	}
	static class UWB_PopupContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_PopupContent>();
	}
};
static_assert(alignof(UWB_PopupContent) == 0x000008, "Wrong alignment on UWB_PopupContent");
static_assert(sizeof(UWB_PopupContent) == 0x000308, "Wrong size on UWB_PopupContent");
static_assert(offsetof(UWB_PopupContent, ToastOverlay) == 0x0002F0, "Member 'UWB_PopupContent::ToastOverlay' has a wrong offset!");
static_assert(offsetof(UWB_PopupContent, ToastTextBlock) == 0x0002F8, "Member 'UWB_PopupContent::ToastTextBlock' has a wrong offset!");

}

