#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKCustomerServiceCommon

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// Class PSDKCustomerServiceCommon.CustomerServicePSNQRCodeWidget
// 0x0078 (0x0368 - 0x02F0)
class UCustomerServicePSNQRCodeWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x18];                                     // 0x02F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 QRCode;                                            // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             QRCodeTips;                                        // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             BacktoGameText;                                    // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             RefreshQRCodeText;                                 // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBackgroundBlur*                        QRCodeBackgroundBlur;                              // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 RefreshImage;                                      // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         RefreshQRCodeKeyTips;                              // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_340[0x28];                                     // 0x0340(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Init();
	void InvalidateQrCode();
	void NativeOnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnBackToGame();
	void OnGamepadEvent(const struct FKeyEvent& InKeyEvent);
	void OnRefreshQrCode();
	void SetRouter(const class FString& Router);
	void UpdateQrCodeImage(const class FString& ImageUrl);
	void UpdateTimeoutSeconds(int32 TimeoutSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomerServicePSNQRCodeWidget">();
	}
	static class UCustomerServicePSNQRCodeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomerServicePSNQRCodeWidget>();
	}
};
static_assert(alignof(UCustomerServicePSNQRCodeWidget) == 0x000008, "Wrong alignment on UCustomerServicePSNQRCodeWidget");
static_assert(sizeof(UCustomerServicePSNQRCodeWidget) == 0x000368, "Wrong size on UCustomerServicePSNQRCodeWidget");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, QRCode) == 0x000308, "Member 'UCustomerServicePSNQRCodeWidget::QRCode' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, QRCodeTips) == 0x000310, "Member 'UCustomerServicePSNQRCodeWidget::QRCodeTips' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, BacktoGameText) == 0x000318, "Member 'UCustomerServicePSNQRCodeWidget::BacktoGameText' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, RefreshQRCodeText) == 0x000320, "Member 'UCustomerServicePSNQRCodeWidget::RefreshQRCodeText' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, QRCodeBackgroundBlur) == 0x000328, "Member 'UCustomerServicePSNQRCodeWidget::QRCodeBackgroundBlur' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, RefreshImage) == 0x000330, "Member 'UCustomerServicePSNQRCodeWidget::RefreshImage' has a wrong offset!");
static_assert(offsetof(UCustomerServicePSNQRCodeWidget, RefreshQRCodeKeyTips) == 0x000338, "Member 'UCustomerServicePSNQRCodeWidget::RefreshQRCodeKeyTips' has a wrong offset!");

}

