#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKWebView

#include "Basic.hpp"


namespace SDK::Params
{

// Function PSDKWebView.PSWebUserWidget.Handle
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_Handle final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_Handle) == 0x000008, "Wrong alignment on PSWebUserWidget_Handle");
static_assert(sizeof(PSWebUserWidget_Handle) == 0x000010, "Wrong size on PSWebUserWidget_Handle");
static_assert(offsetof(PSWebUserWidget_Handle, Params_0) == 0x000000, "Member 'PSWebUserWidget_Handle::Params_0' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.OnBackButton
// 0x0008 (0x0008 - 0x0000)
struct PSWebUserWidget_OnBackButton final
{
public:
	class UButton*                                Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_OnBackButton) == 0x000008, "Wrong alignment on PSWebUserWidget_OnBackButton");
static_assert(sizeof(PSWebUserWidget_OnBackButton) == 0x000008, "Wrong size on PSWebUserWidget_OnBackButton");
static_assert(offsetof(PSWebUserWidget_OnBackButton, Button) == 0x000000, "Member 'PSWebUserWidget_OnBackButton::Button' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.OnCloseButton
// 0x0008 (0x0008 - 0x0000)
struct PSWebUserWidget_OnCloseButton final
{
public:
	class UButton*                                Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_OnCloseButton) == 0x000008, "Wrong alignment on PSWebUserWidget_OnCloseButton");
static_assert(sizeof(PSWebUserWidget_OnCloseButton) == 0x000008, "Wrong size on PSWebUserWidget_OnCloseButton");
static_assert(offsetof(PSWebUserWidget_OnCloseButton, Button) == 0x000000, "Member 'PSWebUserWidget_OnCloseButton::Button' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.OnReloadButton
// 0x0008 (0x0008 - 0x0000)
struct PSWebUserWidget_OnReloadButton final
{
public:
	class UButton*                                Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_OnReloadButton) == 0x000008, "Wrong alignment on PSWebUserWidget_OnReloadButton");
static_assert(sizeof(PSWebUserWidget_OnReloadButton) == 0x000008, "Wrong size on PSWebUserWidget_OnReloadButton");
static_assert(offsetof(PSWebUserWidget_OnReloadButton, Button) == 0x000000, "Member 'PSWebUserWidget_OnReloadButton::Button' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.PSGetSDKInfo
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_PSGetSDKInfo final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_PSGetSDKInfo) == 0x000008, "Wrong alignment on PSWebUserWidget_PSGetSDKInfo");
static_assert(sizeof(PSWebUserWidget_PSGetSDKInfo) == 0x000010, "Wrong size on PSWebUserWidget_PSGetSDKInfo");
static_assert(offsetof(PSWebUserWidget_PSGetSDKInfo, Params_0) == 0x000000, "Member 'PSWebUserWidget_PSGetSDKInfo::Params_0' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.PSJSNotification
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_PSJSNotification final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_PSJSNotification) == 0x000008, "Wrong alignment on PSWebUserWidget_PSJSNotification");
static_assert(sizeof(PSWebUserWidget_PSJSNotification) == 0x000010, "Wrong size on PSWebUserWidget_PSJSNotification");
static_assert(offsetof(PSWebUserWidget_PSJSNotification, Params_0) == 0x000000, "Member 'PSWebUserWidget_PSJSNotification::Params_0' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.PSJSToGame
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_PSJSToGame final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_PSJSToGame) == 0x000008, "Wrong alignment on PSWebUserWidget_PSJSToGame");
static_assert(sizeof(PSWebUserWidget_PSJSToGame) == 0x000010, "Wrong size on PSWebUserWidget_PSJSToGame");
static_assert(offsetof(PSWebUserWidget_PSJSToGame, Params_0) == 0x000000, "Member 'PSWebUserWidget_PSJSToGame::Params_0' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.PSLoginSession
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_PSLoginSession final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_PSLoginSession) == 0x000008, "Wrong alignment on PSWebUserWidget_PSLoginSession");
static_assert(sizeof(PSWebUserWidget_PSLoginSession) == 0x000010, "Wrong size on PSWebUserWidget_PSLoginSession");
static_assert(offsetof(PSWebUserWidget_PSLoginSession, Params_0) == 0x000000, "Member 'PSWebUserWidget_PSLoginSession::Params_0' has a wrong offset!");

// Function PSDKWebView.PSWebUserWidget.PSWebClose
// 0x0010 (0x0010 - 0x0000)
struct PSWebUserWidget_PSWebClose final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSWebUserWidget_PSWebClose) == 0x000008, "Wrong alignment on PSWebUserWidget_PSWebClose");
static_assert(sizeof(PSWebUserWidget_PSWebClose) == 0x000010, "Wrong size on PSWebUserWidget_PSWebClose");
static_assert(offsetof(PSWebUserWidget_PSWebClose, Params_0) == 0x000000, "Member 'PSWebUserWidget_PSWebClose::Params_0' has a wrong offset!");

}

