#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKPayPaperPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function PSDKPayPaperPC.PSdkPayOverseasUI.Handle
// 0x0010 (0x0010 - 0x0000)
struct PSdkPayOverseasUI_Handle final
{
public:
	class FString                                 Params_0;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSdkPayOverseasUI_Handle) == 0x000008, "Wrong alignment on PSdkPayOverseasUI_Handle");
static_assert(sizeof(PSdkPayOverseasUI_Handle) == 0x000010, "Wrong size on PSdkPayOverseasUI_Handle");
static_assert(offsetof(PSdkPayOverseasUI_Handle, Params_0) == 0x000000, "Member 'PSdkPayOverseasUI_Handle::Params_0' has a wrong offset!");

// Function PSDKPayPaperPC.PSdkPayOverseasUI.WebBrowserLoadUrlChanged
// 0x0010 (0x0010 - 0x0000)
struct PSdkPayOverseasUI_WebBrowserLoadUrlChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSdkPayOverseasUI_WebBrowserLoadUrlChanged) == 0x000008, "Wrong alignment on PSdkPayOverseasUI_WebBrowserLoadUrlChanged");
static_assert(sizeof(PSdkPayOverseasUI_WebBrowserLoadUrlChanged) == 0x000010, "Wrong size on PSdkPayOverseasUI_WebBrowserLoadUrlChanged");
static_assert(offsetof(PSdkPayOverseasUI_WebBrowserLoadUrlChanged, Text) == 0x000000, "Member 'PSdkPayOverseasUI_WebBrowserLoadUrlChanged::Text' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnChangedButtonDelegate
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnChangedButtonDelegate final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnChangedButtonDelegate) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnChangedButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnChangedButtonDelegate) == 0x000010, "Wrong size on PSPaperPayPCView_OnChangedButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnChangedButtonDelegate, Info) == 0x000000, "Member 'PSPaperPayPCView_OnChangedButtonDelegate::Info' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnCloseButtonDelegate
// 0x0001 (0x0001 - 0x0000)
struct PSPaperPayPCView_OnCloseButtonDelegate final
{
public:
	bool                                          CloseModal;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnCloseButtonDelegate) == 0x000001, "Wrong alignment on PSPaperPayPCView_OnCloseButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnCloseButtonDelegate) == 0x000001, "Wrong size on PSPaperPayPCView_OnCloseButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnCloseButtonDelegate, CloseModal) == 0x000000, "Member 'PSPaperPayPCView_OnCloseButtonDelegate::CloseModal' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnFinishedButtonDelegate
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnFinishedButtonDelegate final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnFinishedButtonDelegate) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnFinishedButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnFinishedButtonDelegate) == 0x000010, "Wrong size on PSPaperPayPCView_OnFinishedButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnFinishedButtonDelegate, Info) == 0x000000, "Member 'PSPaperPayPCView_OnFinishedButtonDelegate::Info' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnOkButtonDelegate
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnOkButtonDelegate final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnOkButtonDelegate) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnOkButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnOkButtonDelegate) == 0x000010, "Wrong size on PSPaperPayPCView_OnOkButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnOkButtonDelegate, Info) == 0x000000, "Member 'PSPaperPayPCView_OnOkButtonDelegate::Info' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnPayButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnPayButtonClicked final
{
public:
	class FString                                 ChargeType;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnPayButtonClicked) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnPayButtonClicked");
static_assert(sizeof(PSPaperPayPCView_OnPayButtonClicked) == 0x000010, "Wrong size on PSPaperPayPCView_OnPayButtonClicked");
static_assert(offsetof(PSPaperPayPCView_OnPayButtonClicked, ChargeType) == 0x000000, "Member 'PSPaperPayPCView_OnPayButtonClicked::ChargeType' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnReOrderButtonDelegate
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnReOrderButtonDelegate final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnReOrderButtonDelegate) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnReOrderButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnReOrderButtonDelegate) == 0x000010, "Wrong size on PSPaperPayPCView_OnReOrderButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnReOrderButtonDelegate, Info) == 0x000000, "Member 'PSPaperPayPCView_OnReOrderButtonDelegate::Info' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.OnRetryButtonDelegate
// 0x0010 (0x0010 - 0x0000)
struct PSPaperPayPCView_OnRetryButtonDelegate final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_OnRetryButtonDelegate) == 0x000008, "Wrong alignment on PSPaperPayPCView_OnRetryButtonDelegate");
static_assert(sizeof(PSPaperPayPCView_OnRetryButtonDelegate) == 0x000010, "Wrong size on PSPaperPayPCView_OnRetryButtonDelegate");
static_assert(offsetof(PSPaperPayPCView_OnRetryButtonDelegate, Info) == 0x000000, "Member 'PSPaperPayPCView_OnRetryButtonDelegate::Info' has a wrong offset!");

// Function PSDKPayPaperPC.PSPaperPayPCView.SetProductImage
// 0x0008 (0x0008 - 0x0000)
struct PSPaperPayPCView_SetProductImage final
{
public:
	class UTexture2DDynamic*                      DownloadedTexture;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSPaperPayPCView_SetProductImage) == 0x000008, "Wrong alignment on PSPaperPayPCView_SetProductImage");
static_assert(sizeof(PSPaperPayPCView_SetProductImage) == 0x000008, "Wrong size on PSPaperPayPCView_SetProductImage");
static_assert(offsetof(PSPaperPayPCView_SetProductImage, DownloadedTexture) == 0x000000, "Member 'PSPaperPayPCView_SetProductImage::DownloadedTexture' has a wrong offset!");

}

