#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKAppUpdate

#include "Basic.hpp"

#include "PSDKConfig_structs.hpp"
#include "PSDKBasic_structs.hpp"


namespace SDK
{

// ScriptStruct PSDKAppUpdate.PSdkAppUpdateLanguagesRow
// 0x0000 (0x00D8 - 0x00D8)
struct FPSdkAppUpdateLanguagesRow final : public FPSDKLanguageTableRowBase
{
};
static_assert(alignof(FPSdkAppUpdateLanguagesRow) == 0x000008, "Wrong alignment on FPSdkAppUpdateLanguagesRow");
static_assert(sizeof(FPSdkAppUpdateLanguagesRow) == 0x0000D8, "Wrong size on FPSdkAppUpdateLanguagesRow");

// ScriptStruct PSDKAppUpdate.PSdkAppUpdateDataExtraModel
// 0x0038 (0x0038 - 0x0000)
struct FPSdkAppUpdateDataExtraModel final
{
public:
	class FString                                 Apk_Url;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Customize_Version_Info;                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Resource_Size;                                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 File_Md5;                                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkAppUpdateDataExtraModel) == 0x000008, "Wrong alignment on FPSdkAppUpdateDataExtraModel");
static_assert(sizeof(FPSdkAppUpdateDataExtraModel) == 0x000038, "Wrong size on FPSdkAppUpdateDataExtraModel");
static_assert(offsetof(FPSdkAppUpdateDataExtraModel, Apk_Url) == 0x000000, "Member 'FPSdkAppUpdateDataExtraModel::Apk_Url' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataExtraModel, Customize_Version_Info) == 0x000010, "Member 'FPSdkAppUpdateDataExtraModel::Customize_Version_Info' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataExtraModel, Resource_Size) == 0x000020, "Member 'FPSdkAppUpdateDataExtraModel::Resource_Size' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataExtraModel, File_Md5) == 0x000028, "Member 'FPSdkAppUpdateDataExtraModel::File_Md5' has a wrong offset!");

// ScriptStruct PSDKAppUpdate.PSdkAppUpdateDataModel
// 0x0078 (0x0078 - 0x0000)
struct FPSdkAppUpdateDataModel final
{
public:
	bool                                          Force_Update;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Min_Version;                                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Update_Type;                                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Update_Content;                                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Env;                                               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPSdkAppUpdateDataExtraModel           Extra;                                             // 0x0040(0x0038)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkAppUpdateDataModel) == 0x000008, "Wrong alignment on FPSdkAppUpdateDataModel");
static_assert(sizeof(FPSdkAppUpdateDataModel) == 0x000078, "Wrong size on FPSdkAppUpdateDataModel");
static_assert(offsetof(FPSdkAppUpdateDataModel, Force_Update) == 0x000000, "Member 'FPSdkAppUpdateDataModel::Force_Update' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataModel, Min_Version) == 0x000008, "Member 'FPSdkAppUpdateDataModel::Min_Version' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataModel, Update_Type) == 0x000018, "Member 'FPSdkAppUpdateDataModel::Update_Type' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataModel, Update_Content) == 0x000020, "Member 'FPSdkAppUpdateDataModel::Update_Content' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataModel, Env) == 0x000030, "Member 'FPSdkAppUpdateDataModel::Env' has a wrong offset!");
static_assert(offsetof(FPSdkAppUpdateDataModel, Extra) == 0x000040, "Member 'FPSdkAppUpdateDataModel::Extra' has a wrong offset!");

// ScriptStruct PSDKAppUpdate.PSdkAppUpdateModel
// 0x0078 (0x00B0 - 0x0038)
struct FPSdkAppUpdateModel final : public FPSBffBasicModel
{
public:
	struct FPSdkAppUpdateDataModel                Data;                                              // 0x0038(0x0078)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkAppUpdateModel) == 0x000008, "Wrong alignment on FPSdkAppUpdateModel");
static_assert(sizeof(FPSdkAppUpdateModel) == 0x0000B0, "Wrong size on FPSdkAppUpdateModel");
static_assert(offsetof(FPSdkAppUpdateModel, Data) == 0x000038, "Member 'FPSdkAppUpdateModel::Data' has a wrong offset!");

}

