#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDK

#include "Basic.hpp"


namespace SDK::Params
{

// Function PSDK.PaperSDKBlueprintLibrary.PaperRouter
// 0x0038 (0x0038 - 0x0000)
struct PaperSDKBlueprintLibrary_PaperRouter final
{
public:
	class FString                                 Router;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& ReturnValue)> CallBackPlatform;                              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGlobal;                                         // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PaperSDKBlueprintLibrary_PaperRouter) == 0x000008, "Wrong alignment on PaperSDKBlueprintLibrary_PaperRouter");
static_assert(sizeof(PaperSDKBlueprintLibrary_PaperRouter) == 0x000038, "Wrong size on PaperSDKBlueprintLibrary_PaperRouter");
static_assert(offsetof(PaperSDKBlueprintLibrary_PaperRouter, Router) == 0x000000, "Member 'PaperSDKBlueprintLibrary_PaperRouter::Router' has a wrong offset!");
static_assert(offsetof(PaperSDKBlueprintLibrary_PaperRouter, Param) == 0x000010, "Member 'PaperSDKBlueprintLibrary_PaperRouter::Param' has a wrong offset!");
static_assert(offsetof(PaperSDKBlueprintLibrary_PaperRouter, CallBackPlatform) == 0x000020, "Member 'PaperSDKBlueprintLibrary_PaperRouter::CallBackPlatform' has a wrong offset!");
static_assert(offsetof(PaperSDKBlueprintLibrary_PaperRouter, bIsGlobal) == 0x000030, "Member 'PaperSDKBlueprintLibrary_PaperRouter::bIsGlobal' has a wrong offset!");

}

