#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKBasic

#include "Basic.hpp"

#include "WebBrowserWidget_classes.hpp"
#include "Engine_classes.hpp"
#include "PSDKBasic_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PSDKBasic.PSDKGamePadHelpersFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UPSDKGamePadHelpersFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static EPSDKInputType GetCurrentInputType();
	static bool IsCurrentGamePad();
	static bool IsSteamDeck();
	static bool IsTopWidgetInLayers(class UPSdkUIBaseWidget* UserWidget);
	static bool ShouldShowGamePadIcons(class UPSdkUIBaseWidget* UserWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSDKGamePadHelpersFunctionLibrary">();
	}
	static class UPSDKGamePadHelpersFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSDKGamePadHelpersFunctionLibrary>();
	}
};
static_assert(alignof(UPSDKGamePadHelpersFunctionLibrary) == 0x000008, "Wrong alignment on UPSDKGamePadHelpersFunctionLibrary");
static_assert(sizeof(UPSDKGamePadHelpersFunctionLibrary) == 0x000028, "Wrong size on UPSDKGamePadHelpersFunctionLibrary");

// Class PSDKBasic.PSDKGamePadInterface
// 0x0000 (0x0000 - 0x0000)
class IPSDKGamePadInterface final : public IInterface
{
public:
	void OnKeyDownTrigger(const struct FKeyEvent& KeyEvent);
	void OnKeyUpTrigger(const struct FKeyEvent& KeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSDKGamePadInterface">();
	}
	static class IPSDKGamePadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPSDKGamePadInterface>();
	}
};
static_assert(alignof(IPSDKGamePadInterface) == 0x000001, "Wrong alignment on IPSDKGamePadInterface");
static_assert(sizeof(IPSDKGamePadInterface) == 0x000001, "Wrong size on IPSDKGamePadInterface");

// Class PSDKBasic.PSdkUIBaseWidget
// 0x0070 (0x0360 - 0x02F0)
class UPSdkUIBaseWidget : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x70];                                     // 0x02F0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkUIBaseWidget">();
	}
	static class UPSdkUIBaseWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkUIBaseWidget>();
	}
};
static_assert(alignof(UPSdkUIBaseWidget) == 0x000008, "Wrong alignment on UPSdkUIBaseWidget");
static_assert(sizeof(UPSdkUIBaseWidget) == 0x000360, "Wrong size on UPSdkUIBaseWidget");

// Class PSDKBasic.PSdkPS5BaseUI
// 0x0000 (0x0360 - 0x0360)
class UPSdkPS5BaseUI : public UPSdkUIBaseWidget
{
public:
	void OnGamepadButton(const struct FKeyEvent& KeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkPS5BaseUI">();
	}
	static class UPSdkPS5BaseUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkPS5BaseUI>();
	}
};
static_assert(alignof(UPSdkPS5BaseUI) == 0x000008, "Wrong alignment on UPSdkPS5BaseUI");
static_assert(sizeof(UPSdkPS5BaseUI) == 0x000360, "Wrong size on UPSdkPS5BaseUI");

// Class PSDKBasic.PSdkPSCommonErrorUI
// 0x0108 (0x0468 - 0x0360)
class UPSdkPSCommonErrorUI final : public UPSdkPS5BaseUI
{
public:
	uint8                                         Pad_360[0xC0];                                     // 0x0360(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 LogoImage;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMultiLineEditableText*                 PromptText;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Left1Image;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Left1TextBlock;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Right1Image;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Right1TextBlock;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Right2Image;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Right2TextBlock;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkPSCommonErrorUI">();
	}
	static class UPSdkPSCommonErrorUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkPSCommonErrorUI>();
	}
};
static_assert(alignof(UPSdkPSCommonErrorUI) == 0x000008, "Wrong alignment on UPSdkPSCommonErrorUI");
static_assert(sizeof(UPSdkPSCommonErrorUI) == 0x000468, "Wrong size on UPSdkPSCommonErrorUI");
static_assert(offsetof(UPSdkPSCommonErrorUI, LogoImage) == 0x000420, "Member 'UPSdkPSCommonErrorUI::LogoImage' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, PromptText) == 0x000428, "Member 'UPSdkPSCommonErrorUI::PromptText' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Left1Image) == 0x000430, "Member 'UPSdkPSCommonErrorUI::Left1Image' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Left1TextBlock) == 0x000438, "Member 'UPSdkPSCommonErrorUI::Left1TextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Right1Image) == 0x000440, "Member 'UPSdkPSCommonErrorUI::Right1Image' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Right1TextBlock) == 0x000448, "Member 'UPSdkPSCommonErrorUI::Right1TextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Right2Image) == 0x000450, "Member 'UPSdkPSCommonErrorUI::Right2Image' has a wrong offset!");
static_assert(offsetof(UPSdkPSCommonErrorUI, Right2TextBlock) == 0x000458, "Member 'UPSdkPSCommonErrorUI::Right2TextBlock' has a wrong offset!");

// Class PSDKBasic.PSdkRichTextBlockInlineDecorator
// 0x0000 (0x0028 - 0x0028)
class UPSdkRichTextBlockInlineDecorator final : public URichTextBlockDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkRichTextBlockInlineDecorator">();
	}
	static class UPSdkRichTextBlockInlineDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkRichTextBlockInlineDecorator>();
	}
};
static_assert(alignof(UPSdkRichTextBlockInlineDecorator) == 0x000008, "Wrong alignment on UPSdkRichTextBlockInlineDecorator");
static_assert(sizeof(UPSdkRichTextBlockInlineDecorator) == 0x000028, "Wrong size on UPSdkRichTextBlockInlineDecorator");

// Class PSDKBasic.PSdkUILoading
// 0x0010 (0x0300 - 0x02F0)
class UPSdkUILoading : public UUserWidget
{
public:
	class UTextBlock*                             TextBlock_prompt;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkUILoading">();
	}
	static class UPSdkUILoading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkUILoading>();
	}
};
static_assert(alignof(UPSdkUILoading) == 0x000008, "Wrong alignment on UPSdkUILoading");
static_assert(sizeof(UPSdkUILoading) == 0x000300, "Wrong size on UPSdkUILoading");
static_assert(offsetof(UPSdkUILoading, TextBlock_prompt) == 0x0002F0, "Member 'UPSdkUILoading::TextBlock_prompt' has a wrong offset!");

// Class PSDKBasic.PSdkUIOneButtonUI
// 0x0058 (0x03B8 - 0x0360)
class UPSdkUIOneButtonUI final : public UPSdkUIBaseWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 BackgroundImage;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CloseButton;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ContentTextBlock;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CommitButton;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x20];                                     // 0x0398(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseButton();
	void OnCommitButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkUIOneButtonUI">();
	}
	static class UPSdkUIOneButtonUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkUIOneButtonUI>();
	}
};
static_assert(alignof(UPSdkUIOneButtonUI) == 0x000008, "Wrong alignment on UPSdkUIOneButtonUI");
static_assert(sizeof(UPSdkUIOneButtonUI) == 0x0003B8, "Wrong size on UPSdkUIOneButtonUI");
static_assert(offsetof(UPSdkUIOneButtonUI, OverlayImage) == 0x000360, "Member 'UPSdkUIOneButtonUI::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, BackgroundImage) == 0x000368, "Member 'UPSdkUIOneButtonUI::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, CloseButton) == 0x000370, "Member 'UPSdkUIOneButtonUI::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, TitleTextBlock) == 0x000378, "Member 'UPSdkUIOneButtonUI::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, ContentTextBlock) == 0x000380, "Member 'UPSdkUIOneButtonUI::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, CommitButton) == 0x000388, "Member 'UPSdkUIOneButtonUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPSdkUIOneButtonUI, CommitButtonTextBlock) == 0x000390, "Member 'UPSdkUIOneButtonUI::CommitButtonTextBlock' has a wrong offset!");

// Class PSDKBasic.PSDKUIToast
// 0x0050 (0x0340 - 0x02F0)
class UPSDKUIToast final : public UUserWidget
{
public:
	class UTextBlock*                             PSLoginUIToastTextBlock;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x48];                                     // 0x02F8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSDKUIToast">();
	}
	static class UPSDKUIToast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSDKUIToast>();
	}
};
static_assert(alignof(UPSDKUIToast) == 0x000008, "Wrong alignment on UPSDKUIToast");
static_assert(sizeof(UPSDKUIToast) == 0x000340, "Wrong size on UPSDKUIToast");
static_assert(offsetof(UPSDKUIToast, PSLoginUIToastTextBlock) == 0x0002F0, "Member 'UPSDKUIToast::PSLoginUIToastTextBlock' has a wrong offset!");

// Class PSDKBasic.PSdkUITwoButtonsUI
// 0x0078 (0x03D8 - 0x0360)
class UPSdkUITwoButtonsUI final : public UPSdkUIBaseWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 BackgroundImage;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CloseButton;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ContentTextBlock;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CommitButton;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CancelButton;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             CancelButtonTextBlock;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x30];                                     // 0x03A8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancelButton();
	void OnCloseButton();
	void OnCommitButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkUITwoButtonsUI">();
	}
	static class UPSdkUITwoButtonsUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkUITwoButtonsUI>();
	}
};
static_assert(alignof(UPSdkUITwoButtonsUI) == 0x000008, "Wrong alignment on UPSdkUITwoButtonsUI");
static_assert(sizeof(UPSdkUITwoButtonsUI) == 0x0003D8, "Wrong size on UPSdkUITwoButtonsUI");
static_assert(offsetof(UPSdkUITwoButtonsUI, OverlayImage) == 0x000360, "Member 'UPSdkUITwoButtonsUI::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, BackgroundImage) == 0x000368, "Member 'UPSdkUITwoButtonsUI::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, CloseButton) == 0x000370, "Member 'UPSdkUITwoButtonsUI::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, TitleTextBlock) == 0x000378, "Member 'UPSdkUITwoButtonsUI::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, ContentTextBlock) == 0x000380, "Member 'UPSdkUITwoButtonsUI::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, CommitButton) == 0x000388, "Member 'UPSdkUITwoButtonsUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, CommitButtonTextBlock) == 0x000390, "Member 'UPSdkUITwoButtonsUI::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, CancelButton) == 0x000398, "Member 'UPSdkUITwoButtonsUI::CancelButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsUI, CancelButtonTextBlock) == 0x0003A0, "Member 'UPSdkUITwoButtonsUI::CancelButtonTextBlock' has a wrong offset!");

// Class PSDKBasic.PSdkUITwoButtonsVerticalUI
// 0x0078 (0x03D8 - 0x0360)
class UPSdkUITwoButtonsVerticalUI final : public UPSdkUIBaseWidget
{
public:
	class UImage*                                 OverlayImage;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 BackgroundImage;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CloseButton;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TitleTextBlock;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ContentTextBlock;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CommitButton;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             CommitButtonTextBlock;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CancelButton;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             CancelButtonTextBlock;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x30];                                     // 0x03A8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancelButtonClicked();
	void OnCancelButtonHovered();
	void OnCancelButtonPressed();
	void OnCancelButtonReleased();
	void OnCancelButtonUnhovered();
	void OnCloseButtonReleased();
	void OnCommitButtonReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkUITwoButtonsVerticalUI">();
	}
	static class UPSdkUITwoButtonsVerticalUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkUITwoButtonsVerticalUI>();
	}
};
static_assert(alignof(UPSdkUITwoButtonsVerticalUI) == 0x000008, "Wrong alignment on UPSdkUITwoButtonsVerticalUI");
static_assert(sizeof(UPSdkUITwoButtonsVerticalUI) == 0x0003D8, "Wrong size on UPSdkUITwoButtonsVerticalUI");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, OverlayImage) == 0x000360, "Member 'UPSdkUITwoButtonsVerticalUI::OverlayImage' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, BackgroundImage) == 0x000368, "Member 'UPSdkUITwoButtonsVerticalUI::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, CloseButton) == 0x000370, "Member 'UPSdkUITwoButtonsVerticalUI::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, TitleTextBlock) == 0x000378, "Member 'UPSdkUITwoButtonsVerticalUI::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, ContentTextBlock) == 0x000380, "Member 'UPSdkUITwoButtonsVerticalUI::ContentTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, CommitButton) == 0x000388, "Member 'UPSdkUITwoButtonsVerticalUI::CommitButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, CommitButtonTextBlock) == 0x000390, "Member 'UPSdkUITwoButtonsVerticalUI::CommitButtonTextBlock' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, CancelButton) == 0x000398, "Member 'UPSdkUITwoButtonsVerticalUI::CancelButton' has a wrong offset!");
static_assert(offsetof(UPSdkUITwoButtonsVerticalUI, CancelButtonTextBlock) == 0x0003A0, "Member 'UPSdkUITwoButtonsVerticalUI::CancelButtonTextBlock' has a wrong offset!");

// Class PSDKBasic.PSWebBrowser
// 0x0078 (0x0258 - 0x01E0)
class UPSWebBrowser final : public UWebBrowser
{
public:
	TMulticastInlineDelegate<void(const class FText& Text)> OnTitleChanged;                          // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadCompleted;                                   // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadError;                                       // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadStarted;                                     // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& String)> OnJsAction;                          // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x28];                                     // 0x0230(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Handle(const class FString& Params_0);

	void Reload() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSWebBrowser">();
	}
	static class UPSWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSWebBrowser>();
	}
};
static_assert(alignof(UPSWebBrowser) == 0x000008, "Wrong alignment on UPSWebBrowser");
static_assert(sizeof(UPSWebBrowser) == 0x000258, "Wrong size on UPSWebBrowser");
static_assert(offsetof(UPSWebBrowser, OnTitleChanged) == 0x0001E0, "Member 'UPSWebBrowser::OnTitleChanged' has a wrong offset!");
static_assert(offsetof(UPSWebBrowser, OnLoadCompleted) == 0x0001F0, "Member 'UPSWebBrowser::OnLoadCompleted' has a wrong offset!");
static_assert(offsetof(UPSWebBrowser, OnLoadError) == 0x000200, "Member 'UPSWebBrowser::OnLoadError' has a wrong offset!");
static_assert(offsetof(UPSWebBrowser, OnLoadStarted) == 0x000210, "Member 'UPSWebBrowser::OnLoadStarted' has a wrong offset!");
static_assert(offsetof(UPSWebBrowser, OnJsAction) == 0x000220, "Member 'UPSWebBrowser::OnJsAction' has a wrong offset!");

}

