#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKPayPaperCommon

#include "Basic.hpp"

#include "PSDKBasic_structs.hpp"


namespace SDK
{

// ScriptStruct PSDKPayPaperCommon.PSdkPayPaperYouthChargeModel
// 0x001C (0x001C - 0x0000)
struct FPSdkPayPaperYouthChargeModel final
{
public:
	int32                                         Age;                                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AuthStatus;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         day_money;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         zolimitneId;                                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         month_money;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         month_remain_money;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         once_money_limit;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkPayPaperYouthChargeModel) == 0x000004, "Wrong alignment on FPSdkPayPaperYouthChargeModel");
static_assert(sizeof(FPSdkPayPaperYouthChargeModel) == 0x00001C, "Wrong size on FPSdkPayPaperYouthChargeModel");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, Age) == 0x000000, "Member 'FPSdkPayPaperYouthChargeModel::Age' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, AuthStatus) == 0x000004, "Member 'FPSdkPayPaperYouthChargeModel::AuthStatus' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, day_money) == 0x000008, "Member 'FPSdkPayPaperYouthChargeModel::day_money' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, zolimitneId) == 0x00000C, "Member 'FPSdkPayPaperYouthChargeModel::zolimitneId' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, month_money) == 0x000010, "Member 'FPSdkPayPaperYouthChargeModel::month_money' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, month_remain_money) == 0x000014, "Member 'FPSdkPayPaperYouthChargeModel::month_remain_money' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperYouthChargeModel, once_money_limit) == 0x000018, "Member 'FPSdkPayPaperYouthChargeModel::once_money_limit' has a wrong offset!");

// ScriptStruct PSDKPayPaperCommon.Content
// 0x0020 (0x0020 - 0x0000)
struct FContent final
{
public:
	class FString                                 lang;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FContent) == 0x000008, "Wrong alignment on FContent");
static_assert(sizeof(FContent) == 0x000020, "Wrong size on FContent");
static_assert(offsetof(FContent, lang) == 0x000000, "Member 'FContent::lang' has a wrong offset!");
static_assert(offsetof(FContent, Text) == 0x000010, "Member 'FContent::Text' has a wrong offset!");

// ScriptStruct PSDKPayPaperCommon.Tip
// 0x0018 (0x0018 - 0x0000)
struct FTip final
{
public:
	int32                                         sort;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContent>                       Content;                                           // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTip) == 0x000008, "Wrong alignment on FTip");
static_assert(sizeof(FTip) == 0x000018, "Wrong size on FTip");
static_assert(offsetof(FTip, sort) == 0x000000, "Member 'FTip::sort' has a wrong offset!");
static_assert(offsetof(FTip, Content) == 0x000008, "Member 'FTip::Content' has a wrong offset!");

// ScriptStruct PSDKPayPaperCommon.ChargeConfig
// 0x0040 (0x0040 - 0x0000)
struct FChargeConfig final
{
public:
	int32                                         sort;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 client_id;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Area;                                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         charge_type;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTip>                           tips;                                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChargeConfig) == 0x000008, "Wrong alignment on FChargeConfig");
static_assert(sizeof(FChargeConfig) == 0x000040, "Wrong size on FChargeConfig");
static_assert(offsetof(FChargeConfig, sort) == 0x000000, "Member 'FChargeConfig::sort' has a wrong offset!");
static_assert(offsetof(FChargeConfig, client_id) == 0x000008, "Member 'FChargeConfig::client_id' has a wrong offset!");
static_assert(offsetof(FChargeConfig, Area) == 0x000018, "Member 'FChargeConfig::Area' has a wrong offset!");
static_assert(offsetof(FChargeConfig, charge_type) == 0x000028, "Member 'FChargeConfig::charge_type' has a wrong offset!");
static_assert(offsetof(FChargeConfig, tips) == 0x000030, "Member 'FChargeConfig::tips' has a wrong offset!");

// ScriptStruct PSDKPayPaperCommon.PSdkPayPaperDataModel
// 0x0030 (0x0030 - 0x0000)
struct FPSdkPayPaperDataModel final
{
public:
	struct FPSdkPayPaperYouthChargeModel          Youth_Charge;                                      // 0x0000(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChargeConfig>                  chargeConfigs;                                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkPayPaperDataModel) == 0x000008, "Wrong alignment on FPSdkPayPaperDataModel");
static_assert(sizeof(FPSdkPayPaperDataModel) == 0x000030, "Wrong size on FPSdkPayPaperDataModel");
static_assert(offsetof(FPSdkPayPaperDataModel, Youth_Charge) == 0x000000, "Member 'FPSdkPayPaperDataModel::Youth_Charge' has a wrong offset!");
static_assert(offsetof(FPSdkPayPaperDataModel, chargeConfigs) == 0x000020, "Member 'FPSdkPayPaperDataModel::chargeConfigs' has a wrong offset!");

// ScriptStruct PSDKPayPaperCommon.PSdkPayPaperApiModel
// 0x0030 (0x0068 - 0x0038)
struct FPSdkPayPaperApiModel final : public FPSBffBasicModel
{
public:
	struct FPSdkPayPaperDataModel                 Data;                                              // 0x0038(0x0030)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkPayPaperApiModel) == 0x000008, "Wrong alignment on FPSdkPayPaperApiModel");
static_assert(sizeof(FPSdkPayPaperApiModel) == 0x000068, "Wrong size on FPSdkPayPaperApiModel");
static_assert(offsetof(FPSdkPayPaperApiModel, Data) == 0x000038, "Member 'FPSdkPayPaperApiModel::Data' has a wrong offset!");

}

