#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKLogin

#include "Basic.hpp"

#include "PSDKBasic_structs.hpp"


namespace SDK
{

// ScriptStruct PSDKLogin.PSdkAccountExistsInfoData
// 0x0001 (0x0001 - 0x0000)
struct FPSdkAccountExistsInfoData final
{
public:
	bool                                          Exists;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPSdkAccountExistsInfoData) == 0x000001, "Wrong alignment on FPSdkAccountExistsInfoData");
static_assert(sizeof(FPSdkAccountExistsInfoData) == 0x000001, "Wrong size on FPSdkAccountExistsInfoData");
static_assert(offsetof(FPSdkAccountExistsInfoData, Exists) == 0x000000, "Member 'FPSdkAccountExistsInfoData::Exists' has a wrong offset!");

// ScriptStruct PSDKLogin.PSdkAccountExistsModel
// 0x0008 (0x0040 - 0x0038)
struct FPSdkAccountExistsModel final : public FPSBffBasicModel
{
public:
	struct FPSdkAccountExistsInfoData             Data;                                              // 0x0038(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPSdkAccountExistsModel) == 0x000008, "Wrong alignment on FPSdkAccountExistsModel");
static_assert(sizeof(FPSdkAccountExistsModel) == 0x000040, "Wrong size on FPSdkAccountExistsModel");
static_assert(offsetof(FPSdkAccountExistsModel, Data) == 0x000038, "Member 'FPSdkAccountExistsModel::Data' has a wrong offset!");

}

