#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSDKPayPaperPC

#include "Basic.hpp"

#include "PSDKBasic_classes.hpp"


namespace SDK
{

// Class PSDKPayPaperPC.PSDKPaperPayTip
// 0x0008 (0x0368 - 0x0360)
class UPSDKPaperPayTip final : public UPSdkUIBaseWidget
{
public:
	class UTextBlock*                             TipTextBlock;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSDKPaperPayTip">();
	}
	static class UPSDKPaperPayTip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSDKPaperPayTip>();
	}
};
static_assert(alignof(UPSDKPaperPayTip) == 0x000008, "Wrong alignment on UPSDKPaperPayTip");
static_assert(sizeof(UPSDKPaperPayTip) == 0x000368, "Wrong size on UPSDKPaperPayTip");
static_assert(offsetof(UPSDKPaperPayTip, TipTextBlock) == 0x000360, "Member 'UPSDKPaperPayTip::TipTextBlock' has a wrong offset!");

// Class PSDKPayPaperPC.PSdkPayOverseasUI
// 0x0050 (0x03B0 - 0x0360)
class UPSdkPayOverseasUI final : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x30];                                     // 0x0360(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UPSWebBrowser*                          PSPayWebBrowser;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BackgroundImage;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Handle(const class FString& Params_0);
	void OnCloseButton();
	void OnPrintButton();
	void Setup();
	void WebBrowerLoadCompleted();
	void WebBrowerLoadError();
	void WebBrowerLoadStarted();
	void WebBrowserLoadUrlChanged(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSdkPayOverseasUI">();
	}
	static class UPSdkPayOverseasUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSdkPayOverseasUI>();
	}
};
static_assert(alignof(UPSdkPayOverseasUI) == 0x000008, "Wrong alignment on UPSdkPayOverseasUI");
static_assert(sizeof(UPSdkPayOverseasUI) == 0x0003B0, "Wrong size on UPSdkPayOverseasUI");
static_assert(offsetof(UPSdkPayOverseasUI, PSPayWebBrowser) == 0x000390, "Member 'UPSdkPayOverseasUI::PSPayWebBrowser' has a wrong offset!");
static_assert(offsetof(UPSdkPayOverseasUI, BackgroundImage) == 0x000398, "Member 'UPSdkPayOverseasUI::BackgroundImage' has a wrong offset!");

// Class PSDKPayPaperPC.PSPaperPayPCChargeTypeItemWidget
// 0x0048 (0x03A8 - 0x0360)
class UPSPaperPayPCChargeTypeItemWidget final : public UPSdkUIBaseWidget
{
public:
	class UImage*                                 PayLogo;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                PayButton;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWrapBox*                               TipsWrapBox;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x30];                                     // 0x0378(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReleaseButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSPaperPayPCChargeTypeItemWidget">();
	}
	static class UPSPaperPayPCChargeTypeItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSPaperPayPCChargeTypeItemWidget>();
	}
};
static_assert(alignof(UPSPaperPayPCChargeTypeItemWidget) == 0x000008, "Wrong alignment on UPSPaperPayPCChargeTypeItemWidget");
static_assert(sizeof(UPSPaperPayPCChargeTypeItemWidget) == 0x0003A8, "Wrong size on UPSPaperPayPCChargeTypeItemWidget");
static_assert(offsetof(UPSPaperPayPCChargeTypeItemWidget, PayLogo) == 0x000360, "Member 'UPSPaperPayPCChargeTypeItemWidget::PayLogo' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCChargeTypeItemWidget, PayButton) == 0x000368, "Member 'UPSPaperPayPCChargeTypeItemWidget::PayButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCChargeTypeItemWidget, TipsWrapBox) == 0x000370, "Member 'UPSPaperPayPCChargeTypeItemWidget::TipsWrapBox' has a wrong offset!");

// Class PSDKPayPaperPC.PSPaperPayPCModalWidget
// 0x00B8 (0x0418 - 0x0360)
class UPSPaperPayPCModalWidget final : public UPSdkUIBaseWidget
{
public:
	class UTextBlock*                             TitleTextBlock;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             MsgTextBlock;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        ButtonWidgetSwitcher;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseButton;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                OkButton;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                FinishedButton;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ReOrderButton;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ChangedButton;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RetryButton;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x70];                                     // 0x03A8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangedButtonRelease();
	void OnCloseButtonRelease();
	void OnFinishedButtonRelease();
	void OnOkButtonRelease();
	void OnReOrderButtonRelease();
	void OnRetryButtonRelease();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSPaperPayPCModalWidget">();
	}
	static class UPSPaperPayPCModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSPaperPayPCModalWidget>();
	}
};
static_assert(alignof(UPSPaperPayPCModalWidget) == 0x000008, "Wrong alignment on UPSPaperPayPCModalWidget");
static_assert(sizeof(UPSPaperPayPCModalWidget) == 0x000418, "Wrong size on UPSPaperPayPCModalWidget");
static_assert(offsetof(UPSPaperPayPCModalWidget, TitleTextBlock) == 0x000360, "Member 'UPSPaperPayPCModalWidget::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, MsgTextBlock) == 0x000368, "Member 'UPSPaperPayPCModalWidget::MsgTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, ButtonWidgetSwitcher) == 0x000370, "Member 'UPSPaperPayPCModalWidget::ButtonWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, CloseButton) == 0x000378, "Member 'UPSPaperPayPCModalWidget::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, OkButton) == 0x000380, "Member 'UPSPaperPayPCModalWidget::OkButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, FinishedButton) == 0x000388, "Member 'UPSPaperPayPCModalWidget::FinishedButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, ReOrderButton) == 0x000390, "Member 'UPSPaperPayPCModalWidget::ReOrderButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, ChangedButton) == 0x000398, "Member 'UPSPaperPayPCModalWidget::ChangedButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCModalWidget, RetryButton) == 0x0003A0, "Member 'UPSPaperPayPCModalWidget::RetryButton' has a wrong offset!");

// Class PSDKPayPaperPC.PSPaperPayPCSuccessToast
// 0x0048 (0x03A8 - 0x0360)
class UPSPaperPayPCSuccessToast final : public UPSdkUIBaseWidget
{
public:
	uint8                                         Pad_360[0x48];                                     // 0x0360(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSPaperPayPCSuccessToast">();
	}
	static class UPSPaperPayPCSuccessToast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSPaperPayPCSuccessToast>();
	}
};
static_assert(alignof(UPSPaperPayPCSuccessToast) == 0x000008, "Wrong alignment on UPSPaperPayPCSuccessToast");
static_assert(sizeof(UPSPaperPayPCSuccessToast) == 0x0003A8, "Wrong size on UPSPaperPayPCSuccessToast");

// Class PSDKPayPaperPC.PSPaperPayPCView
// 0x01A0 (0x0500 - 0x0360)
class UPSPaperPayPCView final : public UPSdkUIBaseWidget
{
public:
	class UButton*                                CloseButton;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 AliQrCode;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 WxQrCode;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 ProductImage;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CountdownTextBlock;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             PriceTextBlock;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             OriginalPriceTextBlock;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ProductNameTextBlock;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RoleIdTextBlock;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             RoleNameTextBlock;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               RoleNameSizeBox;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        QrCodeSwitcher;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                ButtonSpacer;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPSPaperPayPCChargeTypeItemWidget*      AliPayButton;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPSPaperPayPCChargeTypeItemWidget*      WxPayButton;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPSPaperPayPCModalWidget*               PaperPayModalWidget;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           RetryQrCodeBox;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RetryQrCodeButton;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 QrCodeMask;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x108];                                    // 0x03F8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangedButtonDelegate(const class FString& Info);
	void OnCloseButton();
	void OnCloseButtonDelegate(const bool CloseModal);
	void OnFinishedButtonDelegate(const class FString& Info);
	void OnOkButtonDelegate(const class FString& Info);
	void OnPayButtonClicked(const class FString& ChargeType);
	void OnReOrderButtonDelegate(const class FString& Info);
	void OnRetryButtonDelegate(const class FString& Info);
	void OnRetryQrCodeButtonClicked();
	void SetProductImage(class UTexture2DDynamic* DownloadedTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PSPaperPayPCView">();
	}
	static class UPSPaperPayPCView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPSPaperPayPCView>();
	}
};
static_assert(alignof(UPSPaperPayPCView) == 0x000008, "Wrong alignment on UPSPaperPayPCView");
static_assert(sizeof(UPSPaperPayPCView) == 0x000500, "Wrong size on UPSPaperPayPCView");
static_assert(offsetof(UPSPaperPayPCView, CloseButton) == 0x000360, "Member 'UPSPaperPayPCView::CloseButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, AliQrCode) == 0x000368, "Member 'UPSPaperPayPCView::AliQrCode' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, WxQrCode) == 0x000370, "Member 'UPSPaperPayPCView::WxQrCode' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, ProductImage) == 0x000378, "Member 'UPSPaperPayPCView::ProductImage' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, CountdownTextBlock) == 0x000380, "Member 'UPSPaperPayPCView::CountdownTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, PriceTextBlock) == 0x000388, "Member 'UPSPaperPayPCView::PriceTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, OriginalPriceTextBlock) == 0x000390, "Member 'UPSPaperPayPCView::OriginalPriceTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, ProductNameTextBlock) == 0x000398, "Member 'UPSPaperPayPCView::ProductNameTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, RoleIdTextBlock) == 0x0003A0, "Member 'UPSPaperPayPCView::RoleIdTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, RoleNameTextBlock) == 0x0003A8, "Member 'UPSPaperPayPCView::RoleNameTextBlock' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, RoleNameSizeBox) == 0x0003B0, "Member 'UPSPaperPayPCView::RoleNameSizeBox' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, QrCodeSwitcher) == 0x0003B8, "Member 'UPSPaperPayPCView::QrCodeSwitcher' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, ButtonSpacer) == 0x0003C0, "Member 'UPSPaperPayPCView::ButtonSpacer' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, AliPayButton) == 0x0003C8, "Member 'UPSPaperPayPCView::AliPayButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, WxPayButton) == 0x0003D0, "Member 'UPSPaperPayPCView::WxPayButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, PaperPayModalWidget) == 0x0003D8, "Member 'UPSPaperPayPCView::PaperPayModalWidget' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, RetryQrCodeBox) == 0x0003E0, "Member 'UPSPaperPayPCView::RetryQrCodeBox' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, RetryQrCodeButton) == 0x0003E8, "Member 'UPSPaperPayPCView::RetryQrCodeButton' has a wrong offset!");
static_assert(offsetof(UPSPaperPayPCView, QrCodeMask) == 0x0003F0, "Member 'UPSPaperPayPCView::QrCodeMask' has a wrong offset!");

}

