#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichTextBlockInlineDecorator

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// Class RichTextBlockInlineDecorator.RichTextBlockInlineDecorator
// 0x0000 (0x0028 - 0x0028)
class URichTextBlockInlineDecorator final : public URichTextBlockDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextBlockInlineDecorator">();
	}
	static class URichTextBlockInlineDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlockInlineDecorator>();
	}
};
static_assert(alignof(URichTextBlockInlineDecorator) == 0x000008, "Wrong alignment on URichTextBlockInlineDecorator");
static_assert(sizeof(URichTextBlockInlineDecorator) == 0x000028, "Wrong size on URichTextBlockInlineDecorator");

// Class RichTextBlockInlineDecorator.X6RichTextBlockImageDecorator
// 0x0018 (0x0040 - 0x0028)
class UX6RichTextBlockImageDecorator final : public URichTextBlockDecorator
{
public:
	float                                         Scale;                                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     InlineTextureArray;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6RichTextBlockImageDecorator">();
	}
	static class UX6RichTextBlockImageDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6RichTextBlockImageDecorator>();
	}
};
static_assert(alignof(UX6RichTextBlockImageDecorator) == 0x000008, "Wrong alignment on UX6RichTextBlockImageDecorator");
static_assert(sizeof(UX6RichTextBlockImageDecorator) == 0x000040, "Wrong size on UX6RichTextBlockImageDecorator");
static_assert(offsetof(UX6RichTextBlockImageDecorator, Scale) == 0x000028, "Member 'UX6RichTextBlockImageDecorator::Scale' has a wrong offset!");
static_assert(offsetof(UX6RichTextBlockImageDecorator, InlineTextureArray) == 0x000030, "Member 'UX6RichTextBlockImageDecorator::InlineTextureArray' has a wrong offset!");

}

