#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Candela

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Candela.S_Candela
// 0x0048 (0x0048 - 0x0000)
struct FS_Candela final
{
public:
	class UTexture*                               SkyOccTexture_10_71D116C941CF0C48BD944FAE1D33D8ED; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               SkyHemisphereColorTexture_13_154F87294B4A4428CB8BFEB77203124D; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FunctionLocation_16_1A96D21B4B9A3D6E9DF8E1A78D52F0F0; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FunctionHeightRange_18_380CEAE0436F101FEBDE33B5DBD85E82; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FunctionSmoothHeight_25_018A77ED42E5D4AAAAC9BE9EC62574B4; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FunctionScale_21_9F8571A14E32FDAF6D7DBBA57DEA655C; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FunctionLeaking_23_AC15EC3C4F7175232A6FAFB35489FB75; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Candela) == 0x000008, "Wrong alignment on FS_Candela");
static_assert(sizeof(FS_Candela) == 0x000048, "Wrong size on FS_Candela");
static_assert(offsetof(FS_Candela, SkyOccTexture_10_71D116C941CF0C48BD944FAE1D33D8ED) == 0x000000, "Member 'FS_Candela::SkyOccTexture_10_71D116C941CF0C48BD944FAE1D33D8ED' has a wrong offset!");
static_assert(offsetof(FS_Candela, SkyHemisphereColorTexture_13_154F87294B4A4428CB8BFEB77203124D) == 0x000008, "Member 'FS_Candela::SkyHemisphereColorTexture_13_154F87294B4A4428CB8BFEB77203124D' has a wrong offset!");
static_assert(offsetof(FS_Candela, FunctionLocation_16_1A96D21B4B9A3D6E9DF8E1A78D52F0F0) == 0x000010, "Member 'FS_Candela::FunctionLocation_16_1A96D21B4B9A3D6E9DF8E1A78D52F0F0' has a wrong offset!");
static_assert(offsetof(FS_Candela, FunctionHeightRange_18_380CEAE0436F101FEBDE33B5DBD85E82) == 0x000020, "Member 'FS_Candela::FunctionHeightRange_18_380CEAE0436F101FEBDE33B5DBD85E82' has a wrong offset!");
static_assert(offsetof(FS_Candela, FunctionSmoothHeight_25_018A77ED42E5D4AAAAC9BE9EC62574B4) == 0x000030, "Member 'FS_Candela::FunctionSmoothHeight_25_018A77ED42E5D4AAAAC9BE9EC62574B4' has a wrong offset!");
static_assert(offsetof(FS_Candela, FunctionScale_21_9F8571A14E32FDAF6D7DBBA57DEA655C) == 0x000038, "Member 'FS_Candela::FunctionScale_21_9F8571A14E32FDAF6D7DBBA57DEA655C' has a wrong offset!");
static_assert(offsetof(FS_Candela, FunctionLeaking_23_AC15EC3C4F7175232A6FAFB35489FB75) == 0x000040, "Member 'FS_Candela::FunctionLeaking_23_AC15EC3C4F7175232A6FAFB35489FB75' has a wrong offset!");

}

