#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_FaculaBrush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_FaculaBrush.S_FaculaBrush
// 0x0080 (0x0080 - 0x0000)
struct FS_FaculaBrush final
{
public:
	struct FTransform                             BrushTransform_10_3252410944565ACF9D007BA7E7A22EDA; // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               BrushTexture_11_8EA6900D4F922646DEB0AB87298D5EA4;  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BrushIntensity_5_888FBEAE40BB83D6C6A0159C97864CAD; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconScale_7_BA08F21847B9995B1C184299BB14781A;      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_FaculaBrush) == 0x000010, "Wrong alignment on FS_FaculaBrush");
static_assert(sizeof(FS_FaculaBrush) == 0x000080, "Wrong size on FS_FaculaBrush");
static_assert(offsetof(FS_FaculaBrush, BrushTransform_10_3252410944565ACF9D007BA7E7A22EDA) == 0x000000, "Member 'FS_FaculaBrush::BrushTransform_10_3252410944565ACF9D007BA7E7A22EDA' has a wrong offset!");
static_assert(offsetof(FS_FaculaBrush, BrushTexture_11_8EA6900D4F922646DEB0AB87298D5EA4) == 0x000060, "Member 'FS_FaculaBrush::BrushTexture_11_8EA6900D4F922646DEB0AB87298D5EA4' has a wrong offset!");
static_assert(offsetof(FS_FaculaBrush, BrushIntensity_5_888FBEAE40BB83D6C6A0159C97864CAD) == 0x000068, "Member 'FS_FaculaBrush::BrushIntensity_5_888FBEAE40BB83D6C6A0159C97864CAD' has a wrong offset!");
static_assert(offsetof(FS_FaculaBrush, IconScale_7_BA08F21847B9995B1C184299BB14781A) == 0x000070, "Member 'FS_FaculaBrush::IconScale_7_BA08F21847B9995B1C184299BB14781A' has a wrong offset!");

}

