#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LevelConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_CLFSConfig_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LevelConfig.S_LevelConfig
// 0x00E0 (0x00E0 - 0x0000)
struct FS_LevelConfig final
{
public:
	bool                                          UseCurveFog_6_D4D071C4463AEB43FCC40D93E123E58E;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SyncFogZ_5_766EA40F4B20F7023A5826B2A6AC845C;       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FogZ_Remapping_13_C603C886466FA309892E24B7514C4F84; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalGMUI_1_981DE2024360032722CB09822F73BE8D;      // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EditorUMG_24_7204888F44072F90038E97B6B6B189C2;     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               SunCycleRotator_38_6BCC84894632348C624002A5ABAC600A; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               MoonCycleRotator_9_BBE883794093F66D6CF88480101EC9FF; // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CurrentSpanName_16_57A901E04246AC7EB49E7F8BE20DE430; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CurrentWeatherName_19_8574DB0B45101BF74444398BA4F6997A; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FS_CLFSConfig                          CLFS_22_8DDCD2F643DCA1E4E92D75A5B9E9D50A;          // 0x0058(0x0070)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          RenderStateDirty_26_2F1683CB43F09F85DFC48FA66BA925D0; // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckEndplay_30_FE23452041CADE0F82ACE38EE37CBED3;  // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FarShadowCount_35_A62DABBB442024A2421EB9A880269CF0; // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkyLightLowerHemisphere_40_CA82D423414BBF198B1F1EA8F0766452; // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticFarShadowAsset*                  ShadowDataAsset_46_DF19D6EB4EB12FB911C53391177F5888; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LevelConfig) == 0x000008, "Wrong alignment on FS_LevelConfig");
static_assert(sizeof(FS_LevelConfig) == 0x0000E0, "Wrong size on FS_LevelConfig");
static_assert(offsetof(FS_LevelConfig, UseCurveFog_6_D4D071C4463AEB43FCC40D93E123E58E) == 0x000000, "Member 'FS_LevelConfig::UseCurveFog_6_D4D071C4463AEB43FCC40D93E123E58E' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, SyncFogZ_5_766EA40F4B20F7023A5826B2A6AC845C) == 0x000001, "Member 'FS_LevelConfig::SyncFogZ_5_766EA40F4B20F7023A5826B2A6AC845C' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, FogZ_Remapping_13_C603C886466FA309892E24B7514C4F84) == 0x000002, "Member 'FS_LevelConfig::FogZ_Remapping_13_C603C886466FA309892E24B7514C4F84' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, LocalGMUI_1_981DE2024360032722CB09822F73BE8D) == 0x000003, "Member 'FS_LevelConfig::LocalGMUI_1_981DE2024360032722CB09822F73BE8D' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, EditorUMG_24_7204888F44072F90038E97B6B6B189C2) == 0x000004, "Member 'FS_LevelConfig::EditorUMG_24_7204888F44072F90038E97B6B6B189C2' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, SunCycleRotator_38_6BCC84894632348C624002A5ABAC600A) == 0x000008, "Member 'FS_LevelConfig::SunCycleRotator_38_6BCC84894632348C624002A5ABAC600A' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, MoonCycleRotator_9_BBE883794093F66D6CF88480101EC9FF) == 0x000020, "Member 'FS_LevelConfig::MoonCycleRotator_9_BBE883794093F66D6CF88480101EC9FF' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, CurrentSpanName_16_57A901E04246AC7EB49E7F8BE20DE430) == 0x000038, "Member 'FS_LevelConfig::CurrentSpanName_16_57A901E04246AC7EB49E7F8BE20DE430' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, CurrentWeatherName_19_8574DB0B45101BF74444398BA4F6997A) == 0x000048, "Member 'FS_LevelConfig::CurrentWeatherName_19_8574DB0B45101BF74444398BA4F6997A' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, CLFS_22_8DDCD2F643DCA1E4E92D75A5B9E9D50A) == 0x000058, "Member 'FS_LevelConfig::CLFS_22_8DDCD2F643DCA1E4E92D75A5B9E9D50A' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, RenderStateDirty_26_2F1683CB43F09F85DFC48FA66BA925D0) == 0x0000C8, "Member 'FS_LevelConfig::RenderStateDirty_26_2F1683CB43F09F85DFC48FA66BA925D0' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, CheckEndplay_30_FE23452041CADE0F82ACE38EE37CBED3) == 0x0000C9, "Member 'FS_LevelConfig::CheckEndplay_30_FE23452041CADE0F82ACE38EE37CBED3' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, FarShadowCount_35_A62DABBB442024A2421EB9A880269CF0) == 0x0000CC, "Member 'FS_LevelConfig::FarShadowCount_35_A62DABBB442024A2421EB9A880269CF0' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, SkyLightLowerHemisphere_40_CA82D423414BBF198B1F1EA8F0766452) == 0x0000D0, "Member 'FS_LevelConfig::SkyLightLowerHemisphere_40_CA82D423414BBF198B1F1EA8F0766452' has a wrong offset!");
static_assert(offsetof(FS_LevelConfig, ShadowDataAsset_46_DF19D6EB4EB12FB911C53391177F5888) == 0x0000D8, "Member 'FS_LevelConfig::ShadowDataAsset_46_DF19D6EB4EB12FB911C53391177F5888' has a wrong offset!");

}

