#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LevelConfigScalability

#include "Basic.hpp"

#include "S_ScalabilityValue_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LevelConfigScalability.S_LevelConfigScalability
// 0x0050 (0x0050 - 0x0000)
struct FS_LevelConfigScalability final
{
public:
	class FString                                 ConsoleVariable_17_949991CD469D29F132F60FAAF9339CD2; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FS_ScalabilityValue                    PC_24_A41FD6BF4D1D71D46B54699788DE255F;            // 0x0010(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ScalabilityValue                    Mobile_25_7F29795C459958A1EBD9F8B00279984C;        // 0x0030(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LevelConfigScalability) == 0x000008, "Wrong alignment on FS_LevelConfigScalability");
static_assert(sizeof(FS_LevelConfigScalability) == 0x000050, "Wrong size on FS_LevelConfigScalability");
static_assert(offsetof(FS_LevelConfigScalability, ConsoleVariable_17_949991CD469D29F132F60FAAF9339CD2) == 0x000000, "Member 'FS_LevelConfigScalability::ConsoleVariable_17_949991CD469D29F132F60FAAF9339CD2' has a wrong offset!");
static_assert(offsetof(FS_LevelConfigScalability, PC_24_A41FD6BF4D1D71D46B54699788DE255F) == 0x000010, "Member 'FS_LevelConfigScalability::PC_24_A41FD6BF4D1D71D46B54699788DE255F' has a wrong offset!");
static_assert(offsetof(FS_LevelConfigScalability, Mobile_25_7F29795C459958A1EBD9F8B00279984C) == 0x000030, "Member 'FS_LevelConfigScalability::Mobile_25_7F29795C459958A1EBD9F8B00279984C' has a wrong offset!");

}

