#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UrbanLight

#include "Basic.hpp"

#include "S_TimeRange_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UrbanLight.S_UrbanLight
// 0x0058 (0x0058 - 0x0000)
struct FS_UrbanLight final
{
public:
	int32                                         id_7_D9E6CA36458239026C5DA98FADF60093;             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        mpc_path_11_63D6A8EB4D614062D96A4886362B43F4;      // 0x0008(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int64                                         rule_id_26_35641D534114122E068B6DAE5F2AD39A;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TimeRange                           on_time_range_17_FA3C674449E1BF862DB33CBD1454C39B; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          on_when_rain_20_5759564D4222D38EDD84F7B16DE38FB9;  // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          on_when_cloudy_22_92CA26BF4D4F052AEFA024B53A2C208E; // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   tips_25_3422D6784C75F3B467725CAFB6563FD9;          // 0x0048(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_UrbanLight) == 0x000008, "Wrong alignment on FS_UrbanLight");
static_assert(sizeof(FS_UrbanLight) == 0x000058, "Wrong size on FS_UrbanLight");
static_assert(offsetof(FS_UrbanLight, id_7_D9E6CA36458239026C5DA98FADF60093) == 0x000000, "Member 'FS_UrbanLight::id_7_D9E6CA36458239026C5DA98FADF60093' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, mpc_path_11_63D6A8EB4D614062D96A4886362B43F4) == 0x000008, "Member 'FS_UrbanLight::mpc_path_11_63D6A8EB4D614062D96A4886362B43F4' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, rule_id_26_35641D534114122E068B6DAE5F2AD39A) == 0x000028, "Member 'FS_UrbanLight::rule_id_26_35641D534114122E068B6DAE5F2AD39A' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, on_time_range_17_FA3C674449E1BF862DB33CBD1454C39B) == 0x000030, "Member 'FS_UrbanLight::on_time_range_17_FA3C674449E1BF862DB33CBD1454C39B' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, on_when_rain_20_5759564D4222D38EDD84F7B16DE38FB9) == 0x000040, "Member 'FS_UrbanLight::on_when_rain_20_5759564D4222D38EDD84F7B16DE38FB9' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, on_when_cloudy_22_92CA26BF4D4F052AEFA024B53A2C208E) == 0x000041, "Member 'FS_UrbanLight::on_when_cloudy_22_92CA26BF4D4F052AEFA024B53A2C208E' has a wrong offset!");
static_assert(offsetof(FS_UrbanLight, tips_25_3422D6784C75F3B467725CAFB6563FD9) == 0x000048, "Member 'FS_UrbanLight::tips_25_3422D6784C75F3B467725CAFB6563FD9' has a wrong offset!");

}

