#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SMSystem.ESMNetworkConfigurationType
// NumValues: 0x0004
enum class ESMNetworkConfigurationType : uint8
{
	SM_Client                                = 0,
	SM_Server                                = 1,
	SM_ClientAndServer                       = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMExposedFunctionExecutionType
// NumValues: 0x0004
enum class ESMExposedFunctionExecutionType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_None                                  = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMConditionalEvaluationType
// NumValues: 0x0005
enum class ESMConditionalEvaluationType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_AlwaysFalse                           = 2,
	SM_AlwaysTrue                            = 3,
	SM_MAX                                   = 4,
};

// Enum SMSystem.ESMTransactionType
// NumValues: 0x0009
enum class ESMTransactionType : uint8
{
	SM_Unknown                               = 0,
	SM_Transition                            = 1,
	SM_State                                 = 2,
	SM_FullSync                              = 3,
	SM_Start                                 = 4,
	SM_Stop                                  = 5,
	SM_Initialize                            = 6,
	SM_Shutdown                              = 7,
	SM_MAX                                   = 8,
};

// ScriptStruct SMSystem.SMInfo_Base
// 0x0060 (0x0060 - 0x0000)
struct FSMInfo_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerGuid;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerNodeGuid;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMNodeInstance*                        NodeInstance;                                      // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMInfo_Base) == 0x000008, "Wrong alignment on FSMInfo_Base");
static_assert(sizeof(FSMInfo_Base) == 0x000060, "Wrong size on FSMInfo_Base");
static_assert(offsetof(FSMInfo_Base, NodeName) == 0x000008, "Member 'FSMInfo_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, Guid) == 0x000018, "Member 'FSMInfo_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerGuid) == 0x000028, "Member 'FSMInfo_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeGuid) == 0x000038, "Member 'FSMInfo_Base::NodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, OwnerNodeGuid) == 0x000048, "Member 'FSMInfo_Base::OwnerNodeGuid' has a wrong offset!");
static_assert(offsetof(FSMInfo_Base, NodeInstance) == 0x000058, "Member 'FSMInfo_Base::NodeInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMStateHistory
// 0x0020 (0x0020 - 0x0000)
struct FSMStateHistory final
{
public:
	struct FGuid                                  StateGuid;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              StartTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerTimeInState;                                 // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMStateHistory) == 0x000008, "Wrong alignment on FSMStateHistory");
static_assert(sizeof(FSMStateHistory) == 0x000020, "Wrong size on FSMStateHistory");
static_assert(offsetof(FSMStateHistory, StateGuid) == 0x000000, "Member 'FSMStateHistory::StateGuid' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, StartTime) == 0x000010, "Member 'FSMStateHistory::StartTime' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, TimeInState) == 0x000018, "Member 'FSMStateHistory::TimeInState' has a wrong offset!");
static_assert(offsetof(FSMStateHistory, ServerTimeInState) == 0x00001C, "Member 'FSMStateHistory::ServerTimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionInfo
// 0x0038 (0x0098 - 0x0060)
struct FSMTransitionInfo final : public FSMInfo_Base
{
public:
	struct FGuid                                  FromStateGuid;                                     // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToStateGuid;                                       // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastNetworkTimestamp;                              // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransitionInfo) == 0x000008, "Wrong alignment on FSMTransitionInfo");
static_assert(sizeof(FSMTransitionInfo) == 0x000098, "Wrong size on FSMTransitionInfo");
static_assert(offsetof(FSMTransitionInfo, FromStateGuid) == 0x000060, "Member 'FSMTransitionInfo::FromStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, ToStateGuid) == 0x000070, "Member 'FSMTransitionInfo::ToStateGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, Priority) == 0x000080, "Member 'FSMTransitionInfo::Priority' has a wrong offset!");
static_assert(offsetof(FSMTransitionInfo, LastNetworkTimestamp) == 0x000088, "Member 'FSMTransitionInfo::LastNetworkTimestamp' has a wrong offset!");

// ScriptStruct SMSystem.SMStateInfo
// 0x0020 (0x0080 - 0x0060)
struct FSMStateInfo final : public FSMInfo_Base
{
public:
	TArray<struct FSMTransitionInfo>              OutgoingTransitions;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsEndState;                                       // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateInfo) == 0x000008, "Wrong alignment on FSMStateInfo");
static_assert(sizeof(FSMStateInfo) == 0x000080, "Wrong size on FSMStateInfo");
static_assert(offsetof(FSMStateInfo, OutgoingTransitions) == 0x000060, "Member 'FSMStateInfo::OutgoingTransitions' has a wrong offset!");
static_assert(offsetof(FSMStateInfo, bIsEndState) == 0x000070, "Member 'FSMStateInfo::bIsEndState' has a wrong offset!");

// ScriptStruct SMSystem.SMNode_Base
// 0x0090 (0x0090 - 0x0000)
struct FSMNode_Base
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeInState;                                       // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInEndState;                                     // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasUpdated;                                       // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DuplicateId;                                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PathGuid;                                          // 0x003C(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0xC];                                       // 0x004C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0058(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TemplateName;                                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            OwningInstance;                                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMNodeInstance*                        NodeInstance;                                      // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                 NodeInstanceClass;                                 // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNode_Base) == 0x000008, "Wrong alignment on FSMNode_Base");
static_assert(sizeof(FSMNode_Base) == 0x000090, "Wrong size on FSMNode_Base");
static_assert(offsetof(FSMNode_Base, TimeInState) == 0x000010, "Member 'FSMNode_Base::TimeInState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bIsInEndState) == 0x000014, "Member 'FSMNode_Base::bIsInEndState' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, bHasUpdated) == 0x000015, "Member 'FSMNode_Base::bHasUpdated' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, DuplicateId) == 0x000018, "Member 'FSMNode_Base::DuplicateId' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, Guid) == 0x00001C, "Member 'FSMNode_Base::Guid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwnerGuid) == 0x00002C, "Member 'FSMNode_Base::OwnerGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, PathGuid) == 0x00003C, "Member 'FSMNode_Base::PathGuid' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeName) == 0x000058, "Member 'FSMNode_Base::NodeName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, TemplateName) == 0x000068, "Member 'FSMNode_Base::TemplateName' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, OwningInstance) == 0x000070, "Member 'FSMNode_Base::OwningInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstance) == 0x000078, "Member 'FSMNode_Base::NodeInstance' has a wrong offset!");
static_assert(offsetof(FSMNode_Base, NodeInstanceClass) == 0x000080, "Member 'FSMNode_Base::NodeInstanceClass' has a wrong offset!");

// ScriptStruct SMSystem.SMState_Base
// 0x0070 (0x0100 - 0x0090)
struct FSMState_Base : public FSMNode_Base
{
public:
	uint8                                         bIsRootNode : 1;                                   // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUpdate : 1;                                 // 0x0090(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalTransitionsOnStart : 1;                       // 0x0090(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTickTransitionEvaluation : 1;              // 0x0090(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStayActiveOnStateChange : 1;                      // 0x0090(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowParallelReentry : 1;                         // 0x0090(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AnimGroupTag;                                      // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   StanceTagGroup;                                    // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x50];                                      // 0x00B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMState_Base) == 0x000008, "Wrong alignment on FSMState_Base");
static_assert(sizeof(FSMState_Base) == 0x000100, "Wrong size on FSMState_Base");
static_assert(offsetof(FSMState_Base, AnimGroupTag) == 0x000094, "Member 'FSMState_Base::AnimGroupTag' has a wrong offset!");
static_assert(offsetof(FSMState_Base, StanceTagGroup) == 0x0000A0, "Member 'FSMState_Base::StanceTagGroup' has a wrong offset!");

// ScriptStruct SMSystem.SMConduit
// 0x0008 (0x0108 - 0x0100)
struct FSMConduit final : public FSMState_Base
{
public:
	uint8                                         bCanEnterTransition : 1;                           // 0x0100(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x0100(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalWithTransitions : 1;                          // 0x0100(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESMConditionalEvaluationType                  ConditionalEvaluationType;                         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMConduit) == 0x000008, "Wrong alignment on FSMConduit");
static_assert(sizeof(FSMConduit) == 0x000108, "Wrong size on FSMConduit");
static_assert(offsetof(FSMConduit, ConditionalEvaluationType) == 0x000104, "Member 'FSMConduit::ConditionalEvaluationType' has a wrong offset!");

// ScriptStruct SMSystem.SMExposedFunctionHandler
// 0x0018 (0x0018 - 0x0000)
struct FSMExposedFunctionHandler final
{
public:
	class FName                                   BoundFunction;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMExposedFunctionExecutionType               ExecutionType;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFunction*                              Function;                                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FSMExposedFunctionHandler) == 0x000008, "Wrong alignment on FSMExposedFunctionHandler");
static_assert(sizeof(FSMExposedFunctionHandler) == 0x000018, "Wrong size on FSMExposedFunctionHandler");
static_assert(offsetof(FSMExposedFunctionHandler, BoundFunction) == 0x000000, "Member 'FSMExposedFunctionHandler::BoundFunction' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, ExecutionType) == 0x000008, "Member 'FSMExposedFunctionHandler::ExecutionType' has a wrong offset!");
static_assert(offsetof(FSMExposedFunctionHandler, Function) == 0x000010, "Member 'FSMExposedFunctionHandler::Function' has a wrong offset!");

// ScriptStruct SMSystem.SMExposedFunctionContainer
// 0x0010 (0x0010 - 0x0000)
struct FSMExposedFunctionContainer final
{
public:
	TArray<struct FSMExposedFunctionHandler>      ExposedFunctionHandlers;                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMExposedFunctionContainer) == 0x000008, "Wrong alignment on FSMExposedFunctionContainer");
static_assert(sizeof(FSMExposedFunctionContainer) == 0x000010, "Wrong size on FSMExposedFunctionContainer");
static_assert(offsetof(FSMExposedFunctionContainer, ExposedFunctionHandlers) == 0x000000, "Member 'FSMExposedFunctionContainer::ExposedFunctionHandlers' has a wrong offset!");

// ScriptStruct SMSystem.SMNode_FunctionHandlers
// 0x0048 (0x0048 - 0x0000)
struct FSMNode_FunctionHandlers
{
public:
	TArray<struct FSMExposedFunctionHandler>      NodeInitializedGraphEvaluators;                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      NodeShutdownGraphEvaluators;                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      OnRootStateMachineStartedGraphEvaluator;           // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      OnRootStateMachineStoppedGraphEvaluator;           // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMNode_FunctionHandlers) == 0x000008, "Wrong alignment on FSMNode_FunctionHandlers");
static_assert(sizeof(FSMNode_FunctionHandlers) == 0x000048, "Wrong size on FSMNode_FunctionHandlers");
static_assert(offsetof(FSMNode_FunctionHandlers, NodeInitializedGraphEvaluators) == 0x000000, "Member 'FSMNode_FunctionHandlers::NodeInitializedGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_FunctionHandlers, NodeShutdownGraphEvaluators) == 0x000010, "Member 'FSMNode_FunctionHandlers::NodeShutdownGraphEvaluators' has a wrong offset!");
static_assert(offsetof(FSMNode_FunctionHandlers, OnRootStateMachineStartedGraphEvaluator) == 0x000020, "Member 'FSMNode_FunctionHandlers::OnRootStateMachineStartedGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMNode_FunctionHandlers, OnRootStateMachineStoppedGraphEvaluator) == 0x000030, "Member 'FSMNode_FunctionHandlers::OnRootStateMachineStoppedGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMState_FunctionHandlers
// 0x0030 (0x0078 - 0x0048)
struct FSMState_FunctionHandlers final : public FSMNode_FunctionHandlers
{
public:
	TArray<struct FSMExposedFunctionHandler>      BeginStateGraphEvaluator;                          // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      UpdateStateGraphEvaluator;                         // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      EndStateGraphEvaluator;                            // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMState_FunctionHandlers) == 0x000008, "Wrong alignment on FSMState_FunctionHandlers");
static_assert(sizeof(FSMState_FunctionHandlers) == 0x000078, "Wrong size on FSMState_FunctionHandlers");
static_assert(offsetof(FSMState_FunctionHandlers, BeginStateGraphEvaluator) == 0x000048, "Member 'FSMState_FunctionHandlers::BeginStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState_FunctionHandlers, UpdateStateGraphEvaluator) == 0x000058, "Member 'FSMState_FunctionHandlers::UpdateStateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMState_FunctionHandlers, EndStateGraphEvaluator) == 0x000068, "Member 'FSMState_FunctionHandlers::EndStateGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMConduit_FunctionHandlers
// 0x0020 (0x0068 - 0x0048)
struct FSMConduit_FunctionHandlers final : public FSMNode_FunctionHandlers
{
public:
	TArray<struct FSMExposedFunctionHandler>      CanEnterConduitGraphEvaluator;                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      ConduitEnteredGraphEvaluator;                      // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMConduit_FunctionHandlers) == 0x000008, "Wrong alignment on FSMConduit_FunctionHandlers");
static_assert(sizeof(FSMConduit_FunctionHandlers) == 0x000068, "Wrong size on FSMConduit_FunctionHandlers");
static_assert(offsetof(FSMConduit_FunctionHandlers, CanEnterConduitGraphEvaluator) == 0x000048, "Member 'FSMConduit_FunctionHandlers::CanEnterConduitGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMConduit_FunctionHandlers, ConduitEnteredGraphEvaluator) == 0x000058, "Member 'FSMConduit_FunctionHandlers::ConduitEnteredGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMTransition_FunctionHandlers
// 0x0040 (0x0088 - 0x0048)
struct FSMTransition_FunctionHandlers final : public FSMNode_FunctionHandlers
{
public:
	TArray<struct FSMExposedFunctionHandler>      CanEnterTransitionGraphEvaluator;                  // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionEnteredGraphEvaluator;                   // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionPreEvaluateGraphEvaluator;               // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionPostEvaluateGraphEvaluator;              // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMTransition_FunctionHandlers) == 0x000008, "Wrong alignment on FSMTransition_FunctionHandlers");
static_assert(sizeof(FSMTransition_FunctionHandlers) == 0x000088, "Wrong size on FSMTransition_FunctionHandlers");
static_assert(offsetof(FSMTransition_FunctionHandlers, CanEnterTransitionGraphEvaluator) == 0x000048, "Member 'FSMTransition_FunctionHandlers::CanEnterTransitionGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition_FunctionHandlers, TransitionEnteredGraphEvaluator) == 0x000058, "Member 'FSMTransition_FunctionHandlers::TransitionEnteredGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition_FunctionHandlers, TransitionPreEvaluateGraphEvaluator) == 0x000068, "Member 'FSMTransition_FunctionHandlers::TransitionPreEvaluateGraphEvaluator' has a wrong offset!");
static_assert(offsetof(FSMTransition_FunctionHandlers, TransitionPostEvaluateGraphEvaluator) == 0x000078, "Member 'FSMTransition_FunctionHandlers::TransitionPostEvaluateGraphEvaluator' has a wrong offset!");

// ScriptStruct SMSystem.SMExposedNodeFunctions
// 0x0080 (0x0080 - 0x0000)
struct FSMExposedNodeFunctions final
{
public:
	TArray<struct FSMState_FunctionHandlers>      FSMState_FunctionHandlers;                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMConduit_FunctionHandlers>    FSMConduit_FunctionHandlers;                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMTransition_FunctionHandlers> FSMTransition_FunctionHandlers;                    // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FSMExposedFunctionContainer> GraphPropertyFunctionHandlers;            // 0x0030(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMExposedNodeFunctions) == 0x000008, "Wrong alignment on FSMExposedNodeFunctions");
static_assert(sizeof(FSMExposedNodeFunctions) == 0x000080, "Wrong size on FSMExposedNodeFunctions");
static_assert(offsetof(FSMExposedNodeFunctions, FSMState_FunctionHandlers) == 0x000000, "Member 'FSMExposedNodeFunctions::FSMState_FunctionHandlers' has a wrong offset!");
static_assert(offsetof(FSMExposedNodeFunctions, FSMConduit_FunctionHandlers) == 0x000010, "Member 'FSMExposedNodeFunctions::FSMConduit_FunctionHandlers' has a wrong offset!");
static_assert(offsetof(FSMExposedNodeFunctions, FSMTransition_FunctionHandlers) == 0x000020, "Member 'FSMExposedNodeFunctions::FSMTransition_FunctionHandlers' has a wrong offset!");
static_assert(offsetof(FSMExposedNodeFunctions, GraphPropertyFunctionHandlers) == 0x000030, "Member 'FSMExposedNodeFunctions::GraphPropertyFunctionHandlers' has a wrong offset!");

// ScriptStruct SMSystem.SMDebugStateMachine
// 0x0001 (0x0001 - 0x0000)
struct FSMDebugStateMachine final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMDebugStateMachine) == 0x000001, "Wrong alignment on FSMDebugStateMachine");
static_assert(sizeof(FSMDebugStateMachine) == 0x000001, "Wrong size on FSMDebugStateMachine");

// ScriptStruct SMSystem.SMReferenceContainer
// 0x0018 (0x0018 - 0x0000)
struct FSMReferenceContainer final
{
public:
	struct FGuid                                  PathGuid;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMInstance*                            Reference;                                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMReferenceContainer) == 0x000008, "Wrong alignment on FSMReferenceContainer");
static_assert(sizeof(FSMReferenceContainer) == 0x000018, "Wrong size on FSMReferenceContainer");
static_assert(offsetof(FSMReferenceContainer, PathGuid) == 0x000000, "Member 'FSMReferenceContainer::PathGuid' has a wrong offset!");
static_assert(offsetof(FSMReferenceContainer, Reference) == 0x000010, "Member 'FSMReferenceContainer::Reference' has a wrong offset!");

// ScriptStruct SMSystem.SMGuidMap
// 0x0050 (0x0050 - 0x0000)
struct FSMGuidMap final
{
public:
	TMap<struct FGuid, struct FGuid>              NodeToPathGuids;                                   // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMGuidMap) == 0x000008, "Wrong alignment on FSMGuidMap");
static_assert(sizeof(FSMGuidMap) == 0x000050, "Wrong size on FSMGuidMap");
static_assert(offsetof(FSMGuidMap, NodeToPathGuids) == 0x000000, "Member 'FSMGuidMap::NodeToPathGuids' has a wrong offset!");

// ScriptStruct SMSystem.SMNodeDescription
// 0x0028 (0x0028 - 0x0000)
struct FSMNodeDescription final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Category;                                          // 0x0008(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMNodeDescription) == 0x000008, "Wrong alignment on FSMNodeDescription");
static_assert(sizeof(FSMNodeDescription) == 0x000028, "Wrong size on FSMNodeDescription");
static_assert(offsetof(FSMNodeDescription, Name) == 0x000000, "Member 'FSMNodeDescription::Name' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Category) == 0x000008, "Member 'FSMNodeDescription::Category' has a wrong offset!");
static_assert(offsetof(FSMNodeDescription, Description) == 0x000018, "Member 'FSMNodeDescription::Description' has a wrong offset!");

// ScriptStruct SMSystem.SMBlendSetting
// 0x0020 (0x0020 - 0x0000)
struct FSMBlendSetting final
{
public:
	ETransitionLogicType                          LogicType;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAlphaBlendArgs                        Blend;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   BlendProfileName;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMBlendSetting) == 0x000008, "Wrong alignment on FSMBlendSetting");
static_assert(sizeof(FSMBlendSetting) == 0x000020, "Wrong size on FSMBlendSetting");
static_assert(offsetof(FSMBlendSetting, LogicType) == 0x000000, "Member 'FSMBlendSetting::LogicType' has a wrong offset!");
static_assert(offsetof(FSMBlendSetting, Blend) == 0x000008, "Member 'FSMBlendSetting::Blend' has a wrong offset!");
static_assert(offsetof(FSMBlendSetting, BlendProfileName) == 0x000018, "Member 'FSMBlendSetting::BlendProfileName' has a wrong offset!");

// ScriptStruct SMSystem.SMState
// 0x0000 (0x0100 - 0x0100)
struct FSMState final : public FSMState_Base
{
};
static_assert(alignof(FSMState) == 0x000008, "Wrong alignment on FSMState");
static_assert(sizeof(FSMState) == 0x000100, "Wrong size on FSMState");

// ScriptStruct SMSystem.SMStateMachine
// 0x0140 (0x0240 - 0x0100)
struct FSMStateMachine final : public FSMState_Base
{
public:
	bool                                          bHasAdditionalLogic;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseCurrentState;                                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyReuseIfNotEndState;                           // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowIndependentTick;                             // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallReferenceTickOnManualUpdate;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bWaitForEndState : 1;                              // 0x0105(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISMStateMachineNetworkedInterface> NetworkedInterface;                    // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0xF0];                                     // 0x0118(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReferencedStateMachineClass;                       // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ReferencedTemplateName;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DynamicStateMachineReferenceVariable;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USMInstance*                            ReferencedStateMachine;                            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USMInstance*                            IsReferencedByInstance;                            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMStateMachine) == 0x000008, "Wrong alignment on FSMStateMachine");
static_assert(sizeof(FSMStateMachine) == 0x000240, "Wrong size on FSMStateMachine");
static_assert(offsetof(FSMStateMachine, bHasAdditionalLogic) == 0x000100, "Member 'FSMStateMachine::bHasAdditionalLogic' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bReuseCurrentState) == 0x000101, "Member 'FSMStateMachine::bReuseCurrentState' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bOnlyReuseIfNotEndState) == 0x000102, "Member 'FSMStateMachine::bOnlyReuseIfNotEndState' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bAllowIndependentTick) == 0x000103, "Member 'FSMStateMachine::bAllowIndependentTick' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, bCallReferenceTickOnManualUpdate) == 0x000104, "Member 'FSMStateMachine::bCallReferenceTickOnManualUpdate' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, NetworkedInterface) == 0x000108, "Member 'FSMStateMachine::NetworkedInterface' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachineClass) == 0x000208, "Member 'FSMStateMachine::ReferencedStateMachineClass' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedTemplateName) == 0x000210, "Member 'FSMStateMachine::ReferencedTemplateName' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, DynamicStateMachineReferenceVariable) == 0x000218, "Member 'FSMStateMachine::DynamicStateMachineReferenceVariable' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, ReferencedStateMachine) == 0x000220, "Member 'FSMStateMachine::ReferencedStateMachine' has a wrong offset!");
static_assert(offsetof(FSMStateMachine, IsReferencedByInstance) == 0x000228, "Member 'FSMStateMachine::IsReferencedByInstance' has a wrong offset!");

// ScriptStruct SMSystem.SMTransaction_Base
// 0x0003 (0x0003 - 0x0000)
struct FSMTransaction_Base
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	ESMTransactionType                            TransactionType;                                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOriginatedFromServer : 1;                         // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};
static_assert(alignof(FSMTransaction_Base) == 0x000001, "Wrong alignment on FSMTransaction_Base");
static_assert(sizeof(FSMTransaction_Base) == 0x000003, "Wrong size on FSMTransaction_Base");
static_assert(offsetof(FSMTransaction_Base, TransactionType) == 0x000001, "Member 'FSMTransaction_Base::TransactionType' has a wrong offset!");

// ScriptStruct SMSystem.SMInitializeTransaction
// 0x000D (0x0010 - 0x0003)
struct FSMInitializeTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Context;                                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMInitializeTransaction) == 0x000008, "Wrong alignment on FSMInitializeTransaction");
static_assert(sizeof(FSMInitializeTransaction) == 0x000010, "Wrong size on FSMInitializeTransaction");
static_assert(offsetof(FSMInitializeTransaction, Context) == 0x000008, "Member 'FSMInitializeTransaction::Context' has a wrong offset!");

// ScriptStruct SMSystem.SMTransitionTransaction
// 0x0035 (0x0038 - 0x0003)
struct FSMTransitionTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          AdditionalGuids;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              TimeStamp;                                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveTime;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransitionTransaction) == 0x000008, "Wrong alignment on FSMTransitionTransaction");
static_assert(sizeof(FSMTransitionTransaction) == 0x000038, "Wrong size on FSMTransitionTransaction");
static_assert(offsetof(FSMTransitionTransaction, BaseGuid) == 0x000004, "Member 'FSMTransitionTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMTransitionTransaction, AdditionalGuids) == 0x000018, "Member 'FSMTransitionTransaction::AdditionalGuids' has a wrong offset!");
static_assert(offsetof(FSMTransitionTransaction, TimeStamp) == 0x000028, "Member 'FSMTransitionTransaction::TimeStamp' has a wrong offset!");
static_assert(offsetof(FSMTransitionTransaction, ActiveTime) == 0x000030, "Member 'FSMTransitionTransaction::ActiveTime' has a wrong offset!");

// ScriptStruct SMSystem.SMActivateStateTransaction
// 0x0019 (0x001C - 0x0003)
struct FSMActivateStateTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsActive : 1;                                     // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSetAllParents : 1;                                // 0x0018(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMActivateStateTransaction) == 0x000004, "Wrong alignment on FSMActivateStateTransaction");
static_assert(sizeof(FSMActivateStateTransaction) == 0x00001C, "Wrong size on FSMActivateStateTransaction");
static_assert(offsetof(FSMActivateStateTransaction, BaseGuid) == 0x000004, "Member 'FSMActivateStateTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMActivateStateTransaction, TimeInState) == 0x000014, "Member 'FSMActivateStateTransaction::TimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMFullSyncStateTransaction
// 0x0015 (0x0018 - 0x0003)
struct FSMFullSyncStateTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BaseGuid;                                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMFullSyncStateTransaction) == 0x000004, "Wrong alignment on FSMFullSyncStateTransaction");
static_assert(sizeof(FSMFullSyncStateTransaction) == 0x000018, "Wrong size on FSMFullSyncStateTransaction");
static_assert(offsetof(FSMFullSyncStateTransaction, BaseGuid) == 0x000004, "Member 'FSMFullSyncStateTransaction::BaseGuid' has a wrong offset!");
static_assert(offsetof(FSMFullSyncStateTransaction, TimeInState) == 0x000014, "Member 'FSMFullSyncStateTransaction::TimeInState' has a wrong offset!");

// ScriptStruct SMSystem.SMFullSyncTransaction
// 0x001D (0x0020 - 0x0003)
struct FSMFullSyncTransaction final : public FSMTransaction_Base
{
public:
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMFullSyncStateTransaction>    ActiveStates;                                      // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bHasStarted : 1;                                   // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFromUserLoad : 1;                                 // 0x0018(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceFullRefresh : 1;                             // 0x0018(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMFullSyncTransaction) == 0x000008, "Wrong alignment on FSMFullSyncTransaction");
static_assert(sizeof(FSMFullSyncTransaction) == 0x000020, "Wrong size on FSMFullSyncTransaction");
static_assert(offsetof(FSMFullSyncTransaction, ActiveStates) == 0x000008, "Member 'FSMFullSyncTransaction::ActiveStates' has a wrong offset!");

// ScriptStruct SMSystem.SMTransition
// 0x00B0 (0x0140 - 0x0090)
struct FSMTransition final : public FSMNode_Base
{
public:
	int32                                         Priority;                                          // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanEnterTransition : 1;                           // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEnterTransitionFromEvent : 1;                  // 0x0094(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEvaluating : 1;                                 // 0x0094(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x0094(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluateFromEvent : 1;                         // 0x0094(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFastTransition : 1;                               // 0x0094(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LinkedSequenceTag;                                 // 0x0098(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMBlendSetting                        BlendSettings;                                     // 0x00A0(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FastLinkedSequenceTag;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMBlendSetting                        FastBlendSettings;                                 // 0x00C8(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bRunParallel : 1;                                  // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalIfNextStateActive : 1;                        // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvalWithStartState : 1;                        // 0x00E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysFalse : 1;                                  // 0x00E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFromAnyState : 1;                                 // 0x00E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_E8_5 : 3;                                   // 0x00E8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bFromLinkState : 1;                                // 0x00EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  FromGuid;                                          // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToGuid;                                            // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMConditionalEvaluationType                  ConditionalEvaluationType;                         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x2F];                                     // 0x0111(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMTransition) == 0x000008, "Wrong alignment on FSMTransition");
static_assert(sizeof(FSMTransition) == 0x000140, "Wrong size on FSMTransition");
static_assert(offsetof(FSMTransition, Priority) == 0x000090, "Member 'FSMTransition::Priority' has a wrong offset!");
static_assert(offsetof(FSMTransition, LinkedSequenceTag) == 0x000098, "Member 'FSMTransition::LinkedSequenceTag' has a wrong offset!");
static_assert(offsetof(FSMTransition, BlendSettings) == 0x0000A0, "Member 'FSMTransition::BlendSettings' has a wrong offset!");
static_assert(offsetof(FSMTransition, FastLinkedSequenceTag) == 0x0000C0, "Member 'FSMTransition::FastLinkedSequenceTag' has a wrong offset!");
static_assert(offsetof(FSMTransition, FastBlendSettings) == 0x0000C8, "Member 'FSMTransition::FastBlendSettings' has a wrong offset!");
