#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineMeshInsertData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SplineMeshInsertData.SplineMeshInsertData
// 0x0088 (0x0088 - 0x0000)
struct FSplineMeshInsertData final
{
public:
	TArray<class UStaticMesh*>                    Mesh_26_726C13094B4CD665E7524591BCD92B38;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInterface*>             Material_35_B25C48D1485E9708F91B62B95E9CC5AB;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                Scale_31_AC8FB1C84CE48135CFA43C804E6C2497;         // 0x0020(0x0010)(Edit, BlueprintVisible)
	double                                        Distance_10_0F5BB60A460BCF78CBA2CD82277B591E;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Offset_20_1B757DCA44C933ED731D398F14BF64E4;        // 0x0038(0x0010)(Edit, BlueprintVisible)
	double                                        Length_11_B836D8444C5BAB50773E44926E790A5D;        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInstance_13_A109FF06499388F0804E79B81DE0B0E4;   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Forward_25_2E4C91924ED4EA6BCEC28F98A62C12EB;       // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  IsSidePivot_34_1F7779D04DD7C0F991675396EEAD221F;   // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRotator>                       Rotation_40_C39E9D044FC98512CD4C5FB461F05958;      // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInterface*>             MaterialAll_44_368FB66243E5C69D6693C6B0D1153A4D;   // 0x0078(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FSplineMeshInsertData) == 0x000008, "Wrong alignment on FSplineMeshInsertData");
static_assert(sizeof(FSplineMeshInsertData) == 0x000088, "Wrong size on FSplineMeshInsertData");
static_assert(offsetof(FSplineMeshInsertData, Mesh_26_726C13094B4CD665E7524591BCD92B38) == 0x000000, "Member 'FSplineMeshInsertData::Mesh_26_726C13094B4CD665E7524591BCD92B38' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Material_35_B25C48D1485E9708F91B62B95E9CC5AB) == 0x000010, "Member 'FSplineMeshInsertData::Material_35_B25C48D1485E9708F91B62B95E9CC5AB' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Scale_31_AC8FB1C84CE48135CFA43C804E6C2497) == 0x000020, "Member 'FSplineMeshInsertData::Scale_31_AC8FB1C84CE48135CFA43C804E6C2497' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Distance_10_0F5BB60A460BCF78CBA2CD82277B591E) == 0x000030, "Member 'FSplineMeshInsertData::Distance_10_0F5BB60A460BCF78CBA2CD82277B591E' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Offset_20_1B757DCA44C933ED731D398F14BF64E4) == 0x000038, "Member 'FSplineMeshInsertData::Offset_20_1B757DCA44C933ED731D398F14BF64E4' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Length_11_B836D8444C5BAB50773E44926E790A5D) == 0x000048, "Member 'FSplineMeshInsertData::Length_11_B836D8444C5BAB50773E44926E790A5D' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, UseInstance_13_A109FF06499388F0804E79B81DE0B0E4) == 0x000050, "Member 'FSplineMeshInsertData::UseInstance_13_A109FF06499388F0804E79B81DE0B0E4' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Forward_25_2E4C91924ED4EA6BCEC28F98A62C12EB) == 0x000051, "Member 'FSplineMeshInsertData::Forward_25_2E4C91924ED4EA6BCEC28F98A62C12EB' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, IsSidePivot_34_1F7779D04DD7C0F991675396EEAD221F) == 0x000058, "Member 'FSplineMeshInsertData::IsSidePivot_34_1F7779D04DD7C0F991675396EEAD221F' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, Rotation_40_C39E9D044FC98512CD4C5FB461F05958) == 0x000068, "Member 'FSplineMeshInsertData::Rotation_40_C39E9D044FC98512CD4C5FB461F05958' has a wrong offset!");
static_assert(offsetof(FSplineMeshInsertData, MaterialAll_44_368FB66243E5C69D6693C6B0D1153A4D) == 0x000078, "Member 'FSplineMeshInsertData::MaterialAll_44_368FB66243E5C69D6693C6B0D1153A4D' has a wrong offset!");

}

