#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CloudMask

#include "Basic.hpp"

#include "CloudNoiseSettings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CloudObjectType0_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_CloudMask.ST_CloudMask
// 0x00C0 (0x00C0 - 0x0000)
struct FST_CloudMask final
{
public:
	class UMaterialInterface*                     CloudMaterial_29_CA2C7FB9462740BAE1E624B986CA5776; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CloudMask_5_CDA65DCF431AF90E3A4E5786A1A98611;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Density_8_AB58FB244B36527C17D0CC97C0C03B80;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MipLevel_16_69A3D34E4F79A4C55C461DBFF85CE39B;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCloudNoiseSettings                    NoiseSettings_31_DFB3D55F498F9468F8AC398621671267; // 0x0018(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_10_ED500ECD4A77255CAF099E8B07D94F46;         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaskColorValue_19_1CCD09184653D49CB16435B15B4BCDC5; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebugPlane_22_8B893A35492340BC51074BA199C2C80A; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CloudMaskGenerator_C*               Generator_25_0D5A708B49552C6014A9CB99EFFBAE1A;     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ECloudObjectType0                             DrawType_28_4BC9006E4D63DF34315437BFC031D9AA;      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_34_3E39CE1D4CBD9B01E985B2A2E5AA001E;     // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_CloudMask) == 0x000010, "Wrong alignment on FST_CloudMask");
static_assert(sizeof(FST_CloudMask) == 0x0000C0, "Wrong size on FST_CloudMask");
static_assert(offsetof(FST_CloudMask, CloudMaterial_29_CA2C7FB9462740BAE1E624B986CA5776) == 0x000000, "Member 'FST_CloudMask::CloudMaterial_29_CA2C7FB9462740BAE1E624B986CA5776' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, CloudMask_5_CDA65DCF431AF90E3A4E5786A1A98611) == 0x000008, "Member 'FST_CloudMask::CloudMask_5_CDA65DCF431AF90E3A4E5786A1A98611' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, Density_8_AB58FB244B36527C17D0CC97C0C03B80) == 0x000010, "Member 'FST_CloudMask::Density_8_AB58FB244B36527C17D0CC97C0C03B80' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, MipLevel_16_69A3D34E4F79A4C55C461DBFF85CE39B) == 0x000014, "Member 'FST_CloudMask::MipLevel_16_69A3D34E4F79A4C55C461DBFF85CE39B' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, NoiseSettings_31_DFB3D55F498F9468F8AC398621671267) == 0x000018, "Member 'FST_CloudMask::NoiseSettings_31_DFB3D55F498F9468F8AC398621671267' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, Alpha_10_ED500ECD4A77255CAF099E8B07D94F46) == 0x000024, "Member 'FST_CloudMask::Alpha_10_ED500ECD4A77255CAF099E8B07D94F46' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, MaskColorValue_19_1CCD09184653D49CB16435B15B4BCDC5) == 0x000028, "Member 'FST_CloudMask::MaskColorValue_19_1CCD09184653D49CB16435B15B4BCDC5' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, ShowDebugPlane_22_8B893A35492340BC51074BA199C2C80A) == 0x000040, "Member 'FST_CloudMask::ShowDebugPlane_22_8B893A35492340BC51074BA199C2C80A' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, Generator_25_0D5A708B49552C6014A9CB99EFFBAE1A) == 0x000048, "Member 'FST_CloudMask::Generator_25_0D5A708B49552C6014A9CB99EFFBAE1A' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, DrawType_28_4BC9006E4D63DF34315437BFC031D9AA) == 0x000050, "Member 'FST_CloudMask::DrawType_28_4BC9006E4D63DF34315437BFC031D9AA' has a wrong offset!");
static_assert(offsetof(FST_CloudMask, Transform_34_3E39CE1D4CBD9B01E985B2A2E5AA001E) == 0x000060, "Member 'FST_CloudMask::Transform_34_3E39CE1D4CBD9B01E985B2A2E5AA001E' has a wrong offset!");

}

