#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_TransitionConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_TransitionConfig.ST_TransitionConfig
// 0x0060 (0x0060 - 0x0000)
struct FST_TransitionConfig final
{
public:
	struct FGameplayTag                           PreGroupTag_16_E78EFDEE4D69F2AC341A82962FED1DD1;   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NextGroupTag_17_DFD23E584191FEB825097EB7D79540B8;  // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LinkAnimTag_15_A9BC35FA40B61DD6415FC0B45D06D134;   // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSMBlendSetting                        BlendSetting_8_AC65700940D95FBE8E76CFB33E6D5B6D;   // 0x0018(0x0020)(Edit, BlueprintVisible, NoDestructor)
	struct FGameplayTag                           FastLinkAnimTag_21_23AC281640C863B8B6C001BE145A631C; // 0x0038(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSMBlendSetting                        FastBlendSetting_24_ABA43EB14EF3A7410A257B9F5C5EBC3B; // 0x0040(0x0020)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FST_TransitionConfig) == 0x000008, "Wrong alignment on FST_TransitionConfig");
static_assert(sizeof(FST_TransitionConfig) == 0x000060, "Wrong size on FST_TransitionConfig");
static_assert(offsetof(FST_TransitionConfig, PreGroupTag_16_E78EFDEE4D69F2AC341A82962FED1DD1) == 0x000000, "Member 'FST_TransitionConfig::PreGroupTag_16_E78EFDEE4D69F2AC341A82962FED1DD1' has a wrong offset!");
static_assert(offsetof(FST_TransitionConfig, NextGroupTag_17_DFD23E584191FEB825097EB7D79540B8) == 0x000008, "Member 'FST_TransitionConfig::NextGroupTag_17_DFD23E584191FEB825097EB7D79540B8' has a wrong offset!");
static_assert(offsetof(FST_TransitionConfig, LinkAnimTag_15_A9BC35FA40B61DD6415FC0B45D06D134) == 0x000010, "Member 'FST_TransitionConfig::LinkAnimTag_15_A9BC35FA40B61DD6415FC0B45D06D134' has a wrong offset!");
static_assert(offsetof(FST_TransitionConfig, BlendSetting_8_AC65700940D95FBE8E76CFB33E6D5B6D) == 0x000018, "Member 'FST_TransitionConfig::BlendSetting_8_AC65700940D95FBE8E76CFB33E6D5B6D' has a wrong offset!");
static_assert(offsetof(FST_TransitionConfig, FastLinkAnimTag_21_23AC281640C863B8B6C001BE145A631C) == 0x000038, "Member 'FST_TransitionConfig::FastLinkAnimTag_21_23AC281640C863B8B6C001BE145A631C' has a wrong offset!");
static_assert(offsetof(FST_TransitionConfig, FastBlendSetting_24_ABA43EB14EF3A7410A257B9F5C5EBC3B) == 0x000040, "Member 'FST_TransitionConfig::FastBlendSetting_24_ABA43EB14EF3A7410A257B9F5C5EBC3B' has a wrong offset!");

}

