#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ActivityDisplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ActivityDisplay.Struct_ActivityDisplay
// 0x0050 (0x0050 - 0x0000)
struct FStruct_ActivityDisplay final
{
public:
	struct FVector                                Location_9_3763DF25457763319131179B2DD428D7;       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_14_0597274F4A385B3DEF147EA44BC19E2F;      // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               NPCRotation_13_E9FCBFED44D941CE452B7284B9C5D277;   // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        FocalLength_16_60089CC84DACB0690EABB9993647ECE5;   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ActivityDisplay) == 0x000008, "Wrong alignment on FStruct_ActivityDisplay");
static_assert(sizeof(FStruct_ActivityDisplay) == 0x000050, "Wrong size on FStruct_ActivityDisplay");
static_assert(offsetof(FStruct_ActivityDisplay, Location_9_3763DF25457763319131179B2DD428D7) == 0x000000, "Member 'FStruct_ActivityDisplay::Location_9_3763DF25457763319131179B2DD428D7' has a wrong offset!");
static_assert(offsetof(FStruct_ActivityDisplay, Rotation_14_0597274F4A385B3DEF147EA44BC19E2F) == 0x000018, "Member 'FStruct_ActivityDisplay::Rotation_14_0597274F4A385B3DEF147EA44BC19E2F' has a wrong offset!");
static_assert(offsetof(FStruct_ActivityDisplay, NPCRotation_13_E9FCBFED44D941CE452B7284B9C5D277) == 0x000030, "Member 'FStruct_ActivityDisplay::NPCRotation_13_E9FCBFED44D941CE452B7284B9C5D277' has a wrong offset!");
static_assert(offsetof(FStruct_ActivityDisplay, FocalLength_16_60089CC84DACB0690EABB9993647ECE5) == 0x000048, "Member 'FStruct_ActivityDisplay::FocalLength_16_60089CC84DACB0690EABB9993647ECE5' has a wrong offset!");

}

