#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ClothesOverlay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "F_OverlayConfig_structs.hpp"
#include "EClothesType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ClothesOverlay.Struct_ClothesOverlay
// 0x0068 (0x0068 - 0x0000)
struct FStruct_ClothesOverlay final
{
public:
	class FString                                 ClothName_3_3D56C2704B81D98A68186388560634E9;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           OverlayPriority_11_ABD5774745B05FF661C206A86837B9D4; // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TMap<EClothesType, struct FF_OverlayConfig>   StylizedConfigs_8_07A638E349B3844725501AB0B5E03B03; // 0x0018(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_ClothesOverlay) == 0x000008, "Wrong alignment on FStruct_ClothesOverlay");
static_assert(sizeof(FStruct_ClothesOverlay) == 0x000068, "Wrong size on FStruct_ClothesOverlay");
static_assert(offsetof(FStruct_ClothesOverlay, ClothName_3_3D56C2704B81D98A68186388560634E9) == 0x000000, "Member 'FStruct_ClothesOverlay::ClothName_3_3D56C2704B81D98A68186388560634E9' has a wrong offset!");
static_assert(offsetof(FStruct_ClothesOverlay, OverlayPriority_11_ABD5774745B05FF661C206A86837B9D4) == 0x000010, "Member 'FStruct_ClothesOverlay::OverlayPriority_11_ABD5774745B05FF661C206A86837B9D4' has a wrong offset!");
static_assert(offsetof(FStruct_ClothesOverlay, StylizedConfigs_8_07A638E349B3844725501AB0B5E03B03) == 0x000018, "Member 'FStruct_ClothesOverlay::StylizedConfigs_8_07A638E349B3844725501AB0B5E03B03' has a wrong offset!");

}

