#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_X6WeaponList

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_X6WeaponList.Struct_X6WeaponList
// 0x0048 (0x0048 - 0x0000)
struct FStruct_X6WeaponList final
{
public:
	class FString                                 WeaponName_3_B84DEAD44E422AF7993A808E5F30F9E2;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           WeaponType_8_E766BA044C6F77AE535C03BA3FD36166;     // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        ConfigReference_14_B0CE60DC4E5E69AE11FDACA25843639B; // 0x0018(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FInstancedStruct                       CustomData_11_AEEC0B0F4002EC550AD3A6802BF92312;    // 0x0038(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_X6WeaponList) == 0x000008, "Wrong alignment on FStruct_X6WeaponList");
static_assert(sizeof(FStruct_X6WeaponList) == 0x000048, "Wrong size on FStruct_X6WeaponList");
static_assert(offsetof(FStruct_X6WeaponList, WeaponName_3_B84DEAD44E422AF7993A808E5F30F9E2) == 0x000000, "Member 'FStruct_X6WeaponList::WeaponName_3_B84DEAD44E422AF7993A808E5F30F9E2' has a wrong offset!");
static_assert(offsetof(FStruct_X6WeaponList, WeaponType_8_E766BA044C6F77AE535C03BA3FD36166) == 0x000010, "Member 'FStruct_X6WeaponList::WeaponType_8_E766BA044C6F77AE535C03BA3FD36166' has a wrong offset!");
static_assert(offsetof(FStruct_X6WeaponList, ConfigReference_14_B0CE60DC4E5E69AE11FDACA25843639B) == 0x000018, "Member 'FStruct_X6WeaponList::ConfigReference_14_B0CE60DC4E5E69AE11FDACA25843639B' has a wrong offset!");
static_assert(offsetof(FStruct_X6WeaponList, CustomData_11_AEEC0B0F4002EC550AD3A6802BF92312) == 0x000038, "Member 'FStruct_X6WeaponList::CustomData_11_AEEC0B0F4002EC550AD3A6802BF92312' has a wrong offset!");

}

