#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ClothesMobileMatSwitchPair

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ClothesMobileMatSwitchPair.Struct_ClothesMobileMatSwitchPair
// 0x0014 (0x0014 - 0x0000)
struct FStruct_ClothesMobileMatSwitchPair final
{
public:
	class FName                                   TranslucentSlotName_2_EB03D8944A8466D0CF94E08F9D125EC3; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaskedSlotName_4_F82074A442947E59763C74AEC9F3674D; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableMaskSlotOverlayWhenMaskedState_8_C8CC158D43B6F218608025BA1A3CBD33; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTranslucentSlotOverlayWhenMaskedState_9_1F4D216E454DC9968189CBBBA5F77B3C; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ClothesMobileMatSwitchPair) == 0x000004, "Wrong alignment on FStruct_ClothesMobileMatSwitchPair");
static_assert(sizeof(FStruct_ClothesMobileMatSwitchPair) == 0x000014, "Wrong size on FStruct_ClothesMobileMatSwitchPair");
static_assert(offsetof(FStruct_ClothesMobileMatSwitchPair, TranslucentSlotName_2_EB03D8944A8466D0CF94E08F9D125EC3) == 0x000000, "Member 'FStruct_ClothesMobileMatSwitchPair::TranslucentSlotName_2_EB03D8944A8466D0CF94E08F9D125EC3' has a wrong offset!");
static_assert(offsetof(FStruct_ClothesMobileMatSwitchPair, MaskedSlotName_4_F82074A442947E59763C74AEC9F3674D) == 0x000008, "Member 'FStruct_ClothesMobileMatSwitchPair::MaskedSlotName_4_F82074A442947E59763C74AEC9F3674D' has a wrong offset!");
static_assert(offsetof(FStruct_ClothesMobileMatSwitchPair, EnableMaskSlotOverlayWhenMaskedState_8_C8CC158D43B6F218608025BA1A3CBD33) == 0x000010, "Member 'FStruct_ClothesMobileMatSwitchPair::EnableMaskSlotOverlayWhenMaskedState_8_C8CC158D43B6F218608025BA1A3CBD33' has a wrong offset!");
static_assert(offsetof(FStruct_ClothesMobileMatSwitchPair, EnableTranslucentSlotOverlayWhenMaskedState_9_1F4D216E454DC9968189CBBBA5F77B3C) == 0x000011, "Member 'FStruct_ClothesMobileMatSwitchPair::EnableTranslucentSlotOverlayWhenMaskedState_9_1F4D216E454DC9968189CBBBA5F77B3C' has a wrong offset!");

}

