#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DecorateWeaponCustomData

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "F_HandObjInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DecorateWeaponCustomData.Struct_DecorateWeaponCustomData
// 0x0030 (0x0030 - 0x0000)
struct FStruct_DecorateWeaponCustomData final
{
public:
	struct FInstancedStruct                       LeftHandObj_8_2432234244E0243E9C44A6807154B81C;    // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FInstancedStruct                       RightHandObj_9_E79A3DB04F9B5C6028E67DA1842A5F66;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FF_HandObjInfo>                 HandObjs_13_F8544E1F4DBD9DCDD5A52589C4E18E67;      // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_DecorateWeaponCustomData) == 0x000008, "Wrong alignment on FStruct_DecorateWeaponCustomData");
static_assert(sizeof(FStruct_DecorateWeaponCustomData) == 0x000030, "Wrong size on FStruct_DecorateWeaponCustomData");
static_assert(offsetof(FStruct_DecorateWeaponCustomData, LeftHandObj_8_2432234244E0243E9C44A6807154B81C) == 0x000000, "Member 'FStruct_DecorateWeaponCustomData::LeftHandObj_8_2432234244E0243E9C44A6807154B81C' has a wrong offset!");
static_assert(offsetof(FStruct_DecorateWeaponCustomData, RightHandObj_9_E79A3DB04F9B5C6028E67DA1842A5F66) == 0x000010, "Member 'FStruct_DecorateWeaponCustomData::RightHandObj_9_E79A3DB04F9B5C6028E67DA1842A5F66' has a wrong offset!");
static_assert(offsetof(FStruct_DecorateWeaponCustomData, HandObjs_13_F8544E1F4DBD9DCDD5A52589C4E18E67) == 0x000020, "Member 'FStruct_DecorateWeaponCustomData::HandObjs_13_F8544E1F4DBD9DCDD5A52589C4E18E67' has a wrong offset!");

}

