#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ClothMatchType

#include "Basic.hpp"

#include "E_MatchClothType_Arm_structs.hpp"
#include "E_MatchClothType_Leg_structs.hpp"
#include "E_MatchClothType_Head_structs.hpp"
#include "E_MatchClothType_Body_structs.hpp"
#include "E_MatchClothType_Neck_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ClothMatchType.Struct_ClothMatchType
// 0x0005 (0x0005 - 0x0000)
struct FStruct_ClothMatchType final
{
public:
	E_MatchClothType_Arm                          Arm_10_B6F50B714A62C5FB8C897B8F8F36ADA8;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchClothType_Body                         Body_11_BA1A16BD42623BC69F0CE58CE6C2ACAF;          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchClothType_Leg                          Leg_12_4E666279466AE0F5DF27DB9874CB6C6A;           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchClothType_Head                         Head_13_F8BDCCAA49930C1756DD74B5100B8E78;          // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MatchClothType_Neck                         Neck_14_DCC9522D45411A51888C859F558BBA6F;          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ClothMatchType) == 0x000001, "Wrong alignment on FStruct_ClothMatchType");
static_assert(sizeof(FStruct_ClothMatchType) == 0x000005, "Wrong size on FStruct_ClothMatchType");
static_assert(offsetof(FStruct_ClothMatchType, Arm_10_B6F50B714A62C5FB8C897B8F8F36ADA8) == 0x000000, "Member 'FStruct_ClothMatchType::Arm_10_B6F50B714A62C5FB8C897B8F8F36ADA8' has a wrong offset!");
static_assert(offsetof(FStruct_ClothMatchType, Body_11_BA1A16BD42623BC69F0CE58CE6C2ACAF) == 0x000001, "Member 'FStruct_ClothMatchType::Body_11_BA1A16BD42623BC69F0CE58CE6C2ACAF' has a wrong offset!");
static_assert(offsetof(FStruct_ClothMatchType, Leg_12_4E666279466AE0F5DF27DB9874CB6C6A) == 0x000002, "Member 'FStruct_ClothMatchType::Leg_12_4E666279466AE0F5DF27DB9874CB6C6A' has a wrong offset!");
static_assert(offsetof(FStruct_ClothMatchType, Head_13_F8BDCCAA49930C1756DD74B5100B8E78) == 0x000003, "Member 'FStruct_ClothMatchType::Head_13_F8BDCCAA49930C1756DD74B5100B8E78' has a wrong offset!");
static_assert(offsetof(FStruct_ClothMatchType, Neck_14_DCC9522D45411A51888C859F558BBA6F) == 0x000004, "Member 'FStruct_ClothMatchType::Neck_14_DCC9522D45411A51888C859F558BBA6F' has a wrong offset!");

}

