#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ClothThicknessConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ClothThicknessConfig.Struct_ClothThicknessConfig
// 0x0048 (0x0048 - 0x0000)
struct FStruct_ClothThicknessConfig final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMeshAsset_11_8670063C42BC8FB97D12BCBD6A5FA86A; // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        ClothesFrontThickness_Follow_2_A72502CC479DBA93BF4A8580C982276D; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesBackThickness_Follow_4_71B5FDCC41468FFADECCAAABD5F4E50A; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesFrontThickness_Splay_7_06885B704B70970272601AA05EB4E137; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClothesBackThickness_Splay_8_A5DF03674EB6A5C7E48E9C9BF934351E; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ClothThicknessConfig) == 0x000008, "Wrong alignment on FStruct_ClothThicknessConfig");
static_assert(sizeof(FStruct_ClothThicknessConfig) == 0x000048, "Wrong size on FStruct_ClothThicknessConfig");
static_assert(offsetof(FStruct_ClothThicknessConfig, SkeletalMeshAsset_11_8670063C42BC8FB97D12BCBD6A5FA86A) == 0x000000, "Member 'FStruct_ClothThicknessConfig::SkeletalMeshAsset_11_8670063C42BC8FB97D12BCBD6A5FA86A' has a wrong offset!");
static_assert(offsetof(FStruct_ClothThicknessConfig, ClothesFrontThickness_Follow_2_A72502CC479DBA93BF4A8580C982276D) == 0x000028, "Member 'FStruct_ClothThicknessConfig::ClothesFrontThickness_Follow_2_A72502CC479DBA93BF4A8580C982276D' has a wrong offset!");
static_assert(offsetof(FStruct_ClothThicknessConfig, ClothesBackThickness_Follow_4_71B5FDCC41468FFADECCAAABD5F4E50A) == 0x000030, "Member 'FStruct_ClothThicknessConfig::ClothesBackThickness_Follow_4_71B5FDCC41468FFADECCAAABD5F4E50A' has a wrong offset!");
static_assert(offsetof(FStruct_ClothThicknessConfig, ClothesFrontThickness_Splay_7_06885B704B70970272601AA05EB4E137) == 0x000038, "Member 'FStruct_ClothThicknessConfig::ClothesFrontThickness_Splay_7_06885B704B70970272601AA05EB4E137' has a wrong offset!");
static_assert(offsetof(FStruct_ClothThicknessConfig, ClothesBackThickness_Splay_8_A5DF03674EB6A5C7E48E9C9BF934351E) == 0x000040, "Member 'FStruct_ClothThicknessConfig::ClothesBackThickness_Splay_8_A5DF03674EB6A5C7E48E9C9BF934351E' has a wrong offset!");

}

