#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TipsEvent

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TipsEvent.TipsEvent_C
// 0x0018 (0x0040 - 0x0028)
class UTipsEvent_C final : public UObject
{
public:
	int64                                         UniqueID;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ConfigID;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Container;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TipsEvent_C">();
	}
	static class UTipsEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTipsEvent_C>();
	}
};
static_assert(alignof(UTipsEvent_C) == 0x000008, "Wrong alignment on UTipsEvent_C");
static_assert(sizeof(UTipsEvent_C) == 0x000040, "Wrong size on UTipsEvent_C");
static_assert(offsetof(UTipsEvent_C, UniqueID) == 0x000028, "Member 'UTipsEvent_C::UniqueID' has a wrong offset!");
static_assert(offsetof(UTipsEvent_C, ConfigID) == 0x000030, "Member 'UTipsEvent_C::ConfigID' has a wrong offset!");
static_assert(offsetof(UTipsEvent_C, Container) == 0x000034, "Member 'UTipsEvent_C::Container' has a wrong offset!");
static_assert(offsetof(UTipsEvent_C, Index_0) == 0x000038, "Member 'UTipsEvent_C::Index_0' has a wrong offset!");

}

