#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TT_InteractSelectionByParabola

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TT_InteractSelectionByParabola.TT_InteractSelectionByParabola_C
// 0x0040 (0x00F0 - 0x00B0)
class UTT_InteractSelectionByParabola_C final : public UX6TargetingSelectionTask_ChargeUpBase
{
public:
	class UBP_ShapeTraceDataAsset_C*              HitShape;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x00B8(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      HitPartTraceObjectTypes;                           // 0x00C8(0x0010)(Edit, BlueprintVisible)
	double                                        SearchWidth;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SearchHeightOffset;                                // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SearchDistanceOffset;                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TT_InteractSelectionByParabola_C">();
	}
	static class UTT_InteractSelectionByParabola_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTT_InteractSelectionByParabola_C>();
	}
};
static_assert(alignof(UTT_InteractSelectionByParabola_C) == 0x000010, "Wrong alignment on UTT_InteractSelectionByParabola_C");
static_assert(sizeof(UTT_InteractSelectionByParabola_C) == 0x0000F0, "Wrong size on UTT_InteractSelectionByParabola_C");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, HitShape) == 0x0000B0, "Member 'UTT_InteractSelectionByParabola_C::HitShape' has a wrong offset!");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, TraceObjectTypes) == 0x0000B8, "Member 'UTT_InteractSelectionByParabola_C::TraceObjectTypes' has a wrong offset!");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, HitPartTraceObjectTypes) == 0x0000C8, "Member 'UTT_InteractSelectionByParabola_C::HitPartTraceObjectTypes' has a wrong offset!");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, SearchWidth) == 0x0000D8, "Member 'UTT_InteractSelectionByParabola_C::SearchWidth' has a wrong offset!");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, SearchHeightOffset) == 0x0000E0, "Member 'UTT_InteractSelectionByParabola_C::SearchHeightOffset' has a wrong offset!");
static_assert(offsetof(UTT_InteractSelectionByParabola_C, SearchDistanceOffset) == 0x0000E8, "Member 'UTT_InteractSelectionByParabola_C::SearchDistanceOffset' has a wrong offset!");

}

