#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TT_RecoverySelectionTargetBangLocation

#include "Basic.hpp"

#include "TargetingSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TT_RecoverySelectionTargetBangLocation.TT_RecoverySelectionTargetBangLocation_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct TT_RecoverySelectionTargetBangLocation_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TT_RecoverySelectionTargetBangLocation_C_GetModuleName) == 0x000008, "Wrong alignment on TT_RecoverySelectionTargetBangLocation_C_GetModuleName");
static_assert(sizeof(TT_RecoverySelectionTargetBangLocation_C_GetModuleName) == 0x000010, "Wrong size on TT_RecoverySelectionTargetBangLocation_C_GetModuleName");
static_assert(offsetof(TT_RecoverySelectionTargetBangLocation_C_GetModuleName, ReturnValue) == 0x000000, "Member 'TT_RecoverySelectionTargetBangLocation_C_GetModuleName::ReturnValue' has a wrong offset!");

// Function TT_RecoverySelectionTargetBangLocation.TT_RecoverySelectionTargetBangLocation_C.GetSourceLocation
// 0x0020 (0x0020 - 0x0000)
struct TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation) == 0x000008, "Wrong alignment on TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation");
static_assert(sizeof(TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation) == 0x000020, "Wrong size on TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation");
static_assert(offsetof(TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation, TargetingHandle) == 0x000000, "Member 'TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation::TargetingHandle' has a wrong offset!");
static_assert(offsetof(TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation, ReturnValue) == 0x000008, "Member 'TT_RecoverySelectionTargetBangLocation_C_GetSourceLocation::ReturnValue' has a wrong offset!");

}

