#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TT_TargetingSelection_Crash

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "F_FilterOutlineJumpEndSelector_structs.hpp"
#include "X6Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TT_TargetingSelection_Crash.TT_TargetingSelection_Crash_C
// 0x0090 (0x0140 - 0x00B0)
class UTT_TargetingSelection_Crash_C final : public UX6TargetingSelectionTask_ChargeUpBase
{
public:
	struct FGameplayTag                           JumpPlungeTriggerTag;                              // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   JumpPlungeSocket;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                JumpPlungeOffset;                                  // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpPlungeHeight;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CollisionObjectTypes;                              // 0x00E0(0x0010)(Edit, BlueprintVisible)
	struct FVector                                JumpPlungeHalfSize;                                // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                JumpEndBaseHalfSize;                               // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_FilterOutlineJumpEndSelector> JumpEndHalfSizeSelector;                          // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   CheckSocket;                                       // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;
	bool K2_CanSelect(const struct FTargetingRequestHandle& TargetingHandle, const struct FTargetingSourceContext& SourceContext) const;
	void SelectTargets(const struct FTargetingRequestHandle& TargetingHandle, const struct FTargetingSourceContext& SourceContext) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TT_TargetingSelection_Crash_C">();
	}
	static class UTT_TargetingSelection_Crash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTT_TargetingSelection_Crash_C>();
	}
};
static_assert(alignof(UTT_TargetingSelection_Crash_C) == 0x000010, "Wrong alignment on UTT_TargetingSelection_Crash_C");
static_assert(sizeof(UTT_TargetingSelection_Crash_C) == 0x000140, "Wrong size on UTT_TargetingSelection_Crash_C");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpPlungeTriggerTag) == 0x0000B0, "Member 'UTT_TargetingSelection_Crash_C::JumpPlungeTriggerTag' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpPlungeSocket) == 0x0000B8, "Member 'UTT_TargetingSelection_Crash_C::JumpPlungeSocket' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpPlungeOffset) == 0x0000C0, "Member 'UTT_TargetingSelection_Crash_C::JumpPlungeOffset' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpPlungeHeight) == 0x0000D8, "Member 'UTT_TargetingSelection_Crash_C::JumpPlungeHeight' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, CollisionObjectTypes) == 0x0000E0, "Member 'UTT_TargetingSelection_Crash_C::CollisionObjectTypes' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpPlungeHalfSize) == 0x0000F0, "Member 'UTT_TargetingSelection_Crash_C::JumpPlungeHalfSize' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpEndBaseHalfSize) == 0x000108, "Member 'UTT_TargetingSelection_Crash_C::JumpEndBaseHalfSize' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, JumpEndHalfSizeSelector) == 0x000120, "Member 'UTT_TargetingSelection_Crash_C::JumpEndHalfSizeSelector' has a wrong offset!");
static_assert(offsetof(UTT_TargetingSelection_Crash_C, CheckSocket) == 0x000130, "Member 'UTT_TargetingSelection_Crash_C::CheckSocket' has a wrong offset!");

}

