#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UnLua.Testcase_LocalVariableCheck.Testcase_CallCPPWithOutParameter
// 0x0010 (0x0010 - 0x0000)
struct Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter final
{
public:
	class FString                                 OutString;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter) == 0x000008, "Wrong alignment on Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter");
static_assert(sizeof(Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter) == 0x000010, "Wrong size on Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter");
static_assert(offsetof(Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter, OutString) == 0x000000, "Member 'Testcase_LocalVariableCheck_Testcase_CallCPPWithOutParameter::OutString' has a wrong offset!");

// Function UnLua.Testcase_LocalVariableCheck.Testcase_ReturnLocalVariable
// 0x0018 (0x0018 - 0x0000)
struct Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable) == 0x000008, "Wrong alignment on Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable");
static_assert(sizeof(Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable) == 0x000018, "Wrong size on Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable");
static_assert(offsetof(Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable, ReturnValue) == 0x000000, "Member 'Testcase_LocalVariableCheck_Testcase_ReturnLocalVariable::ReturnValue' has a wrong offset!");

// Function UnLua.TutorialBlueprintFunctionLibrary.CallDelegate
// 0x0014 (0x0014 - 0x0000)
struct TutorialBlueprintFunctionLibrary_CallDelegate final
{
public:
	TDelegate<void(int32 nValue)>                 InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TutorialBlueprintFunctionLibrary_CallDelegate) == 0x000004, "Wrong alignment on TutorialBlueprintFunctionLibrary_CallDelegate");
static_assert(sizeof(TutorialBlueprintFunctionLibrary_CallDelegate) == 0x000014, "Wrong size on TutorialBlueprintFunctionLibrary_CallDelegate");
static_assert(offsetof(TutorialBlueprintFunctionLibrary_CallDelegate, InDelegate) == 0x000000, "Member 'TutorialBlueprintFunctionLibrary_CallDelegate::InDelegate' has a wrong offset!");
static_assert(offsetof(TutorialBlueprintFunctionLibrary_CallDelegate, Num) == 0x000010, "Member 'TutorialBlueprintFunctionLibrary_CallDelegate::Num' has a wrong offset!");

// Function UnLua.TutorialBlueprintFunctionLibrary.KillObject
// 0x0008 (0x0008 - 0x0000)
struct TutorialBlueprintFunctionLibrary_KillObject final
{
public:
	class UObject*                                obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TutorialBlueprintFunctionLibrary_KillObject) == 0x000008, "Wrong alignment on TutorialBlueprintFunctionLibrary_KillObject");
static_assert(sizeof(TutorialBlueprintFunctionLibrary_KillObject) == 0x000008, "Wrong size on TutorialBlueprintFunctionLibrary_KillObject");
static_assert(offsetof(TutorialBlueprintFunctionLibrary_KillObject, obj) == 0x000000, "Member 'TutorialBlueprintFunctionLibrary_KillObject::obj' has a wrong offset!");

// Function UnLua.TutorialBlueprintFunctionLibrary.SetupCustomLoader
// 0x0004 (0x0004 - 0x0000)
struct TutorialBlueprintFunctionLibrary_SetupCustomLoader final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TutorialBlueprintFunctionLibrary_SetupCustomLoader) == 0x000004, "Wrong alignment on TutorialBlueprintFunctionLibrary_SetupCustomLoader");
static_assert(sizeof(TutorialBlueprintFunctionLibrary_SetupCustomLoader) == 0x000004, "Wrong size on TutorialBlueprintFunctionLibrary_SetupCustomLoader");
static_assert(offsetof(TutorialBlueprintFunctionLibrary_SetupCustomLoader, Index_0) == 0x000000, "Member 'TutorialBlueprintFunctionLibrary_SetupCustomLoader::Index_0' has a wrong offset!");

// Function UnLua.UnLuaInterface.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaInterface_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaInterface_GetModuleName) == 0x000008, "Wrong alignment on UnLuaInterface_GetModuleName");
static_assert(sizeof(UnLuaInterface_GetModuleName) == 0x000010, "Wrong size on UnLuaInterface_GetModuleName");
static_assert(offsetof(UnLuaInterface_GetModuleName, ReturnValue) == 0x000000, "Member 'UnLuaInterface_GetModuleName::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaManager.InputAction
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputAction) == 0x000008, "Wrong alignment on UnLuaManager_InputAction");
static_assert(sizeof(UnLuaManager_InputAction) == 0x000018, "Wrong size on UnLuaManager_InputAction");
static_assert(offsetof(UnLuaManager_InputAction, Key) == 0x000000, "Member 'UnLuaManager_InputAction::Key' has a wrong offset!");

// Function UnLua.UnLuaManager.InputAxis
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputAxis final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputAxis) == 0x000004, "Wrong alignment on UnLuaManager_InputAxis");
static_assert(sizeof(UnLuaManager_InputAxis) == 0x000004, "Wrong size on UnLuaManager_InputAxis");
static_assert(offsetof(UnLuaManager_InputAxis, AxisValue) == 0x000000, "Member 'UnLuaManager_InputAxis::AxisValue' has a wrong offset!");

// Function UnLua.UnLuaManager.InputGesture
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputGesture final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputGesture) == 0x000004, "Wrong alignment on UnLuaManager_InputGesture");
static_assert(sizeof(UnLuaManager_InputGesture) == 0x000004, "Wrong size on UnLuaManager_InputGesture");
static_assert(offsetof(UnLuaManager_InputGesture, Value) == 0x000000, "Member 'UnLuaManager_InputGesture::Value' has a wrong offset!");

// Function UnLua.UnLuaManager.InputTouch
// 0x0020 (0x0020 - 0x0000)
struct UnLuaManager_InputTouch final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputTouch) == 0x000008, "Wrong alignment on UnLuaManager_InputTouch");
static_assert(sizeof(UnLuaManager_InputTouch) == 0x000020, "Wrong size on UnLuaManager_InputTouch");
static_assert(offsetof(UnLuaManager_InputTouch, FingerIndex) == 0x000000, "Member 'UnLuaManager_InputTouch::FingerIndex' has a wrong offset!");
static_assert(offsetof(UnLuaManager_InputTouch, Location) == 0x000008, "Member 'UnLuaManager_InputTouch::Location' has a wrong offset!");

// Function UnLua.UnLuaManager.InputVectorAxis
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputVectorAxis final
{
public:
	struct FVector                                AxisValue;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputVectorAxis) == 0x000008, "Wrong alignment on UnLuaManager_InputVectorAxis");
static_assert(sizeof(UnLuaManager_InputVectorAxis) == 0x000018, "Wrong size on UnLuaManager_InputVectorAxis");
static_assert(offsetof(UnLuaManager_InputVectorAxis, AxisValue) == 0x000000, "Member 'UnLuaManager_InputVectorAxis::AxisValue' has a wrong offset!");

// Function UnLua.UnLuaManager.OnLatentActionCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_OnLatentActionCompleted final
{
public:
	int32                                         LinkID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_OnLatentActionCompleted) == 0x000004, "Wrong alignment on UnLuaManager_OnLatentActionCompleted");
static_assert(sizeof(UnLuaManager_OnLatentActionCompleted) == 0x000004, "Wrong size on UnLuaManager_OnLatentActionCompleted");
static_assert(offsetof(UnLuaManager_OnLatentActionCompleted, LinkID) == 0x000000, "Member 'UnLuaManager_OnLatentActionCompleted::LinkID' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.CallLuaActor
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_CallLuaActor final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InActor;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_CallLuaActor) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_CallLuaActor");
static_assert(sizeof(UnLuaPerformanceTestProxy_CallLuaActor) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_CallLuaActor");
static_assert(offsetof(UnLuaPerformanceTestProxy_CallLuaActor, Count) == 0x000000, "Member 'UnLuaPerformanceTestProxy_CallLuaActor::Count' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_CallLuaActor, InActor) == 0x000008, "Member 'UnLuaPerformanceTestProxy_CallLuaActor::InActor' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.CallLuaInt
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_CallLuaInt final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_CallLuaInt) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_CallLuaInt");
static_assert(sizeof(UnLuaPerformanceTestProxy_CallLuaInt) == 0x000004, "Wrong size on UnLuaPerformanceTestProxy_CallLuaInt");
static_assert(offsetof(UnLuaPerformanceTestProxy_CallLuaInt, Count) == 0x000000, "Member 'UnLuaPerformanceTestProxy_CallLuaInt::Count' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.CallLuaTSet
// 0x0058 (0x0058 - 0x0000)
struct UnLuaPerformanceTestProxy_CallLuaTSet final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FVector>                          InPositions;                                       // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_CallLuaTSet) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_CallLuaTSet");
static_assert(sizeof(UnLuaPerformanceTestProxy_CallLuaTSet) == 0x000058, "Wrong size on UnLuaPerformanceTestProxy_CallLuaTSet");
static_assert(offsetof(UnLuaPerformanceTestProxy_CallLuaTSet, Count) == 0x000000, "Member 'UnLuaPerformanceTestProxy_CallLuaTSet::Count' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_CallLuaTSet, InPositions) == 0x000008, "Member 'UnLuaPerformanceTestProxy_CallLuaTSet::InPositions' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.ExeDelegate
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_ExeDelegate final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_ExeDelegate) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_ExeDelegate");
static_assert(sizeof(UnLuaPerformanceTestProxy_ExeDelegate) == 0x000004, "Wrong size on UnLuaPerformanceTestProxy_ExeDelegate");
static_assert(offsetof(UnLuaPerformanceTestProxy_ExeDelegate, Count) == 0x000000, "Member 'UnLuaPerformanceTestProxy_ExeDelegate::Count' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetActor
// 0x0008 (0x0008 - 0x0000)
struct UnLuaPerformanceTestProxy_GetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetActor) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetActor");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetActor) == 0x000008, "Wrong size on UnLuaPerformanceTestProxy_GetActor");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetActor, ReturnValue) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetActor::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.OverrideFunctionActor
// 0x0008 (0x0008 - 0x0000)
struct UnLuaPerformanceTestProxy_OverrideFunctionActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_OverrideFunctionActor) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_OverrideFunctionActor");
static_assert(sizeof(UnLuaPerformanceTestProxy_OverrideFunctionActor) == 0x000008, "Wrong size on UnLuaPerformanceTestProxy_OverrideFunctionActor");
static_assert(offsetof(UnLuaPerformanceTestProxy_OverrideFunctionActor, InActor) == 0x000000, "Member 'UnLuaPerformanceTestProxy_OverrideFunctionActor::InActor' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.OverrideFunctionInt
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_OverrideFunctionInt final
{
public:
	int32                                         In;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_OverrideFunctionInt) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_OverrideFunctionInt");
static_assert(sizeof(UnLuaPerformanceTestProxy_OverrideFunctionInt) == 0x000004, "Wrong size on UnLuaPerformanceTestProxy_OverrideFunctionInt");
static_assert(offsetof(UnLuaPerformanceTestProxy_OverrideFunctionInt, In) == 0x000000, "Member 'UnLuaPerformanceTestProxy_OverrideFunctionInt::In' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.OverrideFunctionTSet
// 0x0050 (0x0050 - 0x0000)
struct UnLuaPerformanceTestProxy_OverrideFunctionTSet final
{
public:
	TSet<struct FVector>                          InPositions;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_OverrideFunctionTSet) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_OverrideFunctionTSet");
static_assert(sizeof(UnLuaPerformanceTestProxy_OverrideFunctionTSet) == 0x000050, "Wrong size on UnLuaPerformanceTestProxy_OverrideFunctionTSet");
static_assert(offsetof(UnLuaPerformanceTestProxy_OverrideFunctionTSet, InPositions) == 0x000000, "Member 'UnLuaPerformanceTestProxy_OverrideFunctionTSet::InPositions' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.SetActor
// 0x0008 (0x0008 - 0x0000)
struct UnLuaPerformanceTestProxy_SetActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_SetActor) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_SetActor");
static_assert(sizeof(UnLuaPerformanceTestProxy_SetActor) == 0x000008, "Wrong size on UnLuaPerformanceTestProxy_SetActor");
static_assert(offsetof(UnLuaPerformanceTestProxy_SetActor, InActor) == 0x000000, "Member 'UnLuaPerformanceTestProxy_SetActor::InActor' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.SetDelegate
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_SetDelegate final
{
public:
	TDelegate<void(int32 nIndex)>                 InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_SetDelegate) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_SetDelegate");
static_assert(sizeof(UnLuaPerformanceTestProxy_SetDelegate) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_SetDelegate");
static_assert(offsetof(UnLuaPerformanceTestProxy_SetDelegate, InDelegate) == 0x000000, "Member 'UnLuaPerformanceTestProxy_SetDelegate::InDelegate' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.Simulate
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_Simulate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_Simulate) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_Simulate");
static_assert(sizeof(UnLuaPerformanceTestProxy_Simulate) == 0x000004, "Wrong size on UnLuaPerformanceTestProxy_Simulate");
static_assert(offsetof(UnLuaPerformanceTestProxy_Simulate, DeltaTime) == 0x000000, "Member 'UnLuaPerformanceTestProxy_Simulate::DeltaTime' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.UpdateIndices
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateIndices final
{
public:
	TArray<int32>                                 NewIndices;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_UpdateIndices) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_UpdateIndices");
static_assert(sizeof(UnLuaPerformanceTestProxy_UpdateIndices) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_UpdateIndices");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdateIndices, NewIndices) == 0x000000, "Member 'UnLuaPerformanceTestProxy_UpdateIndices::NewIndices' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.UpdateMeshID
// 0x0008 (0x0008 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateMeshID final
{
public:
	int32                                         NewID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_UpdateMeshID) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_UpdateMeshID");
static_assert(sizeof(UnLuaPerformanceTestProxy_UpdateMeshID) == 0x000008, "Wrong size on UnLuaPerformanceTestProxy_UpdateMeshID");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdateMeshID, NewID) == 0x000000, "Member 'UnLuaPerformanceTestProxy_UpdateMeshID::NewID' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdateMeshID, ReturnValue) == 0x000004, "Member 'UnLuaPerformanceTestProxy_UpdateMeshID::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.UpdateMeshName
// 0x0020 (0x0020 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateMeshName final
{
public:
	class FString                                 NewName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_UpdateMeshName) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_UpdateMeshName");
static_assert(sizeof(UnLuaPerformanceTestProxy_UpdateMeshName) == 0x000020, "Wrong size on UnLuaPerformanceTestProxy_UpdateMeshName");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdateMeshName, NewName) == 0x000000, "Member 'UnLuaPerformanceTestProxy_UpdateMeshName::NewName' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdateMeshName, ReturnValue) == 0x000010, "Member 'UnLuaPerformanceTestProxy_UpdateMeshName::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.UpdatePositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdatePositions final
{
public:
	TArray<struct FVector>                        NewPositions;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_UpdatePositions) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_UpdatePositions");
static_assert(sizeof(UnLuaPerformanceTestProxy_UpdatePositions) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_UpdatePositions");
static_assert(offsetof(UnLuaPerformanceTestProxy_UpdatePositions, NewPositions) == 0x000000, "Member 'UnLuaPerformanceTestProxy_UpdatePositions::NewPositions' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetCOM
// 0x0018 (0x0018 - 0x0000)
struct UnLuaPerformanceTestProxy_GetCOM final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetCOM) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetCOM");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetCOM) == 0x000018, "Wrong size on UnLuaPerformanceTestProxy_GetCOM");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetCOM, ReturnValue) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetCOM::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetIndices
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetIndices final
{
public:
	TArray<int32>                                 OutIndices;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetIndices) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetIndices");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetIndices) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_GetIndices");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetIndices, OutIndices) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetIndices::OutIndices' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshID
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetMeshID) == 0x000004, "Wrong alignment on UnLuaPerformanceTestProxy_GetMeshID");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetMeshID) == 0x000004, "Wrong size on UnLuaPerformanceTestProxy_GetMeshID");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshID, ReturnValue) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetMeshID::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshInfo
// 0x0068 (0x0068 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshInfo final
{
public:
	int32                                         OutMeshID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutMeshName;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutCOM;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutIndices;                                        // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutPositions;                                      // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutPredictedPositions;                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetMeshInfo) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetMeshInfo");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetMeshInfo) == 0x000068, "Wrong size on UnLuaPerformanceTestProxy_GetMeshInfo");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutMeshID) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutMeshID' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutMeshName) == 0x000008, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutMeshName' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutCOM) == 0x000018, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutCOM' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutIndices) == 0x000030, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutIndices' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutPositions) == 0x000040, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutPositions' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, OutPredictedPositions) == 0x000050, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::OutPredictedPositions' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshInfo, ReturnValue) == 0x000060, "Member 'UnLuaPerformanceTestProxy_GetMeshInfo::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetMeshName) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetMeshName");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetMeshName) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_GetMeshName");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetMeshName, ReturnValue) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetMeshName::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetPositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetPositions final
{
public:
	TArray<struct FVector>                        OutPositions;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetPositions) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetPositions");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetPositions) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_GetPositions");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetPositions, OutPositions) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetPositions::OutPositions' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.GetPredictedPositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetPredictedPositions final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaPerformanceTestProxy_GetPredictedPositions) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_GetPredictedPositions");
static_assert(sizeof(UnLuaPerformanceTestProxy_GetPredictedPositions) == 0x000010, "Wrong size on UnLuaPerformanceTestProxy_GetPredictedPositions");
static_assert(offsetof(UnLuaPerformanceTestProxy_GetPredictedPositions, ReturnValue) == 0x000000, "Member 'UnLuaPerformanceTestProxy_GetPredictedPositions::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaPerformanceTestProxy.Raycast
// 0x0038 (0x0038 - 0x0000)
struct UnLuaPerformanceTestProxy_Raycast final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnLuaPerformanceTestProxy_Raycast) == 0x000008, "Wrong alignment on UnLuaPerformanceTestProxy_Raycast");
static_assert(sizeof(UnLuaPerformanceTestProxy_Raycast) == 0x000038, "Wrong size on UnLuaPerformanceTestProxy_Raycast");
static_assert(offsetof(UnLuaPerformanceTestProxy_Raycast, Origin) == 0x000000, "Member 'UnLuaPerformanceTestProxy_Raycast::Origin' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_Raycast, Direction) == 0x000018, "Member 'UnLuaPerformanceTestProxy_Raycast::Direction' has a wrong offset!");
static_assert(offsetof(UnLuaPerformanceTestProxy_Raycast, ReturnValue) == 0x000030, "Member 'UnLuaPerformanceTestProxy_Raycast::ReturnValue' has a wrong offset!");

}

