#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealYAML

#include "Basic.hpp"

#include "UnrealYAML_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UnrealYAML.YamlNodeHelpers.AsBool
// 0x0048 (0x0048 - 0x0000)
struct YamlNodeHelpers_AsBool final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Default;                                           // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0042(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsBool) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsBool");
static_assert(sizeof(YamlNodeHelpers_AsBool) == 0x000048, "Wrong size on YamlNodeHelpers_AsBool");
static_assert(offsetof(YamlNodeHelpers_AsBool, Node) == 0x000000, "Member 'YamlNodeHelpers_AsBool::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBool, Default) == 0x000040, "Member 'YamlNodeHelpers_AsBool::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBool, Value) == 0x000041, "Member 'YamlNodeHelpers_AsBool::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBool, ReturnValue) == 0x000042, "Member 'YamlNodeHelpers_AsBool::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsBoolArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsBoolArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<bool>                                  Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<bool>                                  Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsBoolArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsBoolArray");
static_assert(sizeof(YamlNodeHelpers_AsBoolArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsBoolArray");
static_assert(offsetof(YamlNodeHelpers_AsBoolArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsBoolArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBoolArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsBoolArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBoolArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsBoolArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsBoolArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsBoolArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsByte
// 0x0048 (0x0048 - 0x0000)
struct YamlNodeHelpers_AsByte final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Default;                                           // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0042(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsByte) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsByte");
static_assert(sizeof(YamlNodeHelpers_AsByte) == 0x000048, "Wrong size on YamlNodeHelpers_AsByte");
static_assert(offsetof(YamlNodeHelpers_AsByte, Node) == 0x000000, "Member 'YamlNodeHelpers_AsByte::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByte, Default) == 0x000040, "Member 'YamlNodeHelpers_AsByte::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByte, Value) == 0x000041, "Member 'YamlNodeHelpers_AsByte::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByte, ReturnValue) == 0x000042, "Member 'YamlNodeHelpers_AsByte::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsByteArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsByteArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsByteArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsByteArray");
static_assert(sizeof(YamlNodeHelpers_AsByteArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsByteArray");
static_assert(offsetof(YamlNodeHelpers_AsByteArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsByteArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByteArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsByteArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByteArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsByteArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsByteArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsByteArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsFloat
// 0x0050 (0x0050 - 0x0000)
struct YamlNodeHelpers_AsFloat final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsFloat) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsFloat");
static_assert(sizeof(YamlNodeHelpers_AsFloat) == 0x000050, "Wrong size on YamlNodeHelpers_AsFloat");
static_assert(offsetof(YamlNodeHelpers_AsFloat, Node) == 0x000000, "Member 'YamlNodeHelpers_AsFloat::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloat, Default) == 0x000040, "Member 'YamlNodeHelpers_AsFloat::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloat, Value) == 0x000044, "Member 'YamlNodeHelpers_AsFloat::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloat, ReturnValue) == 0x000048, "Member 'YamlNodeHelpers_AsFloat::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsFloatArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsFloatArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsFloatArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsFloatArray");
static_assert(sizeof(YamlNodeHelpers_AsFloatArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsFloatArray");
static_assert(offsetof(YamlNodeHelpers_AsFloatArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsFloatArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloatArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsFloatArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloatArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsFloatArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsFloatArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsFloatArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsInt
// 0x0050 (0x0050 - 0x0000)
struct YamlNodeHelpers_AsInt final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Default;                                           // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsInt) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsInt");
static_assert(sizeof(YamlNodeHelpers_AsInt) == 0x000050, "Wrong size on YamlNodeHelpers_AsInt");
static_assert(offsetof(YamlNodeHelpers_AsInt, Node) == 0x000000, "Member 'YamlNodeHelpers_AsInt::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsInt, Default) == 0x000040, "Member 'YamlNodeHelpers_AsInt::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsInt, Value) == 0x000044, "Member 'YamlNodeHelpers_AsInt::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsInt, ReturnValue) == 0x000048, "Member 'YamlNodeHelpers_AsInt::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsIntArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntArray");
static_assert(sizeof(YamlNodeHelpers_AsIntArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsIntArray");
static_assert(offsetof(YamlNodeHelpers_AsIntArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsIntArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsIntArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntBoolMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntBoolMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, bool>                             Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, bool>                             Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntBoolMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntBoolMap");
static_assert(sizeof(YamlNodeHelpers_AsIntBoolMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntBoolMap");
static_assert(offsetof(YamlNodeHelpers_AsIntBoolMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntBoolMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntBoolMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntBoolMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntBoolMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntBoolMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntBoolMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntBoolMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntByteMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntByteMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, uint8>                            Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, uint8>                            Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntByteMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntByteMap");
static_assert(sizeof(YamlNodeHelpers_AsIntByteMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntByteMap");
static_assert(offsetof(YamlNodeHelpers_AsIntByteMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntByteMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntByteMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntByteMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntByteMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntByteMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntByteMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntByteMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntFloatMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntFloatMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, float>                            Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, float>                            Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntFloatMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntFloatMap");
static_assert(sizeof(YamlNodeHelpers_AsIntFloatMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntFloatMap");
static_assert(offsetof(YamlNodeHelpers_AsIntFloatMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntFloatMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntFloatMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntFloatMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntFloatMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntFloatMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntFloatMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntFloatMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntIntMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntIntMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntIntMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntIntMap");
static_assert(sizeof(YamlNodeHelpers_AsIntIntMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntIntMap");
static_assert(offsetof(YamlNodeHelpers_AsIntIntMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntIntMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntIntMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntIntMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntIntMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntIntMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntIntMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntIntMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntLongMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntLongMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, int64>                            Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, int64>                            Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntLongMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntLongMap");
static_assert(sizeof(YamlNodeHelpers_AsIntLongMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntLongMap");
static_assert(offsetof(YamlNodeHelpers_AsIntLongMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntLongMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntLongMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntLongMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntLongMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntLongMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntLongMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntLongMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntQuatMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntQuatMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FQuat>                     Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FQuat>                     Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntQuatMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntQuatMap");
static_assert(sizeof(YamlNodeHelpers_AsIntQuatMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntQuatMap");
static_assert(offsetof(YamlNodeHelpers_AsIntQuatMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntQuatMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntQuatMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntQuatMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntQuatMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntQuatMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntQuatMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntQuatMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntStringMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntStringMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FString>                    Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FString>                    Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntStringMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntStringMap");
static_assert(sizeof(YamlNodeHelpers_AsIntStringMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntStringMap");
static_assert(offsetof(YamlNodeHelpers_AsIntStringMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntStringMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntStringMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntStringMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntStringMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntStringMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntStringMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntStringMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntTextMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntTextMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FText>                      Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, class FText>                      Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntTextMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntTextMap");
static_assert(sizeof(YamlNodeHelpers_AsIntTextMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntTextMap");
static_assert(offsetof(YamlNodeHelpers_AsIntTextMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntTextMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTextMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntTextMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTextMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntTextMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTextMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntTextMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntTransformMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntTransformMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FTransform>                Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FTransform>                Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntTransformMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntTransformMap");
static_assert(sizeof(YamlNodeHelpers_AsIntTransformMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntTransformMap");
static_assert(offsetof(YamlNodeHelpers_AsIntTransformMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntTransformMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTransformMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntTransformMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTransformMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntTransformMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntTransformMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntTransformMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsIntVectorMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsIntVectorMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FVector>                   Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FVector>                   Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsIntVectorMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsIntVectorMap");
static_assert(sizeof(YamlNodeHelpers_AsIntVectorMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsIntVectorMap");
static_assert(offsetof(YamlNodeHelpers_AsIntVectorMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsIntVectorMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntVectorMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsIntVectorMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntVectorMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsIntVectorMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsIntVectorMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsIntVectorMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsLong
// 0x0058 (0x0058 - 0x0000)
struct YamlNodeHelpers_AsLong final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Default;                                           // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Value;                                             // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsLong) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsLong");
static_assert(sizeof(YamlNodeHelpers_AsLong) == 0x000058, "Wrong size on YamlNodeHelpers_AsLong");
static_assert(offsetof(YamlNodeHelpers_AsLong, Node) == 0x000000, "Member 'YamlNodeHelpers_AsLong::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLong, Default) == 0x000040, "Member 'YamlNodeHelpers_AsLong::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLong, Value) == 0x000048, "Member 'YamlNodeHelpers_AsLong::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLong, ReturnValue) == 0x000050, "Member 'YamlNodeHelpers_AsLong::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsLongArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsLongArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int64>                                 Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int64>                                 Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsLongArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsLongArray");
static_assert(sizeof(YamlNodeHelpers_AsLongArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsLongArray");
static_assert(offsetof(YamlNodeHelpers_AsLongArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsLongArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLongArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsLongArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLongArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsLongArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsLongArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsLongArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsQuat
// 0x0090 (0x0090 - 0x0000)
struct YamlNodeHelpers_AsQuat final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FQuat                                  Default;                                           // 0x0040(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Value;                                             // 0x0060(0x0020)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsQuat) == 0x000010, "Wrong alignment on YamlNodeHelpers_AsQuat");
static_assert(sizeof(YamlNodeHelpers_AsQuat) == 0x000090, "Wrong size on YamlNodeHelpers_AsQuat");
static_assert(offsetof(YamlNodeHelpers_AsQuat, Node) == 0x000000, "Member 'YamlNodeHelpers_AsQuat::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuat, Default) == 0x000040, "Member 'YamlNodeHelpers_AsQuat::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuat, Value) == 0x000060, "Member 'YamlNodeHelpers_AsQuat::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuat, ReturnValue) == 0x000080, "Member 'YamlNodeHelpers_AsQuat::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsQuatArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsQuatArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsQuatArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsQuatArray");
static_assert(sizeof(YamlNodeHelpers_AsQuatArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsQuatArray");
static_assert(offsetof(YamlNodeHelpers_AsQuatArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsQuatArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuatArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsQuatArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuatArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsQuatArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsQuatArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsQuatArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsString
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsString final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Default;                                           // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsString) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsString");
static_assert(sizeof(YamlNodeHelpers_AsString) == 0x000068, "Wrong size on YamlNodeHelpers_AsString");
static_assert(offsetof(YamlNodeHelpers_AsString, Node) == 0x000000, "Member 'YamlNodeHelpers_AsString::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsString, Default) == 0x000040, "Member 'YamlNodeHelpers_AsString::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsString, Value) == 0x000050, "Member 'YamlNodeHelpers_AsString::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsString, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsString::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringArray
// 0x0068 (0x0068 - 0x0000)
struct YamlNodeHelpers_AsStringArray final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Default;                                           // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Value;                                             // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringArray) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringArray");
static_assert(sizeof(YamlNodeHelpers_AsStringArray) == 0x000068, "Wrong size on YamlNodeHelpers_AsStringArray");
static_assert(offsetof(YamlNodeHelpers_AsStringArray, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringArray::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringArray, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringArray::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringArray, Value) == 0x000050, "Member 'YamlNodeHelpers_AsStringArray::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringArray, ReturnValue) == 0x000060, "Member 'YamlNodeHelpers_AsStringArray::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringBoolMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringBoolMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringBoolMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringBoolMap");
static_assert(sizeof(YamlNodeHelpers_AsStringBoolMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringBoolMap");
static_assert(offsetof(YamlNodeHelpers_AsStringBoolMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringBoolMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringBoolMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringBoolMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringBoolMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringBoolMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringBoolMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringBoolMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringByteMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringByteMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, uint8>                    Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, uint8>                    Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringByteMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringByteMap");
static_assert(sizeof(YamlNodeHelpers_AsStringByteMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringByteMap");
static_assert(offsetof(YamlNodeHelpers_AsStringByteMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringByteMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringByteMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringByteMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringByteMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringByteMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringByteMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringByteMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringFloatMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringFloatMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringFloatMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringFloatMap");
static_assert(sizeof(YamlNodeHelpers_AsStringFloatMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringFloatMap");
static_assert(offsetof(YamlNodeHelpers_AsStringFloatMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringFloatMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringFloatMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringFloatMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringFloatMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringFloatMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringFloatMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringFloatMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringIntMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringIntMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringIntMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringIntMap");
static_assert(sizeof(YamlNodeHelpers_AsStringIntMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringIntMap");
static_assert(offsetof(YamlNodeHelpers_AsStringIntMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringIntMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringIntMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringIntMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringIntMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringIntMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringIntMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringIntMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringLongMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringLongMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int64>                    Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, int64>                    Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringLongMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringLongMap");
static_assert(sizeof(YamlNodeHelpers_AsStringLongMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringLongMap");
static_assert(offsetof(YamlNodeHelpers_AsStringLongMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringLongMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringLongMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringLongMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringLongMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringLongMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringLongMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringLongMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringQuatMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringQuatMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, struct FQuat>             Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, struct FQuat>             Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringQuatMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringQuatMap");
static_assert(sizeof(YamlNodeHelpers_AsStringQuatMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringQuatMap");
static_assert(offsetof(YamlNodeHelpers_AsStringQuatMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringQuatMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringQuatMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringQuatMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringQuatMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringQuatMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringQuatMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringQuatMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringStringMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringStringMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Value;                                             // 0x0090(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(YamlNodeHelpers_AsStringStringMap) == 0x000008, "Wrong alignment on YamlNodeHelpers_AsStringStringMap");
static_assert(sizeof(YamlNodeHelpers_AsStringStringMap) == 0x0000E8, "Wrong size on YamlNodeHelpers_AsStringStringMap");
static_assert(offsetof(YamlNodeHelpers_AsStringStringMap, Node) == 0x000000, "Member 'YamlNodeHelpers_AsStringStringMap::Node' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringStringMap, Default) == 0x000040, "Member 'YamlNodeHelpers_AsStringStringMap::Default' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringStringMap, Value) == 0x000090, "Member 'YamlNodeHelpers_AsStringStringMap::Value' has a wrong offset!");
static_assert(offsetof(YamlNodeHelpers_AsStringStringMap, ReturnValue) == 0x0000E0, "Member 'YamlNodeHelpers_AsStringStringMap::ReturnValue' has a wrong offset!");

// Function UnrealYAML.YamlNodeHelpers.AsStringTextMap
// 0x00E8 (0x00E8 - 0x0000)
struct YamlNodeHelpers_AsStringTextMap final
{
public:
	struct FYamlNode                              Node;                                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FString, class FText>              Default;                                           // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
