#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EDeviceScreenSizeType_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UTCComponent.UTCComponent_C.Add Finger Location
// 0x0030 (0x0030 - 0x0000)
struct UTCComponent_C_Add_Finger_Location final
{
public:
	ETouchIndex                                   Finger_Index;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Add_Finger_Location) == 0x000008, "Wrong alignment on UTCComponent_C_Add_Finger_Location");
static_assert(sizeof(UTCComponent_C_Add_Finger_Location) == 0x000030, "Wrong size on UTCComponent_C_Add_Finger_Location");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, Finger_Index) == 0x000000, "Member 'UTCComponent_C_Add_Finger_Location::Finger_Index' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, Location) == 0x000008, "Member 'UTCComponent_C_Add_Finger_Location::Location' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, Result) == 0x000020, "Member 'UTCComponent_C_Add_Finger_Location::Result' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'UTCComponent_C_Add_Finger_Location::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, CallFunc_Array_Add_ReturnValue_1) == 0x000028, "Member 'UTCComponent_C_Add_Finger_Location::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Add_Finger_Location, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'UTCComponent_C_Add_Finger_Location::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.BP_GetDeviceType
// 0x0001 (0x0001 - 0x0000)
struct UTCComponent_C_BP_GetDeviceType final
{
public:
	EDeviceScreenSizeType                         NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_BP_GetDeviceType) == 0x000001, "Wrong alignment on UTCComponent_C_BP_GetDeviceType");
static_assert(sizeof(UTCComponent_C_BP_GetDeviceType) == 0x000001, "Wrong size on UTCComponent_C_BP_GetDeviceType");
static_assert(offsetof(UTCComponent_C_BP_GetDeviceType, NewParam) == 0x000000, "Member 'UTCComponent_C_BP_GetDeviceType::NewParam' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.BP_GetJoystickOffset
// 0x0018 (0x0018 - 0x0000)
struct UTCComponent_C_BP_GetJoystickOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_BP_GetJoystickOffset) == 0x000008, "Wrong alignment on UTCComponent_C_BP_GetJoystickOffset");
static_assert(sizeof(UTCComponent_C_BP_GetJoystickOffset) == 0x000018, "Wrong size on UTCComponent_C_BP_GetJoystickOffset");
static_assert(offsetof(UTCComponent_C_BP_GetJoystickOffset, Offset) == 0x000000, "Member 'UTCComponent_C_BP_GetJoystickOffset::Offset' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_BP_GetJoystickOffset, Scale) == 0x000010, "Member 'UTCComponent_C_BP_GetJoystickOffset::Scale' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.BP_GetPixelRateStandardToReal
// 0x0008 (0x0008 - 0x0000)
struct UTCComponent_C_BP_GetPixelRateStandardToReal final
{
public:
	double                                        Rate;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_BP_GetPixelRateStandardToReal) == 0x000008, "Wrong alignment on UTCComponent_C_BP_GetPixelRateStandardToReal");
static_assert(sizeof(UTCComponent_C_BP_GetPixelRateStandardToReal) == 0x000008, "Wrong size on UTCComponent_C_BP_GetPixelRateStandardToReal");
static_assert(offsetof(UTCComponent_C_BP_GetPixelRateStandardToReal, Rate) == 0x000000, "Member 'UTCComponent_C_BP_GetPixelRateStandardToReal::Rate' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.BP_GetTouchSensitivity
// 0x0008 (0x0008 - 0x0000)
struct UTCComponent_C_BP_GetTouchSensitivity final
{
public:
	double                                        Rate;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_BP_GetTouchSensitivity) == 0x000008, "Wrong alignment on UTCComponent_C_BP_GetTouchSensitivity");
static_assert(sizeof(UTCComponent_C_BP_GetTouchSensitivity) == 0x000008, "Wrong size on UTCComponent_C_BP_GetTouchSensitivity");
static_assert(offsetof(UTCComponent_C_BP_GetTouchSensitivity, Rate) == 0x000000, "Member 'UTCComponent_C_BP_GetTouchSensitivity::Rate' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Check Bounds
// 0x0078 (0x0078 - 0x0000)
struct UTCComponent_C_Check_Bounds final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Bounds;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          out_Bounds;                                        // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Bounds_by_X;                                    // 0x001A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In_Bounds_by_Y;                                    // 0x001B(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Without_Bounds;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Bounding_Enabled_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Check_Bounds) == 0x000008, "Wrong alignment on UTCComponent_C_Check_Bounds");
static_assert(sizeof(UTCComponent_C_Check_Bounds) == 0x000078, "Wrong size on UTCComponent_C_Check_Bounds");
static_assert(offsetof(UTCComponent_C_Check_Bounds, Location) == 0x000000, "Member 'UTCComponent_C_Check_Bounds::Location' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, In_Bounds) == 0x000018, "Member 'UTCComponent_C_Check_Bounds::In_Bounds' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, out_Bounds) == 0x000019, "Member 'UTCComponent_C_Check_Bounds::out_Bounds' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, In_Bounds_by_X) == 0x00001A, "Member 'UTCComponent_C_Check_Bounds::In_Bounds_by_X' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, In_Bounds_by_Y) == 0x00001B, "Member 'UTCComponent_C_Check_Bounds::In_Bounds_by_Y' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, Without_Bounds) == 0x00001C, "Member 'UTCComponent_C_Check_Bounds::Without_Bounds' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector_X) == 0x000020, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector_Y) == 0x000028, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector_Z) == 0x000030, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_Is_Bounding_Enabled_ReturnValue) == 0x000038, "Member 'UTCComponent_C_Check_Bounds::CallFunc_Is_Bounding_Enabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector2D_X) == 0x000040, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector2D_X_1) == 0x000050, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BreakVector2D_Y_1) == 0x000058, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'UTCComponent_C_Check_Bounds::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'UTCComponent_C_Check_Bounds::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000070, "Member 'UTCComponent_C_Check_Bounds::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000071, "Member 'UTCComponent_C_Check_Bounds::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Bounds, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'UTCComponent_C_Check_Bounds::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Check Is Viewport Size Changed
// 0x0038 (0x0038 - 0x0000)
struct UTCComponent_C_Check_Is_Viewport_Size_Changed final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Changed;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Check_Is_Viewport_Size_Changed) == 0x000008, "Wrong alignment on UTCComponent_C_Check_Is_Viewport_Size_Changed");
static_assert(sizeof(UTCComponent_C_Check_Is_Viewport_Size_Changed) == 0x000038, "Wrong size on UTCComponent_C_Check_Is_Viewport_Size_Changed");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, Result) == 0x000000, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::Result' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, Is_Changed) == 0x000001, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::Is_Changed' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_GetViewportSize_ReturnValue) == 0x000008, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_BreakVector2D_X) == 0x000018, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_FTrunc_ReturnValue_1) == 0x00002C, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Check_Is_Viewport_Size_Changed, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'UTCComponent_C_Check_Is_Viewport_Size_Changed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.ExecuteUbergraph_UTCComponent
// 0x00B0 (0x00B0 - 0x0000)
struct UTCComponent_C_ExecuteUbergraph_UTCComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Is_Viewport_Size_Changed_Result;    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Pawn_Possessed_By_PC_Is_Possessed;     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Pawn_Possessed_By_PC_Is_Locally_Controlled; // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Is_Viewport_Size_Changed_Result_1;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUTCComponent_C*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUTCComponent_C*                        CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Player_Controller_Loaded_Is_Loaded;    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_ExecuteUbergraph_UTCComponent) == 0x000008, "Wrong alignment on UTCComponent_C_ExecuteUbergraph_UTCComponent");
static_assert(sizeof(UTCComponent_C_ExecuteUbergraph_UTCComponent) == 0x0000B0, "Wrong size on UTCComponent_C_ExecuteUbergraph_UTCComponent");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, EntryPoint) == 0x000000, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, Temp_int_Variable) == 0x000004, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Check_Is_Viewport_Size_Changed_Result) == 0x000014, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Check_Is_Viewport_Size_Changed_Result' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Is_Pawn_Possessed_By_PC_Is_Possessed) == 0x000015, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Is_Pawn_Possessed_By_PC_Is_Possessed' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Is_Pawn_Possessed_By_PC_Is_Locally_Controlled) == 0x000016, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Is_Pawn_Possessed_By_PC_Is_Locally_Controlled' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000038, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000040, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_MakeVector2D_ReturnValue_1) == 0x000048, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Check_Is_Viewport_Size_Changed_Result_1) == 0x000058, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Check_Is_Viewport_Size_Changed_Result_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000060, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Array_Get_Item) == 0x000070, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000080, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A4, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_ExecuteUbergraph_UTCComponent, CallFunc_Is_Player_Controller_Loaded_Is_Loaded) == 0x0000AC, "Member 'UTCComponent_C_ExecuteUbergraph_UTCComponent::CallFunc_Is_Player_Controller_Loaded_Is_Loaded' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Filter By Active
// 0x0058 (0x0058 - 0x0000)
struct UTCComponent_C_Filter_By_Active final
{
public:
	TArray<class UUTCComponent_C*>                UTCComponents;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UUTCComponent_C*>                Active_Components;                                 // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UUTCComponent_C*>                Active_UTC_Components;                             // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCComponent_C*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Filter_By_Active) == 0x000008, "Wrong alignment on UTCComponent_C_Filter_By_Active");
static_assert(sizeof(UTCComponent_C_Filter_By_Active) == 0x000058, "Wrong size on UTCComponent_C_Filter_By_Active");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, UTCComponents) == 0x000000, "Member 'UTCComponent_C_Filter_By_Active::UTCComponents' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, Active_Components) == 0x000010, "Member 'UTCComponent_C_Filter_By_Active::Active_Components' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, Active_UTC_Components) == 0x000020, "Member 'UTCComponent_C_Filter_By_Active::Active_UTC_Components' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, Temp_int_Array_Index_Variable) == 0x000034, "Member 'UTCComponent_C_Filter_By_Active::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'UTCComponent_C_Filter_By_Active::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_Array_Get_Item) == 0x000040, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_IsActive_ReturnValue) == 0x000048, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Filter_By_Active, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'UTCComponent_C_Filter_By_Active::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Get FingerIndex and Location by index
// 0x0048 (0x0048 - 0x0000)
struct UTCComponent_C_Get_FingerIndex_and_Location_by_index final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Valid;                                          // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   CallFunc_Array_Get_Item;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Get_FingerIndex_and_Location_by_index) == 0x000008, "Wrong alignment on UTCComponent_C_Get_FingerIndex_and_Location_by_index");
static_assert(sizeof(UTCComponent_C_Get_FingerIndex_and_Location_by_index) == 0x000048, "Wrong size on UTCComponent_C_Get_FingerIndex_and_Location_by_index");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, Index_0) == 0x000000, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::Index_0' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, Location) == 0x000008, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::Location' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, FingerIndex) == 0x000020, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::FingerIndex' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, Is_Valid) == 0x000021, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::Is_Valid' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, CallFunc_Array_Get_Item) == 0x000022, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000041, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_FingerIndex_and_Location_by_index, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'UTCComponent_C_Get_FingerIndex_and_Location_by_index::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Get Fingers Length
// 0x0008 (0x0008 - 0x0000)
struct UTCComponent_C_Get_Fingers_Length final
{
public:
	int32                                         Length;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Get_Fingers_Length) == 0x000004, "Wrong alignment on UTCComponent_C_Get_Fingers_Length");
static_assert(sizeof(UTCComponent_C_Get_Fingers_Length) == 0x000008, "Wrong size on UTCComponent_C_Get_Fingers_Length");
static_assert(offsetof(UTCComponent_C_Get_Fingers_Length, Length) == 0x000000, "Member 'UTCComponent_C_Get_Fingers_Length::Length' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Fingers_Length, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'UTCComponent_C_Get_Fingers_Length::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Get Is Pawn Possessed by PC
// 0x0058 (0x0058 - 0x0000)
struct UTCComponent_C_Get_Is_Pawn_Possessed_by_PC final
{
public:
	bool                                          Is_Possessed_By_PC;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Locally_Controlled;                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC) == 0x000008, "Wrong alignment on UTCComponent_C_Get_Is_Pawn_Possessed_by_PC");
static_assert(sizeof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC) == 0x000058, "Wrong size on UTCComponent_C_Get_Is_Pawn_Possessed_by_PC");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, Is_Possessed_By_PC) == 0x000000, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::Is_Possessed_By_PC' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, Is_Locally_Controlled) == 0x000001, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::Is_Locally_Controlled' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_AsPlayer_Controller) == 0x000020, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_IsLocallyControlled_ReturnValue) == 0x000029, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_IsLocalController_ReturnValue) == 0x00002A, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x000048, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Is_Pawn_Possessed_by_PC, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'UTCComponent_C_Get_Is_Pawn_Possessed_by_PC::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Get Screen Size By Size In Percents
// 0x0060 (0x0060 - 0x0000)
struct UTCComponent_C_Get_Screen_Size_By_Size_In_Percents final
{
public:
	struct FVector2D                              InVec;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents) == 0x000008, "Wrong alignment on UTCComponent_C_Get_Screen_Size_By_Size_In_Percents");
static_assert(sizeof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents) == 0x000060, "Wrong size on UTCComponent_C_Get_Screen_Size_By_Size_In_Percents");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, InVec) == 0x000000, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::InVec' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, ReturnValue) == 0x000010, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_BreakVector2D_X) == 0x000020, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000040, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Get_Screen_Size_By_Size_In_Percents, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'UTCComponent_C_Get_Screen_Size_By_Size_In_Percents::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Is Bounding Enabled
// 0x0005 (0x0005 - 0x0000)
struct UTCComponent_C_Is_Bounding_Enabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZero2D_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Is_Bounding_Enabled) == 0x000001, "Wrong alignment on UTCComponent_C_Is_Bounding_Enabled");
static_assert(sizeof(UTCComponent_C_Is_Bounding_Enabled) == 0x000005, "Wrong size on UTCComponent_C_Is_Bounding_Enabled");
static_assert(offsetof(UTCComponent_C_Is_Bounding_Enabled, ReturnValue) == 0x000000, "Member 'UTCComponent_C_Is_Bounding_Enabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Bounding_Enabled, CallFunc_IsZero2D_ReturnValue) == 0x000001, "Member 'UTCComponent_C_Is_Bounding_Enabled::CallFunc_IsZero2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Bounding_Enabled, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'UTCComponent_C_Is_Bounding_Enabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Bounding_Enabled, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'UTCComponent_C_Is_Bounding_Enabled::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Bounding_Enabled, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'UTCComponent_C_Is_Bounding_Enabled::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Is Finger Location Exists
// 0x000C (0x000C - 0x0000)
struct UTCComponent_C_Is_Finger_Location_Exists final
{
public:
	ETouchIndex                                   Finger_Index;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Is_Finger_Location_Exists) == 0x000004, "Wrong alignment on UTCComponent_C_Is_Finger_Location_Exists");
static_assert(sizeof(UTCComponent_C_Is_Finger_Location_Exists) == 0x00000C, "Wrong size on UTCComponent_C_Is_Finger_Location_Exists");
static_assert(offsetof(UTCComponent_C_Is_Finger_Location_Exists, Finger_Index) == 0x000000, "Member 'UTCComponent_C_Is_Finger_Location_Exists::Finger_Index' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Location_Exists, Result) == 0x000001, "Member 'UTCComponent_C_Is_Finger_Location_Exists::Result' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Location_Exists, CallFunc_Array_Find_ReturnValue) == 0x000004, "Member 'UTCComponent_C_Is_Finger_Location_Exists::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Location_Exists, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000008, "Member 'UTCComponent_C_Is_Finger_Location_Exists::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function UTCComponent.UTCComponent_C.Is Finger Slots Available
// 0x000C (0x000C - 0x0000)
struct UTCComponent_C_Is_Finger_Slots_Available final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Fingers_Length_Length;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCComponent_C_Is_Finger_Slots_Available) == 0x000004, "Wrong alignment on UTCComponent_C_Is_Finger_Slots_Available");
static_assert(sizeof(UTCComponent_C_Is_Finger_Slots_Available) == 0x00000C, "Wrong size on UTCComponent_C_Is_Finger_Slots_Available");
static_assert(offsetof(UTCComponent_C_Is_Finger_Slots_Available, ReturnValue) == 0x000000, "Member 'UTCComponent_C_Is_Finger_Slots_Available::ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Slots_Available, CallFunc_Get_Fingers_Length_Length) == 0x000004, "Member 'UTCComponent_C_Is_Finger_Slots_Available::CallFunc_Get_Fingers_Length_Length' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Slots_Available, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'UTCComponent_C_Is_Finger_Slots_Available::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Slots_Available, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'UTCComponent_C_Is_Finger_Slots_Available::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCComponent_C_Is_Finger_Slots_Available, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'UTCComponent_C_Is_Finger_Slots_Available::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

