#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCDebugWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UTCDebugWidget.UTCDebugWidget_C.OnPaint
// 0x0030 (0x0030 - 0x0000)
struct UTCDebugWidget_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UTCDebugWidget_C_OnPaint) == 0x000008, "Wrong alignment on UTCDebugWidget_C_OnPaint");
static_assert(sizeof(UTCDebugWidget_C_OnPaint) == 0x000030, "Wrong size on UTCDebugWidget_C_OnPaint");
static_assert(offsetof(UTCDebugWidget_C_OnPaint, Context) == 0x000000, "Member 'UTCDebugWidget_C_OnPaint::Context' has a wrong offset!");

// Function UTCDebugWidget.UTCDebugWidget_C.Draw Radial Shape
// 0x0180 (0x0180 - 0x0000)
struct UTCDebugWidget_C_Draw_Radial_Shape final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FVector2D                              Center;                                            // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Segments;                                          // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x004C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Angle;                                             // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Cos_ReturnValue;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue_1;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_3;     // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Cos_ReturnValue_1;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_4;     // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_5;     // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCDebugWidget_C_Draw_Radial_Shape) == 0x000008, "Wrong alignment on UTCDebugWidget_C_Draw_Radial_Shape");
static_assert(sizeof(UTCDebugWidget_C_Draw_Radial_Shape) == 0x000180, "Wrong size on UTCDebugWidget_C_Draw_Radial_Shape");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Context) == 0x000000, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Context' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Center) == 0x000030, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Center' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Radius) == 0x000040, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Radius' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Segments) == 0x000048, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Segments' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Color) == 0x00004C, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Color' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Angle) == 0x000060, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Angle' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Max_ReturnValue) == 0x000078, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, Temp_int_Variable) == 0x000088, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Sin_ReturnValue) == 0x000090, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000098, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Cos_ReturnValue) == 0x0000B0, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000C0, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x0000D8, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000F0, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x000100, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Sin_ReturnValue_1) == 0x000110, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Sin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000118, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue_3) == 0x000128, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Cos_ReturnValue_1) == 0x000138, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Cos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue_4) == 0x000140, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x000150, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Multiply_Vector2DFloat_ReturnValue_5) == 0x000160, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Multiply_Vector2DFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Radial_Shape, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x000170, "Member 'UTCDebugWidget_C_Draw_Radial_Shape::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");

// Function UTCDebugWidget.UTCDebugWidget_C.Draw Bounding Box
// 0x0180 (0x0180 - 0x0000)
struct UTCDebugWidget_C_Draw_Bounding_Box final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FVector2D                              Location;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_2;       // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_2;  // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_3;  // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_3;       // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_4;       // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1;    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2;    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_4;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCDebugWidget_C_Draw_Bounding_Box) == 0x000008, "Wrong alignment on UTCDebugWidget_C_Draw_Bounding_Box");
static_assert(sizeof(UTCDebugWidget_C_Draw_Bounding_Box) == 0x000180, "Wrong size on UTCDebugWidget_C_Draw_Bounding_Box");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, Context) == 0x000000, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::Context' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, Location) == 0x000030, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::Location' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, Size) == 0x000040, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::Size' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_GetViewportScale_ReturnValue) == 0x000050, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_BreakVector2D_X) == 0x000058, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000068, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000088, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000098, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000A8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x0000B8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x0000C8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x0000D8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x0000E8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_ReturnValue_2) == 0x0000F8, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Subtract_Vector2DVector2D_ReturnValue_2) == 0x000108, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Subtract_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Subtract_Vector2DVector2D_ReturnValue_3) == 0x000118, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Subtract_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_ReturnValue_3) == 0x000128, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_ReturnValue_4) == 0x000138, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, K2Node_MakeArray_Array) == 0x000148, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_B_ImplicitCast) == 0x000158, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1) == 0x000160, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2) == 0x000168, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3) == 0x000170, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(UTCDebugWidget_C_Draw_Bounding_Box, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_4) == 0x000178, "Member 'UTCDebugWidget_C_Draw_Bounding_Box::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_4' has a wrong offset!");

}

