#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCJoystickComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UTCJoystickComponent.UTCJoystickComponent_C.UpdateWidgetSize
// 0x00B8 (0x00B8 - 0x0000)
struct UTCJoystickComponent_C_UpdateWidgetSize final
{
public:
	class UClass*                                 Widget_Class;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Widget_Size_0;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide_If_Unpossessed;                               // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Initialized;                                    // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Possessed_By_PC; // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Locally_Controlled; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIUTCWidget_C>         K2Node_DynamicCast_AsIUTCWidget;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIUTCWidget_C>         K2Node_DynamicCast_AsIUTCWidget_1;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIUTCWidget_C>         K2Node_DynamicCast_AsIUTCWidget_2;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Max_Size_Value;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue_1;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_UpdateWidgetSize) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_UpdateWidgetSize");
static_assert(sizeof(UTCJoystickComponent_C_UpdateWidgetSize) == 0x0000B8, "Wrong size on UTCJoystickComponent_C_UpdateWidgetSize");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, Widget_Class) == 0x000000, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::Widget_Class' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, Use_Widget_Size_0) == 0x000008, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::Use_Widget_Size_0' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, Hide_If_Unpossessed) == 0x000009, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::Hide_If_Unpossessed' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, Is_Initialized) == 0x00000A, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::Is_Initialized' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Possessed_By_PC) == 0x00000B, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Possessed_By_PC' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Locally_Controlled) == 0x00000C, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Get_Is_Pawn_Possessed_by_PC_Is_Locally_Controlled' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000F, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_AsIUTCWidget) == 0x000010, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_AsIUTCWidget' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_AsIUTCWidget_1) == 0x000028, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_AsIUTCWidget_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_AsIUTCWidget_2) == 0x000040, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_AsIUTCWidget_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Get_Max_Size_Value) == 0x000058, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Get_Max_Size_Value' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_BooleanAND_ReturnValue_1) == 0x000062, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_BooleanOR_ReturnValue) == 0x000063, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_GetViewportScale_ReturnValue) == 0x000064, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000068, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000080, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_GetViewportScale_ReturnValue_1) == 0x000088, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_GetViewportScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Divide_Vector2DFloat_B_ImplicitCast) == 0x0000A8, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Divide_Vector2DFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateWidgetSize, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0000B0, "Member 'UTCJoystickComponent_C_UpdateWidgetSize::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.UpdateDebugWidget
// 0x0028 (0x0028 - 0x0000)
struct UTCJoystickComponent_C_UpdateDebugWidget final
{
public:
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_UpdateDebugWidget) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_UpdateDebugWidget");
static_assert(sizeof(UTCJoystickComponent_C_UpdateDebugWidget) == 0x000028, "Wrong size on UTCJoystickComponent_C_UpdateDebugWidget");
static_assert(offsetof(UTCJoystickComponent_C_UpdateDebugWidget, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000000, "Member 'UTCJoystickComponent_C_UpdateDebugWidget::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateDebugWidget, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000010, "Member 'UTCJoystickComponent_C_UpdateDebugWidget::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_UpdateDebugWidget, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UTCJoystickComponent_C_UpdateDebugWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Temp Variables
// 0x0048 (0x0048 - 0x0000)
struct UTCJoystickComponent_C_Update_Temp_Variables final
{
public:
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_Update_Temp_Variables) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_Update_Temp_Variables");
static_assert(sizeof(UTCJoystickComponent_C_Update_Temp_Variables) == 0x000048, "Wrong size on UTCJoystickComponent_C_Update_Temp_Variables");
static_assert(offsetof(UTCJoystickComponent_C_Update_Temp_Variables, CallFunc_Dot_VectorVector_ReturnValue) == 0x000000, "Member 'UTCJoystickComponent_C_Update_Temp_Variables::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Temp_Variables, CallFunc_DegAcos_ReturnValue) == 0x000008, "Member 'UTCJoystickComponent_C_Update_Temp_Variables::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Temp_Variables, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000010, "Member 'UTCJoystickComponent_C_Update_Temp_Variables::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Temp_Variables, CallFunc_Normal_ReturnValue) == 0x000028, "Member 'UTCJoystickComponent_C_Update_Temp_Variables::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Temp_Variables, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'UTCJoystickComponent_C_Update_Temp_Variables::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Magnituge By Widget Size
// 0x0058 (0x0058 - 0x0000)
struct UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size final
{
public:
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIUTCWidget_C>         K2Node_DynamicCast_AsIUTCWidget;                   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Max_Size_Value;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size");
static_assert(sizeof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size) == 0x000058, "Wrong size on UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_GetViewportScale_ReturnValue) == 0x000000, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, K2Node_DynamicCast_AsIUTCWidget) == 0x000008, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::K2Node_DynamicCast_AsIUTCWidget' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_Get_Max_Size_Value) == 0x000020, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_Get_Max_Size_Value' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'UTCJoystickComponent_C_Update_Magnituge_By_Widget_Size::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Lock Axes
// 0x0110 (0x0110 - 0x0000)
struct UTCJoystickComponent_C_Update_Lock_Axes final
{
public:
	double                                        CallFunc_BreakVector_X;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_3;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_Update_Lock_Axes) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_Update_Lock_Axes");
static_assert(sizeof(UTCJoystickComponent_C_Update_Lock_Axes) == 0x000110, "Wrong size on UTCJoystickComponent_C_Update_Lock_Axes");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_X) == 0x000000, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Y) == 0x000008, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Z) == 0x000010, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_X_1) == 0x000020, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Z_1) == 0x000030, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000070, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_SelectVector_ReturnValue) == 0x000078, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000090, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000098, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_X_2) == 0x0000A0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Y_2) == 0x0000A8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Z_2) == 0x0000B0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x0000B8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_X_3) == 0x0000C0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Y_3) == 0x0000C8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_BreakVector_Z_3) == 0x0000D0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_FInterpTo_ReturnValue) == 0x0000D8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_FInterpTo_ReturnValue_1) == 0x0000E0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_SelectFloat_ReturnValue) == 0x0000E8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_SelectFloat_ReturnValue_1) == 0x0000F0, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Lock_Axes, CallFunc_MakeVector_ReturnValue_2) == 0x0000F8, "Member 'UTCJoystickComponent_C_Update_Lock_Axes::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Floating
// 0x01C8 (0x01C8 - 0x0000)
struct UTCJoystickComponent_C_Update_Floating final
{
public:
	struct FVector                                JoystickLocation;                                  // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PickerLocation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Old_Magnitude;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax;   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_1; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_2; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_3; // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Bounds_In_Bounds;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Bounds_W_out_Bounds;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Bounds_In_Bounds_by_X;              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Bounds_In_Bounds_by_Y;              // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_3;               // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_1;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_Update_Floating) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_Update_Floating");
static_assert(sizeof(UTCJoystickComponent_C_Update_Floating) == 0x0001C8, "Wrong size on UTCJoystickComponent_C_Update_Floating");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, JoystickLocation) == 0x000000, "Member 'UTCJoystickComponent_C_Update_Floating::JoystickLocation' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, PickerLocation) == 0x000018, "Member 'UTCJoystickComponent_C_Update_Floating::PickerLocation' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, Old_Magnitude) == 0x000030, "Member 'UTCJoystickComponent_C_Update_Floating::Old_Magnitude' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax) == 0x000038, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_1) == 0x000039, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_2) == 0x00003A, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_3) == 0x00003B, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_IsMagnitudeLowerThanMax_IsLowerThanMax_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00003D, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000080, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000098, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectVector_ReturnValue) == 0x0000B0, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_X) == 0x0000C8, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_Z) == 0x0000D8, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Check_Bounds_In_Bounds) == 0x0000E0, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Check_Bounds_In_Bounds' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Check_Bounds_W_out_Bounds) == 0x0000E1, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Check_Bounds_W_out_Bounds' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Check_Bounds_In_Bounds_by_X) == 0x0000E2, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Check_Bounds_In_Bounds_by_X' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Check_Bounds_In_Bounds_by_Y) == 0x0000E3, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Check_Bounds_In_Bounds_by_Y' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BooleanAND_ReturnValue) == 0x0000E4, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E5, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectVector_ReturnValue_1) == 0x0000E8, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BooleanAND_ReturnValue_2) == 0x000100, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Not_PreBool_ReturnValue_2) == 0x000101, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000108, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000110, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000118, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_VLerp_ReturnValue) == 0x000120, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_VLerp_ReturnValue_1) == 0x000138, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_X_1) == 0x000150, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_Y_1) == 0x000158, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_BreakVector_Z_1) == 0x000160, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectVector_ReturnValue_2) == 0x000168, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectFloat_ReturnValue_1) == 0x000180, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectFloat_ReturnValue_2) == 0x000188, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_SelectVector_ReturnValue_3) == 0x0001A8, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_SelectVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_VLerp_Alpha_ImplicitCast) == 0x0001C0, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Floating, CallFunc_VLerp_Alpha_ImplicitCast_1) == 0x0001C4, "Member 'UTCJoystickComponent_C_Update_Floating::CallFunc_VLerp_Alpha_ImplicitCast_1' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Fixed Location
// 0x0020 (0x0020 - 0x0000)
struct UTCJoystickComponent_C_Update_Fixed_Location final
{
public:
	bool                                          Is_Viewport_Size_Changed;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Screen_Size_By_Size_In_Percents_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCJoystickComponent_C_Update_Fixed_Location) == 0x000008, "Wrong alignment on UTCJoystickComponent_C_Update_Fixed_Location");
static_assert(sizeof(UTCJoystickComponent_C_Update_Fixed_Location) == 0x000020, "Wrong size on UTCJoystickComponent_C_Update_Fixed_Location");
static_assert(offsetof(UTCJoystickComponent_C_Update_Fixed_Location, Is_Viewport_Size_Changed) == 0x000000, "Member 'UTCJoystickComponent_C_Update_Fixed_Location::Is_Viewport_Size_Changed' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Fixed_Location, CallFunc_Get_Screen_Size_By_Size_In_Percents_ReturnValue) == 0x000008, "Member 'UTCJoystickComponent_C_Update_Fixed_Location::CallFunc_Get_Screen_Size_By_Size_In_Percents_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Fixed_Location, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'UTCJoystickComponent_C_Update_Fixed_Location::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCJoystickComponent_C_Update_Fixed_Location, CallFunc_BooleanAND_ReturnValue_1) == 0x000019, "Member 'UTCJoystickComponent_C_Update_Fixed_Location::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function UTCJoystickComponent.UTCJoystickComponent_C.Update Axis Vector
// 0x00E8 (0x00E8 - 0x0000)
struct UTCJoystickComponent_C_Update_Axis_Vector final
{
public:
	struct FVector2D                              Axis;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
