#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCPinchDebugWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UTCPinchDebugWidget.UTCPinchDebugWidget_C.OnPaint
// 0x01A0 (0x01A0 - 0x0000)
struct UTCPinchDebugWidget_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_3;      // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue_1;           // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_2;       // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue_2;           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_3;       // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchDebugWidget_C_OnPaint) == 0x000008, "Wrong alignment on UTCPinchDebugWidget_C_OnPaint");
static_assert(sizeof(UTCPinchDebugWidget_C_OnPaint) == 0x0001A0, "Wrong size on UTCPinchDebugWidget_C_OnPaint");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, Context) == 0x000000, "Member 'UTCPinchDebugWidget_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UTCPinchDebugWidget_C_OnPaint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_GetViewportScale_ReturnValue) == 0x000034, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000040, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000050, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000060, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000070, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000080, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000090, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0000D0, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x0000E0, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000F4, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Conv_VectorToVector2D_ReturnValue_3) == 0x000110, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Conv_VectorToVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Array_Length_ReturnValue_2) == 0x000120, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'UTCPinchDebugWidget_C_OnPaint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_GetViewportScale_ReturnValue_1) == 0x000128, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_GetViewportScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x000130, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_ReturnValue_2) == 0x000140, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Add_IntInt_ReturnValue) == 0x000154, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_GetViewportScale_ReturnValue_2) == 0x000158, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_GetViewportScale_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000160, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_ReturnValue_3) == 0x000168, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_B_ImplicitCast) == 0x000178, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1) == 0x000180, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2) == 0x000188, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000190, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCPinchDebugWidget_C_OnPaint, CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3) == 0x000198, "Member 'UTCPinchDebugWidget_C_OnPaint::CallFunc_Divide_Vector2DFloat_B_ImplicitCast_3' has a wrong offset!");

}

