#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCPinchDebugWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UTCDebugWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UTCPinchDebugWidget.UTCPinchDebugWidget_C
// 0x0030 (0x0340 - 0x0310)
class UUTCPinchDebugWidget_C final : public UUTCDebugWidget_C
{
public:
	TArray<struct FVector>                        Finger_Locations;                                  // 0x0310(0x0010)(Edit, BlueprintVisible)
	struct FVector                                Pan_Location;                                      // 0x0320(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UTCPinchDebugWidget_C">();
	}
	static class UUTCPinchDebugWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUTCPinchDebugWidget_C>();
	}
};
static_assert(alignof(UUTCPinchDebugWidget_C) == 0x000008, "Wrong alignment on UUTCPinchDebugWidget_C");
static_assert(sizeof(UUTCPinchDebugWidget_C) == 0x000340, "Wrong size on UUTCPinchDebugWidget_C");
static_assert(offsetof(UUTCPinchDebugWidget_C, Finger_Locations) == 0x000310, "Member 'UUTCPinchDebugWidget_C::Finger_Locations' has a wrong offset!");
static_assert(offsetof(UUTCPinchDebugWidget_C, Pan_Location) == 0x000320, "Member 'UUTCPinchDebugWidget_C::Pan_Location' has a wrong offset!");
static_assert(offsetof(UUTCPinchDebugWidget_C, Radius) == 0x000338, "Member 'UUTCPinchDebugWidget_C::Radius' has a wrong offset!");

}

