#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCPinchComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UTCPinchComponent.UTCPinchComponent_C.UpdateBanAreaSize
// 0x0060 (0x0060 - 0x0000)
struct UTCPinchComponent_C_UpdateBanAreaSize final
{
public:
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_UpdateBanAreaSize) == 0x000008, "Wrong alignment on UTCPinchComponent_C_UpdateBanAreaSize");
static_assert(sizeof(UTCPinchComponent_C_UpdateBanAreaSize) == 0x000060, "Wrong size on UTCPinchComponent_C_UpdateBanAreaSize");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000000, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_BreakVector2D_X) == 0x000008, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000048, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaSize, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'UTCPinchComponent_C_UpdateBanAreaSize::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.UpdateBanAreaInfo
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_UpdateBanAreaInfo final
{
public:
	bool                                          BanAreaEnable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BanAreaLocation;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_UpdateBanAreaInfo) == 0x000008, "Wrong alignment on UTCPinchComponent_C_UpdateBanAreaInfo");
static_assert(sizeof(UTCPinchComponent_C_UpdateBanAreaInfo) == 0x000020, "Wrong size on UTCPinchComponent_C_UpdateBanAreaInfo");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaInfo, BanAreaEnable) == 0x000000, "Member 'UTCPinchComponent_C_UpdateBanAreaInfo::BanAreaEnable' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_UpdateBanAreaInfo, BanAreaLocation) == 0x000008, "Member 'UTCPinchComponent_C_UpdateBanAreaInfo::BanAreaLocation' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Update Debug Widget
// 0x0002 (0x0002 - 0x0000)
struct UTCPinchComponent_C_Update_Debug_Widget final
{
public:
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Update_Debug_Widget) == 0x000001, "Wrong alignment on UTCPinchComponent_C_Update_Debug_Widget");
static_assert(sizeof(UTCPinchComponent_C_Update_Debug_Widget) == 0x000002, "Wrong size on UTCPinchComponent_C_Update_Debug_Widget");
static_assert(offsetof(UTCPinchComponent_C_Update_Debug_Widget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'UTCPinchComponent_C_Update_Debug_Widget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Update_Debug_Widget, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'UTCPinchComponent_C_Update_Debug_Widget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Uninitialize Debug Widget
// 0x0008 (0x0008 - 0x0000)
struct UTCPinchComponent_C_Uninitialize_Debug_Widget final
{
public:
	int32                                         CallFunc_Get_Fingers_Length_Length;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Uninitialize_Debug_Widget) == 0x000004, "Wrong alignment on UTCPinchComponent_C_Uninitialize_Debug_Widget");
static_assert(sizeof(UTCPinchComponent_C_Uninitialize_Debug_Widget) == 0x000008, "Wrong size on UTCPinchComponent_C_Uninitialize_Debug_Widget");
static_assert(offsetof(UTCPinchComponent_C_Uninitialize_Debug_Widget, CallFunc_Get_Fingers_Length_Length) == 0x000000, "Member 'UTCPinchComponent_C_Uninitialize_Debug_Widget::CallFunc_Get_Fingers_Length_Length' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Uninitialize_Debug_Widget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UTCPinchComponent_C_Uninitialize_Debug_Widget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Uninitialize_Debug_Widget, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'UTCPinchComponent_C_Uninitialize_Debug_Widget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UTCPinchComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on UTCPinchComponent_C_ReceiveTick");
static_assert(sizeof(UTCPinchComponent_C_ReceiveTick) == 0x000004, "Wrong size on UTCPinchComponent_C_ReceiveTick");
static_assert(offsetof(UTCPinchComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UTCPinchComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.OnJoystickReleased
// 0x0018 (0x0018 - 0x0000)
struct UTCPinchComponent_C_OnJoystickReleased final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_OnJoystickReleased) == 0x000008, "Wrong alignment on UTCPinchComponent_C_OnJoystickReleased");
static_assert(sizeof(UTCPinchComponent_C_OnJoystickReleased) == 0x000018, "Wrong size on UTCPinchComponent_C_OnJoystickReleased");
static_assert(offsetof(UTCPinchComponent_C_OnJoystickReleased, Location) == 0x000000, "Member 'UTCPinchComponent_C_OnJoystickReleased::Location' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.On Event Touch Released
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_On_Event_Touch_Released final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_On_Event_Touch_Released) == 0x000008, "Wrong alignment on UTCPinchComponent_C_On_Event_Touch_Released");
static_assert(sizeof(UTCPinchComponent_C_On_Event_Touch_Released) == 0x000020, "Wrong size on UTCPinchComponent_C_On_Event_Touch_Released");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Released, Location) == 0x000000, "Member 'UTCPinchComponent_C_On_Event_Touch_Released::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Released, FingerIndex) == 0x000018, "Member 'UTCPinchComponent_C_On_Event_Touch_Released::FingerIndex' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.On Event Touch Pressed
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_On_Event_Touch_Pressed final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_On_Event_Touch_Pressed) == 0x000008, "Wrong alignment on UTCPinchComponent_C_On_Event_Touch_Pressed");
static_assert(sizeof(UTCPinchComponent_C_On_Event_Touch_Pressed) == 0x000020, "Wrong size on UTCPinchComponent_C_On_Event_Touch_Pressed");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Pressed, Location) == 0x000000, "Member 'UTCPinchComponent_C_On_Event_Touch_Pressed::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Pressed, FingerIndex) == 0x000018, "Member 'UTCPinchComponent_C_On_Event_Touch_Pressed::FingerIndex' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.On Event Touch Moved
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_On_Event_Touch_Moved final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_On_Event_Touch_Moved) == 0x000008, "Wrong alignment on UTCPinchComponent_C_On_Event_Touch_Moved");
static_assert(sizeof(UTCPinchComponent_C_On_Event_Touch_Moved) == 0x000020, "Wrong size on UTCPinchComponent_C_On_Event_Touch_Moved");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Moved, Location) == 0x000000, "Member 'UTCPinchComponent_C_On_Event_Touch_Moved::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Moved, FingerIndex) == 0x000018, "Member 'UTCPinchComponent_C_On_Event_Touch_Moved::FingerIndex' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.On Event Touch Canceled
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_On_Event_Touch_Canceled final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_On_Event_Touch_Canceled) == 0x000008, "Wrong alignment on UTCPinchComponent_C_On_Event_Touch_Canceled");
static_assert(sizeof(UTCPinchComponent_C_On_Event_Touch_Canceled) == 0x000020, "Wrong size on UTCPinchComponent_C_On_Event_Touch_Canceled");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Canceled, Location) == 0x000000, "Member 'UTCPinchComponent_C_On_Event_Touch_Canceled::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_On_Event_Touch_Canceled, FingerIndex) == 0x000018, "Member 'UTCPinchComponent_C_On_Event_Touch_Canceled::FingerIndex' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Initialize Debug Widget
// 0x0010 (0x0010 - 0x0000)
struct UTCPinchComponent_C_Initialize_Debug_Widget final
{
public:
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUTCPinchDebugWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Initialize_Debug_Widget) == 0x000008, "Wrong alignment on UTCPinchComponent_C_Initialize_Debug_Widget");
static_assert(sizeof(UTCPinchComponent_C_Initialize_Debug_Widget) == 0x000010, "Wrong size on UTCPinchComponent_C_Initialize_Debug_Widget");
static_assert(offsetof(UTCPinchComponent_C_Initialize_Debug_Widget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000000, "Member 'UTCPinchComponent_C_Initialize_Debug_Widget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Initialize_Debug_Widget, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'UTCPinchComponent_C_Initialize_Debug_Widget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Initialize_Debug_Widget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UTCPinchComponent_C_Initialize_Debug_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Get Length and Angle
// 0x00E0 (0x00E0 - 0x0000)
struct UTCPinchComponent_C_Get_Length_and_Angle final
{
public:
	double                                        Length;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Halfway_Vector;                                    // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan2_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Get_Length_and_Angle) == 0x000008, "Wrong alignment on UTCPinchComponent_C_Get_Length_and_Angle");
static_assert(sizeof(UTCPinchComponent_C_Get_Length_and_Angle) == 0x0000E0, "Wrong size on UTCPinchComponent_C_Get_Length_and_Angle");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, Length) == 0x000000, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::Length' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, Angle) == 0x000008, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::Angle' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, Halfway_Vector) == 0x000010, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::Halfway_Vector' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Array_Get_Item) == 0x000028, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_VSize_ReturnValue) == 0x000070, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Dot_VectorVector_ReturnValue) == 0x000098, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A0, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Get_Length_and_Angle, CallFunc_DegAtan2_ReturnValue) == 0x0000D8, "Member 'UTCPinchComponent_C_Get_Length_and_Angle::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.ExecuteUbergraph_UTCPinchComponent
// 0x0198 (0x0198 - 0x0000)
struct UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Length_and_Angle_Length;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Length_and_Angle_Angle;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Length_and_Angle_Halfway_Vector;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Length_and_Angle_Length_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Length_and_Angle_Angle_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Length_and_Angle_Halfway_Vector_1;    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location_2;                           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   K2Node_Event_FingerIndex_2;                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location_1;                           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   K2Node_Event_FingerIndex_1;                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFingerLocationBan_FixedBan;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Fingers_Length_Length;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Fingers_Length_Length_1;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location_3;                           // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   K2Node_Event_FingerIndex_3;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   K2Node_Event_FingerIndex;                          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsEmpty_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue_1;                 // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& Location)> K2Node_CreateDelegate_OutputDelegate;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUTCJoystickComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_1;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast;       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent) == 0x000008, "Wrong alignment on UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent");
static_assert(sizeof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent) == 0x000198, "Wrong size on UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, EntryPoint) == 0x000000, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Length) == 0x000008, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Length' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Angle) == 0x000010, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Angle' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Halfway_Vector) == 0x000018, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Halfway_Vector' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Length_1) == 0x000030, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Length_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Angle_1) == 0x000038, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Angle_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Length_and_Angle_Halfway_Vector_1) == 0x000040, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Length_and_Angle_Halfway_Vector_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_Location_2) == 0x000078, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_Location_2' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_FingerIndex_2) == 0x000090, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_FingerIndex_2' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000098, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_Location_1) == 0x0000A0, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_FingerIndex_1) == 0x0000B8, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_FingerIndex_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_CheckFingerLocationBan_FixedBan) == 0x0000B9, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_CheckFingerLocationBan_FixedBan' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_DeltaSeconds) == 0x0000BC, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Fingers_Length_Length) == 0x0000C0, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Fingers_Length_Length' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0000C5, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Get_Fingers_Length_Length_1) == 0x0000C8, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Get_Fingers_Length_Length_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000CC, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0000CD, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x0000CE, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_BooleanAND_ReturnValue) == 0x0000CF, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_BooleanOR_ReturnValue) == 0x0000D0, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0000D1, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D2, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D3, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_Location_3) == 0x0000D8, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_Location_3' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_FingerIndex_3) == 0x0000F0, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_FingerIndex_3' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_Location) == 0x0000F8, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_Event_FingerIndex) == 0x000110, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_Event_FingerIndex' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_FInterpTo_ReturnValue) == 0x000118, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_FInterpTo_ReturnValue_1) == 0x000120, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_VInterpTo_ReturnValue) == 0x000128, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Set_IsEmpty_ReturnValue) == 0x000140, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Set_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Set_Remove_ReturnValue) == 0x000141, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_Set_Remove_ReturnValue_1) == 0x000142, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_Set_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_GetOwner_ReturnValue) == 0x000148, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000160, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, K2Node_CustomEvent_Location) == 0x000168, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000180, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_FInterpTo_DeltaTime_ImplicitCast_1) == 0x000188, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_FInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_VInterpTo_InterpSpeed_ImplicitCast) == 0x000190, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_VInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x000194, "Member 'UTCPinchComponent_C_ExecuteUbergraph_UTCPinchComponent::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.CheckFingerLocationBan
// 0x0098 (0x0098 - 0x0000)
struct UTCPinchComponent_C_CheckFingerLocationBan final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   FingerIndex;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FixedBan;                                          // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_CheckFingerLocationBan) == 0x000008, "Wrong alignment on UTCPinchComponent_C_CheckFingerLocationBan");
static_assert(sizeof(UTCPinchComponent_C_CheckFingerLocationBan) == 0x000098, "Wrong size on UTCPinchComponent_C_CheckFingerLocationBan");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, Location) == 0x000000, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, FingerIndex) == 0x000018, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::FingerIndex' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, FixedBan) == 0x000019, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::FixedBan' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_X) == 0x000020, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_Y) == 0x000028, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_Z) == 0x000030, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector2D_X) == 0x000038, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000049, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_X_1) == 0x000050, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_Y_1) == 0x000058, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BreakVector_Z_1) == 0x000060, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000080, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000090, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_CheckFingerLocationBan, CallFunc_BooleanAND_ReturnValue_2) == 0x000091, "Member 'UTCPinchComponent_C_CheckFingerLocationBan::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Check Debug Touch Location
// 0x0003 (0x0003 - 0x0000)
struct UTCPinchComponent_C_Check_Debug_Touch_Location final
{
public:
	bool                                          CallFunc_Is_Finger_Location_Exists_Result;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Check_Debug_Touch_Location) == 0x000001, "Wrong alignment on UTCPinchComponent_C_Check_Debug_Touch_Location");
static_assert(sizeof(UTCPinchComponent_C_Check_Debug_Touch_Location) == 0x000003, "Wrong size on UTCPinchComponent_C_Check_Debug_Touch_Location");
static_assert(offsetof(UTCPinchComponent_C_Check_Debug_Touch_Location, CallFunc_Is_Finger_Location_Exists_Result) == 0x000000, "Member 'UTCPinchComponent_C_Check_Debug_Touch_Location::CallFunc_Is_Finger_Location_Exists_Result' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Check_Debug_Touch_Location, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'UTCPinchComponent_C_Check_Debug_Touch_Location::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Check_Debug_Touch_Location, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'UTCPinchComponent_C_Check_Debug_Touch_Location::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UTCPinchComponent.UTCPinchComponent_C.Add Debug Touch Location
// 0x0020 (0x0020 - 0x0000)
struct UTCPinchComponent_C_Add_Debug_Touch_Location final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Finger_Location_Result;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTCPinchComponent_C_Add_Debug_Touch_Location) == 0x000008, "Wrong alignment on UTCPinchComponent_C_Add_Debug_Touch_Location");
static_assert(sizeof(UTCPinchComponent_C_Add_Debug_Touch_Location) == 0x000020, "Wrong size on UTCPinchComponent_C_Add_Debug_Touch_Location");
static_assert(offsetof(UTCPinchComponent_C_Add_Debug_Touch_Location, Location) == 0x000000, "Member 'UTCPinchComponent_C_Add_Debug_Touch_Location::Location' has a wrong offset!");
static_assert(offsetof(UTCPinchComponent_C_Add_Debug_Touch_Location, CallFunc_Add_Finger_Location_Result) == 0x000018, "Member 'UTCPinchComponent_C_Add_Debug_Touch_Location::CallFunc_Add_Finger_Location_Result' has a wrong offset!");

}

