#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCSwipeToMoveComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UTCComponent_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UTCSwipeToMoveComponent.UTCSwipeToMoveComponent_C
// 0x00E8 (0x02D8 - 0x01F0)
class UUTCSwipeToMoveComponent_C : public UUTCComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UTCSwipeToMoveComponent_C;          // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Previous_Location;                                 // 0x01F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                Current_Delta;                                     // 0x0210(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Delta;                                      // 0x0228(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double Value)>  On_Delta_X_Changed;                                // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double Value)>  On_Delta_Y_Changed;                                // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FVector& Location)> On_Pressed;                       // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FVector& Location)> On_Released;                      // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FVector& Value)> On_Delta_Location_Changed;           // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Speed;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUTCDebugWidget_C*                      Debug_Widget;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Interpolation;                              // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interpolation_Speed;                               // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& Location, ETouchIndex FingerIndex)> On_Canceled; // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Value;                                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SensitivityRate;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Recalculate_Delta(const struct FVector& Current_Location, struct FVector* Target_Delta_0, struct FVector* Current_Delta_0);
	void On_Released_Event(const struct FVector& Location);
	void On_Pressed_Event(const struct FVector& Location);
	void On_Event_Touch_Released(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Event_Touch_Pressed(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Event_Touch_Moved(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Event_Touch_Canceled(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Delta_Y_Changed_Event(double Value_0);
	void On_Delta_X_Changed_Event(double Value_0);
	void On_Delta_Location_Changed_Event(const struct FVector& Value_0);
	void On_Canceled_Event(const struct FVector& Location, ETouchIndex FingerIndex);
	void ModifyCameraInput(const struct FVector& RawDeltaLocation, struct FVector* ModifyedLocation);
	void ExecuteUbergraph_UTCSwipeToMoveComponent(int32 EntryPoint);
	void BindEvents();
	void AdjustLocation(const struct FVector& Pos, bool* res);
	void AddEventInput(class FName PropertyName, const struct FVector& Value_0, bool IsAccumulate);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UTCSwipeToMoveComponent_C">();
	}
	static class UUTCSwipeToMoveComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUTCSwipeToMoveComponent_C>();
	}
};
static_assert(alignof(UUTCSwipeToMoveComponent_C) == 0x000008, "Wrong alignment on UUTCSwipeToMoveComponent_C");
static_assert(sizeof(UUTCSwipeToMoveComponent_C) == 0x0002D8, "Wrong size on UUTCSwipeToMoveComponent_C");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, UberGraphFrame_UTCSwipeToMoveComponent_C) == 0x0001F0, "Member 'UUTCSwipeToMoveComponent_C::UberGraphFrame_UTCSwipeToMoveComponent_C' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Previous_Location) == 0x0001F8, "Member 'UUTCSwipeToMoveComponent_C::Previous_Location' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Current_Delta) == 0x000210, "Member 'UUTCSwipeToMoveComponent_C::Current_Delta' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Target_Delta) == 0x000228, "Member 'UUTCSwipeToMoveComponent_C::Target_Delta' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Delta_X_Changed) == 0x000240, "Member 'UUTCSwipeToMoveComponent_C::On_Delta_X_Changed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Delta_Y_Changed) == 0x000250, "Member 'UUTCSwipeToMoveComponent_C::On_Delta_Y_Changed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Pressed) == 0x000260, "Member 'UUTCSwipeToMoveComponent_C::On_Pressed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Released) == 0x000270, "Member 'UUTCSwipeToMoveComponent_C::On_Released' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Delta_Location_Changed) == 0x000280, "Member 'UUTCSwipeToMoveComponent_C::On_Delta_Location_Changed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Speed) == 0x000290, "Member 'UUTCSwipeToMoveComponent_C::Speed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Debug_Widget) == 0x000298, "Member 'UUTCSwipeToMoveComponent_C::Debug_Widget' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Enable_Interpolation) == 0x0002A0, "Member 'UUTCSwipeToMoveComponent_C::Enable_Interpolation' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Interpolation_Speed) == 0x0002A8, "Member 'UUTCSwipeToMoveComponent_C::Interpolation_Speed' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Enabled) == 0x0002B0, "Member 'UUTCSwipeToMoveComponent_C::Enabled' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, On_Canceled) == 0x0002B8, "Member 'UUTCSwipeToMoveComponent_C::On_Canceled' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, Value) == 0x0002C8, "Member 'UUTCSwipeToMoveComponent_C::Value' has a wrong offset!");
static_assert(offsetof(UUTCSwipeToMoveComponent_C, SensitivityRate) == 0x0002D0, "Member 'UUTCSwipeToMoveComponent_C::SensitivityRate' has a wrong offset!");

}

