#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTCTapComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UTCComponent_classes.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UTCTapComponent.UTCTapComponent_C
// 0x00C8 (0x02B8 - 0x01F0)
class UUTCTapComponent_C final : public UUTCComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UTCTapComponent_C;                  // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Released;                                          // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	ETouchIndex                                   CurrentFingerIndex;                                // 0x01F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& Location, ETouchIndex FingerIndex)> On_Tap;  // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDateTime                              One_Finger_Tap_Time;                               // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FVector& Location, ETouchIndex FingerIndex, double Interval__ms_)> On_Double_Tap; // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Double_Tap_Interval__ms_;                          // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Two_Fingers_Tap;                                   // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Two_Fingers_Tap_Interval__ms_;                     // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FDateTime                              Two_Fingers_Tap_Time;                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FVector& Location__Tap_1, ETouchIndex FingerIndex__Tap_1, const struct FVector& Location__Tap_2, ETouchIndex FingerIndex__Tap_2)> On_Two_Fingers_Tap; // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FVector& Location__Tap_1, ETouchIndex FingerIndex__Tap_1, const struct FVector& Location__Tap_2, ETouchIndex FingerIndex__Tap_2, double Interval__ms_)> On_Two_Fingers_Double_Tap; // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class FText Reason, double Interval__ms_)> On_Two_Fingers_Tap_Failed; // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDateTime                              Last_Tap_Time;                                     // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FVector& Location, ETouchIndex FingerIndex)> On_Tap_Move; // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FVector& Location, ETouchIndex FingerIndex)> On_Tap_Release; // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                LastTapLocation;                                   // 0x02A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnDoubleTap_Event(const struct FVector& Location, ETouchIndex FingerIndex, double Interval__ms_);
	void On_Event_Touch_Released(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Event_Touch_Pressed(const struct FVector& Location, ETouchIndex FingerIndex);
	void On_Event_Touch_Moved(const struct FVector& Location, ETouchIndex FingerIndex);
	void ExecuteUbergraph_UTCTapComponent(int32 EntryPoint);
	int32 ChooseSmallViewportAxis();
	void BindEvents();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UTCTapComponent_C">();
	}
	static class UUTCTapComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUTCTapComponent_C>();
	}
};
static_assert(alignof(UUTCTapComponent_C) == 0x000008, "Wrong alignment on UUTCTapComponent_C");
static_assert(sizeof(UUTCTapComponent_C) == 0x0002B8, "Wrong size on UUTCTapComponent_C");
static_assert(offsetof(UUTCTapComponent_C, UberGraphFrame_UTCTapComponent_C) == 0x0001F0, "Member 'UUTCTapComponent_C::UberGraphFrame_UTCTapComponent_C' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Released) == 0x0001F8, "Member 'UUTCTapComponent_C::Released' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, CurrentFingerIndex) == 0x0001F9, "Member 'UUTCTapComponent_C::CurrentFingerIndex' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Tap) == 0x000200, "Member 'UUTCTapComponent_C::On_Tap' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, One_Finger_Tap_Time) == 0x000210, "Member 'UUTCTapComponent_C::One_Finger_Tap_Time' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Double_Tap) == 0x000218, "Member 'UUTCTapComponent_C::On_Double_Tap' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Double_Tap_Interval__ms_) == 0x000228, "Member 'UUTCTapComponent_C::Double_Tap_Interval__ms_' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Two_Fingers_Tap) == 0x000230, "Member 'UUTCTapComponent_C::Two_Fingers_Tap' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Two_Fingers_Tap_Interval__ms_) == 0x000238, "Member 'UUTCTapComponent_C::Two_Fingers_Tap_Interval__ms_' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Two_Fingers_Tap_Time) == 0x000240, "Member 'UUTCTapComponent_C::Two_Fingers_Tap_Time' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Two_Fingers_Tap) == 0x000248, "Member 'UUTCTapComponent_C::On_Two_Fingers_Tap' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Two_Fingers_Double_Tap) == 0x000258, "Member 'UUTCTapComponent_C::On_Two_Fingers_Double_Tap' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Two_Fingers_Tap_Failed) == 0x000268, "Member 'UUTCTapComponent_C::On_Two_Fingers_Tap_Failed' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, Last_Tap_Time) == 0x000278, "Member 'UUTCTapComponent_C::Last_Tap_Time' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Tap_Move) == 0x000280, "Member 'UUTCTapComponent_C::On_Tap_Move' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, On_Tap_Release) == 0x000290, "Member 'UUTCTapComponent_C::On_Tap_Release' has a wrong offset!");
static_assert(offsetof(UUTCTapComponent_C, LastTapLocation) == 0x0002A0, "Member 'UUTCTapComponent_C::LastTapLocation' has a wrong offset!");

}

