#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_RedPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ERedPointID_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_RedPoint.WBP_UI_RedPoint_C
// 0x0098 (0x0388 - 0x02F0)
class UWBP_UI_RedPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop_HeartSpecial;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_HeartSpecial;                               // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DotImage;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExclamaImage;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HeartSpecial;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_75;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GIFT;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeartSpecial;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeartSpecial_1;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_New;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             numberText_1;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        showSwitch;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ERedPointID                                   RedPointID;                                        // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         UId;                                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RedPointStrID;                                     // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RedPoint_Swither_Index;                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_RedPoint(int32 EntryPoint);
	void GetRedPointID();
	void NewFunction_0();
	void PreConstruct(bool IsDesignTime);
	void SetUniqueId(int32 UId_0);
	void UpdateState();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_RedPoint_C">();
	}
	static class UWBP_UI_RedPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_RedPoint_C>();
	}
};
static_assert(alignof(UWBP_UI_RedPoint_C) == 0x000008, "Wrong alignment on UWBP_UI_RedPoint_C");
static_assert(sizeof(UWBP_UI_RedPoint_C) == 0x000388, "Wrong size on UWBP_UI_RedPoint_C");
static_assert(offsetof(UWBP_UI_RedPoint_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_RedPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Loop_HeartSpecial) == 0x0002F8, "Member 'UWBP_UI_RedPoint_C::Loop_HeartSpecial' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, FadeIn_HeartSpecial) == 0x000300, "Member 'UWBP_UI_RedPoint_C::FadeIn_HeartSpecial' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, DotImage) == 0x000308, "Member 'UWBP_UI_RedPoint_C::DotImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, ExclamaImage) == 0x000310, "Member 'UWBP_UI_RedPoint_C::ExclamaImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, HeartSpecial) == 0x000318, "Member 'UWBP_UI_RedPoint_C::HeartSpecial' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Image_75) == 0x000320, "Member 'UWBP_UI_RedPoint_C::Image_75' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Image_GIFT) == 0x000328, "Member 'UWBP_UI_RedPoint_C::Image_GIFT' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Image_HeartSpecial) == 0x000330, "Member 'UWBP_UI_RedPoint_C::Image_HeartSpecial' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Image_HeartSpecial_1) == 0x000338, "Member 'UWBP_UI_RedPoint_C::Image_HeartSpecial_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Image_New) == 0x000340, "Member 'UWBP_UI_RedPoint_C::Image_New' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, numberText_1) == 0x000348, "Member 'UWBP_UI_RedPoint_C::numberText_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, showSwitch) == 0x000350, "Member 'UWBP_UI_RedPoint_C::showSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, RedPointID) == 0x000358, "Member 'UWBP_UI_RedPoint_C::RedPointID' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, UId) == 0x000360, "Member 'UWBP_UI_RedPoint_C::UId' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, Number) == 0x000368, "Member 'UWBP_UI_RedPoint_C::Number' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, RedPointStrID) == 0x000370, "Member 'UWBP_UI_RedPoint_C::RedPointStrID' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RedPoint_C, RedPoint_Swither_Index) == 0x000380, "Member 'UWBP_UI_RedPoint_C::RedPoint_Swither_Index' has a wrong offset!");

}

