#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Player_MiniMarker

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Player_MiniMarker.WBP_Player_MiniMarker_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_Player_MiniMarker_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Following;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ICON_NonePlayer;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ICON_Player;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_View;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           VisibilityRange;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Player_MiniMarker_C">();
	}
	static class UWBP_Player_MiniMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Player_MiniMarker_C>();
	}
};
static_assert(alignof(UWBP_Player_MiniMarker_C) == 0x000008, "Wrong alignment on UWBP_Player_MiniMarker_C");
static_assert(sizeof(UWBP_Player_MiniMarker_C) == 0x000320, "Wrong size on UWBP_Player_MiniMarker_C");
static_assert(offsetof(UWBP_Player_MiniMarker_C, FadeIn) == 0x0002F0, "Member 'UWBP_Player_MiniMarker_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Player_MiniMarker_C, Anim_Following) == 0x0002F8, "Member 'UWBP_Player_MiniMarker_C::Anim_Following' has a wrong offset!");
static_assert(offsetof(UWBP_Player_MiniMarker_C, ICON_NonePlayer) == 0x000300, "Member 'UWBP_Player_MiniMarker_C::ICON_NonePlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Player_MiniMarker_C, ICON_Player) == 0x000308, "Member 'UWBP_Player_MiniMarker_C::ICON_Player' has a wrong offset!");
static_assert(offsetof(UWBP_Player_MiniMarker_C, Image_View) == 0x000310, "Member 'UWBP_Player_MiniMarker_C::Image_View' has a wrong offset!");
static_assert(offsetof(UWBP_Player_MiniMarker_C, VisibilityRange) == 0x000318, "Member 'UWBP_Player_MiniMarker_C::VisibilityRange' has a wrong offset!");

}

