#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Collection_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Collection_List.WBP_HUD_Collection_List_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_HUD_Collection_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       XianTuan_FadeIn_02;                                // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       XianTuan_FadeIn_01;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       XianTuan_FadeOut;                                  // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IN_Animation;                                      // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_Animation;                                     // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_119;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Collection_item_C*          Collection_item_01;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Collection_item_C*          Collection_item_02;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_93;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_MoneyListItem_C*            GoldMoney;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Collection_Energy_C*           WBP_HUD_Collection_Energy;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_Collection_List_Button_119_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Collection_item_01_Event_0(class UWBP_UI_HUD_Collection_item_C* Collection_item_01_0);
	void Collection_item_01_Event_1(class UWBP_UI_HUD_Collection_item_C* Collection_item_01_0);
	void ExecuteUbergraph_WBP_HUD_Collection_List(int32 EntryPoint);
	void FadeInMoonCoin();
	void FadeInOtherCoin();
	void OnFadeIn();
	void OnFadeOut();
	void OnInDone();
	void OnOutDone();
	void PlayOutAnim();
	void SequenceEvent__ENTRYPOINTWBP_HUD_Collection_List(class UWBP_UI_HUD_Collection_item_C* Collection_item_01_0);
	void SequenceEvent__ENTRYPOINTWBP_HUD_Collection_List_0(class UWBP_UI_HUD_Collection_item_C* Collection_item_01_0);
	void TestID(int32 ID);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Collection_List_C">();
	}
	static class UWBP_HUD_Collection_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Collection_List_C>();
	}
};
static_assert(alignof(UWBP_HUD_Collection_List_C) == 0x000008, "Wrong alignment on UWBP_HUD_Collection_List_C");
static_assert(sizeof(UWBP_HUD_Collection_List_C) == 0x000350, "Wrong size on UWBP_HUD_Collection_List_C");
static_assert(offsetof(UWBP_HUD_Collection_List_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_Collection_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, XianTuan_FadeIn_02) == 0x0002F8, "Member 'UWBP_HUD_Collection_List_C::XianTuan_FadeIn_02' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, XianTuan_FadeIn_01) == 0x000300, "Member 'UWBP_HUD_Collection_List_C::XianTuan_FadeIn_01' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, XianTuan_FadeOut) == 0x000308, "Member 'UWBP_HUD_Collection_List_C::XianTuan_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, IN_Animation) == 0x000310, "Member 'UWBP_HUD_Collection_List_C::IN_Animation' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, Out_Animation) == 0x000318, "Member 'UWBP_HUD_Collection_List_C::Out_Animation' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, Button_119) == 0x000320, "Member 'UWBP_HUD_Collection_List_C::Button_119' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, Collection_item_01) == 0x000328, "Member 'UWBP_HUD_Collection_List_C::Collection_item_01' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, Collection_item_02) == 0x000330, "Member 'UWBP_HUD_Collection_List_C::Collection_item_02' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, EditableTextBox_93) == 0x000338, "Member 'UWBP_HUD_Collection_List_C::EditableTextBox_93' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, GoldMoney) == 0x000340, "Member 'UWBP_HUD_Collection_List_C::GoldMoney' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_List_C, WBP_HUD_Collection_Energy) == 0x000348, "Member 'UWBP_HUD_Collection_List_C::WBP_HUD_Collection_Energy' has a wrong offset!");

}

