#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SceneMarkerPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SceneMarkerPanel.WBP_SceneMarkerPanel_C.ConvertScreenPosToWidgetPos
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos final
{
public:
	struct FVector2D                              screenPos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              widgetPos;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPlayerScreenWidgetGeometry_ReturnValue; // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_Vector2DFloat_B_ImplicitCast;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos) == 0x000008, "Wrong alignment on WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos");
static_assert(sizeof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos) == 0x0000D8, "Wrong size on WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, screenPos) == 0x000000, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::screenPos' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, widgetPos) == 0x000010, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::widgetPos' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_GetCachedGeometry_ReturnValue) == 0x000020, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_GetViewportScale_ReturnValue) == 0x000058, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_GetPlayerScreenWidgetGeometry_ReturnValue) == 0x000068, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_GetPlayerScreenWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_LocalToAbsolute_ReturnValue) == 0x0000A0, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_AbsoluteToLocal_ReturnValue) == 0x0000B0, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0000C0, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos, CallFunc_Divide_Vector2DFloat_B_ImplicitCast) == 0x0000D0, "Member 'WBP_SceneMarkerPanel_C_ConvertScreenPosToWidgetPos::CallFunc_Divide_Vector2DFloat_B_ImplicitCast' has a wrong offset!");

// Function WBP_SceneMarkerPanel.WBP_SceneMarkerPanel_C.CreateSceneMarkerCell
// 0x0010 (0x0010 - 0x0000)
struct WBP_SceneMarkerPanel_C_CreateSceneMarkerCell final
{
public:
	class UWBP_UI_SceneMarkerCell_C*              Cell;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_SceneMarkerCell_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SceneMarkerPanel_C_CreateSceneMarkerCell) == 0x000008, "Wrong alignment on WBP_SceneMarkerPanel_C_CreateSceneMarkerCell");
static_assert(sizeof(WBP_SceneMarkerPanel_C_CreateSceneMarkerCell) == 0x000010, "Wrong size on WBP_SceneMarkerPanel_C_CreateSceneMarkerCell");
static_assert(offsetof(WBP_SceneMarkerPanel_C_CreateSceneMarkerCell, Cell) == 0x000000, "Member 'WBP_SceneMarkerPanel_C_CreateSceneMarkerCell::Cell' has a wrong offset!");
static_assert(offsetof(WBP_SceneMarkerPanel_C_CreateSceneMarkerCell, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_SceneMarkerPanel_C_CreateSceneMarkerCell::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_SceneMarkerPanel.WBP_SceneMarkerPanel_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_SceneMarkerPanel_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SceneMarkerPanel_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_SceneMarkerPanel_C_GetModuleName");
static_assert(sizeof(WBP_SceneMarkerPanel_C_GetModuleName) == 0x000010, "Wrong size on WBP_SceneMarkerPanel_C_GetModuleName");
static_assert(offsetof(WBP_SceneMarkerPanel_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_SceneMarkerPanel_C_GetModuleName::ReturnValue' has a wrong offset!");

}

