#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Action_Rattle

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Action_Rattle.WBP_Hud_Action_Rattle_C
// 0x0128 (0x0418 - 0x02F0)
class UWBP_Hud_Action_Rattle_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Ani_Progress_FadeOut;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Long_Press_Progress;                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Long_Special;                                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Short_Special;                                 // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_icon_Special;                                  // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Special_on;                                    // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Long;                                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Short;                                         // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Press;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Glow;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 fx_glow_progress;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Long;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Long_Special;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Fx_Progress_play;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Ring;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Short;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Icon_Special;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_bell;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_bell_2;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_ring_l_1;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_ring_l_2;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_ring_r_1;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_icon_ring_r_2;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_short;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Progress_play;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           rings_inner;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           rings_outer;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PointerIndex;                                      // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LongPressRattle;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnergyLongPressRattle;                             // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShortPressAnimTime;                                // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LongPressAnimTime;                                 // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TakePhotoFastCD;                                   // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Lua_OnBtnReleased();
	void Lua_OnBtnPressed();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Action_Rattle_C">();
	}
	static class UWBP_Hud_Action_Rattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Action_Rattle_C>();
	}
};
static_assert(alignof(UWBP_Hud_Action_Rattle_C) == 0x000008, "Wrong alignment on UWBP_Hud_Action_Rattle_C");
static_assert(sizeof(UWBP_Hud_Action_Rattle_C) == 0x000418, "Wrong size on UWBP_Hud_Action_Rattle_C");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Progress_FadeOut) == 0x0002F0, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Progress_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Long_Press_Progress) == 0x0002F8, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Long_Press_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Long_Special) == 0x000300, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Long_Special' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Short_Special) == 0x000308, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Short_Special' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_icon_Special) == 0x000310, "Member 'UWBP_Hud_Action_Rattle_C::Ani_icon_Special' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Special_on) == 0x000318, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Special_on' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Long) == 0x000320, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Long' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Ani_Short) == 0x000328, "Member 'UWBP_Hud_Action_Rattle_C::Ani_Short' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, FadeOut) == 0x000330, "Member 'UWBP_Hud_Action_Rattle_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, FadeIn) == 0x000338, "Member 'UWBP_Hud_Action_Rattle_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Button_Press) == 0x000340, "Member 'UWBP_Hud_Action_Rattle_C::Button_Press' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Glow) == 0x000348, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, fx_glow_progress) == 0x000350, "Member 'UWBP_Hud_Action_Rattle_C::fx_glow_progress' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Long) == 0x000358, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Long' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Long_Special) == 0x000360, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Long_Special' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Progress_play) == 0x000368, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Ring) == 0x000370, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Ring' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Fx_Short) == 0x000378, "Member 'UWBP_Hud_Action_Rattle_C::Fx_Short' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Icon_Special) == 0x000380, "Member 'UWBP_Hud_Action_Rattle_C::Icon_Special' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_bg) == 0x000388, "Member 'UWBP_Hud_Action_Rattle_C::Image_bg' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_Icon) == 0x000390, "Member 'UWBP_Hud_Action_Rattle_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_bell) == 0x000398, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_bell' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_bell_2) == 0x0003A0, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_bell_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_ring_l_1) == 0x0003A8, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_ring_l_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_ring_l_2) == 0x0003B0, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_ring_l_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_ring_r_1) == 0x0003B8, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_ring_r_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_icon_ring_r_2) == 0x0003C0, "Member 'UWBP_Hud_Action_Rattle_C::Image_icon_ring_r_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Image_short) == 0x0003C8, "Member 'UWBP_Hud_Action_Rattle_C::Image_short' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, Progress_play) == 0x0003D0, "Member 'UWBP_Hud_Action_Rattle_C::Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, rings_inner) == 0x0003D8, "Member 'UWBP_Hud_Action_Rattle_C::rings_inner' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, rings_outer) == 0x0003E0, "Member 'UWBP_Hud_Action_Rattle_C::rings_outer' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, PointerIndex) == 0x0003E8, "Member 'UWBP_Hud_Action_Rattle_C::PointerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, LongPressRattle) == 0x0003F0, "Member 'UWBP_Hud_Action_Rattle_C::LongPressRattle' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, EnergyLongPressRattle) == 0x0003F8, "Member 'UWBP_Hud_Action_Rattle_C::EnergyLongPressRattle' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, ShortPressAnimTime) == 0x000400, "Member 'UWBP_Hud_Action_Rattle_C::ShortPressAnimTime' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, LongPressAnimTime) == 0x000408, "Member 'UWBP_Hud_Action_Rattle_C::LongPressAnimTime' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Rattle_C, TakePhotoFastCD) == 0x000410, "Member 'UWBP_Hud_Action_Rattle_C::TakePhotoFastCD' has a wrong offset!");

}

