#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_headUI_name

#include "Basic.hpp"

#include "EHeadUIState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_headUI_name.WBP_UI_headUI_name_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_UI_headUI_name_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_27;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Name;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHeadUIState                                  CurrentShowState;                                  // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeadUIState                                  NextShowState;                                     // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetHeight(double* NewParam);
	void ExecuteUbergraph_WBP_UI_headUI_name(int32 EntryPoint);
	void RefreshAnimState();
	void SwitchVisibility(ESlateVisibility EVisibility);
	void WidgetAnimationEvt_FadeIn_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_headUI_name_C">();
	}
	static class UWBP_UI_headUI_name_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_headUI_name_C>();
	}
};
static_assert(alignof(UWBP_UI_headUI_name_C) == 0x000008, "Wrong alignment on UWBP_UI_headUI_name_C");
static_assert(sizeof(UWBP_UI_headUI_name_C) == 0x000320, "Wrong size on UWBP_UI_headUI_name_C");
static_assert(offsetof(UWBP_UI_headUI_name_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_headUI_name_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, FadeOut) == 0x0002F8, "Member 'UWBP_UI_headUI_name_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, FadeIn) == 0x000300, "Member 'UWBP_UI_headUI_name_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, SizeBox_27) == 0x000308, "Member 'UWBP_UI_headUI_name_C::SizeBox_27' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, Txt_Name) == 0x000310, "Member 'UWBP_UI_headUI_name_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, CurrentShowState) == 0x000318, "Member 'UWBP_UI_headUI_name_C::CurrentShowState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_name_C, NextShowState) == 0x000319, "Member 'UWBP_UI_headUI_name_C::NextShowState' has a wrong offset!");

}

