#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Challenge_Aim_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Challenge_Aim_Item.WBP_Challenge_Aim_Item_C.ExecuteUbergraph_WBP_Challenge_Aim_Item
// 0x0008 (0x0008 - 0x0000)
struct WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item) == 0x000004, "Wrong alignment on WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item");
static_assert(sizeof(WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item) == 0x000008, "Wrong size on WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item");
static_assert(offsetof(WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item, EntryPoint) == 0x000000, "Member 'WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Challenge_Aim_Item_C_ExecuteUbergraph_WBP_Challenge_Aim_Item::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Challenge_Aim_Item.WBP_Challenge_Aim_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Challenge_Aim_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Challenge_Aim_Item_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Challenge_Aim_Item_C_PreConstruct");
static_assert(sizeof(WBP_Challenge_Aim_Item_C_PreConstruct) == 0x000001, "Wrong size on WBP_Challenge_Aim_Item_C_PreConstruct");
static_assert(offsetof(WBP_Challenge_Aim_Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Challenge_Aim_Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Challenge_Aim_Item.WBP_Challenge_Aim_Item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Challenge_Aim_Item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Challenge_Aim_Item_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Challenge_Aim_Item_C_GetModuleName");
static_assert(sizeof(WBP_Challenge_Aim_Item_C_GetModuleName) == 0x000010, "Wrong size on WBP_Challenge_Aim_Item_C_GetModuleName");
static_assert(offsetof(WBP_Challenge_Aim_Item_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Challenge_Aim_Item_C_GetModuleName::ReturnValue' has a wrong offset!");

}

