#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugNwczionEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.ExecuteUbergraph_WBP_DebugNwczionEntry
// 0x0014 (0x0014 - 0x0000)
struct WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_index_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry) == 0x000004, "Wrong alignment on WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry");
static_assert(sizeof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry) == 0x000014, "Wrong size on WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry");
static_assert(offsetof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry, EntryPoint) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry, K2Node_Event_index_1) == 0x000008, "Member 'WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry, K2Node_Event_index) == 0x00000C, "Member 'WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry, K2Node_Event_bIsSelected) == 0x000010, "Member 'WBP_DebugNwczionEntry_C_ExecuteUbergraph_WBP_DebugNwczionEntry::K2Node_Event_bIsSelected' has a wrong offset!");

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.OnListItemObjectSetViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong alignment on WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex");
static_assert(sizeof(WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong size on WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex");
static_assert(offsetof(WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex, Index_0) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_OnListItemObjectSetViaIndex::Index_0' has a wrong offset!");

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.OnListItemValueChangedViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong alignment on WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex");
static_assert(sizeof(WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong size on WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex");
static_assert(offsetof(WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex, Index_0) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_OnListItemValueChangedViaIndex::Index_0' has a wrong offset!");

// Function WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_DebugNwczionEntry_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugNwczionEntry_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_DebugNwczionEntry_C_GetModuleName");
static_assert(sizeof(WBP_DebugNwczionEntry_C_GetModuleName) == 0x000010, "Wrong size on WBP_DebugNwczionEntry_C_GetModuleName");
static_assert(offsetof(WBP_DebugNwczionEntry_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_DebugNwczionEntry_C_GetModuleName::ReturnValue' has a wrong offset!");

}

