#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SceneMarkerCell_SocialTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SceneMarkerCell_SocialTask.WBP_UI_SceneMarkerCell_SocialTask_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_UI_SceneMarkerCell_SocialTask_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Distance;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Down;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_107;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bg;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_48;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SmallArrow;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Marker;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Up;                                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_SocialTaskMarkerIcon_C*         WBP_UI_SocialTaskMarkerIcon;                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UI_SceneMarkerCell_SocialTask(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SceneMarkerCell_SocialTask_C">();
	}
	static class UWBP_UI_SceneMarkerCell_SocialTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SceneMarkerCell_SocialTask_C>();
	}
};
static_assert(alignof(UWBP_UI_SceneMarkerCell_SocialTask_C) == 0x000008, "Wrong alignment on UWBP_UI_SceneMarkerCell_SocialTask_C");
static_assert(sizeof(UWBP_UI_SceneMarkerCell_SocialTask_C) == 0x000350, "Wrong size on UWBP_UI_SceneMarkerCell_SocialTask_C");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Distance) == 0x0002F8, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Distance' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Down) == 0x000300, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Down' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Image_107) == 0x000308, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Image_107' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Img_Arrow) == 0x000310, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Img_Bg) == 0x000318, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Normal) == 0x000320, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Normal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, SizeBox_48) == 0x000328, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::SizeBox_48' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, SmallArrow) == 0x000330, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::SmallArrow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, UI_NS_Marker) == 0x000338, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::UI_NS_Marker' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, Up) == 0x000340, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::Up' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SceneMarkerCell_SocialTask_C, WBP_UI_SocialTaskMarkerIcon) == 0x000348, "Member 'UWBP_UI_SceneMarkerCell_SocialTask_C::WBP_UI_SocialTaskMarkerIcon' has a wrong offset!");

}

