#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Login_BG

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_Login_BG.WBP_Login_BG_C.SetBKVolume
// 0x0010 (0x0010 - 0x0000)
struct WBP_Login_BG_C_SetBKVolume final
{
public:
	double                                        Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolume_Rate_ImplicitCast;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_BG_C_SetBKVolume) == 0x000008, "Wrong alignment on WBP_Login_BG_C_SetBKVolume");
static_assert(sizeof(WBP_Login_BG_C_SetBKVolume) == 0x000010, "Wrong size on WBP_Login_BG_C_SetBKVolume");
static_assert(offsetof(WBP_Login_BG_C_SetBKVolume, Volume) == 0x000000, "Member 'WBP_Login_BG_C_SetBKVolume::Volume' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_SetBKVolume, CallFunc_SetVolume_Rate_ImplicitCast) == 0x000008, "Member 'WBP_Login_BG_C_SetBKVolume::CallFunc_SetVolume_Rate_ImplicitCast' has a wrong offset!");

// Function WBP_Login_BG.WBP_Login_BG_C.PlayBG
// 0x0050 (0x0050 - 0x0000)
struct WBP_Login_BG_C_PlayBG final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_X6PostEvent2D_PlayingID;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_X6PostEvent2D_PlayingID_1;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue_1;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_BG_C_PlayBG) == 0x000008, "Wrong alignment on WBP_Login_BG_C_PlayBG");
static_assert(sizeof(WBP_Login_BG_C_PlayBG) == 0x000050, "Wrong size on WBP_Login_BG_C_PlayBG");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, Temp_struct_Variable) == 0x000000, "Member 'WBP_Login_BG_C_PlayBG::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, Temp_delegate_Variable) == 0x000010, "Member 'WBP_Login_BG_C_PlayBG::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, Temp_struct_Variable_1) == 0x000020, "Member 'WBP_Login_BG_C_PlayBG::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, Temp_delegate_Variable_1) == 0x000030, "Member 'WBP_Login_BG_C_PlayBG::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_X6PostEvent2D_PlayingID) == 0x000040, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_X6PostEvent2D_PlayingID' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_Play_ReturnValue) == 0x000044, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_Not_PreBool_ReturnValue) == 0x000045, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_OpenUrl_ReturnValue) == 0x000046, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_X6PostEvent2D_PlayingID_1) == 0x000048, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_X6PostEvent2D_PlayingID_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_Play_ReturnValue_1) == 0x00004C, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_PlayBG, CallFunc_OpenUrl_ReturnValue_1) == 0x00004D, "Member 'WBP_Login_BG_C_PlayBG::CallFunc_OpenUrl_ReturnValue_1' has a wrong offset!");

// Function WBP_Login_BG.WBP_Login_BG_C.FindEventMovie
// 0x0130 (0x0130 - 0x0000)
struct WBP_Login_BG_C_FindEventMovie final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ProjectSavedDir_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_FindFiles_FoundFiles;                     // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindFiles_ReturnValue;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_BG_C_FindEventMovie) == 0x000008, "Wrong alignment on WBP_Login_BG_C_FindEventMovie");
static_assert(sizeof(WBP_Login_BG_C_FindEventMovie) == 0x000130, "Wrong size on WBP_Login_BG_C_FindEventMovie");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Login_BG_C_FindEventMovie::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Login_BG_C_FindEventMovie::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_ProjectSavedDir_ReturnValue) == 0x000010, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_ProjectSavedDir_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Len_ReturnValue) == 0x000020, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000058, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000090, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000A0, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Right_ReturnValue) == 0x0000B0, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000C0, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_FindFiles_FoundFiles) == 0x0000D0, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_FindFiles_FoundFiles' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_FindFiles_ReturnValue) == 0x0000E0, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_FindFiles_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_GetBaseFilename_ReturnValue) == 0x000100, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Replace_ReturnValue) == 0x000110, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Contains_ReturnValue) == 0x000120, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Conv_StringToInt_ReturnValue) == 0x000124, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000128, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Login_BG_C_FindEventMovie, CallFunc_Max_ReturnValue) == 0x00012C, "Member 'WBP_Login_BG_C_FindEventMovie::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function WBP_Login_BG.WBP_Login_BG_C.ExecuteUbergraph_WBP_Login_BG
// 0x0004 (0x0004 - 0x0000)
struct WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG) == 0x000004, "Wrong alignment on WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG");
static_assert(sizeof(WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG) == 0x000004, "Wrong size on WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG");
static_assert(offsetof(WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG, EntryPoint) == 0x000000, "Member 'WBP_Login_BG_C_ExecuteUbergraph_WBP_Login_BG::EntryPoint' has a wrong offset!");

}

