#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_MoneyListItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.AddGoldWithEffect
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect final
{
public:
	int32                                         gold;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect) == 0x000008, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect) == 0x000030, "Wrong size on WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, gold) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::gold' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000004, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_SelectInt_ReturnValue) == 0x000020, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_UI_HUD_MoneyListItem_C_AddGoldWithEffect::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.ExecuteUbergraph_WBP_UI_HUD_MoneyListItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem) == 0x000008, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem) == 0x000030, "Wrong size on WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem, CallFunc_Conv_StringToInt_ReturnValue) == 0x000028, "Member 'WBP_UI_HUD_MoneyListItem_C_ExecuteUbergraph_WBP_UI_HUD_MoneyListItem::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.Init
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_Init final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_Init) == 0x000004, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_Init");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_Init) == 0x000010, "Wrong size on WBP_UI_HUD_MoneyListItem_C_Init");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_Init, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_Init::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_Init, CallFunc_Array_Add_ReturnValue_1) == 0x000004, "Member 'WBP_UI_HUD_MoneyListItem_C_Init::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_Init, CallFunc_Array_Add_ReturnValue_2) == 0x000008, "Member 'WBP_UI_HUD_MoneyListItem_C_Init::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_Init, CallFunc_Array_Add_ReturnValue_3) == 0x00000C, "Member 'WBP_UI_HUD_MoneyListItem_C_Init::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.PendingAddGold
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_PendingAddGold final
{
public:
	int32                                         gold;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_PendingAddGold) == 0x000004, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_PendingAddGold");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_PendingAddGold) == 0x000004, "Wrong size on WBP_UI_HUD_MoneyListItem_C_PendingAddGold");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_PendingAddGold, gold) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_PendingAddGold::gold' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.PlayHitGoldEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect) == 0x000008, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect) == 0x000008, "Wrong size on WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_PlayHitGoldEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.PlaySetDoneEffect
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect) == 0x000008, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect) == 0x000008, "Wrong size on WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_PlaySetDoneEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.SetGoldWithEffect
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect final
{
public:
	int32                                         gold;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect) == 0x000004, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect) == 0x000004, "Wrong size on WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect, gold) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_SetGoldWithEffect::gold' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.TestSetGold
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_TestSetGold final
{
public:
	int32                                         gold;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_TestSetGold) == 0x000004, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_TestSetGold");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_TestSetGold) == 0x000004, "Wrong size on WBP_UI_HUD_MoneyListItem_C_TestSetGold");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_TestSetGold, gold) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_TestSetGold::gold' has a wrong offset!");

// Function WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_MoneyListItem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_MoneyListItem_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_UI_HUD_MoneyListItem_C_GetModuleName");
static_assert(sizeof(WBP_UI_HUD_MoneyListItem_C_GetModuleName) == 0x000010, "Wrong size on WBP_UI_HUD_MoneyListItem_C_GetModuleName");
static_assert(offsetof(WBP_UI_HUD_MoneyListItem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_MoneyListItem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

