#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Login_Privacy

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Login_Privacy.WBP_Login_Privacy_C
// 0x0078 (0x0368 - 0x02F0)
class UWBP_Login_Privacy_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Cancel_C*         BtnCancel;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Confirm_C*        BtnConfirm;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Confirm_C*        BtnOK;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CoverButtonBelow;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Filter_Img;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PanelLink;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PanelRoot;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherButton;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtDesc;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtDescLink;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Snow_Loop;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_PopupBase_C*             WBP_Window;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Login_Privacy_C">();
	}
	static class UWBP_Login_Privacy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Login_Privacy_C>();
	}
};
static_assert(alignof(UWBP_Login_Privacy_C) == 0x000008, "Wrong alignment on UWBP_Login_Privacy_C");
static_assert(sizeof(UWBP_Login_Privacy_C) == 0x000368, "Wrong size on UWBP_Login_Privacy_C");
static_assert(offsetof(UWBP_Login_Privacy_C, FadeOut) == 0x0002F0, "Member 'UWBP_Login_Privacy_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, FadeIn) == 0x0002F8, "Member 'UWBP_Login_Privacy_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, BtnCancel) == 0x000300, "Member 'UWBP_Login_Privacy_C::BtnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, BtnConfirm) == 0x000308, "Member 'UWBP_Login_Privacy_C::BtnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, BtnOK) == 0x000310, "Member 'UWBP_Login_Privacy_C::BtnOK' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, CoverButtonBelow) == 0x000318, "Member 'UWBP_Login_Privacy_C::CoverButtonBelow' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, Filter_Img) == 0x000320, "Member 'UWBP_Login_Privacy_C::Filter_Img' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, PanelLink) == 0x000328, "Member 'UWBP_Login_Privacy_C::PanelLink' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, PanelRoot) == 0x000330, "Member 'UWBP_Login_Privacy_C::PanelRoot' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, RetainerBox_0) == 0x000338, "Member 'UWBP_Login_Privacy_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, SwitcherButton) == 0x000340, "Member 'UWBP_Login_Privacy_C::SwitcherButton' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, TxtDesc) == 0x000348, "Member 'UWBP_Login_Privacy_C::TxtDesc' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, TxtDescLink) == 0x000350, "Member 'UWBP_Login_Privacy_C::TxtDescLink' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, UI_NS_Snow_Loop) == 0x000358, "Member 'UWBP_Login_Privacy_C::UI_NS_Snow_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_Login_Privacy_C, WBP_Window) == 0x000360, "Member 'UWBP_Login_Privacy_C::WBP_Window' has a wrong offset!");

}

