#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_X6FadingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_X6FadingWidget.WBP_X6FadingWidget_C
// 0x0110 (0x0400 - 0x02F0)
class UWBP_X6FadingWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeBackground;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        PauseDuration;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Animation_Finished;                                // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            NewVar_0;                                          // 0x0330(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void PreConstruct(bool IsDesignTime);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void FadeOut();
	void FadeIn();
	void ExecuteUbergraph_WBP_X6FadingWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_X6FadingWidget_C">();
	}
	static class UWBP_X6FadingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_X6FadingWidget_C>();
	}
};
static_assert(alignof(UWBP_X6FadingWidget_C) == 0x000010, "Wrong alignment on UWBP_X6FadingWidget_C");
static_assert(sizeof(UWBP_X6FadingWidget_C) == 0x000400, "Wrong size on UWBP_X6FadingWidget_C");
static_assert(offsetof(UWBP_X6FadingWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_X6FadingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, FadeBackground) == 0x0002F8, "Member 'UWBP_X6FadingWidget_C::FadeBackground' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, Background) == 0x000300, "Member 'UWBP_X6FadingWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, Text) == 0x000308, "Member 'UWBP_X6FadingWidget_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, PauseDuration) == 0x000310, "Member 'UWBP_X6FadingWidget_C::PauseDuration' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, Animation_Finished) == 0x000318, "Member 'UWBP_X6FadingWidget_C::Animation_Finished' has a wrong offset!");
static_assert(offsetof(UWBP_X6FadingWidget_C, NewVar_0) == 0x000330, "Member 'UWBP_X6FadingWidget_C::NewVar_0' has a wrong offset!");

}

