#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SysSocial_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SysSocial_Head.WBP_SysSocial_Head_C
// 0x0198 (0x0488 - 0x02F0)
class UWBP_SysSocial_Head_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop_Star;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_Sign;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Sign_Active;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Destroy;                                       // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Long_Press_Progress;                           // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Pressed;                                       // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover_Select;                                  // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_FadeOut;                                       // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Fadein;                                        // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UX6MultiPlatformButton*                 Button_Res;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_All;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Bright;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Glow;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 fx_glow_progress;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight_01;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Fx_Progress_play;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_smoke;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Icon;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon_bright;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon_destroy;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dwn;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dwn_2;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hov;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hov_1;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hov_2;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_1;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_3;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_H;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sign;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Star;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_State;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               KeyTips;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               KeyTips_H;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_Glow;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_Glow_1;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_Glow_Frame;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_Glow_Frame_1;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Progress_play;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Name_2;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_dust;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SysSocial_Image_State_C*           WBP_SysSocial_Image_State;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SysSocial_Sleep_C*                 WBP_SysSocial_Sleep;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SysSocial_Waiting_C*               WBP_SysSocial_Waiting;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_1;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_169;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SysSocial_Head_Button_Res_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_SysSocial_Head_Button_Res_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_SysSocial_Head_Button_Res_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SysSocial_Head_Button_Res_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Bp_ScaleSet(bool IsMobile);
	void ExecuteUbergraph_WBP_SysSocial_Head(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SysSocial_Head_C">();
	}
	static class UWBP_SysSocial_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SysSocial_Head_C>();
	}
};
static_assert(alignof(UWBP_SysSocial_Head_C) == 0x000008, "Wrong alignment on UWBP_SysSocial_Head_C");
static_assert(sizeof(UWBP_SysSocial_Head_C) == 0x000488, "Wrong size on UWBP_SysSocial_Head_C");
static_assert(offsetof(UWBP_SysSocial_Head_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_SysSocial_Head_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Loop_Star) == 0x0002F8, "Member 'UWBP_SysSocial_Head_C::Loop_Star' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Loop_Sign) == 0x000300, "Member 'UWBP_SysSocial_Head_C::Loop_Sign' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Sign_Active) == 0x000308, "Member 'UWBP_SysSocial_Head_C::Ani_Sign_Active' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Destroy) == 0x000310, "Member 'UWBP_SysSocial_Head_C::Ani_Destroy' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Long_Press_Progress) == 0x000318, "Member 'UWBP_SysSocial_Head_C::Ani_Long_Press_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Pressed) == 0x000320, "Member 'UWBP_SysSocial_Head_C::Ani_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Hover_Select) == 0x000328, "Member 'UWBP_SysSocial_Head_C::Ani_Hover_Select' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_FadeOut) == 0x000330, "Member 'UWBP_SysSocial_Head_C::Ani_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Ani_Fadein) == 0x000338, "Member 'UWBP_SysSocial_Head_C::Ani_Fadein' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Button_Res) == 0x000340, "Member 'UWBP_SysSocial_Head_C::Button_Res' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, CanvasPanel_All) == 0x000348, "Member 'UWBP_SysSocial_Head_C::CanvasPanel_All' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_Bright) == 0x000350, "Member 'UWBP_SysSocial_Head_C::Fx_Bright' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_Glow) == 0x000358, "Member 'UWBP_SysSocial_Head_C::Fx_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, fx_glow_progress) == 0x000360, "Member 'UWBP_SysSocial_Head_C::fx_glow_progress' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_highlight) == 0x000368, "Member 'UWBP_SysSocial_Head_C::Fx_highlight' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_highlight_01) == 0x000370, "Member 'UWBP_SysSocial_Head_C::Fx_highlight_01' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_Progress_play) == 0x000378, "Member 'UWBP_SysSocial_Head_C::Fx_Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Fx_smoke) == 0x000380, "Member 'UWBP_SysSocial_Head_C::Fx_smoke' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Icon) == 0x000388, "Member 'UWBP_SysSocial_Head_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, icon_bright) == 0x000390, "Member 'UWBP_SysSocial_Head_C::icon_bright' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, icon_destroy) == 0x000398, "Member 'UWBP_SysSocial_Head_C::icon_destroy' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Dwn) == 0x0003A0, "Member 'UWBP_SysSocial_Head_C::Image_Dwn' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Dwn_2) == 0x0003A8, "Member 'UWBP_SysSocial_Head_C::Image_Dwn_2' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Hov) == 0x0003B0, "Member 'UWBP_SysSocial_Head_C::Image_Hov' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Hov_1) == 0x0003B8, "Member 'UWBP_SysSocial_Head_C::Image_Hov_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Hov_2) == 0x0003C0, "Member 'UWBP_SysSocial_Head_C::Image_Hov_2' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Icon) == 0x0003C8, "Member 'UWBP_SysSocial_Head_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Icon_1) == 0x0003D0, "Member 'UWBP_SysSocial_Head_C::Image_Icon_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Icon_3) == 0x0003D8, "Member 'UWBP_SysSocial_Head_C::Image_Icon_3' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Icon_H) == 0x0003E0, "Member 'UWBP_SysSocial_Head_C::Image_Icon_H' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Sign) == 0x0003E8, "Member 'UWBP_SysSocial_Head_C::Image_Sign' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_Star) == 0x0003F0, "Member 'UWBP_SysSocial_Head_C::Image_Star' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Image_State) == 0x0003F8, "Member 'UWBP_SysSocial_Head_C::Image_State' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, KeyTips) == 0x000400, "Member 'UWBP_SysSocial_Head_C::KeyTips' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, KeyTips_H) == 0x000408, "Member 'UWBP_SysSocial_Head_C::KeyTips_H' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, NS_Glow) == 0x000410, "Member 'UWBP_SysSocial_Head_C::NS_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, NS_Glow_1) == 0x000418, "Member 'UWBP_SysSocial_Head_C::NS_Glow_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, NS_Glow_Frame) == 0x000420, "Member 'UWBP_SysSocial_Head_C::NS_Glow_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, NS_Glow_Frame_1) == 0x000428, "Member 'UWBP_SysSocial_Head_C::NS_Glow_Frame_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Progress_play) == 0x000430, "Member 'UWBP_SysSocial_Head_C::Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, SizeBox) == 0x000438, "Member 'UWBP_SysSocial_Head_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, Txt_Name_2) == 0x000440, "Member 'UWBP_SysSocial_Head_C::Txt_Name_2' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, UI_NS_dust) == 0x000448, "Member 'UWBP_SysSocial_Head_C::UI_NS_dust' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WBP_SysSocial_Image_State) == 0x000450, "Member 'UWBP_SysSocial_Head_C::WBP_SysSocial_Image_State' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WBP_SysSocial_Sleep) == 0x000458, "Member 'UWBP_SysSocial_Head_C::WBP_SysSocial_Sleep' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WBP_SysSocial_Waiting) == 0x000460, "Member 'UWBP_SysSocial_Head_C::WBP_SysSocial_Waiting' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WidgetSwitcher) == 0x000468, "Member 'UWBP_SysSocial_Head_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WidgetSwitcher_0) == 0x000470, "Member 'UWBP_SysSocial_Head_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WidgetSwitcher_1) == 0x000478, "Member 'UWBP_SysSocial_Head_C::WidgetSwitcher_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Head_C, WidgetSwitcher_169) == 0x000480, "Member 'UWBP_SysSocial_Head_C::WidgetSwitcher_169' has a wrong offset!");

}

