#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CatchingInsects_Mark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C
// 0x0038 (0x0328 - 0x02F0)
class UWBP_CatchingInsects_Mark_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Bg;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpineWidget*                           Spine_icon;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InteractiveWhitePointWidgetComponent_C* WidgetComponent;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowed;                                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CatchingInsects_Mark(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void Construct();
	void BP_DisplayWidget(bool bInShow, bool bInSelect);
	void BP_CheckEnterInsectAbility(bool* bCatchingInsectAbility);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CatchingInsects_Mark_C">();
	}
	static class UWBP_CatchingInsects_Mark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CatchingInsects_Mark_C>();
	}
};
static_assert(alignof(UWBP_CatchingInsects_Mark_C) == 0x000008, "Wrong alignment on UWBP_CatchingInsects_Mark_C");
static_assert(sizeof(UWBP_CatchingInsects_Mark_C) == 0x000328, "Wrong size on UWBP_CatchingInsects_Mark_C");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_CatchingInsects_Mark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, FadeOut) == 0x0002F8, "Member 'UWBP_CatchingInsects_Mark_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, FadeIn) == 0x000300, "Member 'UWBP_CatchingInsects_Mark_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, Img_Bg) == 0x000308, "Member 'UWBP_CatchingInsects_Mark_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, Spine_icon) == 0x000310, "Member 'UWBP_CatchingInsects_Mark_C::Spine_icon' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, WidgetComponent) == 0x000318, "Member 'UWBP_CatchingInsects_Mark_C::WidgetComponent' has a wrong offset!");
static_assert(offsetof(UWBP_CatchingInsects_Mark_C, bShowed) == 0x000320, "Member 'UWBP_CatchingInsects_Mark_C::bShowed' has a wrong offset!");

}

