#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_PC.WBP_Hud_PC_C
// 0x0138 (0x0428 - 0x02F0)
class UWBP_Hud_PC_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_ImmersiveMode;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FX_FadeOutDeath;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAndFadeIn;                                  // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Bottom;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Arrow;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_AbilityOpt;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Collection_List_C*             CollectionList;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Custom_Canvas;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CustomBottom_Canvas;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DyBox_InteractItem_List;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DyBox_PropsItem_List;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Events_Balloon;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SysHUD_FunctionButton_C*           FunctionButton;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Black;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           GuideShow_Panel;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HideWorld;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_1;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainActivity_C*                    MainActivity;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_TopRightArea_C*                Map;                                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Others;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_FunctionButton;                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_UseProps;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TL;                                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TR;                                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_v2_C*                       WBP_Hud_HP_v2;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_NPC_NewsHint_C*                WBP_HUD_NPC_NewsHint;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_Ping_C*                        WBP_HUD_Ping;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_TaskList_C*                    WBP_HUD_TaskList;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_UseProps_C*                    WBP_HUD_UseProps;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NikkiActionGroup_PC_V2_C*          WBP_NikkiActionGroup_PC_V2;                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Photograph_FinishTask_C*           WBP_PhotoWall_FinishTask;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SceneMarkerPanel_C*                WBP_SceneMarkerPanel;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6SoftRefWidget*                       X6SoftRefWidget_IndependentLevel;                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ActivityItemFadeIn();
	void BP_ShowOrHideEnergyLevelHud(bool IsShow);
	void Event_FadeIn(class UWBP_MainActivity_C* MainActivity_0);
	void Event_FadeOut(class UWBP_MainActivity_C* MainActivity_0);
	void ExecuteUbergraph_WBP_Hud_PC(int32 EntryPoint);
	void HideHPParticle(class UWBP_MainActivity_C* MainActivity_0);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnAnimationStarted(const class UWidgetAnimation* Animation);
	void OnFadeOutStart();
	void OnMapFadeInStart();
	void PlayLevelUp();
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_0();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_1();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_10();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_11();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_2();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_3();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_4(class UWBP_MainActivity_C* MainActivity_0);
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_5(class UWBP_MainActivity_C* MainActivity_0);
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_6(class UWBP_MainActivity_C* MainActivity_0);
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_7();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_8();
	void SequenceEvent__ENTRYPOINTWBP_Hud_PC_9();
	void ShowHPParticle(class UWBP_MainActivity_C* MainActivity_0);
	void StopFadeInFull();
	void WH_HideCollectionList();
	void WH_PlayAddAnim();
	void WH_ShoMoonCoin();
	void WH_ShowOtherCoin();
	void WH_ShowTip();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_PC_C">();
	}
	static class UWBP_Hud_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_PC_C>();
	}
};
static_assert(alignof(UWBP_Hud_PC_C) == 0x000008, "Wrong alignment on UWBP_Hud_PC_C");
static_assert(sizeof(UWBP_Hud_PC_C) == 0x000428, "Wrong size on UWBP_Hud_PC_C");
static_assert(offsetof(UWBP_Hud_PC_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Hud_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Ani_ImmersiveMode) == 0x0002F8, "Member 'UWBP_Hud_PC_C::Ani_ImmersiveMode' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FX_FadeOutDeath) == 0x000300, "Member 'UWBP_Hud_PC_C::FX_FadeOutDeath' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FadeOutAndFadeIn) == 0x000308, "Member 'UWBP_Hud_PC_C::FadeOutAndFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FadeIn) == 0x000310, "Member 'UWBP_Hud_PC_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FadeOut) == 0x000318, "Member 'UWBP_Hud_PC_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Bottom) == 0x000320, "Member 'UWBP_Hud_PC_C::Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Button_Arrow) == 0x000328, "Member 'UWBP_Hud_PC_C::Button_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, CanvasPanel_0) == 0x000330, "Member 'UWBP_Hud_PC_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, CanvasPanel_AbilityOpt) == 0x000338, "Member 'UWBP_Hud_PC_C::CanvasPanel_AbilityOpt' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, CollectionList) == 0x000340, "Member 'UWBP_Hud_PC_C::CollectionList' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Custom_Canvas) == 0x000348, "Member 'UWBP_Hud_PC_C::Custom_Canvas' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, CustomBottom_Canvas) == 0x000350, "Member 'UWBP_Hud_PC_C::CustomBottom_Canvas' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, DyBox_InteractItem_List) == 0x000358, "Member 'UWBP_Hud_PC_C::DyBox_InteractItem_List' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, DyBox_PropsItem_List) == 0x000360, "Member 'UWBP_Hud_PC_C::DyBox_PropsItem_List' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Events_Balloon) == 0x000368, "Member 'UWBP_Hud_PC_C::Events_Balloon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FunctionButton) == 0x000370, "Member 'UWBP_Hud_PC_C::FunctionButton' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, FX_Black) == 0x000378, "Member 'UWBP_Hud_PC_C::FX_Black' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, GuideShow_Panel) == 0x000380, "Member 'UWBP_Hud_PC_C::GuideShow_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Image_Arrow) == 0x000388, "Member 'UWBP_Hud_PC_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Image_HideWorld) == 0x000390, "Member 'UWBP_Hud_PC_C::Image_HideWorld' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, InvalidationBox_0) == 0x000398, "Member 'UWBP_Hud_PC_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, InvalidationBox_1) == 0x0003A0, "Member 'UWBP_Hud_PC_C::InvalidationBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, MainActivity) == 0x0003A8, "Member 'UWBP_Hud_PC_C::MainActivity' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Map) == 0x0003B0, "Member 'UWBP_Hud_PC_C::Map' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, Others) == 0x0003B8, "Member 'UWBP_Hud_PC_C::Others' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, ScaleBox_FunctionButton) == 0x0003C0, "Member 'UWBP_Hud_PC_C::ScaleBox_FunctionButton' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, ScaleBox_UseProps) == 0x0003C8, "Member 'UWBP_Hud_PC_C::ScaleBox_UseProps' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, TL) == 0x0003D0, "Member 'UWBP_Hud_PC_C::TL' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, TR) == 0x0003D8, "Member 'UWBP_Hud_PC_C::TR' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_Hud_HP_v2) == 0x0003E0, "Member 'UWBP_Hud_PC_C::WBP_Hud_HP_v2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_HUD_NPC_NewsHint) == 0x0003E8, "Member 'UWBP_Hud_PC_C::WBP_HUD_NPC_NewsHint' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_HUD_Ping) == 0x0003F0, "Member 'UWBP_Hud_PC_C::WBP_HUD_Ping' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_HUD_TaskList) == 0x0003F8, "Member 'UWBP_Hud_PC_C::WBP_HUD_TaskList' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_HUD_UseProps) == 0x000400, "Member 'UWBP_Hud_PC_C::WBP_HUD_UseProps' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_NikkiActionGroup_PC_V2) == 0x000408, "Member 'UWBP_Hud_PC_C::WBP_NikkiActionGroup_PC_V2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_PhotoWall_FinishTask) == 0x000410, "Member 'UWBP_Hud_PC_C::WBP_PhotoWall_FinishTask' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, WBP_SceneMarkerPanel) == 0x000418, "Member 'UWBP_Hud_PC_C::WBP_SceneMarkerPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_PC_C, X6SoftRefWidget_IndependentLevel) == 0x000420, "Member 'UWBP_Hud_PC_C::X6SoftRefWidget_IndependentLevel' has a wrong offset!");

}

