#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Interaction_Skill

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Interaction_Skill.WBP_Interaction_Skill_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_Interaction_Skill_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeOut_SkillBtn;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed_SkillBtn;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_SkillBtn;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Skill;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_bg;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_Icon;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Interaction_Skill_C">();
	}
	static class UWBP_Interaction_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Interaction_Skill_C>();
	}
};
static_assert(alignof(UWBP_Interaction_Skill_C) == 0x000008, "Wrong alignment on UWBP_Interaction_Skill_C");
static_assert(sizeof(UWBP_Interaction_Skill_C) == 0x000320, "Wrong size on UWBP_Interaction_Skill_C");
static_assert(offsetof(UWBP_Interaction_Skill_C, FadeOut_SkillBtn) == 0x0002F0, "Member 'UWBP_Interaction_Skill_C::FadeOut_SkillBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_Skill_C, Pressed_SkillBtn) == 0x0002F8, "Member 'UWBP_Interaction_Skill_C::Pressed_SkillBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_Skill_C, FadeIn_SkillBtn) == 0x000300, "Member 'UWBP_Interaction_Skill_C::FadeIn_SkillBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_Skill_C, CanvasPanel_Skill) == 0x000308, "Member 'UWBP_Interaction_Skill_C::CanvasPanel_Skill' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_Skill_C, Skill_bg) == 0x000310, "Member 'UWBP_Interaction_Skill_C::Skill_bg' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_Skill_C, Skill_Icon) == 0x000318, "Member 'UWBP_Interaction_Skill_C::Skill_Icon' has a wrong offset!");

}

