#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SysSocial_Waiting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SysSocial_Waiting.WBP_SysSocial_Waiting_C
// 0x0058 (0x0348 - 0x02F0)
class UWBP_SysSocial_Waiting_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_waiting_loop;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot;                                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_1;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_2;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_3;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_4;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_5;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_6;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_State;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SysSocial_Waiting(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SysSocial_Waiting_C">();
	}
	static class UWBP_SysSocial_Waiting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SysSocial_Waiting_C>();
	}
};
static_assert(alignof(UWBP_SysSocial_Waiting_C) == 0x000008, "Wrong alignment on UWBP_SysSocial_Waiting_C");
static_assert(sizeof(UWBP_SysSocial_Waiting_C) == 0x000348, "Wrong size on UWBP_SysSocial_Waiting_C");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_SysSocial_Waiting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, Ani_waiting_loop) == 0x0002F8, "Member 'UWBP_SysSocial_Waiting_C::Ani_waiting_loop' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, CanvasPanel_0) == 0x000300, "Member 'UWBP_SysSocial_Waiting_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot) == 0x000308, "Member 'UWBP_SysSocial_Waiting_C::dot' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_1) == 0x000310, "Member 'UWBP_SysSocial_Waiting_C::dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_2) == 0x000318, "Member 'UWBP_SysSocial_Waiting_C::dot_2' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_3) == 0x000320, "Member 'UWBP_SysSocial_Waiting_C::dot_3' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_4) == 0x000328, "Member 'UWBP_SysSocial_Waiting_C::dot_4' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_5) == 0x000330, "Member 'UWBP_SysSocial_Waiting_C::dot_5' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, dot_6) == 0x000338, "Member 'UWBP_SysSocial_Waiting_C::dot_6' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Waiting_C, Image_State) == 0x000340, "Member 'UWBP_SysSocial_Waiting_C::Image_State' has a wrong offset!");

}

