#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_NPC_NewsHint

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_NPC_NewsHint.WBP_HUD_NPC_NewsHint_C.ExecuteUbergraph_WBP_HUD_NPC_NewsHint
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint) == 0x000004, "Wrong alignment on WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint");
static_assert(sizeof(WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint) == 0x000008, "Wrong size on WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint");
static_assert(offsetof(WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint, EntryPoint) == 0x000000, "Member 'WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_HUD_NPC_NewsHint_C_ExecuteUbergraph_WBP_HUD_NPC_NewsHint::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_HUD_NPC_NewsHint.WBP_HUD_NPC_NewsHint_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_NPC_NewsHint_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_NPC_NewsHint_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HUD_NPC_NewsHint_C_PreConstruct");
static_assert(sizeof(WBP_HUD_NPC_NewsHint_C_PreConstruct) == 0x000001, "Wrong size on WBP_HUD_NPC_NewsHint_C_PreConstruct");
static_assert(offsetof(WBP_HUD_NPC_NewsHint_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HUD_NPC_NewsHint_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

