#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainActivity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainActivity.WBP_MainActivity_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_MainActivity_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicEntryBox*                       AllData;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ItemFadeInInternal;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemFadeOutInternal_Fold;                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangePlayerClothes();
	void Construct();
	void ExecuteUbergraph_WBP_MainActivity(int32 EntryPoint);
	void HandleOnLevelLoaded();
	void loadDesignDrawingWorld(const class FString& LevelPath);
	void LoadStreamLevel();
	void OnItemClicked(class UBP_MainHudObtainedContainerData_C* Data);
	void OnLevelLoaded();
	void PlayFadeIn();
	void PreConstruct(bool IsDesignTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainActivity_C">();
	}
	static class UWBP_MainActivity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainActivity_C>();
	}
};
static_assert(alignof(UWBP_MainActivity_C) == 0x000008, "Wrong alignment on UWBP_MainActivity_C");
static_assert(sizeof(UWBP_MainActivity_C) == 0x000318, "Wrong size on UWBP_MainActivity_C");
static_assert(offsetof(UWBP_MainActivity_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_MainActivity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainActivity_C, AllData) == 0x0002F8, "Member 'UWBP_MainActivity_C::AllData' has a wrong offset!");
static_assert(offsetof(UWBP_MainActivity_C, InvalidationBox_0) == 0x000300, "Member 'UWBP_MainActivity_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainActivity_C, ItemFadeInInternal) == 0x000308, "Member 'UWBP_MainActivity_C::ItemFadeInInternal' has a wrong offset!");
static_assert(offsetof(UWBP_MainActivity_C, ItemFadeOutInternal_Fold) == 0x000310, "Member 'UWBP_MainActivity_C::ItemFadeOutInternal_Fold' has a wrong offset!");

}

