#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SysSocial_Image_State

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SysSocial_Image_State.WBP_SysSocial_Image_State_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_SysSocial_Image_State_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_State_loop;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_State;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_SysSocial_Image_State(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SysSocial_Image_State_C">();
	}
	static class UWBP_SysSocial_Image_State_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SysSocial_Image_State_C>();
	}
};
static_assert(alignof(UWBP_SysSocial_Image_State_C) == 0x000008, "Wrong alignment on UWBP_SysSocial_Image_State_C");
static_assert(sizeof(UWBP_SysSocial_Image_State_C) == 0x000310, "Wrong size on UWBP_SysSocial_Image_State_C");
static_assert(offsetof(UWBP_SysSocial_Image_State_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_SysSocial_Image_State_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Image_State_C, Ani_State_loop) == 0x0002F8, "Member 'UWBP_SysSocial_Image_State_C::Ani_State_loop' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Image_State_C, CanvasPanel_0) == 0x000300, "Member 'UWBP_SysSocial_Image_State_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Image_State_C, Image_State) == 0x000308, "Member 'UWBP_SysSocial_Image_State_C::Image_State' has a wrong offset!");

}

