#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Collection_item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C
// 0x0078 (0x0368 - 0x02F0)
class UWBP_UI_HUD_Collection_item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deduct_Ani;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetSpecialStar_Ani;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetDarkStar_Ani;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_TestSet;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_SetCount;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_DarkStarIcon;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Icon;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageIcon_1;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_DarkStar;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetSpecialStar;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_UI_HUD_Collection_item_Button_TestSet_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_UI_HUD_Collection_item(int32 EntryPoint);
	void PlayMinus();
	void PlayMoonCoinAdd();
	void PlayPurpleCoinAdd();
	void TestSet(int32 Count);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_Collection_item_C">();
	}
	static class UWBP_UI_HUD_Collection_item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_Collection_item_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_Collection_item_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_Collection_item_C");
static_assert(sizeof(UWBP_UI_HUD_Collection_item_C) == 0x000368, "Wrong size on UWBP_UI_HUD_Collection_item_C");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_HUD_Collection_item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, Deduct_Ani) == 0x0002F8, "Member 'UWBP_UI_HUD_Collection_item_C::Deduct_Ani' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, GetSpecialStar_Ani) == 0x000300, "Member 'UWBP_UI_HUD_Collection_item_C::GetSpecialStar_Ani' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, GetDarkStar_Ani) == 0x000308, "Member 'UWBP_UI_HUD_Collection_item_C::GetDarkStar_Ani' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, Bg) == 0x000310, "Member 'UWBP_UI_HUD_Collection_item_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, Button_TestSet) == 0x000318, "Member 'UWBP_UI_HUD_Collection_item_C::Button_TestSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, EditableTextBox_SetCount) == 0x000320, "Member 'UWBP_UI_HUD_Collection_item_C::EditableTextBox_SetCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, FX_DarkStarIcon) == 0x000328, "Member 'UWBP_UI_HUD_Collection_item_C::FX_DarkStarIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, Icon) == 0x000330, "Member 'UWBP_UI_HUD_Collection_item_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, ImageIcon) == 0x000338, "Member 'UWBP_UI_HUD_Collection_item_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, ImageIcon_1) == 0x000340, "Member 'UWBP_UI_HUD_Collection_item_C::ImageIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, InvalidationBox_0) == 0x000348, "Member 'UWBP_UI_HUD_Collection_item_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, NS_DarkStar) == 0x000350, "Member 'UWBP_UI_HUD_Collection_item_C::NS_DarkStar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, NS_GetSpecialStar) == 0x000358, "Member 'UWBP_UI_HUD_Collection_item_C::NS_GetSpecialStar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Collection_item_C, Num) == 0x000360, "Member 'UWBP_UI_HUD_Collection_item_C::Num' has a wrong offset!");

}

