#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainHudItemTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainHudItemTab.WBP_MainHudItemTab_C
// 0x00A8 (0x0398 - 0x02F0)
class UWBP_MainHudItemTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Shop_Once;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Unlock;                                        // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowUp;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Fx_Star_01;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Star_02;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Sweep_01;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Sweep_02;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lock;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Interact;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SysName;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Unlock;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_RedPoint_C*                     WBP_RedPoint;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_RedPoint_C*                     WBP_RedPoint_Special;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_PC_C*            WBP_UI_Common_KeyTips_PC;                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MainHudObtainedContainerData_C*     Data;                                              // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        PlayInterval;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopUnlockAnim;                                    // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MainHudItemTab_Interact_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_PLayActivitySound();
	void BP_PLayBagSound();
	void BP_PLayClothSpiritSound();
	void BP_PLayGachaSound();
	void ExecuteUbergraph_WBP_MainHudItemTab(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PlayUnlock(int32 unlockStyle);
	void UpdateUnlockState(bool isUnlocked, int32 unlockStyle);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainHudItemTab_C">();
	}
	static class UWBP_MainHudItemTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainHudItemTab_C>();
	}
};
static_assert(alignof(UWBP_MainHudItemTab_C) == 0x000008, "Wrong alignment on UWBP_MainHudItemTab_C");
static_assert(sizeof(UWBP_MainHudItemTab_C) == 0x000398, "Wrong size on UWBP_MainHudItemTab_C");
static_assert(offsetof(UWBP_MainHudItemTab_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_MainHudItemTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Ani_Shop_Once) == 0x0002F8, "Member 'UWBP_MainHudItemTab_C::Ani_Shop_Once' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Loop) == 0x000300, "Member 'UWBP_MainHudItemTab_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Ani_Unlock) == 0x000308, "Member 'UWBP_MainHudItemTab_C::Ani_Unlock' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, FadeIn) == 0x000310, "Member 'UWBP_MainHudItemTab_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, ShowUp) == 0x000318, "Member 'UWBP_MainHudItemTab_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Fx_Star_01) == 0x000320, "Member 'UWBP_MainHudItemTab_C::Fx_Star_01' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Fx_Star_02) == 0x000328, "Member 'UWBP_MainHudItemTab_C::Fx_Star_02' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Fx_Sweep_01) == 0x000330, "Member 'UWBP_MainHudItemTab_C::Fx_Sweep_01' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Fx_Sweep_02) == 0x000338, "Member 'UWBP_MainHudItemTab_C::Fx_Sweep_02' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Image_Lock) == 0x000340, "Member 'UWBP_MainHudItemTab_C::Image_Lock' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Interact) == 0x000348, "Member 'UWBP_MainHudItemTab_C::Interact' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Name_0) == 0x000350, "Member 'UWBP_MainHudItemTab_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, TextBlock_SysName) == 0x000358, "Member 'UWBP_MainHudItemTab_C::TextBlock_SysName' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, UI_NS_Unlock) == 0x000360, "Member 'UWBP_MainHudItemTab_C::UI_NS_Unlock' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, WBP_RedPoint) == 0x000368, "Member 'UWBP_MainHudItemTab_C::WBP_RedPoint' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, WBP_RedPoint_Special) == 0x000370, "Member 'UWBP_MainHudItemTab_C::WBP_RedPoint_Special' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, WBP_UI_Common_KeyTips_PC) == 0x000378, "Member 'UWBP_MainHudItemTab_C::WBP_UI_Common_KeyTips_PC' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, Data) == 0x000380, "Member 'UWBP_MainHudItemTab_C::Data' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, PlayInterval) == 0x000388, "Member 'UWBP_MainHudItemTab_C::PlayInterval' has a wrong offset!");
static_assert(offsetof(UWBP_MainHudItemTab_C, StopUnlockAnim) == 0x000390, "Member 'UWBP_MainHudItemTab_C::StopUnlockAnim' has a wrong offset!");

}

