#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapHud

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapHud.WBP_MapHud_C.AddFollowMapHud
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapHud_C_AddFollowMapHud final
{
public:
	TScriptInterface<class IBP_MapFollower_C>     HUD;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_AddFollowMapHud) == 0x000008, "Wrong alignment on WBP_MapHud_C_AddFollowMapHud");
static_assert(sizeof(WBP_MapHud_C_AddFollowMapHud) == 0x000018, "Wrong size on WBP_MapHud_C_AddFollowMapHud");
static_assert(offsetof(WBP_MapHud_C_AddFollowMapHud, HUD) == 0x000000, "Member 'WBP_MapHud_C_AddFollowMapHud::HUD' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_AddFollowMapHud, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_AddFollowMapHud::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.BeginInertiaMove
// 0x0040 (0x0040 - 0x0000)
struct WBP_MapHud_C_BeginInertiaMove final
{
public:
	struct FVector2D                              inertiaForce_0;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Distance2D_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_BeginInertiaMove) == 0x000008, "Wrong alignment on WBP_MapHud_C_BeginInertiaMove");
static_assert(sizeof(WBP_MapHud_C_BeginInertiaMove) == 0x000040, "Wrong size on WBP_MapHud_C_BeginInertiaMove");
static_assert(offsetof(WBP_MapHud_C_BeginInertiaMove, inertiaForce_0) == 0x000000, "Member 'WBP_MapHud_C_BeginInertiaMove::inertiaForce_0' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_BeginInertiaMove, CallFunc_Normal2D_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_BeginInertiaMove::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_BeginInertiaMove, CallFunc_Distance2D_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_BeginInertiaMove::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_BeginInertiaMove, CallFunc_FMin_ReturnValue) == 0x000028, "Member 'WBP_MapHud_C_BeginInertiaMove::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_BeginInertiaMove, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000030, "Member 'WBP_MapHud_C_BeginInertiaMove::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.CalculateTime
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapHud_C_CalculateTime final
{
public:
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_CalculateTime) == 0x000008, "Wrong alignment on WBP_MapHud_C_CalculateTime");
static_assert(sizeof(WBP_MapHud_C_CalculateTime) == 0x000010, "Wrong size on WBP_MapHud_C_CalculateTime");
static_assert(offsetof(WBP_MapHud_C_CalculateTime, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000000, "Member 'WBP_MapHud_C_CalculateTime::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CalculateTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_MapHud_C_CalculateTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.CheckIfClick
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_MapHud_C_CheckIfClick final
{
public:
	struct FPointerEvent                          Event;                                             // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0078(0x0018)(HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x00A0(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_ConvertScreenPosToWidgetPos_widgetPos;    // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue;  // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_CheckIfClick) == 0x000008, "Wrong alignment on WBP_MapHud_C_CheckIfClick");
static_assert(sizeof(WBP_MapHud_C_CheckIfClick) == 0x0000F8, "Wrong size on WBP_MapHud_C_CheckIfClick");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, Event) == 0x000000, "Member 'WBP_MapHud_C_CheckIfClick::Event' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_CheckIfClick::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000090, "Member 'WBP_MapHud_C_CheckIfClick::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, CallFunc_GetCachedGeometry_ReturnValue) == 0x0000A0, "Member 'WBP_MapHud_C_CheckIfClick::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, CallFunc_ConvertScreenPosToWidgetPos_widgetPos) == 0x0000D8, "Member 'WBP_MapHud_C_CheckIfClick::CallFunc_ConvertScreenPosToWidgetPos_widgetPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_CheckIfClick, CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue) == 0x0000E8, "Member 'WBP_MapHud_C_CheckIfClick::CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ConstraintMoveRootPos
// 0x0050 (0x0050 - 0x0000)
struct WBP_MapHud_C_ConstraintMoveRootPos final
{
public:
	struct FVector2D                              originPos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Pos;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ConstraintMoveRootPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_ConstraintMoveRootPos");
static_assert(sizeof(WBP_MapHud_C_ConstraintMoveRootPos) == 0x000050, "Wrong size on WBP_MapHud_C_ConstraintMoveRootPos");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, originPos) == 0x000000, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::originPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, Pos) == 0x000010, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::Pos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, CallFunc_FClamp_ReturnValue_1) == 0x000038, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConstraintMoveRootPos, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'WBP_MapHud_C_ConstraintMoveRootPos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ConvertMapPosToWindowPos
// 0x0030 (0x0030 - 0x0000)
struct WBP_MapHud_C_ConvertMapPosToWindowPos final
{
public:
	struct FVector2D                              mapPos;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              windowPos;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_NT_ConvertMapPosToWindowPos_ReturnValue;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ConvertMapPosToWindowPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_ConvertMapPosToWindowPos");
static_assert(sizeof(WBP_MapHud_C_ConvertMapPosToWindowPos) == 0x000030, "Wrong size on WBP_MapHud_C_ConvertMapPosToWindowPos");
static_assert(offsetof(WBP_MapHud_C_ConvertMapPosToWindowPos, mapPos) == 0x000000, "Member 'WBP_MapHud_C_ConvertMapPosToWindowPos::mapPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertMapPosToWindowPos, windowPos) == 0x000010, "Member 'WBP_MapHud_C_ConvertMapPosToWindowPos::windowPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertMapPosToWindowPos, CallFunc_NT_ConvertMapPosToWindowPos_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_ConvertMapPosToWindowPos::CallFunc_NT_ConvertMapPosToWindowPos_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ConvertScreenPosToWidgetPos
// 0x0068 (0x0068 - 0x0000)
struct WBP_MapHud_C_ConvertScreenPosToWidgetPos final
{
public:
	struct FVector2D                              screenPos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              widgetGeometry;                                    // 0x0010(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FVector2D                              widgetPos;                                         // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ConvertScreenPosToWidgetPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_ConvertScreenPosToWidgetPos");
static_assert(sizeof(WBP_MapHud_C_ConvertScreenPosToWidgetPos) == 0x000068, "Wrong size on WBP_MapHud_C_ConvertScreenPosToWidgetPos");
static_assert(offsetof(WBP_MapHud_C_ConvertScreenPosToWidgetPos, screenPos) == 0x000000, "Member 'WBP_MapHud_C_ConvertScreenPosToWidgetPos::screenPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertScreenPosToWidgetPos, widgetGeometry) == 0x000010, "Member 'WBP_MapHud_C_ConvertScreenPosToWidgetPos::widgetGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertScreenPosToWidgetPos, widgetPos) == 0x000048, "Member 'WBP_MapHud_C_ConvertScreenPosToWidgetPos::widgetPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertScreenPosToWidgetPos, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000058, "Member 'WBP_MapHud_C_ConvertScreenPosToWidgetPos::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ConvertWidgetPosToScreenPos
// 0x0068 (0x0068 - 0x0000)
struct WBP_MapHud_C_ConvertWidgetPosToScreenPos final
{
public:
	struct FGeometry                              widgetGeometry;                                    // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FVector2D                              widgetPos;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              screenPos;                                         // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ConvertWidgetPosToScreenPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_ConvertWidgetPosToScreenPos");
static_assert(sizeof(WBP_MapHud_C_ConvertWidgetPosToScreenPos) == 0x000068, "Wrong size on WBP_MapHud_C_ConvertWidgetPosToScreenPos");
static_assert(offsetof(WBP_MapHud_C_ConvertWidgetPosToScreenPos, widgetGeometry) == 0x000000, "Member 'WBP_MapHud_C_ConvertWidgetPosToScreenPos::widgetGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertWidgetPosToScreenPos, widgetPos) == 0x000038, "Member 'WBP_MapHud_C_ConvertWidgetPosToScreenPos::widgetPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertWidgetPosToScreenPos, screenPos) == 0x000048, "Member 'WBP_MapHud_C_ConvertWidgetPosToScreenPos::screenPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertWidgetPosToScreenPos, CallFunc_LocalToAbsolute_ReturnValue) == 0x000058, "Member 'WBP_MapHud_C_ConvertWidgetPosToScreenPos::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ConvertWindowPosToMapPos
// 0x0030 (0x0030 - 0x0000)
struct WBP_MapHud_C_ConvertWindowPosToMapPos final
{
public:
	struct FVector2D                              windowPos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              mapPos;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ConvertWindowPosToMapPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_ConvertWindowPosToMapPos");
static_assert(sizeof(WBP_MapHud_C_ConvertWindowPosToMapPos) == 0x000030, "Wrong size on WBP_MapHud_C_ConvertWindowPosToMapPos");
static_assert(offsetof(WBP_MapHud_C_ConvertWindowPosToMapPos, windowPos) == 0x000000, "Member 'WBP_MapHud_C_ConvertWindowPosToMapPos::windowPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertWindowPosToMapPos, mapPos) == 0x000010, "Member 'WBP_MapHud_C_ConvertWindowPosToMapPos::mapPos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ConvertWindowPosToMapPos, CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_ConvertWindowPosToMapPos::CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.EndDrag
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MapHud_C_EndDrag final
{
public:
	double                                        totalDistance;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DistanceSquared2D_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector2dToString_ReturnValue;        // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_EndDrag) == 0x000008, "Wrong alignment on WBP_MapHud_C_EndDrag");
static_assert(sizeof(WBP_MapHud_C_EndDrag) == 0x0000C8, "Wrong size on WBP_MapHud_C_EndDrag");
static_assert(offsetof(WBP_MapHud_C_EndDrag, totalDistance) == 0x000000, "Member 'WBP_MapHud_C_EndDrag::totalDistance' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_MapHud_C_EndDrag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Normal2D_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000060, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_DistanceSquared2D_ReturnValue) == 0x000070, "Member 'WBP_MapHud_C_EndDrag::CallFunc_DistanceSquared2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Conv_Vector2dToString_ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Conv_Vector2dToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Array_Length_ReturnValue_2) == 0x000088, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Array_Length_ReturnValue_3) == 0x00008C, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'WBP_MapHud_C_EndDrag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000098, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_EndDrag, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_MapHud_C_EndDrag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.ExecuteUbergraph_WBP_MapHud
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0090(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UX6GameInstance*                        CallFunc_GetX6GameInstance_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6InputProcessorHelper*                CallFunc_GetInputProcessorHelper_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPointerEvent& MouseEvent)> K2Node_CreateDelegate_OutputDelegate;    // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud) == 0x000008, "Wrong alignment on WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud");
static_assert(sizeof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud) == 0x0000C8, "Wrong size on WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, EntryPoint) == 0x000000, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_GetPosition_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, K2Node_Event_MyGeometry) == 0x000038, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, K2Node_Event_InDeltaTime) == 0x000070, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000080, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Not_PreBool_ReturnValue_1) == 0x000088, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_BooleanOR_ReturnValue) == 0x000089, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, Temp_struct_Variable) == 0x000090, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_GetX6GameInstance_ReturnValue) == 0x0000A0, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_GetX6GameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, CallFunc_GetInputProcessorHelper_ReturnValue) == 0x0000B0, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::CallFunc_GetInputProcessorHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WBP_MapHud_C_ExecuteUbergraph_WBP_MapHud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.GetIsDragging
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapHud_C_GetIsDragging final
{
public:
	bool                                          isDragging_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_GetIsDragging) == 0x000001, "Wrong alignment on WBP_MapHud_C_GetIsDragging");
static_assert(sizeof(WBP_MapHud_C_GetIsDragging) == 0x000001, "Wrong size on WBP_MapHud_C_GetIsDragging");
static_assert(offsetof(WBP_MapHud_C_GetIsDragging, isDragging_0) == 0x000000, "Member 'WBP_MapHud_C_GetIsDragging::isDragging_0' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.GetMapPos
// 0x0040 (0x0040 - 0x0000)
struct WBP_MapHud_C_GetMapPos final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetWindowSize_size;                       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue;  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_GetMapPos) == 0x000008, "Wrong alignment on WBP_MapHud_C_GetMapPos");
static_assert(sizeof(WBP_MapHud_C_GetMapPos) == 0x000040, "Wrong size on WBP_MapHud_C_GetMapPos");
static_assert(offsetof(WBP_MapHud_C_GetMapPos, Pos) == 0x000000, "Member 'WBP_MapHud_C_GetMapPos::Pos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMapPos, CallFunc_GetWindowSize_size) == 0x000010, "Member 'WBP_MapHud_C_GetMapPos::CallFunc_GetWindowSize_size' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMapPos, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_GetMapPos::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMapPos, CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue) == 0x000030, "Member 'WBP_MapHud_C_GetMapPos::CallFunc_NT_ConvertWindowPosToMapPos_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.GetMapScale
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapHud_C_GetMapScale final
{
public:
	double                                        Scale;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_GetMapScale) == 0x000008, "Wrong alignment on WBP_MapHud_C_GetMapScale");
static_assert(sizeof(WBP_MapHud_C_GetMapScale) == 0x000018, "Wrong size on WBP_MapHud_C_GetMapScale");
static_assert(offsetof(WBP_MapHud_C_GetMapScale, Scale) == 0x000000, "Member 'WBP_MapHud_C_GetMapScale::Scale' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMapScale, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_MapHud_C_GetMapScale::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMapScale, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_MapHud_C_GetMapScale::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.GetMovePos
// 0x0028 (0x0028 - 0x0000)
struct WBP_MapHud_C_GetMovePos final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_GetMovePos) == 0x000008, "Wrong alignment on WBP_MapHud_C_GetMovePos");
static_assert(sizeof(WBP_MapHud_C_GetMovePos) == 0x000028, "Wrong size on WBP_MapHud_C_GetMovePos");
static_assert(offsetof(WBP_MapHud_C_GetMovePos, Pos) == 0x000000, "Member 'WBP_MapHud_C_GetMovePos::Pos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMovePos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_GetMovePos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetMovePos, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WBP_MapHud_C_GetMovePos::CallFunc_GetPosition_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.GetWindowSize
// 0x0058 (0x0058 - 0x0000)
struct WBP_MapHud_C_GetWindowSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0010(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_GetWindowSize) == 0x000008, "Wrong alignment on WBP_MapHud_C_GetWindowSize");
static_assert(sizeof(WBP_MapHud_C_GetWindowSize) == 0x000058, "Wrong size on WBP_MapHud_C_GetWindowSize");
static_assert(offsetof(WBP_MapHud_C_GetWindowSize, Size) == 0x000000, "Member 'WBP_MapHud_C_GetWindowSize::Size' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetWindowSize, CallFunc_GetCachedGeometry_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_GetWindowSize::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_GetWindowSize, CallFunc_GetLocalSize_ReturnValue) == 0x000048, "Member 'WBP_MapHud_C_GetWindowSize::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.HandleMouseButtonUp
// 0x0080 (0x0080 - 0x0000)
struct WBP_MapHud_C_HandleMouseButtonUp final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_HandleMouseButtonUp) == 0x000008, "Wrong alignment on WBP_MapHud_C_HandleMouseButtonUp");
static_assert(sizeof(WBP_MapHud_C_HandleMouseButtonUp) == 0x000080, "Wrong size on WBP_MapHud_C_HandleMouseButtonUp");
static_assert(offsetof(WBP_MapHud_C_HandleMouseButtonUp, MouseEvent) == 0x000000, "Member 'WBP_MapHud_C_HandleMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_HandleMouseButtonUp, ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_HandleMouseButtonUp::ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.HandleMouseMove
// 0x0170 (0x0170 - 0x0000)
struct WBP_MapHud_C_HandleMouseMove final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x007C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_OnMouseMoveCustom_ReturnValue;            // 0x00B8(0x00B8)()
};
static_assert(alignof(WBP_MapHud_C_HandleMouseMove) == 0x000008, "Wrong alignment on WBP_MapHud_C_HandleMouseMove");
static_assert(sizeof(WBP_MapHud_C_HandleMouseMove) == 0x000170, "Wrong size on WBP_MapHud_C_HandleMouseMove");
static_assert(offsetof(WBP_MapHud_C_HandleMouseMove, MouseEvent) == 0x000000, "Member 'WBP_MapHud_C_HandleMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_HandleMouseMove, ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_HandleMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_HandleMouseMove, CallFunc_GetCachedGeometry_ReturnValue) == 0x00007C, "Member 'WBP_MapHud_C_HandleMouseMove::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_HandleMouseMove, CallFunc_OnMouseMoveCustom_ReturnValue) == 0x0000B8, "Member 'WBP_MapHud_C_HandleMouseMove::CallFunc_OnMouseMoveCustom_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.HandlePinchRelease
// 0x0080 (0x0080 - 0x0000)
struct WBP_MapHud_C_HandlePinchRelease final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_HandlePinchRelease) == 0x000008, "Wrong alignment on WBP_MapHud_C_HandlePinchRelease");
static_assert(sizeof(WBP_MapHud_C_HandlePinchRelease) == 0x000080, "Wrong size on WBP_MapHud_C_HandlePinchRelease");
static_assert(offsetof(WBP_MapHud_C_HandlePinchRelease, MouseEvent) == 0x000000, "Member 'WBP_MapHud_C_HandlePinchRelease::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_HandlePinchRelease, ReturnValue) == 0x000078, "Member 'WBP_MapHud_C_HandlePinchRelease::ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.InitPinch
// 0x0038 (0x0038 - 0x0000)
struct WBP_MapHud_C_InitPinch final
{
public:
	TDelegate<void(const struct FPointerEvent& MouseEvent)> K2Node_CreateDelegate_OutputDelegate;    // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UX6GameInstance*                        CallFunc_GetX6GameInstance_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UX6InputProcessorHelper*                CallFunc_GetInputProcessorHelper_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UIPinchHelper_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double ScaleStep)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_InitPinch) == 0x000008, "Wrong alignment on WBP_MapHud_C_InitPinch");
static_assert(sizeof(WBP_MapHud_C_InitPinch) == 0x000038, "Wrong size on WBP_MapHud_C_InitPinch");
static_assert(offsetof(WBP_MapHud_C_InitPinch, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MapHud_C_InitPinch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_InitPinch, CallFunc_GetX6GameInstance_ReturnValue) == 0x000010, "Member 'WBP_MapHud_C_InitPinch::CallFunc_GetX6GameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_InitPinch, CallFunc_GetInputProcessorHelper_ReturnValue) == 0x000018, "Member 'WBP_MapHud_C_InitPinch::CallFunc_GetInputProcessorHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_InitPinch, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'WBP_MapHud_C_InitPinch::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_InitPinch, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_MapHud_C_InitPinch::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.IsMousePointer
// 0x0088 (0x0088 - 0x0000)
struct WBP_MapHud_C_IsMousePointer final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsMouse;                                           // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PointerEvent_GetPointerIndex_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_IsMousePointer) == 0x000008, "Wrong alignment on WBP_MapHud_C_IsMousePointer");
static_assert(sizeof(WBP_MapHud_C_IsMousePointer) == 0x000088, "Wrong size on WBP_MapHud_C_IsMousePointer");
static_assert(offsetof(WBP_MapHud_C_IsMousePointer, MouseEvent) == 0x000000, "Member 'WBP_MapHud_C_IsMousePointer::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMousePointer, IsMouse) == 0x000078, "Member 'WBP_MapHud_C_IsMousePointer::IsMouse' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMousePointer, CallFunc_PointerEvent_GetPointerIndex_ReturnValue) == 0x00007C, "Member 'WBP_MapHud_C_IsMousePointer::CallFunc_PointerEvent_GetPointerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMousePointer, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000080, "Member 'WBP_MapHud_C_IsMousePointer::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.IsMoveRootPosOutOfRange
// 0x0030 (0x0030 - 0x0000)
struct WBP_MapHud_C_IsMoveRootPosOutOfRange final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOut;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOutMinX;                                         // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOutMaxX;                                         // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOutMinY;                                         // 0x0013(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOutMaxY;                                         // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_IsMoveRootPosOutOfRange) == 0x000008, "Wrong alignment on WBP_MapHud_C_IsMoveRootPosOutOfRange");
static_assert(sizeof(WBP_MapHud_C_IsMoveRootPosOutOfRange) == 0x000030, "Wrong size on WBP_MapHud_C_IsMoveRootPosOutOfRange");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, Pos) == 0x000000, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::Pos' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, isOut) == 0x000010, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::isOut' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, isOutMinX) == 0x000011, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::isOutMinX' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, isOutMaxX) == 0x000012, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::isOutMaxX' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, isOutMinY) == 0x000013, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::isOutMinY' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, isOutMaxY) == 0x000014, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::isOutMaxY' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000029, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00002B, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_BooleanOR_ReturnValue_1) == 0x00002C, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00002D, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapHud_C_IsMoveRootPosOutOfRange, CallFunc_BooleanOR_ReturnValue_2) == 0x00002E, "Member 'WBP_MapHud_C_IsMoveRootPosOutOfRange::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.NT_OnPostMoveContentPosition
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapHud_C_NT_OnPostMoveContentPosition final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapHud_C_NT_OnPostMoveContentPosition) == 0x000008, "Wrong alignment on WBP_MapHud_C_NT_OnPostMoveContentPosition");
static_assert(sizeof(WBP_MapHud_C_NT_OnPostMoveContentPosition) == 0x000010, "Wrong size on WBP_MapHud_C_NT_OnPostMoveContentPosition");
static_assert(offsetof(WBP_MapHud_C_NT_OnPostMoveContentPosition, Pos) == 0x000000, "Member 'WBP_MapHud_C_NT_OnPostMoveContentPosition::Pos' has a wrong offset!");

// Function WBP_MapHud.WBP_MapHud_C.OnDragDetected
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_MapHud_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
