#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotUpdate_Message_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HotUpdate_Message_PC.WBP_HotUpdate_Message_PC_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_HotUpdate_Message_PC_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Cancel_C*         BtnCancel;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Confirm_C*        BtnConfirm;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Confirm_C*        BtnOK;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Filter_Img;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherButton;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtDesc;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_PopupBase_C*             WBP_Window;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 NwczionClass;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HotUpdate_Message_PC(int32 EntryPoint);
	void SequenceEvent();
	void StartFadeIn();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HotUpdate_Message_PC_C">();
	}
	static class UWBP_HotUpdate_Message_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HotUpdate_Message_PC_C>();
	}
};
static_assert(alignof(UWBP_HotUpdate_Message_PC_C) == 0x000008, "Wrong alignment on UWBP_HotUpdate_Message_PC_C");
static_assert(sizeof(UWBP_HotUpdate_Message_PC_C) == 0x000350, "Wrong size on UWBP_HotUpdate_Message_PC_C");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HotUpdate_Message_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, FadeOut) == 0x0002F8, "Member 'UWBP_HotUpdate_Message_PC_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, FadeIn) == 0x000300, "Member 'UWBP_HotUpdate_Message_PC_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, BtnCancel) == 0x000308, "Member 'UWBP_HotUpdate_Message_PC_C::BtnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, BtnConfirm) == 0x000310, "Member 'UWBP_HotUpdate_Message_PC_C::BtnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, BtnOK) == 0x000318, "Member 'UWBP_HotUpdate_Message_PC_C::BtnOK' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, Filter_Img) == 0x000320, "Member 'UWBP_HotUpdate_Message_PC_C::Filter_Img' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, RetainerBox_0) == 0x000328, "Member 'UWBP_HotUpdate_Message_PC_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, SwitcherButton) == 0x000330, "Member 'UWBP_HotUpdate_Message_PC_C::SwitcherButton' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, TxtDesc) == 0x000338, "Member 'UWBP_HotUpdate_Message_PC_C::TxtDesc' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, WBP_Window) == 0x000340, "Member 'UWBP_HotUpdate_Message_PC_C::WBP_Window' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Message_PC_C, NwczionClass) == 0x000348, "Member 'UWBP_HotUpdate_Message_PC_C::NwczionClass' has a wrong offset!");

}

