#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FunctionSet_Action_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.ExecuteUbergraph_WBP_FunctionSet_Action_Item
// 0x0028 (0x0028 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_index_1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item) == 0x000008, "Wrong alignment on WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item) == 0x000028, "Wrong size on WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, EntryPoint) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, K2Node_Event_bIsExpanded) == 0x000018, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, K2Node_Event_index_1) == 0x00001C, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item, K2Node_Event_index) == 0x000020, "Member 'WBP_FunctionSet_Action_Item_C_ExecuteUbergraph_WBP_FunctionSet_Action_Item::K2Node_Event_index' has a wrong offset!");

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.OnListItemObjectSetViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong alignment on WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong size on WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex, Index_0) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_OnListItemObjectSetViaIndex::Index_0' has a wrong offset!");

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.OnListItemValueChangedViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong alignment on WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong size on WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex, Index_0) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_OnListItemValueChangedViaIndex::Index_0' has a wrong offset!");

// Function WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_FunctionSet_Action_Item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FunctionSet_Action_Item_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_FunctionSet_Action_Item_C_GetModuleName");
static_assert(sizeof(WBP_FunctionSet_Action_Item_C_GetModuleName) == 0x000010, "Wrong size on WBP_FunctionSet_Action_Item_C_GetModuleName");
static_assert(offsetof(WBP_FunctionSet_Action_Item_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_FunctionSet_Action_Item_C_GetModuleName::ReturnValue' has a wrong offset!");

}

