#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Common_KeyTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Enum_TipsKeyTheme_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Common_KeyTips.WBP_UI_Common_KeyTips_C
// 0x0088 (0x0378 - 0x02F0)
class UWBP_UI_Common_KeyTips_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicEntryBox*                       DynamicEntryBox_Entry;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherTips;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name_Dark;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6InputAction*                         DisplayInputAction;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bForceSimpleIconType;                              // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	Enum_TipsKeyTheme                             KeyTheme;                                          // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextTip;                                           // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UX6InputAction>          ShowInputAction;                                   // 0x0338(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   ShowKey;                                           // 0x0360(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void SetKeyByInputAction(const class FString& ActionPath);
	void SetKey(const struct FKey& Key);
	void RefreshTextTips();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UI_Common_KeyTips(int32 EntryPoint);
	void Construct();
	void BP_SetTips(const class FText& Text);
	void BP_SetJoinDark(bool bJoinDark);
	void BP_SetInputAction(class UX6InputAction* Action, bool bForceSimple);
	void BP_SetEnableState(bool bEnable);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Common_KeyTips_C">();
	}
	static class UWBP_UI_Common_KeyTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Common_KeyTips_C>();
	}
};
static_assert(alignof(UWBP_UI_Common_KeyTips_C) == 0x000008, "Wrong alignment on UWBP_UI_Common_KeyTips_C");
static_assert(sizeof(UWBP_UI_Common_KeyTips_C) == 0x000378, "Wrong size on UWBP_UI_Common_KeyTips_C");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_Common_KeyTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, DynamicEntryBox_Entry) == 0x0002F8, "Member 'UWBP_UI_Common_KeyTips_C::DynamicEntryBox_Entry' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, SwitcherTips) == 0x000300, "Member 'UWBP_UI_Common_KeyTips_C::SwitcherTips' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, Text_Name) == 0x000308, "Member 'UWBP_UI_Common_KeyTips_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, Text_Name_Dark) == 0x000310, "Member 'UWBP_UI_Common_KeyTips_C::Text_Name_Dark' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, DisplayInputAction) == 0x000318, "Member 'UWBP_UI_Common_KeyTips_C::DisplayInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, bForceSimpleIconType) == 0x000320, "Member 'UWBP_UI_Common_KeyTips_C::bForceSimpleIconType' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, KeyTheme) == 0x000321, "Member 'UWBP_UI_Common_KeyTips_C::KeyTheme' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, TextTip) == 0x000328, "Member 'UWBP_UI_Common_KeyTips_C::TextTip' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, ShowInputAction) == 0x000338, "Member 'UWBP_UI_Common_KeyTips_C::ShowInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_C, ShowKey) == 0x000360, "Member 'UWBP_UI_Common_KeyTips_C::ShowKey' has a wrong offset!");

}

