#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_MaterialList_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_MaterialList_Item.WBP_HUD_MaterialList_Item_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_HUD_MaterialList_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num1;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num2;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num3;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ItemSlot_C*                     WBP_UI_ItemSlot;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_HUD_MaterialList_Item(int32 EntryPoint);
	void OnListItemObjectSetViaIndex(int32 Index_0);
	void OnListItemValueChangedViaIndex(int32 Index_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_MaterialList_Item_C">();
	}
	static class UWBP_HUD_MaterialList_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_MaterialList_Item_C>();
	}
};
static_assert(alignof(UWBP_HUD_MaterialList_Item_C) == 0x000008, "Wrong alignment on UWBP_HUD_MaterialList_Item_C");
static_assert(sizeof(UWBP_HUD_MaterialList_Item_C) == 0x000320, "Wrong size on UWBP_HUD_MaterialList_Item_C");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_MaterialList_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, Image_0) == 0x0002F8, "Member 'UWBP_HUD_MaterialList_Item_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, Num1) == 0x000300, "Member 'UWBP_HUD_MaterialList_Item_C::Num1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, Num2) == 0x000308, "Member 'UWBP_HUD_MaterialList_Item_C::Num2' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, Num3) == 0x000310, "Member 'UWBP_HUD_MaterialList_Item_C::Num3' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_Item_C, WBP_UI_ItemSlot) == 0x000318, "Member 'UWBP_HUD_MaterialList_Item_C::WBP_UI_ItemSlot' has a wrong offset!");

}

