#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_headUI_interactiveicon

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_headUI_interactiveicon.WBP_UI_headUI_interactiveicon_C.ExecuteUbergraph_WBP_UI_headUI_interactiveicon
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon) == 0x000004, "Wrong alignment on WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon");
static_assert(sizeof(WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon) == 0x000008, "Wrong size on WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon, EntryPoint) == 0x000000, "Member 'WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon, K2Node_SwitchEnum_CmpSuccess_1) == 0x000005, "Member 'WBP_UI_headUI_interactiveicon_C_ExecuteUbergraph_WBP_UI_headUI_interactiveicon::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WBP_UI_headUI_interactiveicon.WBP_UI_headUI_interactiveicon_C.PlayOutAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_headUI_interactiveicon_C_PlayOutAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_interactiveicon_C_PlayOutAnim) == 0x000008, "Wrong alignment on WBP_UI_headUI_interactiveicon_C_PlayOutAnim");
static_assert(sizeof(WBP_UI_headUI_interactiveicon_C_PlayOutAnim) == 0x000008, "Wrong size on WBP_UI_headUI_interactiveicon_C_PlayOutAnim");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_PlayOutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_headUI_interactiveicon_C_PlayOutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_headUI_interactiveicon.WBP_UI_headUI_interactiveicon_C.PlayShowAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_headUI_interactiveicon_C_PlayShowAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_interactiveicon_C_PlayShowAnim) == 0x000008, "Wrong alignment on WBP_UI_headUI_interactiveicon_C_PlayShowAnim");
static_assert(sizeof(WBP_UI_headUI_interactiveicon_C_PlayShowAnim) == 0x000008, "Wrong size on WBP_UI_headUI_interactiveicon_C_PlayShowAnim");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_PlayShowAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_headUI_interactiveicon_C_PlayShowAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_headUI_interactiveicon.WBP_UI_headUI_interactiveicon_C.SwitchVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_headUI_interactiveicon_C_SwitchVisibility final
{
public:
	ESlateVisibility                              EVisibility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility) == 0x000001, "Wrong alignment on WBP_UI_headUI_interactiveicon_C_SwitchVisibility");
static_assert(sizeof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility) == 0x000004, "Wrong size on WBP_UI_headUI_interactiveicon_C_SwitchVisibility");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility, EVisibility) == 0x000000, "Member 'WBP_UI_headUI_interactiveicon_C_SwitchVisibility::EVisibility' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_UI_headUI_interactiveicon_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess_1) == 0x000002, "Member 'WBP_UI_headUI_interactiveicon_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_interactiveicon_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess_2) == 0x000003, "Member 'WBP_UI_headUI_interactiveicon_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

}

