#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_MaterialList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_MaterialList.WBP_HUD_MaterialList_C
// 0x00D8 (0x03C8 - 0x02F0)
class UWBP_HUD_MaterialList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Finish;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Complete;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Complete_1;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Name;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_OpenDesign;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_finish;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Glow;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_Hover;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_Normal;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Clothes_Icon;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dec_Complete;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dec_Complete_1;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fragranc_Icon;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_Btn_fadein;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Material_List;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Complete;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Complete_1;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Hint;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_PC_C*            WBP_UI_Common_KeyTips_PC;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Arrow;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_State;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6TileView*                            X6Data;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_MaterialList_Button_Name_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HUD_MaterialList_Button_Name_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HUD_MaterialList(int32 EntryPoint);
	void Get_Text_Complete_Text();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_MaterialList_C">();
	}
	static class UWBP_HUD_MaterialList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_MaterialList_C>();
	}
};
static_assert(alignof(UWBP_HUD_MaterialList_C) == 0x000008, "Wrong alignment on UWBP_HUD_MaterialList_C");
static_assert(sizeof(UWBP_HUD_MaterialList_C) == 0x0003C8, "Wrong size on UWBP_HUD_MaterialList_C");
static_assert(offsetof(UWBP_HUD_MaterialList_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_MaterialList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Anim_Finish) == 0x0002F8, "Member 'UWBP_HUD_MaterialList_C::Anim_Finish' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Button_Complete) == 0x000300, "Member 'UWBP_HUD_MaterialList_C::Button_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Button_Complete_1) == 0x000308, "Member 'UWBP_HUD_MaterialList_C::Button_Complete_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Button_Name) == 0x000310, "Member 'UWBP_HUD_MaterialList_C::Button_Name' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Button_OpenDesign) == 0x000318, "Member 'UWBP_HUD_MaterialList_C::Button_OpenDesign' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Fx_finish) == 0x000320, "Member 'UWBP_HUD_MaterialList_C::Fx_finish' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Fx_Glow) == 0x000328, "Member 'UWBP_HUD_MaterialList_C::Fx_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Arrow_Hover) == 0x000330, "Member 'UWBP_HUD_MaterialList_C::Image_Arrow_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Arrow_Normal) == 0x000338, "Member 'UWBP_HUD_MaterialList_C::Image_Arrow_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Clothes_Icon) == 0x000340, "Member 'UWBP_HUD_MaterialList_C::Image_Clothes_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Dec_Complete) == 0x000348, "Member 'UWBP_HUD_MaterialList_C::Image_Dec_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Dec_Complete_1) == 0x000350, "Member 'UWBP_HUD_MaterialList_C::Image_Dec_Complete_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Image_Fragranc_Icon) == 0x000358, "Member 'UWBP_HUD_MaterialList_C::Image_Fragranc_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, NS_Btn_fadein) == 0x000360, "Member 'UWBP_HUD_MaterialList_C::NS_Btn_fadein' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, RetainerBox_Material_List) == 0x000368, "Member 'UWBP_HUD_MaterialList_C::RetainerBox_Material_List' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Text) == 0x000370, "Member 'UWBP_HUD_MaterialList_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Text_Complete) == 0x000378, "Member 'UWBP_HUD_MaterialList_C::Text_Complete' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Text_Complete_1) == 0x000380, "Member 'UWBP_HUD_MaterialList_C::Text_Complete_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Text_Hint) == 0x000388, "Member 'UWBP_HUD_MaterialList_C::Text_Hint' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, Text_Name) == 0x000390, "Member 'UWBP_HUD_MaterialList_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, WBP_UI_Common_KeyTips_PC) == 0x000398, "Member 'UWBP_HUD_MaterialList_C::WBP_UI_Common_KeyTips_PC' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, WidgetSwitcher_Arrow) == 0x0003A0, "Member 'UWBP_HUD_MaterialList_C::WidgetSwitcher_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, WidgetSwitcher_Content) == 0x0003A8, "Member 'UWBP_HUD_MaterialList_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, WidgetSwitcher_Icon) == 0x0003B0, "Member 'UWBP_HUD_MaterialList_C::WidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, WidgetSwitcher_State) == 0x0003B8, "Member 'UWBP_HUD_MaterialList_C::WidgetSwitcher_State' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_MaterialList_C, X6Data) == 0x0003C0, "Member 'UWBP_HUD_MaterialList_C::X6Data' has a wrong offset!");

}

