#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_TopRightArea

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_TopRightArea.WBP_HUD_TopRightArea_C.ExecuteUbergraph_WBP_HUD_TopRightArea
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea) == 0x000008, "Wrong alignment on WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea");
static_assert(sizeof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea) == 0x000020, "Wrong size on WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea");
static_assert(offsetof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea, EntryPoint) == 0x000000, "Member 'WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_HUD_TopRightArea_C_ExecuteUbergraph_WBP_HUD_TopRightArea::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_TopRightArea.WBP_HUD_TopRightArea_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_TopRightArea_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_TopRightArea_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HUD_TopRightArea_C_PreConstruct");
static_assert(sizeof(WBP_HUD_TopRightArea_C_PreConstruct) == 0x000001, "Wrong size on WBP_HUD_TopRightArea_C_PreConstruct");
static_assert(offsetof(WBP_HUD_TopRightArea_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HUD_TopRightArea_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HUD_TopRightArea.WBP_HUD_TopRightArea_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_TopRightArea_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_TopRightArea_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_HUD_TopRightArea_C_GetModuleName");
static_assert(sizeof(WBP_HUD_TopRightArea_C_GetModuleName) == 0x000010, "Wrong size on WBP_HUD_TopRightArea_C_GetModuleName");
static_assert(offsetof(WBP_HUD_TopRightArea_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_HUD_TopRightArea_C_GetModuleName::ReturnValue' has a wrong offset!");

}

