#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Common_SingleKey

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_TipsKeyTheme_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Common_SingleKey.WBP_UI_Common_SingleKey_C
// 0x00C0 (0x03B0 - 0x02F0)
class UWBP_UI_Common_SingleKey_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg_Console;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_PC;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CDProgress;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ControlButtonBg_Img;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_Console_Progress;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_PC_Progress;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Console;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_PC;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Dark;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Press;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_White;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Console;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_PC;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_KeyName;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_And;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Join;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Or;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PC_Icon;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6InputAction*                         DisplayInputAction;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	Enum_TipsKeyTheme                             KeyTheme;                                          // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextTip;                                           // 0x03A0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UI_Common_SingleKey(int32 EntryPoint);
	void BP_CreateProgressMat(bool bConsole, class UMaterialInstanceDynamic** Mat);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Common_SingleKey_C">();
	}
	static class UWBP_UI_Common_SingleKey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Common_SingleKey_C>();
	}
};
static_assert(alignof(UWBP_UI_Common_SingleKey_C) == 0x000008, "Wrong alignment on UWBP_UI_Common_SingleKey_C");
static_assert(sizeof(UWBP_UI_Common_SingleKey_C) == 0x0003B0, "Wrong size on UWBP_UI_Common_SingleKey_C");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_Common_SingleKey_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Bg_Console) == 0x0002F8, "Member 'UWBP_UI_Common_SingleKey_C::Bg_Console' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Bg_PC) == 0x000300, "Member 'UWBP_UI_Common_SingleKey_C::Bg_PC' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, CDProgress) == 0x000308, "Member 'UWBP_UI_Common_SingleKey_C::CDProgress' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, ControlButtonBg_Img) == 0x000310, "Member 'UWBP_UI_Common_SingleKey_C::ControlButtonBg_Img' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, CP_Console_Progress) == 0x000318, "Member 'UWBP_UI_Common_SingleKey_C::CP_Console_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, CP_PC_Progress) == 0x000320, "Member 'UWBP_UI_Common_SingleKey_C::CP_PC_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Image_Icon_Console) == 0x000328, "Member 'UWBP_UI_Common_SingleKey_C::Image_Icon_Console' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Image_Icon_PC) == 0x000330, "Member 'UWBP_UI_Common_SingleKey_C::Image_Icon_PC' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, img_Dark) == 0x000338, "Member 'UWBP_UI_Common_SingleKey_C::img_Dark' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Img_Press) == 0x000340, "Member 'UWBP_UI_Common_SingleKey_C::Img_Press' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, img_White) == 0x000348, "Member 'UWBP_UI_Common_SingleKey_C::img_White' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Progress_Console) == 0x000350, "Member 'UWBP_UI_Common_SingleKey_C::Progress_Console' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Progress_PC) == 0x000358, "Member 'UWBP_UI_Common_SingleKey_C::Progress_PC' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, Text_KeyName) == 0x000360, "Member 'UWBP_UI_Common_SingleKey_C::Text_KeyName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, WidgetSwitcher_And) == 0x000368, "Member 'UWBP_UI_Common_SingleKey_C::WidgetSwitcher_And' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, WidgetSwitcher_Icon) == 0x000370, "Member 'UWBP_UI_Common_SingleKey_C::WidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, WidgetSwitcher_Join) == 0x000378, "Member 'UWBP_UI_Common_SingleKey_C::WidgetSwitcher_Join' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, WidgetSwitcher_Or) == 0x000380, "Member 'UWBP_UI_Common_SingleKey_C::WidgetSwitcher_Or' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, WidgetSwitcher_PC_Icon) == 0x000388, "Member 'UWBP_UI_Common_SingleKey_C::WidgetSwitcher_PC_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, DisplayInputAction) == 0x000390, "Member 'UWBP_UI_Common_SingleKey_C::DisplayInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, KeyTheme) == 0x000398, "Member 'UWBP_UI_Common_SingleKey_C::KeyTheme' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_SingleKey_C, TextTip) == 0x0003A0, "Member 'UWBP_UI_Common_SingleKey_C::TextTip' has a wrong offset!");

}

