#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_headUI_icon

#include "Basic.hpp"

#include "EHeadUIState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_headUI_icon.WBP_UI_headUI_icon_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_UI_headUI_icon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       bubble_out;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       bubble_in;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 sys_icon;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHeadUIState                                  CurrentShowState;                                  // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeadUIState                                  NextShowState;                                     // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UI_headUI_icon(int32 EntryPoint);
	void PlayIdleAnim();
	void PlayOutAnim();
	void PlayShowAnim();
	void RefreshAnimState();
	void StopIdleAnim();
	void SwitchVisibility(ESlateVisibility EVisibility);
	void WidgetAnimationEvt_bubble_in_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_bubble_out_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_headUI_icon_C">();
	}
	static class UWBP_UI_headUI_icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_headUI_icon_C>();
	}
};
static_assert(alignof(UWBP_UI_headUI_icon_C) == 0x000008, "Wrong alignment on UWBP_UI_headUI_icon_C");
static_assert(sizeof(UWBP_UI_headUI_icon_C) == 0x000318, "Wrong size on UWBP_UI_headUI_icon_C");
static_assert(offsetof(UWBP_UI_headUI_icon_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_headUI_icon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_icon_C, bubble_out) == 0x0002F8, "Member 'UWBP_UI_headUI_icon_C::bubble_out' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_icon_C, bubble_in) == 0x000300, "Member 'UWBP_UI_headUI_icon_C::bubble_in' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_icon_C, sys_icon) == 0x000308, "Member 'UWBP_UI_headUI_icon_C::sys_icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_icon_C, CurrentShowState) == 0x000310, "Member 'UWBP_UI_headUI_icon_C::CurrentShowState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_icon_C, NextShowState) == 0x000311, "Member 'UWBP_UI_headUI_icon_C::NextShowState' has a wrong offset!");

}

