#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_MaterialList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_MaterialList.WBP_HUD_MaterialList_C.ExecuteUbergraph_WBP_HUD_MaterialList
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList) == 0x000004, "Wrong alignment on WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList");
static_assert(sizeof(WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList) == 0x000004, "Wrong size on WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList");
static_assert(offsetof(WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList, EntryPoint) == 0x000000, "Member 'WBP_HUD_MaterialList_C_ExecuteUbergraph_WBP_HUD_MaterialList::EntryPoint' has a wrong offset!");

// Function WBP_HUD_MaterialList.WBP_HUD_MaterialList_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_MaterialList_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_MaterialList_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_HUD_MaterialList_C_GetModuleName");
static_assert(sizeof(WBP_HUD_MaterialList_C_GetModuleName) == 0x000010, "Wrong size on WBP_HUD_MaterialList_C_GetModuleName");
static_assert(offsetof(WBP_HUD_MaterialList_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_HUD_MaterialList_C_GetModuleName::ReturnValue' has a wrong offset!");

}

