#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Common_KeyTips_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_TipsKeyTheme_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Common_KeyTips_Entry.WBP_UI_Common_KeyTips_Entry_C
// 0x0038 (0x0328 - 0x02F0)
class UWBP_UI_Common_KeyTips_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicEntryBox*                       DynamicEntryBox_KeyWithJoin;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6InputAction*                         DisplayInputAction;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bForceSimpleIconType;                              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	Enum_TipsKeyTheme                             KeyTheme;                                          // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextTip;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void SetKeyByInputAction(const class FString& ActionPath);
	void SetKey(const struct FKey& Key);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UI_Common_KeyTips_Entry(int32 EntryPoint);
	void BP_SetJoinDark(bool bJoinDark);
	void BP_SetInputAction(class UX6InputAction* Action, bool bForceSimple);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Common_KeyTips_Entry_C">();
	}
	static class UWBP_UI_Common_KeyTips_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Common_KeyTips_Entry_C>();
	}
};
static_assert(alignof(UWBP_UI_Common_KeyTips_Entry_C) == 0x000008, "Wrong alignment on UWBP_UI_Common_KeyTips_Entry_C");
static_assert(sizeof(UWBP_UI_Common_KeyTips_Entry_C) == 0x000328, "Wrong size on UWBP_UI_Common_KeyTips_Entry_C");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_Common_KeyTips_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, DynamicEntryBox_KeyWithJoin) == 0x0002F8, "Member 'UWBP_UI_Common_KeyTips_Entry_C::DynamicEntryBox_KeyWithJoin' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, InvalidationBox_0) == 0x000300, "Member 'UWBP_UI_Common_KeyTips_Entry_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, DisplayInputAction) == 0x000308, "Member 'UWBP_UI_Common_KeyTips_Entry_C::DisplayInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, bForceSimpleIconType) == 0x000310, "Member 'UWBP_UI_Common_KeyTips_Entry_C::bForceSimpleIconType' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, KeyTheme) == 0x000311, "Member 'UWBP_UI_Common_KeyTips_Entry_C::KeyTheme' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_Entry_C, TextTip) == 0x000318, "Member 'UWBP_UI_Common_KeyTips_Entry_C::TextTip' has a wrong offset!");

}

