#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_TaskList_Tab_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_TaskList_Tab_Item.WBP_HUD_TaskList_Tab_Item_C
// 0x0070 (0x0360 - 0x02F0)
class UWBP_HUD_TaskList_Tab_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_Photo;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg_Icon_Hover;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Icon_Select;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Touch;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Image_Star;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Image_Star_1;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Select_Image_Glow;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Hover;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Normal;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Select;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_SelectPhoto;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_RedPoint_C*                     WBP_UI_RedPoint;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_TaskList_Tab_Item_Button_Touch_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HUD_TaskList_Tab_Item_Button_Touch_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_TaskList_Tab_Item_C">();
	}
	static class UWBP_HUD_TaskList_Tab_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_TaskList_Tab_Item_C>();
	}
};
static_assert(alignof(UWBP_HUD_TaskList_Tab_Item_C) == 0x000008, "Wrong alignment on UWBP_HUD_TaskList_Tab_Item_C");
static_assert(sizeof(UWBP_HUD_TaskList_Tab_Item_C) == 0x000360, "Wrong size on UWBP_HUD_TaskList_Tab_Item_C");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_TaskList_Tab_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, FadeIn_Photo) == 0x0002F8, "Member 'UWBP_HUD_TaskList_Tab_Item_C::FadeIn_Photo' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Bg_Icon_Hover) == 0x000300, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Bg_Icon_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Bg_Icon_Select) == 0x000308, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Bg_Icon_Select' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Button_Touch) == 0x000310, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Button_Touch' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Fx_Image_Star) == 0x000318, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Fx_Image_Star' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Fx_Image_Star_1) == 0x000320, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Fx_Image_Star_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, FX_Select_Image_Glow) == 0x000328, "Member 'UWBP_HUD_TaskList_Tab_Item_C::FX_Select_Image_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Image_Icon_Hover) == 0x000330, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Image_Icon_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Image_Icon_Normal) == 0x000338, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Image_Icon_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, Image_Icon_Select) == 0x000340, "Member 'UWBP_HUD_TaskList_Tab_Item_C::Image_Icon_Select' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, UI_NS_SelectPhoto) == 0x000348, "Member 'UWBP_HUD_TaskList_Tab_Item_C::UI_NS_SelectPhoto' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, WBP_UI_RedPoint) == 0x000350, "Member 'UWBP_HUD_TaskList_Tab_Item_C::WBP_UI_RedPoint' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_Tab_Item_C, WidgetSwitcher) == 0x000358, "Member 'UWBP_HUD_TaskList_Tab_Item_C::WidgetSwitcher' has a wrong offset!");

}

