#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_UseProps_ListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C
// 0x00B8 (0x03A8 - 0x02F0)
class UWBP_HUD_UseProps_ListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Pressed;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover_Console;                                 // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover;                                         // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Item;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Mark;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pressed;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Select;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Time;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               KeyTips_Use;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Num;                                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Put_1;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Put_2;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Index;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_Num;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Time;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FunctionSet_Action_Item_C*         WBP_FunctionSet_Action_Item;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_CommonSlot_Mobile_C*           WBP_HUD_CommonSlot_Mobile;                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LimitColor;                                        // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_UseProps_ListItem_Button_Item_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_ListItem_Button_Item_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_PanelItem_PC_Button_Item_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_PanelItem_PC_Button_Item_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_HUD_UseProps_ListItem(int32 EntryPoint);
	void OnListItemObjectSetViaIndex(int32 Index_0);
	void OnListItemValueChangedViaIndex(int32 Index_0);
	void PreConstruct(bool IsDesignTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_UseProps_ListItem_C">();
	}
	static class UWBP_HUD_UseProps_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_UseProps_ListItem_C>();
	}
};
static_assert(alignof(UWBP_HUD_UseProps_ListItem_C) == 0x000008, "Wrong alignment on UWBP_HUD_UseProps_ListItem_C");
static_assert(sizeof(UWBP_HUD_UseProps_ListItem_C) == 0x0003A8, "Wrong size on UWBP_HUD_UseProps_ListItem_C");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_UseProps_ListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Ani_Pressed) == 0x0002F8, "Member 'UWBP_HUD_UseProps_ListItem_C::Ani_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Ani_Hover_Console) == 0x000300, "Member 'UWBP_HUD_UseProps_ListItem_C::Ani_Hover_Console' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Ani_Hover) == 0x000308, "Member 'UWBP_HUD_UseProps_ListItem_C::Ani_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Button_Item) == 0x000310, "Member 'UWBP_HUD_UseProps_ListItem_C::Button_Item' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Image_Hover) == 0x000318, "Member 'UWBP_HUD_UseProps_ListItem_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Image_Mark) == 0x000320, "Member 'UWBP_HUD_UseProps_ListItem_C::Image_Mark' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Image_Pressed) == 0x000328, "Member 'UWBP_HUD_UseProps_ListItem_C::Image_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Image_Select) == 0x000330, "Member 'UWBP_HUD_UseProps_ListItem_C::Image_Select' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Img_Time) == 0x000338, "Member 'UWBP_HUD_UseProps_ListItem_C::Img_Time' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, KeyTips_Use) == 0x000340, "Member 'UWBP_HUD_UseProps_ListItem_C::KeyTips_Use' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Num) == 0x000348, "Member 'UWBP_HUD_UseProps_ListItem_C::Num' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Put_1) == 0x000350, "Member 'UWBP_HUD_UseProps_ListItem_C::Put_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Put_2) == 0x000358, "Member 'UWBP_HUD_UseProps_ListItem_C::Put_2' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, RetainerBox) == 0x000360, "Member 'UWBP_HUD_UseProps_ListItem_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, RetainerBox_0) == 0x000368, "Member 'UWBP_HUD_UseProps_ListItem_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Text_Index) == 0x000370, "Member 'UWBP_HUD_UseProps_ListItem_C::Text_Index' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Text_Num) == 0x000378, "Member 'UWBP_HUD_UseProps_ListItem_C::Text_Num' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, Time) == 0x000380, "Member 'UWBP_HUD_UseProps_ListItem_C::Time' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, WBP_FunctionSet_Action_Item) == 0x000388, "Member 'UWBP_HUD_UseProps_ListItem_C::WBP_FunctionSet_Action_Item' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, WBP_HUD_CommonSlot_Mobile) == 0x000390, "Member 'UWBP_HUD_UseProps_ListItem_C::WBP_HUD_CommonSlot_Mobile' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, WidgetSwitcher) == 0x000398, "Member 'UWBP_HUD_UseProps_ListItem_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_ListItem_C, LimitColor) == 0x0003A0, "Member 'UWBP_HUD_UseProps_ListItem_C::LimitColor' has a wrong offset!");

}

