#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_First_Login_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_First_Login_PC.WBP_First_Login_PC_C
// 0x0128 (0x0418 - 0x02F0)
class UWBP_First_Login_PC_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_OpenWnd;                                       // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnSel_SignupBtn;                                  // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BtnAgeTips;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnEnterGame;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HotUpdate_Button_Confirm_C*        BtnLogin;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnMute;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnNetwork;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnPrivacy;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnQuit;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnSwitchAccount;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BtnVoice;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Filter_Img;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_enlighten;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_enlighten_oversea;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgAgeTips_5;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgAgeTips_6;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgAgeTips_7;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgAgeTips_8;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgAgeTips_9;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgSplash;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgSplashBG;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginState;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal_Img;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PanelSplash;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_BtnVoice;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherAge;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherRegion;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtGameVersion;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Change;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Normal_Loop;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 AgeTipsClass;                                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PrivacyClass;                                      // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MessageClass;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       PlayerSplash;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_First_Login_PC(int32 EntryPoint);
	void OnInitialized();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_First_Login_PC_C">();
	}
	static class UWBP_First_Login_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_First_Login_PC_C>();
	}
};
static_assert(alignof(UWBP_First_Login_PC_C) == 0x000008, "Wrong alignment on UWBP_First_Login_PC_C");
static_assert(sizeof(UWBP_First_Login_PC_C) == 0x000418, "Wrong size on UWBP_First_Login_PC_C");
static_assert(offsetof(UWBP_First_Login_PC_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_First_Login_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, FadeIn) == 0x0002F8, "Member 'UWBP_First_Login_PC_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, FadeOut) == 0x000300, "Member 'UWBP_First_Login_PC_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Ani_OpenWnd) == 0x000308, "Member 'UWBP_First_Login_PC_C::Ani_OpenWnd' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnSel_SignupBtn) == 0x000310, "Member 'UWBP_First_Login_PC_C::BtnSel_SignupBtn' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnAgeTips) == 0x000318, "Member 'UWBP_First_Login_PC_C::BtnAgeTips' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnEnterGame) == 0x000320, "Member 'UWBP_First_Login_PC_C::BtnEnterGame' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnLogin) == 0x000328, "Member 'UWBP_First_Login_PC_C::BtnLogin' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnMute) == 0x000330, "Member 'UWBP_First_Login_PC_C::BtnMute' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnNetwork) == 0x000338, "Member 'UWBP_First_Login_PC_C::BtnNetwork' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnPrivacy) == 0x000340, "Member 'UWBP_First_Login_PC_C::BtnPrivacy' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnQuit) == 0x000348, "Member 'UWBP_First_Login_PC_C::BtnQuit' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnSwitchAccount) == 0x000350, "Member 'UWBP_First_Login_PC_C::BtnSwitchAccount' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, BtnVoice) == 0x000358, "Member 'UWBP_First_Login_PC_C::BtnVoice' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Filter_Img) == 0x000360, "Member 'UWBP_First_Login_PC_C::Filter_Img' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Image_enlighten) == 0x000368, "Member 'UWBP_First_Login_PC_C::Image_enlighten' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Image_enlighten_oversea) == 0x000370, "Member 'UWBP_First_Login_PC_C::Image_enlighten_oversea' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgAgeTips_5) == 0x000378, "Member 'UWBP_First_Login_PC_C::ImgAgeTips_5' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgAgeTips_6) == 0x000380, "Member 'UWBP_First_Login_PC_C::ImgAgeTips_6' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgAgeTips_7) == 0x000388, "Member 'UWBP_First_Login_PC_C::ImgAgeTips_7' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgAgeTips_8) == 0x000390, "Member 'UWBP_First_Login_PC_C::ImgAgeTips_8' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgAgeTips_9) == 0x000398, "Member 'UWBP_First_Login_PC_C::ImgAgeTips_9' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgSplash) == 0x0003A0, "Member 'UWBP_First_Login_PC_C::ImgSplash' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, ImgSplashBG) == 0x0003A8, "Member 'UWBP_First_Login_PC_C::ImgSplashBG' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, LoginState) == 0x0003B0, "Member 'UWBP_First_Login_PC_C::LoginState' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Normal_Img) == 0x0003B8, "Member 'UWBP_First_Login_PC_C::Normal_Img' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, PanelSplash) == 0x0003C0, "Member 'UWBP_First_Login_PC_C::PanelSplash' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, Switcher_BtnVoice) == 0x0003C8, "Member 'UWBP_First_Login_PC_C::Switcher_BtnVoice' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, SwitcherAge) == 0x0003D0, "Member 'UWBP_First_Login_PC_C::SwitcherAge' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, SwitcherRegion) == 0x0003D8, "Member 'UWBP_First_Login_PC_C::SwitcherRegion' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, TxtGameVersion) == 0x0003E0, "Member 'UWBP_First_Login_PC_C::TxtGameVersion' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, UI_NS_Change) == 0x0003E8, "Member 'UWBP_First_Login_PC_C::UI_NS_Change' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, UI_NS_Normal_Loop) == 0x0003F0, "Member 'UWBP_First_Login_PC_C::UI_NS_Normal_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, AgeTipsClass) == 0x0003F8, "Member 'UWBP_First_Login_PC_C::AgeTipsClass' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, PrivacyClass) == 0x000400, "Member 'UWBP_First_Login_PC_C::PrivacyClass' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, MessageClass) == 0x000408, "Member 'UWBP_First_Login_PC_C::MessageClass' has a wrong offset!");
static_assert(offsetof(UWBP_First_Login_PC_C, PlayerSplash) == 0x000410, "Member 'UWBP_First_Login_PC_C::PlayerSplash' has a wrong offset!");

}

