#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dlg_Subtitles_DlgType_V3

#include "Basic.hpp"

#include "F_LocalizationSettings_structs.hpp"
#include "ESubtitleShowEffectType_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dlg_Subtitles_DlgType_V3.WBP_Dlg_Subtitles_DlgType_V3_C.BP_UpdateSubtitlesData
// 0x0080 (0x0080 - 0x0000)
struct WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Name_0;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   SpeakerTag;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubtitleShowEffectType                       ShowEffect;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpakerNameLen;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FF_LocalizationSettings                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData) == 0x000008, "Wrong alignment on WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData");
static_assert(sizeof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData) == 0x000080, "Wrong size on WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, Text) == 0x000000, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::Text' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, Name_0) == 0x000010, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, SpeakerTag) == 0x000020, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::SpeakerTag' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, ShowEffect) == 0x000028, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::ShowEffect' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, SpakerNameLen) == 0x00002C, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::SpakerNameLen' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_GetCurrentCulture_ReturnValue) == 0x000038, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_Left_ReturnValue) == 0x000048, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_Conv_StringToName_ReturnValue) == 0x000058, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'WBP_Dlg_Subtitles_DlgType_V3_C_BP_UpdateSubtitlesData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

