#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_NPC_NewsHint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_NPC_NewsHint.WBP_HUD_NPC_NewsHint_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_HUD_NPC_NewsHint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop_Arrow;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Chat;                                       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut_Chat;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UX6MultiPlatformButton*                 Button_Click;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Content;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_Entry_C*         KeyTip_Chat;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_Describe;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Friends_Head_C*                    WBP_Common_HeadFrame;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              KeyTip;                                            // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUD_NPC_NewsHint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_NPC_NewsHint_C">();
	}
	static class UWBP_HUD_NPC_NewsHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_NPC_NewsHint_C>();
	}
};
static_assert(alignof(UWBP_HUD_NPC_NewsHint_C) == 0x000008, "Wrong alignment on UWBP_HUD_NPC_NewsHint_C");
static_assert(sizeof(UWBP_HUD_NPC_NewsHint_C) == 0x000350, "Wrong size on UWBP_HUD_NPC_NewsHint_C");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_NPC_NewsHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, Loop_Arrow) == 0x0002F8, "Member 'UWBP_HUD_NPC_NewsHint_C::Loop_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, FadeIn_Chat) == 0x000300, "Member 'UWBP_HUD_NPC_NewsHint_C::FadeIn_Chat' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, FadeOut_Chat) == 0x000308, "Member 'UWBP_HUD_NPC_NewsHint_C::FadeOut_Chat' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, Button_Click) == 0x000310, "Member 'UWBP_HUD_NPC_NewsHint_C::Button_Click' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, CanvasPanel_0) == 0x000318, "Member 'UWBP_HUD_NPC_NewsHint_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, CanvasPanel_Content) == 0x000320, "Member 'UWBP_HUD_NPC_NewsHint_C::CanvasPanel_Content' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, Image_Arrow) == 0x000328, "Member 'UWBP_HUD_NPC_NewsHint_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, KeyTip_Chat) == 0x000330, "Member 'UWBP_HUD_NPC_NewsHint_C::KeyTip_Chat' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, Text_Describe) == 0x000338, "Member 'UWBP_HUD_NPC_NewsHint_C::Text_Describe' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, WBP_Common_HeadFrame) == 0x000340, "Member 'UWBP_HUD_NPC_NewsHint_C::WBP_Common_HeadFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_NPC_NewsHint_C, KeyTip) == 0x000348, "Member 'UWBP_HUD_NPC_NewsHint_C::KeyTip' has a wrong offset!");

}

