#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_MoneyListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_MoneyListItem.WBP_UI_HUD_MoneyListItem_C
// 0x0100 (0x03F0 - 0x02F0)
class UWBP_UI_HUD_MoneyListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Deduct_Ani;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fly4;                                              // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fly3;                                              // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fly2;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fly1;                                              // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetGold_02;                                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HuDieJie;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetGold;                                           // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_TestAddGold;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_TestSetGold;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_SetGold;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_ImageIcon;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_ImageIcon_HuDieJie;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_243;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageIcon;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetMoney;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetMoney_1;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetMoney_2;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetMoney_3;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NS_GetMoney_02;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num;                                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               FlyAnimArray;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         flyIndex;                                          // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       currentFlyAnim;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          hasInited;                                         // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BP_SetGoldMaxDuration;                             // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_SetGoldMinDuration;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_SetGoldPerCoinDuration;                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_SetGoldDoneDurationOffset;                      // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddGoldWithEffect(int32 gold);
	void BndEvt__WBP_UI_HUD_MoneyListItem_Button_124_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_UI_HUD_MoneyListItem_Button_TestSetGold_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_UI_HUD_MoneyListItem(int32 EntryPoint);
	void Init();
	void PendingAddGold(int32 gold);
	void PlayHitGoldEffect();
	void PlaySetDoneEffect();
	void PreAddGoldWithEffect();
	void SetGoldWithEffect(int32 gold);
	void TestAddGold();
	void TestSetGold(int32 gold);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_MoneyListItem_C">();
	}
	static class UWBP_UI_HUD_MoneyListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_MoneyListItem_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_MoneyListItem_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_MoneyListItem_C");
static_assert(sizeof(UWBP_UI_HUD_MoneyListItem_C) == 0x0003F0, "Wrong size on UWBP_UI_HUD_MoneyListItem_C");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_HUD_MoneyListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Deduct_Ani) == 0x0002F8, "Member 'UWBP_UI_HUD_MoneyListItem_C::Deduct_Ani' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Fly4) == 0x000300, "Member 'UWBP_UI_HUD_MoneyListItem_C::Fly4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Fly3) == 0x000308, "Member 'UWBP_UI_HUD_MoneyListItem_C::Fly3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Fly2) == 0x000310, "Member 'UWBP_UI_HUD_MoneyListItem_C::Fly2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Fly1) == 0x000318, "Member 'UWBP_UI_HUD_MoneyListItem_C::Fly1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, GetGold_02) == 0x000320, "Member 'UWBP_UI_HUD_MoneyListItem_C::GetGold_02' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, HuDieJie) == 0x000328, "Member 'UWBP_UI_HUD_MoneyListItem_C::HuDieJie' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, GetGold) == 0x000330, "Member 'UWBP_UI_HUD_MoneyListItem_C::GetGold' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Button_TestAddGold) == 0x000338, "Member 'UWBP_UI_HUD_MoneyListItem_C::Button_TestAddGold' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Button_TestSetGold) == 0x000340, "Member 'UWBP_UI_HUD_MoneyListItem_C::Button_TestSetGold' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, EditableTextBox_SetGold) == 0x000348, "Member 'UWBP_UI_HUD_MoneyListItem_C::EditableTextBox_SetGold' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, FX_ImageIcon) == 0x000350, "Member 'UWBP_UI_HUD_MoneyListItem_C::FX_ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, FX_ImageIcon_HuDieJie) == 0x000358, "Member 'UWBP_UI_HUD_MoneyListItem_C::FX_ImageIcon_HuDieJie' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Image_90) == 0x000360, "Member 'UWBP_UI_HUD_MoneyListItem_C::Image_90' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Image_243) == 0x000368, "Member 'UWBP_UI_HUD_MoneyListItem_C::Image_243' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, ImageIcon) == 0x000370, "Member 'UWBP_UI_HUD_MoneyListItem_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NS_GetMoney) == 0x000378, "Member 'UWBP_UI_HUD_MoneyListItem_C::NS_GetMoney' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NS_GetMoney_1) == 0x000380, "Member 'UWBP_UI_HUD_MoneyListItem_C::NS_GetMoney_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NS_GetMoney_2) == 0x000388, "Member 'UWBP_UI_HUD_MoneyListItem_C::NS_GetMoney_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NS_GetMoney_3) == 0x000390, "Member 'UWBP_UI_HUD_MoneyListItem_C::NS_GetMoney_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NS_GetMoney_02) == 0x000398, "Member 'UWBP_UI_HUD_MoneyListItem_C::NS_GetMoney_02' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, Num) == 0x0003A0, "Member 'UWBP_UI_HUD_MoneyListItem_C::Num' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, FlyAnimArray) == 0x0003A8, "Member 'UWBP_UI_HUD_MoneyListItem_C::FlyAnimArray' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, flyIndex) == 0x0003B8, "Member 'UWBP_UI_HUD_MoneyListItem_C::flyIndex' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, currentFlyAnim) == 0x0003C0, "Member 'UWBP_UI_HUD_MoneyListItem_C::currentFlyAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, hasInited) == 0x0003C8, "Member 'UWBP_UI_HUD_MoneyListItem_C::hasInited' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, NewVar_0) == 0x0003C9, "Member 'UWBP_UI_HUD_MoneyListItem_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, BP_SetGoldMaxDuration) == 0x0003D0, "Member 'UWBP_UI_HUD_MoneyListItem_C::BP_SetGoldMaxDuration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, BP_SetGoldMinDuration) == 0x0003D8, "Member 'UWBP_UI_HUD_MoneyListItem_C::BP_SetGoldMinDuration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, BP_SetGoldPerCoinDuration) == 0x0003E0, "Member 'UWBP_UI_HUD_MoneyListItem_C::BP_SetGoldPerCoinDuration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_MoneyListItem_C, BP_SetGoldDoneDurationOffset) == 0x0003E8, "Member 'UWBP_UI_HUD_MoneyListItem_C::BP_SetGoldDoneDurationOffset' has a wrong offset!");

}

