#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FollowMapHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FollowMapHud.WBP_FollowMapHud_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_FollowMapHud_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           MapContent;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MoveRoot;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FollowMapHud(int32 EntryPoint);
	void SetClipRange(const struct FVector2D& Size);
	void SetClipRangeInternal(const struct FVector2D& Size);
	void SetContentScale(const struct FVector2D& Scale);
	void SetContentScaleInternal(const struct FVector2D& Scale);
	void SetContentSize(const struct FVector2D& Size);
	void SetContentSizeInternal(const struct FVector2D& Size);
	void SetMoveContentPosition(const struct FVector2D& Pos);
	void SetMoveContentPositionInternal(const struct FVector2D& Pos);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FollowMapHud_C">();
	}
	static class UWBP_FollowMapHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FollowMapHud_C>();
	}
};
static_assert(alignof(UWBP_FollowMapHud_C) == 0x000008, "Wrong alignment on UWBP_FollowMapHud_C");
static_assert(sizeof(UWBP_FollowMapHud_C) == 0x000308, "Wrong size on UWBP_FollowMapHud_C");
static_assert(offsetof(UWBP_FollowMapHud_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_FollowMapHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FollowMapHud_C, MapContent) == 0x0002F8, "Member 'UWBP_FollowMapHud_C::MapContent' has a wrong offset!");
static_assert(offsetof(UWBP_FollowMapHud_C, MoveRoot) == 0x000300, "Member 'UWBP_FollowMapHud_C::MoveRoot' has a wrong offset!");

}

