#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Collection_Energy

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Collection_Energy.WBP_HUD_Collection_Energy_C
// 0x0040 (0x0330 - 0x02F0)
class UWBP_HUD_Collection_Energy_C final : public UUserWidget
{
public:
	class UButton*                                Button_Add;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_BG;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 currency_icon;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             currency_num;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             currency_num_UpperLimit;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Energy_InfoPanel_C*                WBP_Energy_InfoPanel;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Collection_Energy_C">();
	}
	static class UWBP_HUD_Collection_Energy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Collection_Energy_C>();
	}
};
static_assert(alignof(UWBP_HUD_Collection_Energy_C) == 0x000008, "Wrong alignment on UWBP_HUD_Collection_Energy_C");
static_assert(sizeof(UWBP_HUD_Collection_Energy_C) == 0x000330, "Wrong size on UWBP_HUD_Collection_Energy_C");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, Button_Add) == 0x0002F0, "Member 'UWBP_HUD_Collection_Energy_C::Button_Add' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, Button_BG) == 0x0002F8, "Member 'UWBP_HUD_Collection_Energy_C::Button_BG' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, currency_icon) == 0x000300, "Member 'UWBP_HUD_Collection_Energy_C::currency_icon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, currency_num) == 0x000308, "Member 'UWBP_HUD_Collection_Energy_C::currency_num' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, currency_num_UpperLimit) == 0x000310, "Member 'UWBP_HUD_Collection_Energy_C::currency_num_UpperLimit' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, InvalidationBox_0) == 0x000318, "Member 'UWBP_HUD_Collection_Energy_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, Text) == 0x000320, "Member 'UWBP_HUD_Collection_Energy_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Collection_Energy_C, WBP_Energy_InfoPanel) == 0x000328, "Member 'UWBP_HUD_Collection_Energy_C::WBP_Energy_InfoPanel' has a wrong offset!");

}

