#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UPSdkUILoading

#include "Basic.hpp"

#include "PSDKBasic_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UPSdkUILoading.WBP_UPSdkUILoading_C
// 0x0018 (0x0318 - 0x0300)
class UWBP_UPSdkUILoading_C final : public UPSdkUILoading
{
public:
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_70;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UPSdkUILoading_C">();
	}
	static class UWBP_UPSdkUILoading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UPSdkUILoading_C>();
	}
};
static_assert(alignof(UWBP_UPSdkUILoading_C) == 0x000008, "Wrong alignment on UWBP_UPSdkUILoading_C");
static_assert(sizeof(UWBP_UPSdkUILoading_C) == 0x000318, "Wrong size on UWBP_UPSdkUILoading_C");
static_assert(offsetof(UWBP_UPSdkUILoading_C, CircularThrobber_0) == 0x000300, "Member 'UWBP_UPSdkUILoading_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UWBP_UPSdkUILoading_C, Image_70) == 0x000308, "Member 'UWBP_UPSdkUILoading_C::Image_70' has a wrong offset!");
static_assert(offsetof(UWBP_UPSdkUILoading_C, Image_bg) == 0x000310, "Member 'UWBP_UPSdkUILoading_C::Image_bg' has a wrong offset!");

}

