#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_CommonSlot_Mobile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_CommonSlot_Mobile.WBP_HUD_CommonSlot_Mobile_C
// 0x01E0 (0x04D0 - 0x02F0)
class UWBP_HUD_CommonSlot_Mobile_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Change;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Change_1;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Add_1;                                         // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Empty;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Add;                                           // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TouchAnim;                                         // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Ability_Placeholder;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Action;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Action_1;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ActionText;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CDProgress;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HighLight;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OV;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PressTimeText;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Add;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Empty;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_TouchButton;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EInputEvent InputEvent)> OnActionClick;                            // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bImpressType;                                      // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PressTime;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ButtonPressed;                                     // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NeededPressTime;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CurrentIconMaterialIns;                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            SkillBg;                                           // 0x03D0(0x00D0)(Edit, BlueprintVisible)
	class UTexture2D*                             SpecialTexture2d;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TouchCommonScale;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TouchSmallScale;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 SlotEnumName;                                      // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUD_CommonSlot_Mobile(int32 EntryPoint);
	void NotifyIconRefresh();
	void PreConstruct(bool IsDesignTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_CommonSlot_Mobile_C">();
	}
	static class UWBP_HUD_CommonSlot_Mobile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_CommonSlot_Mobile_C>();
	}
};
static_assert(alignof(UWBP_HUD_CommonSlot_Mobile_C) == 0x000010, "Wrong alignment on UWBP_HUD_CommonSlot_Mobile_C");
static_assert(sizeof(UWBP_HUD_CommonSlot_Mobile_C) == 0x0004D0, "Wrong size on UWBP_HUD_CommonSlot_Mobile_C");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ani_Change) == 0x0002F8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ani_Change' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ani_Change_1) == 0x000300, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ani_Change_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ani_Add_1) == 0x000308, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ani_Add_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ani_Empty) == 0x000310, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ani_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ani_Add) == 0x000318, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ani_Add' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, TouchAnim) == 0x000320, "Member 'UWBP_HUD_CommonSlot_Mobile_C::TouchAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Ability_Placeholder) == 0x000328, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Ability_Placeholder' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Action) == 0x000330, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Action' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Action_1) == 0x000338, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Action_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, ActionText) == 0x000340, "Member 'UWBP_HUD_CommonSlot_Mobile_C::ActionText' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, CDProgress) == 0x000348, "Member 'UWBP_HUD_CommonSlot_Mobile_C::CDProgress' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Image_60) == 0x000350, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Image_60' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Image_bg) == 0x000358, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Image_bg' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, Image_HighLight) == 0x000360, "Member 'UWBP_HUD_CommonSlot_Mobile_C::Image_HighLight' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, InvalidationBox_0) == 0x000368, "Member 'UWBP_HUD_CommonSlot_Mobile_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, OV) == 0x000370, "Member 'UWBP_HUD_CommonSlot_Mobile_C::OV' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, PressTimeText) == 0x000378, "Member 'UWBP_HUD_CommonSlot_Mobile_C::PressTimeText' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, UI_NS_Add) == 0x000380, "Member 'UWBP_HUD_CommonSlot_Mobile_C::UI_NS_Add' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, UI_NS_Empty) == 0x000388, "Member 'UWBP_HUD_CommonSlot_Mobile_C::UI_NS_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, UI_NS_TouchButton) == 0x000390, "Member 'UWBP_HUD_CommonSlot_Mobile_C::UI_NS_TouchButton' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, OnActionClick) == 0x000398, "Member 'UWBP_HUD_CommonSlot_Mobile_C::OnActionClick' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, bImpressType) == 0x0003A8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::bImpressType' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, PressTime) == 0x0003B0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::PressTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, ButtonPressed) == 0x0003B8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::ButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, NeededPressTime) == 0x0003C0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::NeededPressTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, CurrentIconMaterialIns) == 0x0003C8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::CurrentIconMaterialIns' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, SkillBg) == 0x0003D0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::SkillBg' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, SpecialTexture2d) == 0x0004A0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::SpecialTexture2d' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, TouchCommonScale) == 0x0004A8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::TouchCommonScale' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, TouchSmallScale) == 0x0004B0, "Member 'UWBP_HUD_CommonSlot_Mobile_C::TouchSmallScale' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_CommonSlot_Mobile_C, SlotEnumName) == 0x0004B8, "Member 'UWBP_HUD_CommonSlot_Mobile_C::SlotEnumName' has a wrong offset!");

}

