#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_TaskList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_TaskList.WBP_HUD_TaskList_C
// 0x0078 (0x0368 - 0x02F0)
class UWBP_HUD_TaskList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WorldTaskFadeOut;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WorldTaskFadeIn;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_Tab;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_KeyTip_1;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_KeyTip_2;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Task;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Tab;                                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_AimList_C*               Task_Challenge;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_AimList_Puzzle_C*        Task_Puzzle;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_LeftInfoPanel_C*                Task_World;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_MaterialList_C*                WBP_HUD_Material_List;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PhotoGraph_AimList_C*              WBP_PhotoGraph_AimList;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_TaskList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_TaskList_C">();
	}
	static class UWBP_HUD_TaskList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_TaskList_C>();
	}
};
static_assert(alignof(UWBP_HUD_TaskList_C) == 0x000008, "Wrong alignment on UWBP_HUD_TaskList_C");
static_assert(sizeof(UWBP_HUD_TaskList_C) == 0x000368, "Wrong size on UWBP_HUD_TaskList_C");
static_assert(offsetof(UWBP_HUD_TaskList_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_TaskList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, WorldTaskFadeOut) == 0x0002F8, "Member 'UWBP_HUD_TaskList_C::WorldTaskFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, WorldTaskFadeIn) == 0x000300, "Member 'UWBP_HUD_TaskList_C::WorldTaskFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, DynamicEntryBox_Tab) == 0x000308, "Member 'UWBP_HUD_TaskList_C::DynamicEntryBox_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Image_KeyTip_1) == 0x000310, "Member 'UWBP_HUD_TaskList_C::Image_KeyTip_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Image_KeyTip_2) == 0x000318, "Member 'UWBP_HUD_TaskList_C::Image_KeyTip_2' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Image_Line) == 0x000320, "Member 'UWBP_HUD_TaskList_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, InvalidationBox_0) == 0x000328, "Member 'UWBP_HUD_TaskList_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, RetainerBox_Task) == 0x000330, "Member 'UWBP_HUD_TaskList_C::RetainerBox_Task' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Tab) == 0x000338, "Member 'UWBP_HUD_TaskList_C::Tab' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Task_Challenge) == 0x000340, "Member 'UWBP_HUD_TaskList_C::Task_Challenge' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Task_Puzzle) == 0x000348, "Member 'UWBP_HUD_TaskList_C::Task_Puzzle' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, Task_World) == 0x000350, "Member 'UWBP_HUD_TaskList_C::Task_World' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, WBP_HUD_Material_List) == 0x000358, "Member 'UWBP_HUD_TaskList_C::WBP_HUD_Material_List' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_TaskList_C, WBP_PhotoGraph_AimList) == 0x000360, "Member 'UWBP_HUD_TaskList_C::WBP_PhotoGraph_AimList' has a wrong offset!");

}

