#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Action_Clothes

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_Action_Clothes.WBP_Hud_Action_Clothes_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_Hud_Action_Clothes_C final : public UUserWidget
{
public:
	class UX6MultiPlatformButton*                 Button_Click;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_H;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_N;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_S;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_Action_Clothes_C">();
	}
	static class UWBP_Hud_Action_Clothes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_Action_Clothes_C>();
	}
};
static_assert(alignof(UWBP_Hud_Action_Clothes_C) == 0x000008, "Wrong alignment on UWBP_Hud_Action_Clothes_C");
static_assert(sizeof(UWBP_Hud_Action_Clothes_C) == 0x000318, "Wrong size on UWBP_Hud_Action_Clothes_C");
static_assert(offsetof(UWBP_Hud_Action_Clothes_C, Button_Click) == 0x0002F0, "Member 'UWBP_Hud_Action_Clothes_C::Button_Click' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Clothes_C, Image_H) == 0x0002F8, "Member 'UWBP_Hud_Action_Clothes_C::Image_H' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Clothes_C, Image_Icon) == 0x000300, "Member 'UWBP_Hud_Action_Clothes_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Clothes_C, Image_N) == 0x000308, "Member 'UWBP_Hud_Action_Clothes_C::Image_N' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_Action_Clothes_C, Image_S) == 0x000310, "Member 'UWBP_Hud_Action_Clothes_C::Image_S' has a wrong offset!");

}

