#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dlg_Props_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dlg_Props_Item.WBP_Dlg_Props_Item_C
// 0x0070 (0x0360 - 0x02F0)
class UWBP_Dlg_Props_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Subtract_Interact;                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Subtract;                                      // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_32;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 currency_icon;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             currency_num;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             currency_num_1;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Props_Bg;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Props_Bg;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         ItemId;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalCount;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayType;                                       // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ForceStopSubtractAnim();
	void ChangeTextColorToRed();
	void ChangeTextColorToWhite();
	void ExecuteUbergraph_WBP_Dlg_Props_Item(int32 EntryPoint);
	void ReduceItem(double InReduceNum);
	void SequenceEvent__ENTRYPOINTWBP_Dlg_Props_Item();
	void SetNumText(double InFloat, int32 DisplayType_0, class UTextBlock* TextWidget);
	void SubItemEvent();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dlg_Props_Item_C">();
	}
	static class UWBP_Dlg_Props_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dlg_Props_Item_C>();
	}
};
static_assert(alignof(UWBP_Dlg_Props_Item_C) == 0x000008, "Wrong alignment on UWBP_Dlg_Props_Item_C");
static_assert(sizeof(UWBP_Dlg_Props_Item_C) == 0x000360, "Wrong size on UWBP_Dlg_Props_Item_C");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Dlg_Props_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, FadeOut) == 0x0002F8, "Member 'UWBP_Dlg_Props_Item_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, FadeIn) == 0x000300, "Member 'UWBP_Dlg_Props_Item_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, Ani_Subtract_Interact) == 0x000308, "Member 'UWBP_Dlg_Props_Item_C::Ani_Subtract_Interact' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, Ani_Subtract) == 0x000310, "Member 'UWBP_Dlg_Props_Item_C::Ani_Subtract' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, CanvasPanel_32) == 0x000318, "Member 'UWBP_Dlg_Props_Item_C::CanvasPanel_32' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, currency_icon) == 0x000320, "Member 'UWBP_Dlg_Props_Item_C::currency_icon' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, currency_num) == 0x000328, "Member 'UWBP_Dlg_Props_Item_C::currency_num' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, currency_num_1) == 0x000330, "Member 'UWBP_Dlg_Props_Item_C::currency_num_1' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, Fx_Props_Bg) == 0x000338, "Member 'UWBP_Dlg_Props_Item_C::Fx_Props_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, Props_Bg) == 0x000340, "Member 'UWBP_Dlg_Props_Item_C::Props_Bg' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, ItemId) == 0x000348, "Member 'UWBP_Dlg_Props_Item_C::ItemId' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, TotalCount) == 0x000350, "Member 'UWBP_Dlg_Props_Item_C::TotalCount' has a wrong offset!");
static_assert(offsetof(UWBP_Dlg_Props_Item_C, DisplayType) == 0x000358, "Member 'UWBP_Dlg_Props_Item_C::DisplayType' has a wrong offset!");

}

