#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Collection_item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.ExecuteUbergraph_WBP_UI_HUD_Collection_item
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item) == 0x000008, "Wrong alignment on WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item) == 0x000030, "Wrong size on WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item, CallFunc_Conv_StringToInt_ReturnValue) == 0x000028, "Member 'WBP_UI_HUD_Collection_item_C_ExecuteUbergraph_WBP_UI_HUD_Collection_item::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.PlayMinus
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_PlayMinus final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_PlayMinus) == 0x000008, "Wrong alignment on WBP_UI_HUD_Collection_item_C_PlayMinus");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_PlayMinus) == 0x000008, "Wrong size on WBP_UI_HUD_Collection_item_C_PlayMinus");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_PlayMinus, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_PlayMinus::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.PlayMoonCoinAdd
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd) == 0x000008, "Wrong alignment on WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd) == 0x000008, "Wrong size on WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_PlayMoonCoinAdd::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.PlayPurpleCoinAdd
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd) == 0x000008, "Wrong alignment on WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd) == 0x000008, "Wrong size on WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_PlayPurpleCoinAdd::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.TestSet
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_TestSet final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_TestSet) == 0x000004, "Wrong alignment on WBP_UI_HUD_Collection_item_C_TestSet");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_TestSet) == 0x000004, "Wrong size on WBP_UI_HUD_Collection_item_C_TestSet");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_TestSet, Count) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_TestSet::Count' has a wrong offset!");

// Function WBP_UI_HUD_Collection_item.WBP_UI_HUD_Collection_item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Collection_item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Collection_item_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_UI_HUD_Collection_item_C_GetModuleName");
static_assert(sizeof(WBP_UI_HUD_Collection_item_C_GetModuleName) == 0x000010, "Wrong size on WBP_UI_HUD_Collection_item_C_GetModuleName");
static_assert(offsetof(WBP_UI_HUD_Collection_item_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_UI_HUD_Collection_item_C_GetModuleName::ReturnValue' has a wrong offset!");

}

