#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_charactor_name

#include "Basic.hpp"

#include "EHeadUIState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_charactor_name.WBP_UI_charactor_name_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_UI_charactor_name_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_186;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHeadUIState                                  CurrentShowState;                                  // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ResetState();
	void GetVerticalBottomZ(double* NewParam);
	void ExecuteUbergraph_WBP_UI_charactor_name(int32 EntryPoint);
	void BP_SetTile();
	void BP_SetName(const class FString& InText);
	void BP_SetIcon();
	void BP_HideTitle();
	void BP_HideName();
	void BP_HideIcon();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_charactor_name_C">();
	}
	static class UWBP_UI_charactor_name_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_charactor_name_C>();
	}
};
static_assert(alignof(UWBP_UI_charactor_name_C) == 0x000008, "Wrong alignment on UWBP_UI_charactor_name_C");
static_assert(sizeof(UWBP_UI_charactor_name_C) == 0x000318, "Wrong size on UWBP_UI_charactor_name_C");
static_assert(offsetof(UWBP_UI_charactor_name_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_charactor_name_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_charactor_name_C, ShowOut) == 0x0002F8, "Member 'UWBP_UI_charactor_name_C::ShowOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_charactor_name_C, ShowIn) == 0x000300, "Member 'UWBP_UI_charactor_name_C::ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_charactor_name_C, VerticalBox_186) == 0x000308, "Member 'UWBP_UI_charactor_name_C::VerticalBox_186' has a wrong offset!");
static_assert(offsetof(UWBP_UI_charactor_name_C, CurrentShowState) == 0x000310, "Member 'UWBP_UI_charactor_name_C::CurrentShowState' has a wrong offset!");

}

