#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_HP_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_HP_v2.WBP_Hud_HP_v2_C
// 0x0108 (0x03F8 - 0x02F0)
class UWBP_Hud_HP_v2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SwitchRole;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLevel;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUp;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuckleBlood_Ani_1_5miao;                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BuckleBlood_Ani_2miao;                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Add;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_AddExtra;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Minus;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_MinusExtra;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_167;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_2;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HP;                                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_146;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_232;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelNum;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PanelLevel;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RoleName;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_LevelUP;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_1;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_2;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_3;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_4;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_5;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_6;                                 // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_7;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hud_HP_Node_C*                     WBP_Hud_HP_Node_8;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LevelNumRoleName;                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        BP_WaitDuration;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_FlyDownSpeed;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isShowLevel;                                       // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Hud_HP_Button_246_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Hud_HP_Button_Add_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Hud_HP_v2_Button_AddExtra_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Hud_HP_v2_Button_MinusExtra_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_HideHPParticle();
	void BP_ShowHPParticle();
	void ContinueInjuredAnim();
	void ExecuteUbergraph_WBP_Hud_HP_v2(int32 EntryPoint);
	void OnHpItemFlyDown(int32 ItemIndex);
	void OnInjuredFinished(class UHorizontalBox* decorate);
	void OnInjuredWaited(class UHorizontalBox* decorate);
	void OnOffsetHpItem(class UHorizontalBox* decorate);
	void OnSwitchRoleNameLevelNum();
	void PauseInjuredAnim();
	void PlayHideLevel();
	void PlayInjuredAnim();
	void PlayLevelUp();
	void PlayShowLevel();
	void ResetInjuredAnim();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2(class UHorizontalBox* decorate);
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_0(class UHorizontalBox* decorate);
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_1(class UHorizontalBox* decorate);
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_10();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_2();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_3();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_4();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_5();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_6();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_7();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_8();
	void SequenceEvent__ENTRYPOINTWBP_Hud_HP_v2_9();
	void SetHpPosition(double X);
	void TestAddExtraMaxHP(int32 Num);
	void TestAddHP(int32 addHp);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_HP_v2_C">();
	}
	static class UWBP_Hud_HP_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_HP_v2_C>();
	}
};
static_assert(alignof(UWBP_Hud_HP_v2_C) == 0x000008, "Wrong alignment on UWBP_Hud_HP_v2_C");
static_assert(sizeof(UWBP_Hud_HP_v2_C) == 0x0003F8, "Wrong size on UWBP_Hud_HP_v2_C");
static_assert(offsetof(UWBP_Hud_HP_v2_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Hud_HP_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, SwitchRole) == 0x0002F8, "Member 'UWBP_Hud_HP_v2_C::SwitchRole' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, ShowLevel) == 0x000300, "Member 'UWBP_Hud_HP_v2_C::ShowLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, LevelUp) == 0x000308, "Member 'UWBP_Hud_HP_v2_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, BuckleBlood_Ani_1_5miao) == 0x000310, "Member 'UWBP_Hud_HP_v2_C::BuckleBlood_Ani_1_5miao' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, BuckleBlood_Ani_2miao) == 0x000318, "Member 'UWBP_Hud_HP_v2_C::BuckleBlood_Ani_2miao' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Button_Add) == 0x000320, "Member 'UWBP_Hud_HP_v2_C::Button_Add' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Button_AddExtra) == 0x000328, "Member 'UWBP_Hud_HP_v2_C::Button_AddExtra' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Button_Minus) == 0x000330, "Member 'UWBP_Hud_HP_v2_C::Button_Minus' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Button_MinusExtra) == 0x000338, "Member 'UWBP_Hud_HP_v2_C::Button_MinusExtra' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, EditableTextBox_167) == 0x000340, "Member 'UWBP_Hud_HP_v2_C::EditableTextBox_167' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, HorizontalBox_2) == 0x000348, "Member 'UWBP_Hud_HP_v2_C::HorizontalBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, HP) == 0x000350, "Member 'UWBP_Hud_HP_v2_C::HP' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Image_90) == 0x000358, "Member 'UWBP_Hud_HP_v2_C::Image_90' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Image_146) == 0x000360, "Member 'UWBP_Hud_HP_v2_C::Image_146' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, Image_232) == 0x000368, "Member 'UWBP_Hud_HP_v2_C::Image_232' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, InvalidationBox_0) == 0x000370, "Member 'UWBP_Hud_HP_v2_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, LevelNum) == 0x000378, "Member 'UWBP_Hud_HP_v2_C::LevelNum' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, PanelLevel) == 0x000380, "Member 'UWBP_Hud_HP_v2_C::PanelLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, RoleName) == 0x000388, "Member 'UWBP_Hud_HP_v2_C::RoleName' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, UI_NS_LevelUP) == 0x000390, "Member 'UWBP_Hud_HP_v2_C::UI_NS_LevelUP' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_1) == 0x000398, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_2) == 0x0003A0, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_2' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_3) == 0x0003A8, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_3' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_4) == 0x0003B0, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_4' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_5) == 0x0003B8, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_5' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_6) == 0x0003C0, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_6' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_7) == 0x0003C8, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_7' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WBP_Hud_HP_Node_8) == 0x0003D0, "Member 'UWBP_Hud_HP_v2_C::WBP_Hud_HP_Node_8' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, WidgetSwitcher_LevelNumRoleName) == 0x0003D8, "Member 'UWBP_Hud_HP_v2_C::WidgetSwitcher_LevelNumRoleName' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, BP_WaitDuration) == 0x0003E0, "Member 'UWBP_Hud_HP_v2_C::BP_WaitDuration' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, BP_FlyDownSpeed) == 0x0003E8, "Member 'UWBP_Hud_HP_v2_C::BP_FlyDownSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_v2_C, isShowLevel) == 0x0003F0, "Member 'UWBP_Hud_HP_v2_C::isShowLevel' has a wrong offset!");

}

