#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_TaskList_Tab_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_TaskList_Tab_Item.WBP_HUD_TaskList_Tab_Item_C.ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item
// 0x0014 (0x0014 - 0x0000)
struct WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue_1;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item) == 0x000004, "Wrong alignment on WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item");
static_assert(sizeof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item) == 0x000014, "Wrong size on WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item, EntryPoint) == 0x000000, "Member 'WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x000008, "Member 'WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x00000C, "Member 'WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item, CallFunc_EqualEqual_32ByteByte_ReturnValue_1) == 0x000010, "Member 'WBP_HUD_TaskList_Tab_Item_C_ExecuteUbergraph_WBP_HUD_TaskList_Tab_Item::CallFunc_EqualEqual_32ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_TaskList_Tab_Item.WBP_HUD_TaskList_Tab_Item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_TaskList_Tab_Item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_TaskList_Tab_Item_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_HUD_TaskList_Tab_Item_C_GetModuleName");
static_assert(sizeof(WBP_HUD_TaskList_Tab_Item_C_GetModuleName) == 0x000010, "Wrong size on WBP_HUD_TaskList_Tab_Item_C_GetModuleName");
static_assert(offsetof(WBP_HUD_TaskList_Tab_Item_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_HUD_TaskList_Tab_Item_C_GetModuleName::ReturnValue' has a wrong offset!");

}

