#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugNwczion

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugNwczion.WBP_DebugNwczion_C
// 0x0038 (0x0328 - 0x02F0)
class UWBP_DebugNwczion_C final : public UUserWidget
{
public:
	class UButton*                                ButtonClose;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonDelete;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonDownload;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonReset;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextDetail;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6ListView*                            X6ListView;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugNwczion_C">();
	}
	static class UWBP_DebugNwczion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugNwczion_C>();
	}
};
static_assert(alignof(UWBP_DebugNwczion_C) == 0x000008, "Wrong alignment on UWBP_DebugNwczion_C");
static_assert(sizeof(UWBP_DebugNwczion_C) == 0x000328, "Wrong size on UWBP_DebugNwczion_C");
static_assert(offsetof(UWBP_DebugNwczion_C, ButtonClose) == 0x0002F0, "Member 'UWBP_DebugNwczion_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, ButtonDelete) == 0x0002F8, "Member 'UWBP_DebugNwczion_C::ButtonDelete' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, ButtonDownload) == 0x000300, "Member 'UWBP_DebugNwczion_C::ButtonDownload' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, ButtonReset) == 0x000308, "Member 'UWBP_DebugNwczion_C::ButtonReset' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, Image) == 0x000310, "Member 'UWBP_DebugNwczion_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, TextDetail) == 0x000318, "Member 'UWBP_DebugNwczion_C::TextDetail' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczion_C, X6ListView) == 0x000320, "Member 'UWBP_DebugNwczion_C::X6ListView' has a wrong offset!");

}

