#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_UseProps_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_UseProps_List.WBP_HUD_UseProps_List_C
// 0x0050 (0x0340 - 0x02F0)
class UWBP_HUD_UseProps_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Setting_Pressed;                               // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Setting_Hover;                                 // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Btn_Hover;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6MultiPlatformButton*                 Button_Setting;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Setting;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               WBP_UI_Common_KeyTips;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_UseProps_List_Button_Setting_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_List_Button_Setting_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_List_Button_Setting_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_HUD_UseProps_List_Button_Setting_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_HUD_UseProps_List(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_UseProps_List_C">();
	}
	static class UWBP_HUD_UseProps_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_UseProps_List_C>();
	}
};
static_assert(alignof(UWBP_HUD_UseProps_List_C) == 0x000008, "Wrong alignment on UWBP_HUD_UseProps_List_C");
static_assert(sizeof(UWBP_HUD_UseProps_List_C) == 0x000340, "Wrong size on UWBP_HUD_UseProps_List_C");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_UseProps_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, FadeOut) == 0x0002F8, "Member 'UWBP_HUD_UseProps_List_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, FadeIn) == 0x000300, "Member 'UWBP_HUD_UseProps_List_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, Ani_Setting_Pressed) == 0x000308, "Member 'UWBP_HUD_UseProps_List_C::Ani_Setting_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, Ani_Setting_Hover) == 0x000310, "Member 'UWBP_HUD_UseProps_List_C::Ani_Setting_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, Btn_Hover) == 0x000318, "Member 'UWBP_HUD_UseProps_List_C::Btn_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, Button_Setting) == 0x000320, "Member 'UWBP_HUD_UseProps_List_C::Button_Setting' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, DynamicEntryBox) == 0x000328, "Member 'UWBP_HUD_UseProps_List_C::DynamicEntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, Setting) == 0x000330, "Member 'UWBP_HUD_UseProps_List_C::Setting' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_UseProps_List_C, WBP_UI_Common_KeyTips) == 0x000338, "Member 'UWBP_HUD_UseProps_List_C::WBP_UI_Common_KeyTips' has a wrong offset!");

}

