#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Photograph_QuickShoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Photograph_QuickShoot.WBP_Photograph_QuickShoot_C
// 0x0080 (0x0370 - 0x02F0)
class UWBP_Photograph_QuickShoot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_HUD;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Album;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Back_Img;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_1;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_2;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_3;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_4;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_5;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_6;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corner_Img_7;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Img_HighLight;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Img_HighLight_1;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_326;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Photo_Img;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Photograph_QuickShoot(int32 EntryPoint);
	void sfx1();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Photograph_QuickShoot_C">();
	}
	static class UWBP_Photograph_QuickShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Photograph_QuickShoot_C>();
	}
};
static_assert(alignof(UWBP_Photograph_QuickShoot_C) == 0x000008, "Wrong alignment on UWBP_Photograph_QuickShoot_C");
static_assert(sizeof(UWBP_Photograph_QuickShoot_C) == 0x000370, "Wrong size on UWBP_Photograph_QuickShoot_C");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Photograph_QuickShoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, FadeIn_HUD) == 0x0002F8, "Member 'UWBP_Photograph_QuickShoot_C::FadeIn_HUD' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, FadeIn_Album) == 0x000300, "Member 'UWBP_Photograph_QuickShoot_C::FadeIn_Album' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Back_Img) == 0x000308, "Member 'UWBP_Photograph_QuickShoot_C::Back_Img' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img) == 0x000310, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_1) == 0x000318, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_1' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_2) == 0x000320, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_2' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_3) == 0x000328, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_3' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_4) == 0x000330, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_4' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_5) == 0x000338, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_5' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_6) == 0x000340, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_6' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Corner_Img_7) == 0x000348, "Member 'UWBP_Photograph_QuickShoot_C::Corner_Img_7' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Fx_Img_HighLight) == 0x000350, "Member 'UWBP_Photograph_QuickShoot_C::Fx_Img_HighLight' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Fx_Img_HighLight_1) == 0x000358, "Member 'UWBP_Photograph_QuickShoot_C::Fx_Img_HighLight_1' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Image_326) == 0x000360, "Member 'UWBP_Photograph_QuickShoot_C::Image_326' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_QuickShoot_C, Photo_Img) == 0x000368, "Member 'UWBP_Photograph_QuickShoot_C::Photo_Img' has a wrong offset!");

}

