#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friends_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Friends_Head.WBP_Friends_Head_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_Friends_Head_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Pressed;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Fx_Hover;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Pressed;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Indi;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Offi;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_1;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Sign;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_HeadFrame_C*                WBP_HeadFrame;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Level_C*                    WBP_Level;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Scale_Size;                                        // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_Friends_Head(int32 EntryPoint);
	void OnListItemObjectSetViaIndex(int32 Index_0);
	void OnListItemValueChangedViaIndex(int32 Index_0);
	void PreConstruct(bool IsDesignTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Friends_Head_C">();
	}
	static class UWBP_Friends_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Friends_Head_C>();
	}
};
static_assert(alignof(UWBP_Friends_Head_C) == 0x000008, "Wrong alignment on UWBP_Friends_Head_C");
static_assert(sizeof(UWBP_Friends_Head_C) == 0x000350, "Wrong size on UWBP_Friends_Head_C");
static_assert(offsetof(UWBP_Friends_Head_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Friends_Head_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Ani_Pressed) == 0x0002F8, "Member 'UWBP_Friends_Head_C::Ani_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Ani_Hover) == 0x000300, "Member 'UWBP_Friends_Head_C::Ani_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Fx_Hover) == 0x000308, "Member 'UWBP_Friends_Head_C::Fx_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Fx_Pressed) == 0x000310, "Member 'UWBP_Friends_Head_C::Fx_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Img_Indi) == 0x000318, "Member 'UWBP_Friends_Head_C::Img_Indi' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Img_Offi) == 0x000320, "Member 'UWBP_Friends_Head_C::Img_Offi' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, ScaleBox_1) == 0x000328, "Member 'UWBP_Friends_Head_C::ScaleBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Switcher_Sign) == 0x000330, "Member 'UWBP_Friends_Head_C::Switcher_Sign' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, WBP_HeadFrame) == 0x000338, "Member 'UWBP_Friends_Head_C::WBP_HeadFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, WBP_Level) == 0x000340, "Member 'UWBP_Friends_Head_C::WBP_Level' has a wrong offset!");
static_assert(offsetof(UWBP_Friends_Head_C, Scale_Size) == 0x000348, "Member 'UWBP_Friends_Head_C::Scale_Size' has a wrong offset!");

}

