#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Interact_Props_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Interact_Props_Item.WBP_Interact_Props_Item_C.ChangeTextColorToRed
// 0x0014 (0x0014 - 0x0000)
struct WBP_Interact_Props_Item_C_ChangeTextColorToRed final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(WBP_Interact_Props_Item_C_ChangeTextColorToRed) == 0x000004, "Wrong alignment on WBP_Interact_Props_Item_C_ChangeTextColorToRed");
static_assert(sizeof(WBP_Interact_Props_Item_C_ChangeTextColorToRed) == 0x000014, "Wrong size on WBP_Interact_Props_Item_C_ChangeTextColorToRed");
static_assert(offsetof(WBP_Interact_Props_Item_C_ChangeTextColorToRed, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_Interact_Props_Item_C_ChangeTextColorToRed::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Interact_Props_Item.WBP_Interact_Props_Item_C.ChangeTextColorToWhite
// 0x0014 (0x0014 - 0x0000)
struct WBP_Interact_Props_Item_C_ChangeTextColorToWhite final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
static_assert(alignof(WBP_Interact_Props_Item_C_ChangeTextColorToWhite) == 0x000004, "Wrong alignment on WBP_Interact_Props_Item_C_ChangeTextColorToWhite");
static_assert(sizeof(WBP_Interact_Props_Item_C_ChangeTextColorToWhite) == 0x000014, "Wrong size on WBP_Interact_Props_Item_C_ChangeTextColorToWhite");
static_assert(offsetof(WBP_Interact_Props_Item_C_ChangeTextColorToWhite, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_Interact_Props_Item_C_ChangeTextColorToWhite::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Interact_Props_Item.WBP_Interact_Props_Item_C.ExecuteUbergraph_WBP_Interact_Props_Item
// 0x0018 (0x0018 - 0x0000)
struct WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0008(0x0010)()
};
static_assert(alignof(WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item) == 0x000008, "Wrong alignment on WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item");
static_assert(sizeof(WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item) == 0x000018, "Wrong size on WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item");
static_assert(offsetof(WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item, EntryPoint) == 0x000000, "Member 'WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000008, "Member 'WBP_Interact_Props_Item_C_ExecuteUbergraph_WBP_Interact_Props_Item::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");

// Function WBP_Interact_Props_Item.WBP_Interact_Props_Item_C.ReduceItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_Interact_Props_Item_C_ReduceItem final
{
public:
	int64                                         InReduceNum;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0008(0x0010)()
	int64                                         CallFunc_Add_Int64Int64_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Interact_Props_Item_C_ReduceItem) == 0x000008, "Wrong alignment on WBP_Interact_Props_Item_C_ReduceItem");
static_assert(sizeof(WBP_Interact_Props_Item_C_ReduceItem) == 0x000028, "Wrong size on WBP_Interact_Props_Item_C_ReduceItem");
static_assert(offsetof(WBP_Interact_Props_Item_C_ReduceItem, InReduceNum) == 0x000000, "Member 'WBP_Interact_Props_Item_C_ReduceItem::InReduceNum' has a wrong offset!");
static_assert(offsetof(WBP_Interact_Props_Item_C_ReduceItem, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000008, "Member 'WBP_Interact_Props_Item_C_ReduceItem::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Interact_Props_Item_C_ReduceItem, CallFunc_Add_Int64Int64_ReturnValue) == 0x000018, "Member 'WBP_Interact_Props_Item_C_ReduceItem::CallFunc_Add_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Interact_Props_Item_C_ReduceItem, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Interact_Props_Item_C_ReduceItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Interact_Props_Item.WBP_Interact_Props_Item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Interact_Props_Item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Interact_Props_Item_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Interact_Props_Item_C_GetModuleName");
static_assert(sizeof(WBP_Interact_Props_Item_C_GetModuleName) == 0x000010, "Wrong size on WBP_Interact_Props_Item_C_GetModuleName");
static_assert(offsetof(WBP_Interact_Props_Item_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Interact_Props_Item_C_GetModuleName::ReturnValue' has a wrong offset!");

}

