#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Interaction_Dot

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Interaction_Dot.WBP_UI_Interaction_Dot_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Interaction_Dot_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Interaction_Dot_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_UI_Interaction_Dot_C_OnAnimationFinished");
static_assert(sizeof(WBP_UI_Interaction_Dot_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_UI_Interaction_Dot_C_OnAnimationFinished");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_UI_Interaction_Dot_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_UI_Interaction_Dot.WBP_UI_Interaction_Dot_C.ExecuteUbergraph_WBP_UI_Interaction_Dot
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot) == 0x000008, "Wrong alignment on WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot");
static_assert(sizeof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot) == 0x000038, "Wrong size on WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, EntryPoint) == 0x000000, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, K2Node_Event_Animation) == 0x000008, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_Array_Find_ReturnValue) == 0x000030, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, K2Node_SwitchInteger_CmpSuccess) == 0x000034, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_IsValid_ReturnValue) == 0x000035, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot, CallFunc_IsValid_ReturnValue_1) == 0x000037, "Member 'WBP_UI_Interaction_Dot_C_ExecuteUbergraph_WBP_UI_Interaction_Dot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Interaction_Dot.WBP_UI_Interaction_Dot_C.BP_DisplayWidget
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_Interaction_Dot_C_BP_DisplayWidget final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInSelect;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_2;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_3;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_4;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_5;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget) == 0x000008, "Wrong alignment on WBP_UI_Interaction_Dot_C_BP_DisplayWidget");
static_assert(sizeof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget) == 0x000058, "Wrong size on WBP_UI_Interaction_Dot_C_BP_DisplayWidget");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, bInShow) == 0x000000, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::bInShow' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, bInSelect) == 0x000001, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::bInSelect' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000003, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue_2) == 0x000005, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue_3) == 0x000006, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue_4) == 0x000018, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_NotEqual_BoolBool_ReturnValue_5) == 0x000030, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_NotEqual_BoolBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_4) == 0x000038, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_5) == 0x000040, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_6) == 0x000048, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Interaction_Dot_C_BP_DisplayWidget, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_UI_Interaction_Dot_C_BP_DisplayWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

