#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Interaction_Dot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Interaction_Dot.WBP_UI_Interaction_Dot_C
// 0x00A0 (0x0390 - 0x02F0)
class UWBP_UI_Interaction_Dot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Switch_ToSmall;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Switch_ToBig;                                  // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_Arrow;                                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Tip;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Case;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Case_01;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Case_02;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Scale;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangle_1;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangle_2;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 unselect;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               AnimationArray;                                    // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShow;                                             // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractiveWhitePointWidgetComponent_C* WidgetComponent;                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelect;                                           // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ExecuteUbergraph_WBP_UI_Interaction_Dot(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BP_DisplayWidget(bool bInShow, bool bInSelect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Interaction_Dot_C">();
	}
	static class UWBP_UI_Interaction_Dot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Interaction_Dot_C>();
	}
};
static_assert(alignof(UWBP_UI_Interaction_Dot_C) == 0x000008, "Wrong alignment on UWBP_UI_Interaction_Dot_C");
static_assert(sizeof(UWBP_UI_Interaction_Dot_C) == 0x000390, "Wrong size on UWBP_UI_Interaction_Dot_C");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_Interaction_Dot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Loop) == 0x0002F8, "Member 'UWBP_UI_Interaction_Dot_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Ani_Switch_ToSmall) == 0x000300, "Member 'UWBP_UI_Interaction_Dot_C::Ani_Switch_ToSmall' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Ani_Switch_ToBig) == 0x000308, "Member 'UWBP_UI_Interaction_Dot_C::Ani_Switch_ToBig' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, FadeOut) == 0x000310, "Member 'UWBP_UI_Interaction_Dot_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, FadeIn) == 0x000318, "Member 'UWBP_UI_Interaction_Dot_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Loop_Arrow) == 0x000320, "Member 'UWBP_UI_Interaction_Dot_C::Loop_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, CanvasPanel_Tip) == 0x000328, "Member 'UWBP_UI_Interaction_Dot_C::CanvasPanel_Tip' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Case) == 0x000330, "Member 'UWBP_UI_Interaction_Dot_C::Case' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Case_01) == 0x000338, "Member 'UWBP_UI_Interaction_Dot_C::Case_01' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Case_02) == 0x000340, "Member 'UWBP_UI_Interaction_Dot_C::Case_02' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Scale) == 0x000348, "Member 'UWBP_UI_Interaction_Dot_C::Scale' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Triangle_1) == 0x000350, "Member 'UWBP_UI_Interaction_Dot_C::Triangle_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, Triangle_2) == 0x000358, "Member 'UWBP_UI_Interaction_Dot_C::Triangle_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, unselect) == 0x000360, "Member 'UWBP_UI_Interaction_Dot_C::unselect' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, AnimationArray) == 0x000368, "Member 'UWBP_UI_Interaction_Dot_C::AnimationArray' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, bShow) == 0x000378, "Member 'UWBP_UI_Interaction_Dot_C::bShow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, WidgetComponent) == 0x000380, "Member 'UWBP_UI_Interaction_Dot_C::WidgetComponent' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Interaction_Dot_C, bSelect) == 0x000388, "Member 'UWBP_UI_Interaction_Dot_C::bSelect' has a wrong offset!");

}

