#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_AreaMarker_MiniMap_Collect

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_AreaMarker_MiniMap_Collect.WBP_UI_AreaMarker_MiniMap_Collect_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_UI_AreaMarker_MiniMap_Collect_C final : public UUserWidget
{
public:
	class UImage*                                 Marker_ICON;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Marker_ICON_Dis;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Marker_MiniMap_Effect_Yellow_C* WBP_UI_Marker_MiniMap_Effect;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_AreaMarker_MiniMap_Collect_C">();
	}
	static class UWBP_UI_AreaMarker_MiniMap_Collect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_AreaMarker_MiniMap_Collect_C>();
	}
};
static_assert(alignof(UWBP_UI_AreaMarker_MiniMap_Collect_C) == 0x000008, "Wrong alignment on UWBP_UI_AreaMarker_MiniMap_Collect_C");
static_assert(sizeof(UWBP_UI_AreaMarker_MiniMap_Collect_C) == 0x000308, "Wrong size on UWBP_UI_AreaMarker_MiniMap_Collect_C");
static_assert(offsetof(UWBP_UI_AreaMarker_MiniMap_Collect_C, Marker_ICON) == 0x0002F0, "Member 'UWBP_UI_AreaMarker_MiniMap_Collect_C::Marker_ICON' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AreaMarker_MiniMap_Collect_C, Marker_ICON_Dis) == 0x0002F8, "Member 'UWBP_UI_AreaMarker_MiniMap_Collect_C::Marker_ICON_Dis' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AreaMarker_MiniMap_Collect_C, WBP_UI_Marker_MiniMap_Effect) == 0x000300, "Member 'UWBP_UI_AreaMarker_MiniMap_Collect_C::WBP_UI_Marker_MiniMap_Effect' has a wrong offset!");

}

