#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_UseProps_ListItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.ExecuteUbergraph_WBP_HUD_UseProps_ListItem
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_index_1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem) == 0x000008, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem) == 0x000038, "Wrong size on WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, EntryPoint) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, K2Node_Event_bIsExpanded) == 0x000018, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, K2Node_Event_index_1) == 0x00001C, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, K2Node_Event_index) == 0x000020, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'WBP_HUD_UseProps_ListItem_C_ExecuteUbergraph_WBP_HUD_UseProps_ListItem::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.OnListItemObjectSetViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex) == 0x000004, "Wrong size on WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex, Index_0) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_OnListItemObjectSetViaIndex::Index_0' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.OnListItemValueChangedViaIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex) == 0x000004, "Wrong size on WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex, Index_0) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_OnListItemValueChangedViaIndex::Index_0' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_PreConstruct");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_HUD_UseProps_ListItem_C_PreConstruct");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HUD_UseProps_ListItem.WBP_HUD_UseProps_ListItem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_UseProps_ListItem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_UseProps_ListItem_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_HUD_UseProps_ListItem_C_GetModuleName");
static_assert(sizeof(WBP_HUD_UseProps_ListItem_C_GetModuleName) == 0x000010, "Wrong size on WBP_HUD_UseProps_ListItem_C_GetModuleName");
static_assert(offsetof(WBP_HUD_UseProps_ListItem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_HUD_UseProps_ListItem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

