#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Challenge_AimList_Puzzle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Challenge_AimList_Puzzle.WBP_Challenge_AimList_Puzzle_C
// 0x0080 (0x0370 - 0x02F0)
class UWBP_Challenge_AimList_Puzzle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_AimType;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Social;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Star;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Glow;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Start;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Item_Change;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Start;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_Aim_Item_C*              WBP_Challenge_Aim_Item;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_Aim_Item_C*              WBP_Challenge_Aim_Item_1;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_Aim_Item_C*              WBP_Challenge_Aim_Item_2;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_Aim_Item_C*              WBP_Challenge_Aim_Item_3;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Challenge_AimList_Puzzle(int32 EntryPoint);
	void OnFadeOutStart();
	void SequenceEvent__ENTRYPOINTWBP_Challenge_AimList_Puzzle();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Challenge_AimList_Puzzle_C">();
	}
	static class UWBP_Challenge_AimList_Puzzle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Challenge_AimList_Puzzle_C>();
	}
};
static_assert(alignof(UWBP_Challenge_AimList_Puzzle_C) == 0x000008, "Wrong alignment on UWBP_Challenge_AimList_Puzzle_C");
static_assert(sizeof(UWBP_Challenge_AimList_Puzzle_C) == 0x000370, "Wrong size on UWBP_Challenge_AimList_Puzzle_C");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Challenge_AimList_Puzzle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, FadeOut) == 0x0002F8, "Member 'UWBP_Challenge_AimList_Puzzle_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, FadeIn) == 0x000300, "Member 'UWBP_Challenge_AimList_Puzzle_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Icon_AimType) == 0x000308, "Member 'UWBP_Challenge_AimList_Puzzle_C::Icon_AimType' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Icon_Social) == 0x000310, "Member 'UWBP_Challenge_AimList_Puzzle_C::Icon_Social' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Icon_Star) == 0x000318, "Member 'UWBP_Challenge_AimList_Puzzle_C::Icon_Star' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Image_Effect_Glow) == 0x000320, "Member 'UWBP_Challenge_AimList_Puzzle_C::Image_Effect_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Image_Effect_Start) == 0x000328, "Member 'UWBP_Challenge_AimList_Puzzle_C::Image_Effect_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, Name_0) == 0x000330, "Member 'UWBP_Challenge_AimList_Puzzle_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, UI_NS_Item_Change) == 0x000338, "Member 'UWBP_Challenge_AimList_Puzzle_C::UI_NS_Item_Change' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, UI_NS_Start) == 0x000340, "Member 'UWBP_Challenge_AimList_Puzzle_C::UI_NS_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, WBP_Challenge_Aim_Item) == 0x000348, "Member 'UWBP_Challenge_AimList_Puzzle_C::WBP_Challenge_Aim_Item' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, WBP_Challenge_Aim_Item_1) == 0x000350, "Member 'UWBP_Challenge_AimList_Puzzle_C::WBP_Challenge_Aim_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, WBP_Challenge_Aim_Item_2) == 0x000358, "Member 'UWBP_Challenge_AimList_Puzzle_C::WBP_Challenge_Aim_Item_2' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, WBP_Challenge_Aim_Item_3) == 0x000360, "Member 'UWBP_Challenge_AimList_Puzzle_C::WBP_Challenge_Aim_Item_3' has a wrong offset!");
static_assert(offsetof(UWBP_Challenge_AimList_Puzzle_C, WidgetSwitcher_Icon) == 0x000368, "Member 'UWBP_Challenge_AimList_Puzzle_C::WidgetSwitcher_Icon' has a wrong offset!");

}

