#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Interaction_CameraForbid_Mobile

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Interaction_CameraForbid_Mobile.WBP_Interaction_CameraForbid_Mobile_C.SetEnableColor
// 0x0001 (0x0001 - 0x0000)
struct WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor) == 0x000001, "Wrong alignment on WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor");
static_assert(sizeof(WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor) == 0x000001, "Wrong size on WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor, bEnable) == 0x000000, "Member 'WBP_Interaction_CameraForbid_Mobile_C_SetEnableColor::bEnable' has a wrong offset!");

// Function WBP_Interaction_CameraForbid_Mobile.WBP_Interaction_CameraForbid_Mobile_C.OnAreaTapDown
// 0x0238 (0x0238 - 0x0000)
struct WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	class ANikkiPlayerCameraManager_BP_C*         K2Node_DynamicCast_AsNikki_Player_Camera_Manager_BP; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown) == 0x000008, "Wrong alignment on WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown");
static_assert(sizeof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown) == 0x000238, "Wrong size on WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, MyGeometry) == 0x000000, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, MouseEvent) == 0x000038, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, ReturnValue) == 0x0000B0, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000168, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, CallFunc_Unhandled_ReturnValue) == 0x000170, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, K2Node_DynamicCast_AsNikki_Player_Camera_Manager_BP) == 0x000228, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::K2Node_DynamicCast_AsNikki_Player_Camera_Manager_BP' has a wrong offset!");
static_assert(offsetof(WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'WBP_Interaction_CameraForbid_Mobile_C_OnAreaTapDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

