#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhotoGraph_AimList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PhotoGraph_AimList.WBP_PhotoGraph_AimList_C.ExecuteUbergraph_WBP_PhotoGraph_AimList
// 0x0028 (0x0028 - 0x0000)
struct WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList) == 0x000008, "Wrong alignment on WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList");
static_assert(sizeof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList) == 0x000028, "Wrong size on WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList, EntryPoint) == 0x000000, "Member 'WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000008, "Member 'WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x000010, "Member 'WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_PhotoGraph_AimList_C_ExecuteUbergraph_WBP_PhotoGraph_AimList::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_PhotoGraph_AimList.WBP_PhotoGraph_AimList_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_PhotoGraph_AimList_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhotoGraph_AimList_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_PhotoGraph_AimList_C_GetModuleName");
static_assert(sizeof(WBP_PhotoGraph_AimList_C_GetModuleName) == 0x000010, "Wrong size on WBP_PhotoGraph_AimList_C_GetModuleName");
static_assert(offsetof(WBP_PhotoGraph_AimList_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_PhotoGraph_AimList_C_GetModuleName::ReturnValue' has a wrong offset!");

}

