#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Energy_InfoPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Energy_InfoPanel.WBP_Energy_InfoPanel_C
// 0x0068 (0x0358 - 0x02F0)
class UWBP_Energy_InfoPanel_C final : public UUserWidget
{
public:
	class UImage*                                 BG_Title1;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Title2;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg_1;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg_2;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Hint;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Hint_1;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Hint_2;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Time1;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Time2;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title1;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title2;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Energy_InfoPanel_C">();
	}
	static class UWBP_Energy_InfoPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Energy_InfoPanel_C>();
	}
};
static_assert(alignof(UWBP_Energy_InfoPanel_C) == 0x000008, "Wrong alignment on UWBP_Energy_InfoPanel_C");
static_assert(sizeof(UWBP_Energy_InfoPanel_C) == 0x000358, "Wrong size on UWBP_Energy_InfoPanel_C");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, BG_Title1) == 0x0002F0, "Member 'UWBP_Energy_InfoPanel_C::BG_Title1' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, BG_Title2) == 0x0002F8, "Member 'UWBP_Energy_InfoPanel_C::BG_Title2' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Image_bg) == 0x000300, "Member 'UWBP_Energy_InfoPanel_C::Image_bg' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Image_bg_1) == 0x000308, "Member 'UWBP_Energy_InfoPanel_C::Image_bg_1' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Image_bg_2) == 0x000310, "Member 'UWBP_Energy_InfoPanel_C::Image_bg_2' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Hint) == 0x000318, "Member 'UWBP_Energy_InfoPanel_C::Text_Hint' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Hint_1) == 0x000320, "Member 'UWBP_Energy_InfoPanel_C::Text_Hint_1' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Hint_2) == 0x000328, "Member 'UWBP_Energy_InfoPanel_C::Text_Hint_2' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Time1) == 0x000330, "Member 'UWBP_Energy_InfoPanel_C::Text_Time1' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Time2) == 0x000338, "Member 'UWBP_Energy_InfoPanel_C::Text_Time2' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Title1) == 0x000340, "Member 'UWBP_Energy_InfoPanel_C::Text_Title1' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, Text_Title2) == 0x000348, "Member 'UWBP_Energy_InfoPanel_C::Text_Title2' has a wrong offset!");
static_assert(offsetof(UWBP_Energy_InfoPanel_C, WidgetSwitcher_0) == 0x000350, "Member 'UWBP_Energy_InfoPanel_C::WidgetSwitcher_0' has a wrong offset!");

}

