#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LeftTip_Item

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LeftTip_Item.WBP_LeftTip_Item_C
// 0x0080 (0x0370 - 0x02F0)
class UWBP_LeftTip_Item_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Des;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_TargetHost;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Complete;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DES;                                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_100;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_177;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SemTargetHost;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Target;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_82;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LeftTip_Item_C">();
	}
	static class UWBP_LeftTip_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LeftTip_Item_C>();
	}
};
static_assert(alignof(UWBP_LeftTip_Item_C) == 0x000008, "Wrong alignment on UWBP_LeftTip_Item_C");
static_assert(sizeof(UWBP_LeftTip_Item_C) == 0x000370, "Wrong size on UWBP_LeftTip_Item_C");
static_assert(offsetof(UWBP_LeftTip_Item_C, FadeIn) == 0x0002F0, "Member 'UWBP_LeftTip_Item_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, FadeOut) == 0x0002F8, "Member 'UWBP_LeftTip_Item_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Button_Des) == 0x000300, "Member 'UWBP_LeftTip_Item_C::Button_Des' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Button_TargetHost) == 0x000308, "Member 'UWBP_LeftTip_Item_C::Button_TargetHost' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, CanvasPanel_0) == 0x000310, "Member 'UWBP_LeftTip_Item_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Complete) == 0x000318, "Member 'UWBP_LeftTip_Item_C::Complete' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, DES) == 0x000320, "Member 'UWBP_LeftTip_Item_C::DES' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, HorizontalBox_0) == 0x000328, "Member 'UWBP_LeftTip_Item_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Image_100) == 0x000330, "Member 'UWBP_LeftTip_Item_C::Image_100' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Image_177) == 0x000338, "Member 'UWBP_LeftTip_Item_C::Image_177' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Normal) == 0x000340, "Member 'UWBP_LeftTip_Item_C::Normal' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, Overlay_0) == 0x000348, "Member 'UWBP_LeftTip_Item_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, ProgressBar) == 0x000350, "Member 'UWBP_LeftTip_Item_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, SemTargetHost) == 0x000358, "Member 'UWBP_LeftTip_Item_C::SemTargetHost' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, SizeBox_Target) == 0x000360, "Member 'UWBP_LeftTip_Item_C::SizeBox_Target' has a wrong offset!");
static_assert(offsetof(UWBP_LeftTip_Item_C, WidgetSwitcher_82) == 0x000368, "Member 'UWBP_LeftTip_Item_C::WidgetSwitcher_82' has a wrong offset!");

}

