#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_X6FadingWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_X6FadingWidget.WBP_X6FadingWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_X6FadingWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_X6FadingWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_X6FadingWidget_C_PreConstruct");
static_assert(sizeof(WBP_X6FadingWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_X6FadingWidget_C_PreConstruct");
static_assert(offsetof(WBP_X6FadingWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_X6FadingWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_X6FadingWidget.WBP_X6FadingWidget_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_X6FadingWidget_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_X6FadingWidget_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_X6FadingWidget_C_OnAnimationFinished");
static_assert(sizeof(WBP_X6FadingWidget_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_X6FadingWidget_C_OnAnimationFinished");
static_assert(offsetof(WBP_X6FadingWidget_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_X6FadingWidget_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_X6FadingWidget.WBP_X6FadingWidget_C.ExecuteUbergraph_WBP_X6FadingWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget) == 0x000008, "Wrong alignment on WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget");
static_assert(sizeof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget) == 0x000028, "Wrong size on WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget");
static_assert(offsetof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget, EntryPoint) == 0x000000, "Member 'WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget, K2Node_Event_Animation) == 0x000018, "Member 'WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_X6FadingWidget_C_ExecuteUbergraph_WBP_X6FadingWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

