#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Ping

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Ping.WBP_HUD_Ping_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_HUD_Ping_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_Ping;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Num_Ping;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           PingColor_Green;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PingColor_Yellow;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PingColor_Red;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HUD_Ping(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Ping_C">();
	}
	static class UWBP_HUD_Ping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Ping_C>();
	}
};
static_assert(alignof(UWBP_HUD_Ping_C) == 0x000008, "Wrong alignment on UWBP_HUD_Ping_C");
static_assert(sizeof(UWBP_HUD_Ping_C) == 0x000338, "Wrong size on UWBP_HUD_Ping_C");
static_assert(offsetof(UWBP_HUD_Ping_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HUD_Ping_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Ping_C, Icon_Ping) == 0x0002F8, "Member 'UWBP_HUD_Ping_C::Icon_Ping' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Ping_C, Num_Ping) == 0x000300, "Member 'UWBP_HUD_Ping_C::Num_Ping' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Ping_C, PingColor_Green) == 0x000308, "Member 'UWBP_HUD_Ping_C::PingColor_Green' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Ping_C, PingColor_Yellow) == 0x000318, "Member 'UWBP_HUD_Ping_C::PingColor_Yellow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Ping_C, PingColor_Red) == 0x000328, "Member 'UWBP_HUD_Ping_C::PingColor_Red' has a wrong offset!");

}

