#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Common_KeyTips_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Common_KeyTips_PC.WBP_UI_Common_KeyTips_PC_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_UI_Common_KeyTips_PC_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ControlButtonBg_Img;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_bar;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_bg;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_KeyName;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Key;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SlotEnumName;                                      // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         KeyTips;                                           // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Common_KeyTips_PC(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetKey(const struct FKey& Key);
	void SetKeyByInputAction(const class FString& ActionPath);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Common_KeyTips_PC_C">();
	}
	static class UWBP_UI_Common_KeyTips_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Common_KeyTips_PC_C>();
	}
};
static_assert(alignof(UWBP_UI_Common_KeyTips_PC_C) == 0x000008, "Wrong alignment on UWBP_UI_Common_KeyTips_PC_C");
static_assert(sizeof(UWBP_UI_Common_KeyTips_PC_C) == 0x000350, "Wrong size on UWBP_UI_Common_KeyTips_PC_C");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_Common_KeyTips_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, ControlButtonBg_Img) == 0x0002F8, "Member 'UWBP_UI_Common_KeyTips_PC_C::ControlButtonBg_Img' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, Image_Icon) == 0x000300, "Member 'UWBP_UI_Common_KeyTips_PC_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, Img_Icon) == 0x000308, "Member 'UWBP_UI_Common_KeyTips_PC_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, InvalidationBox_0) == 0x000310, "Member 'UWBP_UI_Common_KeyTips_PC_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, Progress_bar) == 0x000318, "Member 'UWBP_UI_Common_KeyTips_PC_C::Progress_bar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, Progress_bg) == 0x000320, "Member 'UWBP_UI_Common_KeyTips_PC_C::Progress_bg' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, Text_KeyName) == 0x000328, "Member 'UWBP_UI_Common_KeyTips_PC_C::Text_KeyName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, WidgetSwitcher_Key) == 0x000330, "Member 'UWBP_UI_Common_KeyTips_PC_C::WidgetSwitcher_Key' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, SlotEnumName) == 0x000338, "Member 'UWBP_UI_Common_KeyTips_PC_C::SlotEnumName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Common_KeyTips_PC_C, KeyTips) == 0x000348, "Member 'UWBP_UI_Common_KeyTips_PC_C::KeyTips' has a wrong offset!");

}

