#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Common_KeyTips_WithDescribe_PC

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Common_KeyTips_WithDescribe_PC.WBP_UI_Common_KeyTips_WithDescribe_PC_C.ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC) == 0x000008, "Wrong alignment on WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC");
static_assert(sizeof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC) == 0x000020, "Wrong size on WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC, EntryPoint) == 0x000000, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000008, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC, CallFunc_Key_IsValid_ReturnValue) == 0x000018, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000019, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_ExecuteUbergraph_WBP_UI_Common_KeyTips_WithDescribe_PC::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_UI_Common_KeyTips_WithDescribe_PC.WBP_UI_Common_KeyTips_WithDescribe_PC_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct");
static_assert(sizeof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct");
static_assert(offsetof(WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Common_KeyTips_WithDescribe_PC_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

