#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Interaction_OperationItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Interaction_OperationItem.WBP_Interaction_OperationItem_C
// 0x0068 (0x0358 - 0x02F0)
class UWBP_Interaction_OperationItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed_InteractionBtn;                            // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut_InteractionBtn;                            // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_InteractionBtn;                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Btn_Interaction;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_All;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Btn;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CanvasPanel_Button;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ExtraSlot;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Interaction_glow;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Interaction;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Interaction_1;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               WBP_UI_Common_KeyTips;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Interaction_OperationItem(int32 EntryPoint);
	void BP_PostAKEventOnPressed();
	void BndEvt__WBP_Interaction_OperationItem_Btn_Interaction_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Interaction_OperationItem_C">();
	}
	static class UWBP_Interaction_OperationItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Interaction_OperationItem_C>();
	}
};
static_assert(alignof(UWBP_Interaction_OperationItem_C) == 0x000008, "Wrong alignment on UWBP_Interaction_OperationItem_C");
static_assert(sizeof(UWBP_Interaction_OperationItem_C) == 0x000358, "Wrong size on UWBP_Interaction_OperationItem_C");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Interaction_OperationItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, Pressed_InteractionBtn) == 0x0002F8, "Member 'UWBP_Interaction_OperationItem_C::Pressed_InteractionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, FadeOut_InteractionBtn) == 0x000300, "Member 'UWBP_Interaction_OperationItem_C::FadeOut_InteractionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, FadeIn_InteractionBtn) == 0x000308, "Member 'UWBP_Interaction_OperationItem_C::FadeIn_InteractionBtn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, Btn_Interaction) == 0x000310, "Member 'UWBP_Interaction_OperationItem_C::Btn_Interaction' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, CanvasPanel_All) == 0x000318, "Member 'UWBP_Interaction_OperationItem_C::CanvasPanel_All' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, CanvasPanel_Btn) == 0x000320, "Member 'UWBP_Interaction_OperationItem_C::CanvasPanel_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, CanvasPanel_Button) == 0x000328, "Member 'UWBP_Interaction_OperationItem_C::CanvasPanel_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, ExtraSlot) == 0x000330, "Member 'UWBP_Interaction_OperationItem_C::ExtraSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, Fx_Interaction_glow) == 0x000338, "Member 'UWBP_Interaction_OperationItem_C::Fx_Interaction_glow' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, Txt_Interaction) == 0x000340, "Member 'UWBP_Interaction_OperationItem_C::Txt_Interaction' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, Txt_Interaction_1) == 0x000348, "Member 'UWBP_Interaction_OperationItem_C::Txt_Interaction_1' has a wrong offset!");
static_assert(offsetof(UWBP_Interaction_OperationItem_C, WBP_UI_Common_KeyTips) == 0x000350, "Member 'UWBP_Interaction_OperationItem_C::WBP_UI_Common_KeyTips' has a wrong offset!");

}

