#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_PC

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Hud_PC.WBP_Hud_PC_C.BP_ShowOrHideEnergyLevelHud
// 0x0001 (0x0001 - 0x0000)
struct WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud) == 0x000001, "Wrong alignment on WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud");
static_assert(sizeof(WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud) == 0x000001, "Wrong size on WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud");
static_assert(offsetof(WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud, IsShow) == 0x000000, "Member 'WBP_Hud_PC_C_BP_ShowOrHideEnergyLevelHud::IsShow' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.Event_FadeIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_Event_FadeIn final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_Event_FadeIn) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_Event_FadeIn");
static_assert(sizeof(WBP_Hud_PC_C_Event_FadeIn) == 0x000008, "Wrong size on WBP_Hud_PC_C_Event_FadeIn");
static_assert(offsetof(WBP_Hud_PC_C_Event_FadeIn, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_Event_FadeIn::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.Event_FadeOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_Event_FadeOut final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_Event_FadeOut) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_Event_FadeOut");
static_assert(sizeof(WBP_Hud_PC_C_Event_FadeOut) == 0x000008, "Wrong size on WBP_Hud_PC_C_Event_FadeOut");
static_assert(offsetof(WBP_Hud_PC_C_Event_FadeOut, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_Event_FadeOut::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.ExecuteUbergraph_WBP_Hud_PC
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainActivity_C*                    K2Node_CustomEvent_MainActivity_3;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainActivity_C*                    K2Node_CustomEvent_MainActivity_2;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation_1;                          // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainActivity_C*                    K2Node_CustomEvent_MainActivity_1;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainActivity_C*                    K2Node_CustomEvent_MainActivity;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast_1;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC");
static_assert(sizeof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC) == 0x0000B0, "Wrong size on WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, EntryPoint) == 0x000000, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_CustomEvent_MainActivity_3) == 0x000008, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_CustomEvent_MainActivity_3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_CustomEvent_MainActivity_2) == 0x000010, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_CustomEvent_MainActivity_2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_PlayAnimation_ReturnValue_4) == 0x000038, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_Event_Animation_1) == 0x000040, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_Event_Animation_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_Event_Animation) == 0x000048, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_GetEndTime_ReturnValue) == 0x000050, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000054, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000058, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00005C, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_GetEndTime_ReturnValue_1) == 0x000060, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000064, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_CustomEvent_MainActivity_1) == 0x000070, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_CustomEvent_MainActivity_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000078, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, K2Node_CustomEvent_MainActivity) == 0x000080, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::K2Node_CustomEvent_MainActivity' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000088, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000089, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000090, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_B_ImplicitCast_1) == 0x0000A0, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'WBP_Hud_PC_C_ExecuteUbergraph_WBP_Hud_PC::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.HideHPParticle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_HideHPParticle final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_HideHPParticle) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_HideHPParticle");
static_assert(sizeof(WBP_Hud_PC_C_HideHPParticle) == 0x000008, "Wrong size on WBP_Hud_PC_C_HideHPParticle");
static_assert(offsetof(WBP_Hud_PC_C_HideHPParticle, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_HideHPParticle::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_OnAnimationFinished");
static_assert(sizeof(WBP_Hud_PC_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_Hud_PC_C_OnAnimationFinished");
static_assert(offsetof(WBP_Hud_PC_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_Hud_PC_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.OnAnimationStarted
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_OnAnimationStarted final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_OnAnimationStarted) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_OnAnimationStarted");
static_assert(sizeof(WBP_Hud_PC_C_OnAnimationStarted) == 0x000008, "Wrong size on WBP_Hud_PC_C_OnAnimationStarted");
static_assert(offsetof(WBP_Hud_PC_C_OnAnimationStarted, Animation) == 0x000000, "Member 'WBP_Hud_PC_C_OnAnimationStarted::Animation' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.SequenceEvent__ENTRYPOINTWBP_Hud_PC_4
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4 final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4");
static_assert(sizeof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4) == 0x000008, "Wrong size on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4");
static_assert(offsetof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_4::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.SequenceEvent__ENTRYPOINTWBP_Hud_PC_5
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5 final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5");
static_assert(sizeof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5) == 0x000008, "Wrong size on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5");
static_assert(offsetof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_5::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.SequenceEvent__ENTRYPOINTWBP_Hud_PC_6
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6 final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6");
static_assert(sizeof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6) == 0x000008, "Wrong size on WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6");
static_assert(offsetof(WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_SequenceEvent__ENTRYPOINTWBP_Hud_PC_6::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.ShowHPParticle
// 0x0008 (0x0008 - 0x0000)
struct WBP_Hud_PC_C_ShowHPParticle final
{
public:
	class UWBP_MainActivity_C*                    MainActivity_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_ShowHPParticle) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_ShowHPParticle");
static_assert(sizeof(WBP_Hud_PC_C_ShowHPParticle) == 0x000008, "Wrong size on WBP_Hud_PC_C_ShowHPParticle");
static_assert(offsetof(WBP_Hud_PC_C_ShowHPParticle, MainActivity_0) == 0x000000, "Member 'WBP_Hud_PC_C_ShowHPParticle::MainActivity_0' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.StopFadeInFull
// 0x0004 (0x0004 - 0x0000)
struct WBP_Hud_PC_C_StopFadeInFull final
{
public:
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_StopFadeInFull) == 0x000004, "Wrong alignment on WBP_Hud_PC_C_StopFadeInFull");
static_assert(sizeof(WBP_Hud_PC_C_StopFadeInFull) == 0x000004, "Wrong size on WBP_Hud_PC_C_StopFadeInFull");
static_assert(offsetof(WBP_Hud_PC_C_StopFadeInFull, CallFunc_PauseAnimation_ReturnValue) == 0x000000, "Member 'WBP_Hud_PC_C_StopFadeInFull::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Hud_PC.WBP_Hud_PC_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_PC_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_PC_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Hud_PC_C_GetModuleName");
static_assert(sizeof(WBP_Hud_PC_C_GetModuleName) == 0x000010, "Wrong size on WBP_Hud_PC_C_GetModuleName");
static_assert(offsetof(WBP_Hud_PC_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Hud_PC_C_GetModuleName::ReturnValue' has a wrong offset!");

}

