#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SysSocial_Rattle_Marker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SysSocial_Rattle_Marker.WBP_SysSocial_Rattle_Marker_C
// 0x0040 (0x0330 - 0x02F0)
class UWBP_SysSocial_Rattle_Marker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Click;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Distance;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_107;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               KeyTips_Click;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_48;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_SysSocial_Rattle_Marker(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SysSocial_Rattle_Marker_C">();
	}
	static class UWBP_SysSocial_Rattle_Marker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SysSocial_Rattle_Marker_C>();
	}
};
static_assert(alignof(UWBP_SysSocial_Rattle_Marker_C) == 0x000008, "Wrong alignment on UWBP_SysSocial_Rattle_Marker_C");
static_assert(sizeof(UWBP_SysSocial_Rattle_Marker_C) == 0x000330, "Wrong size on UWBP_SysSocial_Rattle_Marker_C");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_SysSocial_Rattle_Marker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, Button_Click) == 0x0002F8, "Member 'UWBP_SysSocial_Rattle_Marker_C::Button_Click' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, Distance) == 0x000300, "Member 'UWBP_SysSocial_Rattle_Marker_C::Distance' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, Image_107) == 0x000308, "Member 'UWBP_SysSocial_Rattle_Marker_C::Image_107' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, Img_Arrow) == 0x000310, "Member 'UWBP_SysSocial_Rattle_Marker_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, KeyTips_Click) == 0x000318, "Member 'UWBP_SysSocial_Rattle_Marker_C::KeyTips_Click' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, SizeBox_48) == 0x000320, "Member 'UWBP_SysSocial_Rattle_Marker_C::SizeBox_48' has a wrong offset!");
static_assert(offsetof(UWBP_SysSocial_Rattle_Marker_C, Text_Name) == 0x000328, "Member 'UWBP_SysSocial_Rattle_Marker_C::Text_Name' has a wrong offset!");

}

