#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_HP_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hud_HP_Item.WBP_Hud_HP_Item_C
// 0x0168 (0x0458 - 0x02F0)
class UWBP_Hud_HP_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResidualBlood_03;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SmallToNormal;                                     // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Small;                                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HP_BG_FadeOut;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full_Effect_Hide;                                  // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full_EffectIN;                                     // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HP_BG_FadeIN;                                      // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BigToNormal;                                       // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Big;                                               // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose_L_Spec;                                       // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose_R_Spec;                                       // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Heal_All;                                          // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose_ALL;                                          // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Heal_R;                                            // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Heal_L;                                            // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ResidualBlood_01;                                  // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose_L;                                            // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lose_R;                                            // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg_Heart;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Heart_1;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Full_Effect;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_HP_All_HightLight;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_HP_L_HightLight;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_HP_R_HightLight;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_LastBlood;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_371;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        L_Part;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Part_n;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Part_red;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        R_Part;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Part_N;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Part_red;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Trail;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_HealHP_All;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_HealHP_L;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_HealHP_P;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_HP_Trail;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Lose_L;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Lose_R;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_LoseHP_All;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       currentAnimation;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         BP_SlotIndex;                                      // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               playingAnimationArray;                             // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void __StopBgAnim();
	void BecomeBig();
	void BecomeBigToNormal();
	void BecomeNormalAtOnce();
	void BecomeSmallAtOnce();
	void BecomeSmallToNormal();
	void ExecuteUbergraph_WBP_Hud_HP_Item(int32 EntryPoint);
	void HideBg();
	void HideBgAtOnce();
	void HideDot();
	void HideTrail();
	void HideTrailEx();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayAnimationInternal(class UWidgetAnimation* Anim, bool needLoop);
	void PlayBothAddAnim(bool bSkipAnimation);
	void PlayBothMinusAnim(bool bSkipAnimation);
	void PlayLeftAddAnim();
	void PlayLeftMinusAnim();
	void PlayLeftMinusAnimSpec();
	void PlayResidualAnimation();
	void PlayResidualAnimationLooped();
	void PlayRightAddAnim();
	void PlayRightMinusAnim();
	void PlayRightMinusAnimSpec();
	void ResumeToSmall();
	void SetHpState(int32 hpState);
	void ShowBg();
	void ShowBgAtOnce();
	void ShowDot();
	void ShowDotAtOnce();
	void ShowTrail();
	void ShowTrailEx();
	void StopCurrentAnimation();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Hud_HP_Item_C">();
	}
	static class UWBP_Hud_HP_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hud_HP_Item_C>();
	}
};
static_assert(alignof(UWBP_Hud_HP_Item_C) == 0x000008, "Wrong alignment on UWBP_Hud_HP_Item_C");
static_assert(sizeof(UWBP_Hud_HP_Item_C) == 0x000458, "Wrong size on UWBP_Hud_HP_Item_C");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Hud_HP_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, ResidualBlood_03) == 0x0002F8, "Member 'UWBP_Hud_HP_Item_C::ResidualBlood_03' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, SmallToNormal) == 0x000300, "Member 'UWBP_Hud_HP_Item_C::SmallToNormal' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Small) == 0x000308, "Member 'UWBP_Hud_HP_Item_C::Small' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, HP_BG_FadeOut) == 0x000310, "Member 'UWBP_Hud_HP_Item_C::HP_BG_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Full_Effect_Hide) == 0x000318, "Member 'UWBP_Hud_HP_Item_C::Full_Effect_Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Full_EffectIN) == 0x000320, "Member 'UWBP_Hud_HP_Item_C::Full_EffectIN' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, HP_BG_FadeIN) == 0x000328, "Member 'UWBP_Hud_HP_Item_C::HP_BG_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, BigToNormal) == 0x000330, "Member 'UWBP_Hud_HP_Item_C::BigToNormal' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Big) == 0x000338, "Member 'UWBP_Hud_HP_Item_C::Big' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Lose_L_Spec) == 0x000340, "Member 'UWBP_Hud_HP_Item_C::Lose_L_Spec' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Lose_R_Spec) == 0x000348, "Member 'UWBP_Hud_HP_Item_C::Lose_R_Spec' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Heal_All) == 0x000350, "Member 'UWBP_Hud_HP_Item_C::Heal_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Lose_ALL) == 0x000358, "Member 'UWBP_Hud_HP_Item_C::Lose_ALL' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Heal_R) == 0x000360, "Member 'UWBP_Hud_HP_Item_C::Heal_R' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Heal_L) == 0x000368, "Member 'UWBP_Hud_HP_Item_C::Heal_L' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, ResidualBlood_01) == 0x000370, "Member 'UWBP_Hud_HP_Item_C::ResidualBlood_01' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Lose_L) == 0x000378, "Member 'UWBP_Hud_HP_Item_C::Lose_L' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Lose_R) == 0x000380, "Member 'UWBP_Hud_HP_Item_C::Lose_R' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Bg_Heart) == 0x000388, "Member 'UWBP_Hud_HP_Item_C::Bg_Heart' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Bg_Heart_1) == 0x000390, "Member 'UWBP_Hud_HP_Item_C::Bg_Heart_1' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Full_Effect) == 0x000398, "Member 'UWBP_Hud_HP_Item_C::Full_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, FX_HP_All_HightLight) == 0x0003A0, "Member 'UWBP_Hud_HP_Item_C::FX_HP_All_HightLight' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, FX_HP_L_HightLight) == 0x0003A8, "Member 'UWBP_Hud_HP_Item_C::FX_HP_L_HightLight' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, FX_HP_R_HightLight) == 0x0003B0, "Member 'UWBP_Hud_HP_Item_C::FX_HP_R_HightLight' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, FX_LastBlood) == 0x0003B8, "Member 'UWBP_Hud_HP_Item_C::FX_LastBlood' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, InvalidationBox_371) == 0x0003C0, "Member 'UWBP_Hud_HP_Item_C::InvalidationBox_371' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, L_Part) == 0x0003C8, "Member 'UWBP_Hud_HP_Item_C::L_Part' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, L_Part_n) == 0x0003D0, "Member 'UWBP_Hud_HP_Item_C::L_Part_n' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, L_Part_red) == 0x0003D8, "Member 'UWBP_Hud_HP_Item_C::L_Part_red' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, R_Part) == 0x0003E0, "Member 'UWBP_Hud_HP_Item_C::R_Part' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, R_Part_N) == 0x0003E8, "Member 'UWBP_Hud_HP_Item_C::R_Part_N' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, R_Part_red) == 0x0003F0, "Member 'UWBP_Hud_HP_Item_C::R_Part_red' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, Trail) == 0x0003F8, "Member 'UWBP_Hud_HP_Item_C::Trail' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_HealHP_All) == 0x000400, "Member 'UWBP_Hud_HP_Item_C::UI_NS_HealHP_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_HealHP_L) == 0x000408, "Member 'UWBP_Hud_HP_Item_C::UI_NS_HealHP_L' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_HealHP_P) == 0x000410, "Member 'UWBP_Hud_HP_Item_C::UI_NS_HealHP_P' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_HP_Trail) == 0x000418, "Member 'UWBP_Hud_HP_Item_C::UI_NS_HP_Trail' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_Lose_L) == 0x000420, "Member 'UWBP_Hud_HP_Item_C::UI_NS_Lose_L' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_Lose_R) == 0x000428, "Member 'UWBP_Hud_HP_Item_C::UI_NS_Lose_R' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, UI_NS_LoseHP_All) == 0x000430, "Member 'UWBP_Hud_HP_Item_C::UI_NS_LoseHP_All' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, currentAnimation) == 0x000438, "Member 'UWBP_Hud_HP_Item_C::currentAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, BP_SlotIndex) == 0x000440, "Member 'UWBP_Hud_HP_Item_C::BP_SlotIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Hud_HP_Item_C, playingAnimationArray) == 0x000448, "Member 'UWBP_Hud_HP_Item_C::playingAnimationArray' has a wrong offset!");

}

