#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Photograph_FinishTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Photograph_FinishTask.WBP_Photograph_FinishTask_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_Photograph_FinishTask_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_TaskEnd;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg_1;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_End;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_163;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             normaltx;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Message_3;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Photograph_FinishTask(int32 EntryPoint);
	void sfx1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Photograph_FinishTask_C">();
	}
	static class UWBP_Photograph_FinishTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Photograph_FinishTask_C>();
	}
};
static_assert(alignof(UWBP_Photograph_FinishTask_C) == 0x000008, "Wrong alignment on UWBP_Photograph_FinishTask_C");
static_assert(sizeof(UWBP_Photograph_FinishTask_C) == 0x000338, "Wrong size on UWBP_Photograph_FinishTask_C");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Photograph_FinishTask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, Ani_TaskEnd) == 0x0002F8, "Member 'UWBP_Photograph_FinishTask_C::Ani_TaskEnd' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, Bg_1) == 0x000300, "Member 'UWBP_Photograph_FinishTask_C::Bg_1' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, Icon_End) == 0x000308, "Member 'UWBP_Photograph_FinishTask_C::Icon_End' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, Image_163) == 0x000310, "Member 'UWBP_Photograph_FinishTask_C::Image_163' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, Normal) == 0x000318, "Member 'UWBP_Photograph_FinishTask_C::Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, normaltx) == 0x000320, "Member 'UWBP_Photograph_FinishTask_C::normaltx' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, TextBlock) == 0x000328, "Member 'UWBP_Photograph_FinishTask_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Photograph_FinishTask_C, UI_NS_Message_3) == 0x000330, "Member 'UWBP_Photograph_FinishTask_C::UI_NS_Message_3' has a wrong offset!");

}

