#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CatchingInsects_Mark

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C.ExecuteUbergraph_WBP_CatchingInsects_Mark
// 0x0018 (0x0018 - 0x0000)
struct WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark) == 0x000008, "Wrong alignment on WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark");
static_assert(sizeof(WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark) == 0x000018, "Wrong size on WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark, EntryPoint) == 0x000000, "Member 'WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark, K2Node_Event_Animation) == 0x000008, "Member 'WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_CatchingInsects_Mark_C_ExecuteUbergraph_WBP_CatchingInsects_Mark::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_CatchingInsects_Mark_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CatchingInsects_Mark_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_CatchingInsects_Mark_C_OnAnimationFinished");
static_assert(sizeof(WBP_CatchingInsects_Mark_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_CatchingInsects_Mark_C_OnAnimationFinished");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_CatchingInsects_Mark_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C.BP_DisplayWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_CatchingInsects_Mark_C_BP_DisplayWidget final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInSelect;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CheckEnterInsectAbility_bCatchingInsectAbility; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            CallFunc_SetAnimation_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget) == 0x000008, "Wrong alignment on WBP_CatchingInsects_Mark_C_BP_DisplayWidget");
static_assert(sizeof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget) == 0x000040, "Wrong size on WBP_CatchingInsects_Mark_C_BP_DisplayWidget");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, bInShow) == 0x000000, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::bInShow' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, bInSelect) == 0x000001, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::bInSelect' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_BP_CheckEnterInsectAbility_bCatchingInsectAbility) == 0x000010, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_BP_CheckEnterInsectAbility_bCatchingInsectAbility' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_SetAnimation_ReturnValue) == 0x000018, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_SetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000021, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000030, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_BooleanAND_ReturnValue_1) == 0x000038, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_DisplayWidget, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_CatchingInsects_Mark_C_BP_DisplayWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C.BP_CheckEnterInsectAbility
// 0x0001 (0x0001 - 0x0000)
struct WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility final
{
public:
	bool                                          bCatchingInsectAbility;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility) == 0x000001, "Wrong alignment on WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility");
static_assert(sizeof(WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility) == 0x000001, "Wrong size on WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility, bCatchingInsectAbility) == 0x000000, "Member 'WBP_CatchingInsects_Mark_C_BP_CheckEnterInsectAbility::bCatchingInsectAbility' has a wrong offset!");

// Function WBP_CatchingInsects_Mark.WBP_CatchingInsects_Mark_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_CatchingInsects_Mark_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CatchingInsects_Mark_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_CatchingInsects_Mark_C_GetModuleName");
static_assert(sizeof(WBP_CatchingInsects_Mark_C_GetModuleName) == 0x000010, "Wrong size on WBP_CatchingInsects_Mark_C_GetModuleName");
static_assert(offsetof(WBP_CatchingInsects_Mark_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_CatchingInsects_Mark_C_GetModuleName::ReturnValue' has a wrong offset!");

}

