#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Common_HeadFrame

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Common_HeadFrame.WBP_Common_HeadFrame_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_Common_HeadFrame_C final : public UUserWidget
{
public:
	class UButton*                                Button;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_413;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Head;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Frame;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LoadingFail;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpineWidget*                           Spine_icon;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpineWidget*                           Spine_Loading;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Icon;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Common_HeadFrame_C">();
	}
	static class UWBP_Common_HeadFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Common_HeadFrame_C>();
	}
};
static_assert(alignof(UWBP_Common_HeadFrame_C) == 0x000008, "Wrong alignment on UWBP_Common_HeadFrame_C");
static_assert(sizeof(UWBP_Common_HeadFrame_C) == 0x000338, "Wrong size on UWBP_Common_HeadFrame_C");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Button) == 0x0002F0, "Member 'UWBP_Common_HeadFrame_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Image_9) == 0x0002F8, "Member 'UWBP_Common_HeadFrame_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Image_413) == 0x000300, "Member 'UWBP_Common_HeadFrame_C::Image_413' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Image_Head) == 0x000308, "Member 'UWBP_Common_HeadFrame_C::Image_Head' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Img_Frame) == 0x000310, "Member 'UWBP_Common_HeadFrame_C::Img_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Img_LoadingFail) == 0x000318, "Member 'UWBP_Common_HeadFrame_C::Img_LoadingFail' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Spine_icon) == 0x000320, "Member 'UWBP_Common_HeadFrame_C::Spine_icon' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, Spine_Loading) == 0x000328, "Member 'UWBP_Common_HeadFrame_C::Spine_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_Common_HeadFrame_C, UI_NS_Icon) == 0x000330, "Member 'UWBP_Common_HeadFrame_C::UI_NS_Icon' has a wrong offset!");

}

