#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SocialTaskMarkerIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SocialTaskMarkerIcon.WBP_UI_SocialTaskMarkerIcon_C
// 0x0040 (0x0330 - 0x02F0)
class UWBP_UI_SocialTaskMarkerIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Sign_Active;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_Sign;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Glow;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight_01;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sign;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_UI_SocialTaskMarkerIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SocialTaskMarkerIcon_C">();
	}
	static class UWBP_UI_SocialTaskMarkerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SocialTaskMarkerIcon_C>();
	}
};
static_assert(alignof(UWBP_UI_SocialTaskMarkerIcon_C) == 0x000008, "Wrong alignment on UWBP_UI_SocialTaskMarkerIcon_C");
static_assert(sizeof(UWBP_UI_SocialTaskMarkerIcon_C) == 0x000330, "Wrong size on UWBP_UI_SocialTaskMarkerIcon_C");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Ani_Sign_Active) == 0x0002F8, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Ani_Sign_Active' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Loop_Sign) == 0x000300, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Loop_Sign' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, CanvasPanel_0) == 0x000308, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Fx_Glow) == 0x000310, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Fx_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Fx_highlight) == 0x000318, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Fx_highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Fx_highlight_01) == 0x000320, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Fx_highlight_01' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SocialTaskMarkerIcon_C, Image_Sign) == 0x000328, "Member 'UWBP_UI_SocialTaskMarkerIcon_C::Image_Sign' has a wrong offset!");

}

