#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhotoGraph_AimList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhotoGraph_AimList.WBP_PhotoGraph_AimList_C
// 0x00B0 (0x03A0 - 0x02F0)
class UWBP_PhotoGraph_AimList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Expand;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Collapse;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Change;                                        // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Img;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Name;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_AimType;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_81;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_Hover;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_Normal;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Glow;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Start;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowBtn;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Item_Change;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UI_NS_Start;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenge_Aim_Item_C*              WBP_Challenge_Aim_Item;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Arrow;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        HoldTimeBegin;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BP_IgnoreClickOnce;                                // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PhotoGraph_AimList_Button_Name_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_PhotoGraph_AimList_Button_Name_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_PhotoGraph_AimList_ShowBtn_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PhotoGraph_AimList(int32 EntryPoint);
	void SequenceEvent__ENTRYPOINTWBP_PhotoGraph_AimList();
	void SFX();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhotoGraph_AimList_C">();
	}
	static class UWBP_PhotoGraph_AimList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhotoGraph_AimList_C>();
	}
};
static_assert(alignof(UWBP_PhotoGraph_AimList_C) == 0x000008, "Wrong alignment on UWBP_PhotoGraph_AimList_C");
static_assert(sizeof(UWBP_PhotoGraph_AimList_C) == 0x0003A0, "Wrong size on UWBP_PhotoGraph_AimList_C");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_PhotoGraph_AimList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Ani_Expand) == 0x0002F8, "Member 'UWBP_PhotoGraph_AimList_C::Ani_Expand' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Ani_Collapse) == 0x000300, "Member 'UWBP_PhotoGraph_AimList_C::Ani_Collapse' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, FadeOut) == 0x000308, "Member 'UWBP_PhotoGraph_AimList_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Ani_Change) == 0x000310, "Member 'UWBP_PhotoGraph_AimList_C::Ani_Change' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, FadeIn) == 0x000318, "Member 'UWBP_PhotoGraph_AimList_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Arrow_Img) == 0x000320, "Member 'UWBP_PhotoGraph_AimList_C::Arrow_Img' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Button_Name) == 0x000328, "Member 'UWBP_PhotoGraph_AimList_C::Button_Name' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Icon_AimType) == 0x000330, "Member 'UWBP_PhotoGraph_AimList_C::Icon_AimType' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Image_81) == 0x000338, "Member 'UWBP_PhotoGraph_AimList_C::Image_81' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Image_Arrow_Hover) == 0x000340, "Member 'UWBP_PhotoGraph_AimList_C::Image_Arrow_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Image_Arrow_Normal) == 0x000348, "Member 'UWBP_PhotoGraph_AimList_C::Image_Arrow_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Image_Effect_Glow) == 0x000350, "Member 'UWBP_PhotoGraph_AimList_C::Image_Effect_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Image_Effect_Start) == 0x000358, "Member 'UWBP_PhotoGraph_AimList_C::Image_Effect_Start' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, Name_0) == 0x000360, "Member 'UWBP_PhotoGraph_AimList_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, ShowBtn) == 0x000368, "Member 'UWBP_PhotoGraph_AimList_C::ShowBtn' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, UI_NS_Item_Change) == 0x000370, "Member 'UWBP_PhotoGraph_AimList_C::UI_NS_Item_Change' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, UI_NS_Start) == 0x000378, "Member 'UWBP_PhotoGraph_AimList_C::UI_NS_Start' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, WBP_Challenge_Aim_Item) == 0x000380, "Member 'UWBP_PhotoGraph_AimList_C::WBP_Challenge_Aim_Item' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, WidgetSwitcher_Arrow) == 0x000388, "Member 'UWBP_PhotoGraph_AimList_C::WidgetSwitcher_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, HoldTimeBegin) == 0x000390, "Member 'UWBP_PhotoGraph_AimList_C::HoldTimeBegin' has a wrong offset!");
static_assert(offsetof(UWBP_PhotoGraph_AimList_C, BP_IgnoreClickOnce) == 0x000398, "Member 'UWBP_PhotoGraph_AimList_C::BP_IgnoreClickOnce' has a wrong offset!");

}

