#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugNwczionEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugNwczionEntry.WBP_DebugNwczionEntry_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_DebugNwczionEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Environment;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBG;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Path;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_DebugNwczionEntry(int32 EntryPoint);
	void OnListItemObjectSetViaIndex(int32 Index_0);
	void OnListItemValueChangedViaIndex(int32 Index_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugNwczionEntry_C">();
	}
	static class UWBP_DebugNwczionEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugNwczionEntry_C>();
	}
};
static_assert(alignof(UWBP_DebugNwczionEntry_C) == 0x000008, "Wrong alignment on UWBP_DebugNwczionEntry_C");
static_assert(sizeof(UWBP_DebugNwczionEntry_C) == 0x000318, "Wrong size on UWBP_DebugNwczionEntry_C");
static_assert(offsetof(UWBP_DebugNwczionEntry_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_DebugNwczionEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczionEntry_C, Environment) == 0x0002F8, "Member 'UWBP_DebugNwczionEntry_C::Environment' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczionEntry_C, ImgBG) == 0x000300, "Member 'UWBP_DebugNwczionEntry_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczionEntry_C, Name_0) == 0x000308, "Member 'UWBP_DebugNwczionEntry_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_DebugNwczionEntry_C, Path) == 0x000310, "Member 'UWBP_DebugNwczionEntry_C::Path' has a wrong offset!");

}

