#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Marker_MiniMap

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Marker_MiniMap.WBP_UI_Marker_MiniMap_C
// 0x0048 (0x0338 - 0x02F0)
class UWBP_UI_Marker_MiniMap_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Following;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Follow_Effect;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FloorOff;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FloorOn;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Marker_ICON;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Marker_MiniMap_C">();
	}
	static class UWBP_UI_Marker_MiniMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Marker_MiniMap_C>();
	}
};
static_assert(alignof(UWBP_UI_Marker_MiniMap_C) == 0x000008, "Wrong alignment on UWBP_UI_Marker_MiniMap_C");
static_assert(sizeof(UWBP_UI_Marker_MiniMap_C) == 0x000338, "Wrong size on UWBP_UI_Marker_MiniMap_C");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, FadeIn) == 0x0002F0, "Member 'UWBP_UI_Marker_MiniMap_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Anim_Following) == 0x0002F8, "Member 'UWBP_UI_Marker_MiniMap_C::Anim_Following' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Follow_Effect) == 0x000300, "Member 'UWBP_UI_Marker_MiniMap_C::Follow_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Image) == 0x000308, "Member 'UWBP_UI_Marker_MiniMap_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Image_4) == 0x000310, "Member 'UWBP_UI_Marker_MiniMap_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Image_7) == 0x000318, "Member 'UWBP_UI_Marker_MiniMap_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Image_FloorOff) == 0x000320, "Member 'UWBP_UI_Marker_MiniMap_C::Image_FloorOff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Image_FloorOn) == 0x000328, "Member 'UWBP_UI_Marker_MiniMap_C::Image_FloorOn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Marker_MiniMap_C, Marker_ICON) == 0x000330, "Member 'UWBP_UI_Marker_MiniMap_C::Marker_ICON' has a wrong offset!");

}

