#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotUpdate_Button_Confirm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HotUpdate_Button_Confirm.WBP_HotUpdate_Button_Confirm_C
// 0x0068 (0x0358 - 0x02F0)
class UWBP_HotUpdate_Button_Confirm_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Grey;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Pressed;                                       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover;                                         // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonArea;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Content;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover_Img;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pressed_Img;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SingleTx;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0338(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Common_Button_Confirm_ButtonArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Confirm_ButtonArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Confirm_ButtonArea_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Confirm_ButtonArea_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Confirm_ButtonArea_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HotUpdate_Button_Confirm(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetTitle(const class FText& NewTitle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HotUpdate_Button_Confirm_C">();
	}
	static class UWBP_HotUpdate_Button_Confirm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HotUpdate_Button_Confirm_C>();
	}
};
static_assert(alignof(UWBP_HotUpdate_Button_Confirm_C) == 0x000008, "Wrong alignment on UWBP_HotUpdate_Button_Confirm_C");
static_assert(sizeof(UWBP_HotUpdate_Button_Confirm_C) == 0x000358, "Wrong size on UWBP_HotUpdate_Button_Confirm_C");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_HotUpdate_Button_Confirm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Ani_Grey) == 0x0002F8, "Member 'UWBP_HotUpdate_Button_Confirm_C::Ani_Grey' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Ani_Pressed) == 0x000300, "Member 'UWBP_HotUpdate_Button_Confirm_C::Ani_Pressed' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Ani_Hover) == 0x000308, "Member 'UWBP_HotUpdate_Button_Confirm_C::Ani_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, ButtonArea) == 0x000310, "Member 'UWBP_HotUpdate_Button_Confirm_C::ButtonArea' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Content) == 0x000318, "Member 'UWBP_HotUpdate_Button_Confirm_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Hover_Img) == 0x000320, "Member 'UWBP_HotUpdate_Button_Confirm_C::Hover_Img' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Pressed_Img) == 0x000328, "Member 'UWBP_HotUpdate_Button_Confirm_C::Pressed_Img' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, SingleTx) == 0x000330, "Member 'UWBP_HotUpdate_Button_Confirm_C::SingleTx' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, Title) == 0x000338, "Member 'UWBP_HotUpdate_Button_Confirm_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_HotUpdate_Button_Confirm_C, OnClicked) == 0x000348, "Member 'UWBP_HotUpdate_Button_Confirm_C::OnClicked' has a wrong offset!");

}

