#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_headUI_name

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_headUI_name.WBP_UI_headUI_name_C.GetHeight
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_headUI_name_C_GetHeight final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_NewParam_ImplicitCast;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_name_C_GetHeight) == 0x000008, "Wrong alignment on WBP_UI_headUI_name_C_GetHeight");
static_assert(sizeof(WBP_UI_headUI_name_C_GetHeight) == 0x000010, "Wrong size on WBP_UI_headUI_name_C_GetHeight");
static_assert(offsetof(WBP_UI_headUI_name_C_GetHeight, NewParam) == 0x000000, "Member 'WBP_UI_headUI_name_C_GetHeight::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_GetHeight, K2Node_FunctionResult_NewParam_ImplicitCast) == 0x000008, "Member 'WBP_UI_headUI_name_C_GetHeight::K2Node_FunctionResult_NewParam_ImplicitCast' has a wrong offset!");

// Function WBP_UI_headUI_name.WBP_UI_headUI_name_C.ExecuteUbergraph_WBP_UI_headUI_name
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name) == 0x000008, "Wrong alignment on WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name");
static_assert(sizeof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name) == 0x000018, "Wrong size on WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, EntryPoint) == 0x000000, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, K2Node_SwitchEnum_CmpSuccess_1) == 0x000005, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, K2Node_SwitchEnum_CmpSuccess_2) == 0x000006, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_UI_headUI_name_C_ExecuteUbergraph_WBP_UI_headUI_name::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_headUI_name.WBP_UI_headUI_name_C.SwitchVisibility
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_headUI_name_C_SwitchVisibility final
{
public:
	ESlateVisibility                              EVisibility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_headUI_name_C_SwitchVisibility) == 0x000008, "Wrong alignment on WBP_UI_headUI_name_C_SwitchVisibility");
static_assert(sizeof(WBP_UI_headUI_name_C_SwitchVisibility) == 0x000030, "Wrong size on WBP_UI_headUI_name_C_SwitchVisibility");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, EVisibility) == 0x000000, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::EVisibility' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess_1) == 0x000028, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_headUI_name_C_SwitchVisibility, K2Node_SwitchEnum_CmpSuccess_2) == 0x000029, "Member 'WBP_UI_headUI_name_C_SwitchVisibility::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

}

