#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hud_Action_Rattle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Hud_Action_Rattle.WBP_Hud_Action_Rattle_C.OnMouseButtonUp
// 0x03A0 (0x03A0 - 0x0000)
struct WBP_Hud_Action_Rattle_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_PointerEvent_GetPointerIndex_ReturnValue; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0228(0x00B8)()
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_ReleaseMouseCapture_ReturnValue;          // 0x02E8(0x00B8)()
};
static_assert(alignof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_Hud_Action_Rattle_C_OnMouseButtonUp");
static_assert(sizeof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp) == 0x0003A0, "Wrong size on WBP_Hud_Action_Rattle_C_OnMouseButtonUp");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, CallFunc_PointerEvent_GetPointerIndex_ReturnValue) == 0x000168, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::CallFunc_PointerEvent_GetPointerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, CallFunc_Unhandled_ReturnValue) == 0x000170, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000228, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x0002E0, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonUp, CallFunc_ReleaseMouseCapture_ReturnValue) == 0x0002E8, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonUp::CallFunc_ReleaseMouseCapture_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Action_Rattle.WBP_Hud_Action_Rattle_C.OnMouseButtonDown
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Hud_Action_Rattle_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_PointerEvent_GetPointerIndex_ReturnValue; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	struct FEventReply                            CallFunc_CaptureMouse_ReturnValue;                 // 0x0228(0x00B8)()
};
static_assert(alignof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_Hud_Action_Rattle_C_OnMouseButtonDown");
static_assert(sizeof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown) == 0x0002E0, "Wrong size on WBP_Hud_Action_Rattle_C_OnMouseButtonDown");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, CallFunc_PointerEvent_GetPointerIndex_ReturnValue) == 0x000168, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::CallFunc_PointerEvent_GetPointerIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_OnMouseButtonDown, CallFunc_CaptureMouse_ReturnValue) == 0x000228, "Member 'WBP_Hud_Action_Rattle_C_OnMouseButtonDown::CallFunc_CaptureMouse_ReturnValue' has a wrong offset!");

// Function WBP_Hud_Action_Rattle.WBP_Hud_Action_Rattle_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Hud_Action_Rattle_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Hud_Action_Rattle_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Hud_Action_Rattle_C_GetModuleName");
static_assert(sizeof(WBP_Hud_Action_Rattle_C_GetModuleName) == 0x000010, "Wrong size on WBP_Hud_Action_Rattle_C_GetModuleName");
static_assert(offsetof(WBP_Hud_Action_Rattle_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Hud_Action_Rattle_C_GetModuleName::ReturnValue' has a wrong offset!");

}

