#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_headUI_interactiveicon

#include "Basic.hpp"

#include "EHeadUIState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_headUI_interactiveicon.WBP_UI_headUI_interactiveicon_C
// 0x0058 (0x0348 - 0x02F0)
class UWBP_UI_headUI_interactiveicon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Change;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Fx_Glow;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_highlight_1;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 sys_icon;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 sys_icon_h;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHeadUIState                                  CurrentShowState;                                  // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeadUIState                                  NextShowState;                                     // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UI_headUI_interactiveicon(int32 EntryPoint);
	void PlayIdleAnim();
	void PlayOutAnim();
	void PlayShowAnim();
	void RefreshAnimState();
	void StopIdleAnim();
	void SwitchVisibility(ESlateVisibility EVisibility);
	void WidgetAnimationEvt_FadeIn_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_headUI_interactiveicon_C">();
	}
	static class UWBP_UI_headUI_interactiveicon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_headUI_interactiveicon_C>();
	}
};
static_assert(alignof(UWBP_UI_headUI_interactiveicon_C) == 0x000008, "Wrong alignment on UWBP_UI_headUI_interactiveicon_C");
static_assert(sizeof(UWBP_UI_headUI_interactiveicon_C) == 0x000348, "Wrong size on UWBP_UI_headUI_interactiveicon_C");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_headUI_interactiveicon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, Ani_Change) == 0x0002F8, "Member 'UWBP_UI_headUI_interactiveicon_C::Ani_Change' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, Loop) == 0x000300, "Member 'UWBP_UI_headUI_interactiveicon_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, FadeOut) == 0x000308, "Member 'UWBP_UI_headUI_interactiveicon_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, FadeIn) == 0x000310, "Member 'UWBP_UI_headUI_interactiveicon_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, Fx_Glow) == 0x000318, "Member 'UWBP_UI_headUI_interactiveicon_C::Fx_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, Fx_highlight) == 0x000320, "Member 'UWBP_UI_headUI_interactiveicon_C::Fx_highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, Fx_highlight_1) == 0x000328, "Member 'UWBP_UI_headUI_interactiveicon_C::Fx_highlight_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, sys_icon) == 0x000330, "Member 'UWBP_UI_headUI_interactiveicon_C::sys_icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, sys_icon_h) == 0x000338, "Member 'UWBP_UI_headUI_interactiveicon_C::sys_icon_h' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, CurrentShowState) == 0x000340, "Member 'UWBP_UI_headUI_interactiveicon_C::CurrentShowState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_headUI_interactiveicon_C, NextShowState) == 0x000341, "Member 'UWBP_UI_headUI_interactiveicon_C::NextShowState' has a wrong offset!");

}

