#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SysHUD_FunctionButton

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SysHUD_FunctionButton.WBP_SysHUD_FunctionButton_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_SysHUD_FunctionButton_C final : public UUserWidget
{
public:
	class UX6MultiPlatformButton*                 Button_Function;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_bg;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg_H;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Common_KeyTips_C*               KeyTips_Function;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SysHUD_FunctionButton_C">();
	}
	static class UWBP_SysHUD_FunctionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SysHUD_FunctionButton_C>();
	}
};
static_assert(alignof(UWBP_SysHUD_FunctionButton_C) == 0x000008, "Wrong alignment on UWBP_SysHUD_FunctionButton_C");
static_assert(sizeof(UWBP_SysHUD_FunctionButton_C) == 0x000310, "Wrong size on UWBP_SysHUD_FunctionButton_C");
static_assert(offsetof(UWBP_SysHUD_FunctionButton_C, Button_Function) == 0x0002F0, "Member 'UWBP_SysHUD_FunctionButton_C::Button_Function' has a wrong offset!");
static_assert(offsetof(UWBP_SysHUD_FunctionButton_C, Image_bg) == 0x0002F8, "Member 'UWBP_SysHUD_FunctionButton_C::Image_bg' has a wrong offset!");
static_assert(offsetof(UWBP_SysHUD_FunctionButton_C, Image_Bg_H) == 0x000300, "Member 'UWBP_SysHUD_FunctionButton_C::Image_Bg_H' has a wrong offset!");
static_assert(offsetof(UWBP_SysHUD_FunctionButton_C, KeyTips_Function) == 0x000308, "Member 'UWBP_SysHUD_FunctionButton_C::KeyTips_Function' has a wrong offset!");

}

