#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FunctionSet_Action_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FunctionSet_Action_Item.WBP_FunctionSet_Action_Item_C
// 0x00F8 (0x03E8 - 0x02F0)
class UWBP_FunctionSet_Action_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Select_N;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Progress_play;                                 // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_waiting_loop;                                  // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hover;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Select;                                        // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Fadein;                                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UX6MultiPlatformButton*                 Button_Collect;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Movement;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot;                                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_1;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_2;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_3;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_4;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_5;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_6;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 dot_7;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   Effect_Select;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Collect;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Interactive;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InviteProgress;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NotCollect;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Photo;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Loading;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Progress_play;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UX6RadialSlider*                        Progress_play_1;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Select;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_N;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Select_Num;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Collect;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Progress;                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_FunctionSet_Action_Item_Button_Movement_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FunctionSet_Action_Item_Button_Movement_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_FunctionSet_Action_Item(int32 EntryPoint);
	void OnListItemObjectSetViaIndex(int32 Index_0);
	void OnListItemValueChangedViaIndex(int32 Index_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FunctionSet_Action_Item_C">();
	}
	static class UWBP_FunctionSet_Action_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FunctionSet_Action_Item_C>();
	}
};
static_assert(alignof(UWBP_FunctionSet_Action_Item_C) == 0x000008, "Wrong alignment on UWBP_FunctionSet_Action_Item_C");
static_assert(sizeof(UWBP_FunctionSet_Action_Item_C) == 0x0003E8, "Wrong size on UWBP_FunctionSet_Action_Item_C");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_FunctionSet_Action_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_Select_N) == 0x0002F8, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_Select_N' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_Progress_play) == 0x000300, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_waiting_loop) == 0x000308, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_waiting_loop' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_Hover) == 0x000310, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_Select) == 0x000318, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_Select' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Ani_Fadein) == 0x000320, "Member 'UWBP_FunctionSet_Action_Item_C::Ani_Fadein' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Button_Collect) == 0x000328, "Member 'UWBP_FunctionSet_Action_Item_C::Button_Collect' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Button_Movement) == 0x000330, "Member 'UWBP_FunctionSet_Action_Item_C::Button_Movement' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot) == 0x000338, "Member 'UWBP_FunctionSet_Action_Item_C::dot' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_1) == 0x000340, "Member 'UWBP_FunctionSet_Action_Item_C::dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_2) == 0x000348, "Member 'UWBP_FunctionSet_Action_Item_C::dot_2' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_3) == 0x000350, "Member 'UWBP_FunctionSet_Action_Item_C::dot_3' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_4) == 0x000358, "Member 'UWBP_FunctionSet_Action_Item_C::dot_4' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_5) == 0x000360, "Member 'UWBP_FunctionSet_Action_Item_C::dot_5' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_6) == 0x000368, "Member 'UWBP_FunctionSet_Action_Item_C::dot_6' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, dot_7) == 0x000370, "Member 'UWBP_FunctionSet_Action_Item_C::dot_7' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Effect_Select) == 0x000378, "Member 'UWBP_FunctionSet_Action_Item_C::Effect_Select' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Image_Collect) == 0x000380, "Member 'UWBP_FunctionSet_Action_Item_C::Image_Collect' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Image_Interactive) == 0x000388, "Member 'UWBP_FunctionSet_Action_Item_C::Image_Interactive' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Image_InviteProgress) == 0x000390, "Member 'UWBP_FunctionSet_Action_Item_C::Image_InviteProgress' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Image_NotCollect) == 0x000398, "Member 'UWBP_FunctionSet_Action_Item_C::Image_NotCollect' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Img_Photo) == 0x0003A0, "Member 'UWBP_FunctionSet_Action_Item_C::Img_Photo' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Loading) == 0x0003A8, "Member 'UWBP_FunctionSet_Action_Item_C::Loading' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Progress_play) == 0x0003B0, "Member 'UWBP_FunctionSet_Action_Item_C::Progress_play' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Progress_play_1) == 0x0003B8, "Member 'UWBP_FunctionSet_Action_Item_C::Progress_play_1' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Select) == 0x0003C0, "Member 'UWBP_FunctionSet_Action_Item_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Select_N) == 0x0003C8, "Member 'UWBP_FunctionSet_Action_Item_C::Select_N' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, Text_Select_Num) == 0x0003D0, "Member 'UWBP_FunctionSet_Action_Item_C::Text_Select_Num' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, WidgetSwitcher_Collect) == 0x0003D8, "Member 'UWBP_FunctionSet_Action_Item_C::WidgetSwitcher_Collect' has a wrong offset!");
static_assert(offsetof(UWBP_FunctionSet_Action_Item_C, WidgetSwitcher_Progress) == 0x0003E0, "Member 'UWBP_FunctionSet_Action_Item_C::WidgetSwitcher_Progress' has a wrong offset!");

}

