#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LeftInfoPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_LeftInfoPanel.WBP_UI_LeftInfoPanel_C.CreateLeftInfoCell
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell final
{
public:
	class UWBP_Hud_LeftTip_C*                     Cell;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Hud_LeftTip_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell) == 0x000008, "Wrong alignment on WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell");
static_assert(sizeof(WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell) == 0x000010, "Wrong size on WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell");
static_assert(offsetof(WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell, Cell) == 0x000000, "Member 'WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell::Cell' has a wrong offset!");
static_assert(offsetof(WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_LeftInfoPanel_C_CreateLeftInfoCell::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_UI_LeftInfoPanel.WBP_UI_LeftInfoPanel_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_LeftInfoPanel_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LeftInfoPanel_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_UI_LeftInfoPanel_C_GetModuleName");
static_assert(sizeof(WBP_UI_LeftInfoPanel_C_GetModuleName) == 0x000010, "Wrong size on WBP_UI_LeftInfoPanel_C_GetModuleName");
static_assert(offsetof(WBP_UI_LeftInfoPanel_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_UI_LeftInfoPanel_C_GetModuleName::ReturnValue' has a wrong offset!");

}

