#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetVisibilityState

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK
{

// UserDefinedStruct WidgetVisibilityState.WidgetVisibilityState
// 0x0012 (0x0012 - 0x0000)
struct FWidgetVisibilityState final
{
public:
	ESlateVisibility                              Default_5_9296CF8C40483A5A875D6FBDBD62D09B;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              FishState_ShowTopHUDWidget_10_BEB5A41C4705EF10A3474DBD72CFD60A; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              FishState_ShowAllHUDWidget_11_A1BCCBEA4F6E891EDAADDDA234AC5BF4; // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              FishState_CloseAllHUDWidget_13_4D26795942B58CC3A3CAB79EF3A2291E; // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ShadowDetective_ShowAllHudWidget_17_71A077E040CBF2C3710108B93F832634; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ShadowDetective_CloseAllHUDWidget_20_BA8E5F354B48EBD89F27F489F0FABCAC; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SuperBag_ShowBag_31_6E8E820E402938E559C61DB86E8D6A6A; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SuperBag_ShowEmpty_32_48DA3A5F487AF40A7D687DB65EC8B29D; // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SuperBag_ShowSpirit_33_6AC630FA429585C0BB5F4085A9E2D6D9; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SuperBag_ShowMap_34_621D03C4416DE542F3B2D68E58BC291F; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SuperBag_ShowPear_35_5C8D788A44ADB036E3B1ABB99C14F3A0; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CleanAnimal_ShowAll_40_2E275345470300BEEACFE4ADB47D20B4; // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CleanAnimal_CloseAll_41_B150075F4F5109981C26BEABE3A7FB21; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              RidingBikeState_45_7448B2804ABD2F41AC0C37BE1FEB6526; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              SitOnCarrierState_48_BC7646754E2DD8EE1B0AC0BC0FDA2963; // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              EventBallonState_Show_58_A194D5814B03C470BA9868997CAADC53; // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              EventBallonState_Close_59_FF11C92245031FC9FEB520BB76722226; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              OpenSysSocialMainState_62_A52BC79345E37DE4752163815B66B70B; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWidgetVisibilityState) == 0x000001, "Wrong alignment on FWidgetVisibilityState");
static_assert(sizeof(FWidgetVisibilityState) == 0x000012, "Wrong size on FWidgetVisibilityState");
static_assert(offsetof(FWidgetVisibilityState, Default_5_9296CF8C40483A5A875D6FBDBD62D09B) == 0x000000, "Member 'FWidgetVisibilityState::Default_5_9296CF8C40483A5A875D6FBDBD62D09B' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, FishState_ShowTopHUDWidget_10_BEB5A41C4705EF10A3474DBD72CFD60A) == 0x000001, "Member 'FWidgetVisibilityState::FishState_ShowTopHUDWidget_10_BEB5A41C4705EF10A3474DBD72CFD60A' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, FishState_ShowAllHUDWidget_11_A1BCCBEA4F6E891EDAADDDA234AC5BF4) == 0x000002, "Member 'FWidgetVisibilityState::FishState_ShowAllHUDWidget_11_A1BCCBEA4F6E891EDAADDDA234AC5BF4' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, FishState_CloseAllHUDWidget_13_4D26795942B58CC3A3CAB79EF3A2291E) == 0x000003, "Member 'FWidgetVisibilityState::FishState_CloseAllHUDWidget_13_4D26795942B58CC3A3CAB79EF3A2291E' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, ShadowDetective_ShowAllHudWidget_17_71A077E040CBF2C3710108B93F832634) == 0x000004, "Member 'FWidgetVisibilityState::ShadowDetective_ShowAllHudWidget_17_71A077E040CBF2C3710108B93F832634' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, ShadowDetective_CloseAllHUDWidget_20_BA8E5F354B48EBD89F27F489F0FABCAC) == 0x000005, "Member 'FWidgetVisibilityState::ShadowDetective_CloseAllHUDWidget_20_BA8E5F354B48EBD89F27F489F0FABCAC' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SuperBag_ShowBag_31_6E8E820E402938E559C61DB86E8D6A6A) == 0x000006, "Member 'FWidgetVisibilityState::SuperBag_ShowBag_31_6E8E820E402938E559C61DB86E8D6A6A' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SuperBag_ShowEmpty_32_48DA3A5F487AF40A7D687DB65EC8B29D) == 0x000007, "Member 'FWidgetVisibilityState::SuperBag_ShowEmpty_32_48DA3A5F487AF40A7D687DB65EC8B29D' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SuperBag_ShowSpirit_33_6AC630FA429585C0BB5F4085A9E2D6D9) == 0x000008, "Member 'FWidgetVisibilityState::SuperBag_ShowSpirit_33_6AC630FA429585C0BB5F4085A9E2D6D9' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SuperBag_ShowMap_34_621D03C4416DE542F3B2D68E58BC291F) == 0x000009, "Member 'FWidgetVisibilityState::SuperBag_ShowMap_34_621D03C4416DE542F3B2D68E58BC291F' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SuperBag_ShowPear_35_5C8D788A44ADB036E3B1ABB99C14F3A0) == 0x00000A, "Member 'FWidgetVisibilityState::SuperBag_ShowPear_35_5C8D788A44ADB036E3B1ABB99C14F3A0' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, CleanAnimal_ShowAll_40_2E275345470300BEEACFE4ADB47D20B4) == 0x00000B, "Member 'FWidgetVisibilityState::CleanAnimal_ShowAll_40_2E275345470300BEEACFE4ADB47D20B4' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, CleanAnimal_CloseAll_41_B150075F4F5109981C26BEABE3A7FB21) == 0x00000C, "Member 'FWidgetVisibilityState::CleanAnimal_CloseAll_41_B150075F4F5109981C26BEABE3A7FB21' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, RidingBikeState_45_7448B2804ABD2F41AC0C37BE1FEB6526) == 0x00000D, "Member 'FWidgetVisibilityState::RidingBikeState_45_7448B2804ABD2F41AC0C37BE1FEB6526' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, SitOnCarrierState_48_BC7646754E2DD8EE1B0AC0BC0FDA2963) == 0x00000E, "Member 'FWidgetVisibilityState::SitOnCarrierState_48_BC7646754E2DD8EE1B0AC0BC0FDA2963' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, EventBallonState_Show_58_A194D5814B03C470BA9868997CAADC53) == 0x00000F, "Member 'FWidgetVisibilityState::EventBallonState_Show_58_A194D5814B03C470BA9868997CAADC53' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, EventBallonState_Close_59_FF11C92245031FC9FEB520BB76722226) == 0x000010, "Member 'FWidgetVisibilityState::EventBallonState_Close_59_FF11C92245031FC9FEB520BB76722226' has a wrong offset!");
static_assert(offsetof(FWidgetVisibilityState, OpenSysSocialMainState_62_A52BC79345E37DE4752163815B66B70B) == 0x000011, "Member 'FWidgetVisibilityState::OpenSysSocialMainState_62_A52BC79345E37DE4752163815B66B70B' has a wrong offset!");

}

