#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WoolenHeartPhantomSection

#include "Basic.hpp"


namespace SDK::Params
{

// Function WoolenHeartPhantomSection.WoolenHeartPhantomSection_C.ExecuteUbergraph_WoolenHeartPhantomSection
// 0x0168 (0x0168 - 0x0000)
struct WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_wildcard_Variable;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WoolenHeart_SimulatedLSeq_C*        K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Map_Find_Value;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorByX6Tag_ReturnValue;              // 0x0068(0x0010)(ReferenceParm)
	class UObject*                                K2Node_Event_BindingObject;                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_GetComponentByClass_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetComponentByClass_ReturnValue_3;        // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_wildcard_Variable_1;                          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WoolenHeart_LSeq_C*                 K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x00F0(0x0010)(ReferenceParm)
	class UMovieSceneSequencePlayer*              CallFunc_GetMovieSceneSequencePlayer_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor_2;                      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetActorByX6Tag_ReturnValue_1;            // 0x0130(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Map_Find_Value_1;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection) == 0x000008, "Wrong alignment on WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection");
static_assert(sizeof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection) == 0x000168, "Wrong size on WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, EntryPoint) == 0x000000, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Keys_Keys) == 0x000008, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_wildcard_Variable) == 0x000020, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq) == 0x000030, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_AsBP_Woolen_Heart_Simulated_LSeq' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Get_Item) == 0x000050, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Find_Value) == 0x000058, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetActorByX6Tag_ReturnValue) == 0x000068, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetActorByX6Tag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_Event_BindingObject) == 0x000078, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_Event_BindingObject' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_AsActor) == 0x000088, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_AsActor_1) == 0x000098, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A8, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000B0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0000C0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0000C8, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000D2, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_wildcard_Variable_1) == 0x0000D8, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq) == 0x0000E0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_AsBP_Woolen_Heart_LSeq' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Keys_Keys_1) == 0x0000F0, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetMovieSceneSequencePlayer_ReturnValue) == 0x000100, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetMovieSceneSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetOuterObject_ReturnValue) == 0x000110, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Less_IntInt_ReturnValue_1) == 0x000118, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_AsActor_2) == 0x000120, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_AsActor_2' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_ActorHasTag_ReturnValue) == 0x000129, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_GetActorByX6Tag_ReturnValue_1) == 0x000130, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_GetActorByX6Tag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000148, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, Temp_int_Array_Index_Variable_1) == 0x00014C, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Array_Get_Item_3) == 0x000150, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Find_Value_1) == 0x000158, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection, CallFunc_Map_Find_ReturnValue_1) == 0x000160, "Member 'WoolenHeartPhantomSection_C_ExecuteUbergraph_WoolenHeartPhantomSection::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function WoolenHeartPhantomSection.WoolenHeartPhantomSection_C.K2_OnSectionBegin_WithBindingObject
// 0x0008 (0x0008 - 0x0000)
struct WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject final
{
public:
	class UObject*                                BindingObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject) == 0x000008, "Wrong alignment on WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject");
static_assert(sizeof(WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject) == 0x000008, "Wrong size on WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject");
static_assert(offsetof(WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject, BindingObject) == 0x000000, "Member 'WoolenHeartPhantomSection_C_K2_OnSectionBegin_WithBindingObject::BindingObject' has a wrong offset!");

}

