#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WoolenHeartPhantomSection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "X6CustomizableSequencerTracks_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WoolenHeartPhantomSection.WoolenHeartPhantomSection_C
// 0x0018 (0x0278 - 0x0260)
class UWoolenHeartPhantomSection_C final : public UX6SequencerParameterSectionBP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_WoolenHeart_LSeq_C*                 BP_WoolenHeartLSeq;                                // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_WoolenHeart_SimulatedLSeq_C*        BP_WoolenHeartSimulatedLSeq;                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WoolenHeartPhantomSection(int32 EntryPoint);
	void K2_OnSectionBegin_WithBindingObject(class UObject* BindingObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WoolenHeartPhantomSection_C">();
	}
	static class UWoolenHeartPhantomSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWoolenHeartPhantomSection_C>();
	}
};
static_assert(alignof(UWoolenHeartPhantomSection_C) == 0x000008, "Wrong alignment on UWoolenHeartPhantomSection_C");
static_assert(sizeof(UWoolenHeartPhantomSection_C) == 0x000278, "Wrong size on UWoolenHeartPhantomSection_C");
static_assert(offsetof(UWoolenHeartPhantomSection_C, UberGraphFrame) == 0x000260, "Member 'UWoolenHeartPhantomSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWoolenHeartPhantomSection_C, BP_WoolenHeartLSeq) == 0x000268, "Member 'UWoolenHeartPhantomSection_C::BP_WoolenHeartLSeq' has a wrong offset!");
static_assert(offsetof(UWoolenHeartPhantomSection_C, BP_WoolenHeartSimulatedLSeq) == 0x000270, "Member 'UWoolenHeartPhantomSection_C::BP_WoolenHeartSimulatedLSeq' has a wrong offset!");

}

