#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WoolenHeartRotateSection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "X6CustomizableSequencerTracks_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WoolenHeartRotateSection.WoolenHeartRotateSection_C
// 0x0068 (0x02C8 - 0x0260)
class UWoolenHeartRotateSection_C final : public UX6SequencerParameterSectionBP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BP_RotateWeight;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             LocalPlayerPawn;                                   // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BP_TotalDeltaYaw;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_ExtraRotateThreshold;                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BP_PlayerRotOffset;                                // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BP_PlayerInitYaw;                                  // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BP_PlayerInitRot;                                  // 0x0290(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_WoolenHeart_LSeq_C*                 BP_WoolenHeartLSeq;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BP_LSeqInitYaw;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_CurrentDelataYaw;                               // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BP_PlayerYawOffsetDegree;                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WoolenHeartRotateSection(int32 EntryPoint);
	void K2_OnSectionBegin();
	void K2_OnSectionUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WoolenHeartRotateSection_C">();
	}
	static class UWoolenHeartRotateSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWoolenHeartRotateSection_C>();
	}
};
static_assert(alignof(UWoolenHeartRotateSection_C) == 0x000008, "Wrong alignment on UWoolenHeartRotateSection_C");
static_assert(sizeof(UWoolenHeartRotateSection_C) == 0x0002C8, "Wrong size on UWoolenHeartRotateSection_C");
static_assert(offsetof(UWoolenHeartRotateSection_C, UberGraphFrame) == 0x000260, "Member 'UWoolenHeartRotateSection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_RotateWeight) == 0x000268, "Member 'UWoolenHeartRotateSection_C::BP_RotateWeight' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, LocalPlayerPawn) == 0x000270, "Member 'UWoolenHeartRotateSection_C::LocalPlayerPawn' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_TotalDeltaYaw) == 0x000278, "Member 'UWoolenHeartRotateSection_C::BP_TotalDeltaYaw' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_ExtraRotateThreshold) == 0x000280, "Member 'UWoolenHeartRotateSection_C::BP_ExtraRotateThreshold' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_PlayerRotOffset) == 0x000288, "Member 'UWoolenHeartRotateSection_C::BP_PlayerRotOffset' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_PlayerInitYaw) == 0x00028C, "Member 'UWoolenHeartRotateSection_C::BP_PlayerInitYaw' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_PlayerInitRot) == 0x000290, "Member 'UWoolenHeartRotateSection_C::BP_PlayerInitRot' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_WoolenHeartLSeq) == 0x0002A8, "Member 'UWoolenHeartRotateSection_C::BP_WoolenHeartLSeq' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_LSeqInitYaw) == 0x0002B0, "Member 'UWoolenHeartRotateSection_C::BP_LSeqInitYaw' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_CurrentDelataYaw) == 0x0002B8, "Member 'UWoolenHeartRotateSection_C::BP_CurrentDelataYaw' has a wrong offset!");
static_assert(offsetof(UWoolenHeartRotateSection_C, BP_PlayerYawOffsetDegree) == 0x0002C0, "Member 'UWoolenHeartRotateSection_C::BP_PlayerYawOffsetDegree' has a wrong offset!");

}

