#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: World_TimeofDay

#include "Basic.hpp"

#include "S_WeatherState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DynamicEnvironmentSystem_structs.hpp"


namespace SDK::Params
{

// Function World_TimeofDay.World_TimeofDay_C.ExecuteUbergraph_World_TimeofDay
// 0x02C0 (0x02C0 - 0x0000)
struct World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WeatherState                        K2Node_MakeStruct_S_WeatherState;                  // 0x0030(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeatherState                        K2Node_MakeStruct_S_WeatherState_1;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimeStamp                             CallFunc_TODLevelBeginPlay_TimeConfigInfo;         // 0x0098(0x002C)(NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Weather_C>        CallFunc_BPI_EditorUpdate_self_CastInput;          // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1; // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADynamicWeatherVolume*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0108(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2; // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADynamicWeatherVolume*                  CallFunc_Array_Get_Item;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WeatherName;                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WeatherState                        K2Node_MakeStruct_S_WeatherState_2;                // 0x0158(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_32ByteByte_ReturnValue;        // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Outbreak;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component;  // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component_1; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_Mode_inEditor;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             K2Node_DynamicCast_AsDirectional_Light_Component_2; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_A_ImplicitCast;                      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BlendWeight_ImplicitCast;       // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFogDensity_Value_ImplicitCast;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay) == 0x000008, "Wrong alignment on World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay");
static_assert(sizeof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay) == 0x0002C0, "Wrong size on World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, EntryPoint) == 0x000000, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::EntryPoint' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue) == 0x000018, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000028, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000029, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_MakeStruct_S_WeatherState) == 0x000030, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_MakeStruct_S_WeatherState' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_MakeStruct_S_WeatherState_1) == 0x000060, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_MakeStruct_S_WeatherState_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_TODLevelBeginPlay_TimeConfigInfo) == 0x000098, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_TODLevelBeginPlay_TimeConfigInfo' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_Event_DeltaSeconds) == 0x0000C4, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BPI_EditorUpdate_self_CastInput) == 0x0000C8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BPI_EditorUpdate_self_CastInput' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1) == 0x0000D8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_object_Variable) == 0x0000E8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x0000F0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x0000F1, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_bool_Variable) == 0x0000F2, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BooleanOR_ReturnValue_1) == 0x0000F3, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Not_PreBool_ReturnValue) == 0x0000F4, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_Loaded_1) == 0x0000F8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_bool_Variable_1) == 0x000100, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Not_PreBool_ReturnValue_1) == 0x000101, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetAllActorsOfClass_OutActors) == 0x000108, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_bool_Variable_2) == 0x00011C, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Not_PreBool_ReturnValue_2) == 0x00011D, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2) == 0x000120, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetPlatformNameInEditorPreviewAndRuntime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x000130, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x000131, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BooleanOR_ReturnValue_2) == 0x000132, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_object_Variable_1) == 0x000138, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_int_Array_Index_Variable) == 0x000140, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Array_Get_Item) == 0x000148, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_WeatherName) == 0x000150, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_WeatherName' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_MakeStruct_S_WeatherState_2) == 0x000158, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_MakeStruct_S_WeatherState_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000188, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_EqualEqual_32ByteByte_ReturnValue) == 0x00018C, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_EqualEqual_32ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BooleanOR_ReturnValue_3) == 0x00018D, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_Loaded_2) == 0x000190, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_Outbreak) == 0x000198, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_Outbreak' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetScalarParameterValue_ReturnValue) == 0x00019C, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x0001A4, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_GetVectorValue_ReturnValue) == 0x0001A8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BreakVector_X) == 0x0001C0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BreakVector_Y) == 0x0001C8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_BreakVector_Z) == 0x0001D0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_FClamp_ReturnValue) == 0x0001E8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001F0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_FMin_ReturnValue) == 0x0001F8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_bool_Variable_3) == 0x000201, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Not_PreBool_ReturnValue_3) == 0x000202, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_AsDirectional_Light_Component) == 0x000208, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_AsDirectional_Light_Component' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000218, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_object_Variable_2) == 0x000220, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CustomEvent_Loaded_3) == 0x000228, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CreateDelegate_OutputDelegate_1) == 0x000230, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_AsDirectional_Light_Component_1) == 0x000240, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_AsDirectional_Light_Component_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_object_Variable_3) == 0x000250, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_IsEditor_Mode_inEditor) == 0x000258, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_IsEditor_Mode_inEditor' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CreateDelegate_OutputDelegate_2) == 0x00025C, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, Temp_int_Loop_Counter_Variable) == 0x00026C, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Less_IntInt_ReturnValue) == 0x000270, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Add_IntInt_ReturnValue) == 0x000274, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_CreateDelegate_OutputDelegate_3) == 0x000278, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_AsDirectional_Light_Component_2) == 0x000288, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_AsDirectional_Light_Component_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_DynamicCast_bSuccess_2) == 0x000290, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_FMin_A_ImplicitCast) == 0x000298, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_FMin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0002A0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, K2Node_VariableSet_BlendWeight_ImplicitCast) == 0x0002A8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::K2Node_VariableSet_BlendWeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay, CallFunc_SetFogDensity_Value_ImplicitCast) == 0x0002B8, "Member 'World_TimeofDay_C_ExecuteUbergraph_World_TimeofDay::CallFunc_SetFogDensity_Value_ImplicitCast' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.OnLoaded_153BC3174A665DD2EDCA02973E2A153A
// 0x0008 (0x0008 - 0x0000)
struct World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A) == 0x000008, "Wrong alignment on World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A");
static_assert(sizeof(World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A) == 0x000008, "Wrong size on World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A");
static_assert(offsetof(World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A, Loaded) == 0x000000, "Member 'World_TimeofDay_C_OnLoaded_153BC3174A665DD2EDCA02973E2A153A::Loaded' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.OnLoaded_556B8BD044371CBE530395858E5DEEF6
// 0x0008 (0x0008 - 0x0000)
struct World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6) == 0x000008, "Wrong alignment on World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6");
static_assert(sizeof(World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6) == 0x000008, "Wrong size on World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6");
static_assert(offsetof(World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6, Loaded) == 0x000000, "Member 'World_TimeofDay_C_OnLoaded_556B8BD044371CBE530395858E5DEEF6::Loaded' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.OnLoaded_A05238DB4B20CC692EFCBC816E6E854A
// 0x0008 (0x0008 - 0x0000)
struct World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A) == 0x000008, "Wrong alignment on World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A");
static_assert(sizeof(World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A) == 0x000008, "Wrong size on World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A");
static_assert(offsetof(World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A, Loaded) == 0x000000, "Member 'World_TimeofDay_C_OnLoaded_A05238DB4B20CC692EFCBC816E6E854A::Loaded' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301
// 0x0008 (0x0008 - 0x0000)
struct World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301) == 0x000008, "Wrong alignment on World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301");
static_assert(sizeof(World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301) == 0x000008, "Wrong size on World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301");
static_assert(offsetof(World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301, Loaded) == 0x000000, "Member 'World_TimeofDay_C_OnLoaded_AC3D764F40D6E6BA6E0F169EBB0EC301::Loaded' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct World_TimeofDay_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_ReceiveTick) == 0x000004, "Wrong alignment on World_TimeofDay_C_ReceiveTick");
static_assert(sizeof(World_TimeofDay_C_ReceiveTick) == 0x000004, "Wrong size on World_TimeofDay_C_ReceiveTick");
static_assert(offsetof(World_TimeofDay_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'World_TimeofDay_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.wp
// 0x0008 (0x0008 - 0x0000)
struct World_TimeofDay_C_wp final
{
public:
	class FName                                   WeatherName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_wp) == 0x000004, "Wrong alignment on World_TimeofDay_C_wp");
static_assert(sizeof(World_TimeofDay_C_wp) == 0x000008, "Wrong size on World_TimeofDay_C_wp");
static_assert(offsetof(World_TimeofDay_C_wp, WeatherName) == 0x000000, "Member 'World_TimeofDay_C_wp::WeatherName' has a wrong offset!");

// Function World_TimeofDay.World_TimeofDay_C.XinYuanShuLinOutbreak
// 0x0001 (0x0001 - 0x0000)
struct World_TimeofDay_C_XinYuanShuLinOutbreak final
{
public:
	bool                                          Outbreak;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(World_TimeofDay_C_XinYuanShuLinOutbreak) == 0x000001, "Wrong alignment on World_TimeofDay_C_XinYuanShuLinOutbreak");
static_assert(sizeof(World_TimeofDay_C_XinYuanShuLinOutbreak) == 0x000001, "Wrong size on World_TimeofDay_C_XinYuanShuLinOutbreak");
static_assert(offsetof(World_TimeofDay_C_XinYuanShuLinOutbreak, Outbreak) == 0x000000, "Member 'World_TimeofDay_C_XinYuanShuLinOutbreak::Outbreak' has a wrong offset!");

}

