#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: World_P

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass World_P.World_P_C
// 0x00F0 (0x04A0 - 0x03B0)
class AWorld_P_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spawn_Transform;                                   // 0x03C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResstPos1;                                         // 0x0420(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResetPos2;                                         // 0x0438(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  RVT1;                                              // 0x0450(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  RVT2;                                              // 0x0478(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_World_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"World_P_C">();
	}
	static class AWorld_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWorld_P_C>();
	}
};
static_assert(alignof(AWorld_P_C) == 0x000010, "Wrong alignment on AWorld_P_C");
static_assert(sizeof(AWorld_P_C) == 0x0004A0, "Wrong size on AWorld_P_C");
static_assert(offsetof(AWorld_P_C, UberGraphFrame) == 0x0003B0, "Member 'AWorld_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWorld_P_C, Spawn_Transform) == 0x0003C0, "Member 'AWorld_P_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(AWorld_P_C, ResstPos1) == 0x000420, "Member 'AWorld_P_C::ResstPos1' has a wrong offset!");
static_assert(offsetof(AWorld_P_C, ResetPos2) == 0x000438, "Member 'AWorld_P_C::ResetPos2' has a wrong offset!");
static_assert(offsetof(AWorld_P_C, RVT1) == 0x000450, "Member 'AWorld_P_C::RVT1' has a wrong offset!");
static_assert(offsetof(AWorld_P_C, RVT2) == 0x000478, "Member 'AWorld_P_C::RVT2' has a wrong offset!");

}

