#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Animation

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// Enum X6Animation.ELocomotionGait
// NumValues: 0x0006
enum class ELocomotionGait : uint8
{
	LMG_TYPE1                                = 0,
	LMG_TYPE2                                = 1,
	LMG_WalkFast                             = 2,
	LMG_Jog                                  = 3,
	LMG_Sprint                               = 4,
	LMG_MAX                                  = 5,
};

// Enum X6Animation.ELocomotionType
// NumValues: 0x0004
enum class ELocomotionType : uint8
{
	ELT_NONE                                 = 0,
	ELT_GROUND_NORMAL                        = 1,
	ELT_INAIR_NORMAL                         = 2,
	ELT_MAX                                  = 3,
};

// Enum X6Animation.ELocoExitAnimType
// NumValues: 0x0008
enum class ELocoExitAnimType : uint8
{
	LEAT_TYPE1                               = 0,
	LEAT_TYPE2                               = 1,
	LEAT_TYPE3                               = 2,
	LEAT_TYPE4                               = 3,
	LEAT_TYPE5                               = 4,
	LEAT_TYPE6                               = 5,
	LEAT_TYPE7                               = 6,
	LEAT_MAX                                 = 7,
};

// Enum X6Animation.EX6ActionBlendType
// NumValues: 0x0003
enum class EX6ActionBlendType : uint8
{
	Default                                  = 0,
	CustomMode                               = 1,
	EX6ActionBlendType_MAX                   = 2,
};

// Enum X6Animation.EX6ActionBlendIKType
// NumValues: 0x0004
enum class EX6ActionBlendIKType : uint8
{
	None                                     = 0,
	LeftHandAuthority                        = 1,
	RightHandAuthority                       = 2,
	EX6ActionBlendIKType_MAX                 = 3,
};

// Enum X6Animation.EX6OverlayBlendType
// NumValues: 0x0003
enum class EX6OverlayBlendType : uint8
{
	Default                                  = 0,
	CustomMode                               = 1,
	EX6OverlayBlendType_MAX                  = 2,
};

// Enum X6Animation.EX6PoseBlendNodeMode
// NumValues: 0x0004
enum class EX6PoseBlendNodeMode : uint8
{
	Normal                                   = 0,
	EvaluateMontage                          = 1,
	EvaluateAnimSequence                     = 2,
	EX6PoseBlendNodeMode_MAX                 = 3,
};

// Enum X6Animation.EX6SequenceTimeControlType
// NumValues: 0x0007
enum class EX6SequenceTimeControlType : uint8
{
	EX6STCT_None                             = 0,
	EX6STCT_DISTANCE_MATCH                   = 1,
	EX6STCT_SET                              = 2,
	EX6STCT_POSE_MATCH                       = 3,
	EX6STCT_MATCH_FOOT                       = 4,
	EX6STCT_MATCH_CURVE                      = 5,
	EX6STCT_MAX                              = 6,
};

// Enum X6Animation.EX6StateMachineMarkerType
// NumValues: 0x0003
enum class EX6StateMachineMarkerType : uint8
{
	Auto                                     = 0,
	Manual                                   = 1,
	EX6StateMachineMarkerType_MAX            = 2,
};

// Enum X6Animation.EContextualPlayType
// NumValues: 0x0003
enum class EContextualPlayType : uint8
{
	ECST_CONTINUOUS                          = 0,
	ECST_ONCE                                = 1,
	ECST_MAX                                 = 2,
};

// Enum X6Animation.EContextualType
// NumValues: 0x0005
enum class EContextualType : uint8
{
	ECT_NONE                                 = 0,
	ECT_WEATHER                              = 1,
	ECT_ENVIRONMENT                          = 2,
	ECT_IDLE                                 = 3,
	ECT_MAX                                  = 4,
};

// Enum X6Animation.ENativePlayerLocomotionType
// NumValues: 0x0005
enum class ENativePlayerLocomotionType : uint8
{
	EMovementType_None                       = 0,
	EMovementType_Walking                    = 1,
	EMovementType_Running                    = 2,
	EMovementType_Sprinting                  = 3,
	EMovementType_Max                        = 4,
};

// Enum X6Animation.ENativePlayerFloatingJumpStage
// NumValues: 0x0008
enum class ENativePlayerFloatingJumpStage : uint8
{
	OnLand                                   = 0,
	Jump                                     = 1,
	Fly                                      = 2,
	Fall                                     = 3,
	Crash                                    = 4,
	SlowFall                                 = 5,
	Float                                    = 6,
	ENativePlayerFloatingJumpStage_MAX       = 7,
};

// Enum X6Animation.ELocomotionGroundMainState
// NumValues: 0x0006
enum class ELocomotionGroundMainState : uint8
{
	ELMGMS_NOT_MOVING                        = 0,
	ELMGMS_START                             = 1,
	ELMGMS_PIVOT                             = 2,
	ELMGMS_STOP                              = 3,
	ELMGMS_MOVING                            = 4,
	ELMGMS_MAX                               = 5,
};

// Enum X6Animation.ELocomotionGroundIdleState
// NumValues: 0x0004
enum class ELocomotionGroundIdleState : uint8
{
	ELGIS_NOTIDLE                            = 0,
	ELGIS_DEFAULT_IDLE                       = 1,
	ELGIS_CONTEXTURE_IDLE                    = 2,
	ELGIS_MAX                                = 3,
};

// Enum X6Animation.EX6AnimTagGait
// NumValues: 0x0006
enum class EX6AnimTagGait : uint8
{
	EX6ATG_IDLE                              = 0,
	EX6ATG_Walk                              = 1,
	EX6ATG_JOG                               = 2,
	EX6ATG_SPRINT                            = 3,
	EX6ATG_PRESERVE1                         = 4,
	EX6ATG_MAX                               = 5,
};

// Enum X6Animation.ECopyMotion_Component
// NumValues: 0x0005
enum class ECopyMotion_Component : uint8
{
	TranslationX                             = 0,
	TranslationY                             = 1,
	TranslationZ                             = 2,
	RotationAngle                            = 3,
	ECopyMotion_MAX                          = 4,
};

// ScriptStruct X6Animation.AnimNode_MirrorForPoseMatch
// 0x0000 (0x0048 - 0x0048)
struct FAnimNode_MirrorForPoseMatch final : public FAnimNode_Mirror
{
};
static_assert(alignof(FAnimNode_MirrorForPoseMatch) == 0x000008, "Wrong alignment on FAnimNode_MirrorForPoseMatch");
static_assert(sizeof(FAnimNode_MirrorForPoseMatch) == 0x000048, "Wrong size on FAnimNode_MirrorForPoseMatch");

// ScriptStruct X6Animation.AnimNode_SequencePlayerIgnorePose
// 0x0008 (0x0048 - 0x0040)
struct FAnimNode_SequencePlayerIgnorePose final : public FAnimNode_SequencePlayerBase
{
public:
	class UAnimSequenceBase*                      Sequence;                                          // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimNode_SequencePlayerIgnorePose) == 0x000008, "Wrong alignment on FAnimNode_SequencePlayerIgnorePose");
static_assert(sizeof(FAnimNode_SequencePlayerIgnorePose) == 0x000048, "Wrong size on FAnimNode_SequencePlayerIgnorePose");
static_assert(offsetof(FAnimNode_SequencePlayerIgnorePose, Sequence) == 0x000040, "Member 'FAnimNode_SequencePlayerIgnorePose::Sequence' has a wrong offset!");

// ScriptStruct X6Animation.X6OverlayCurveData
// 0x0018 (0x0018 - 0x0000)
struct FX6OverlayCurveData final
{
public:
	bool                                          bUseCurve;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AlphaCurve;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FX6OverlayCurveData) == 0x000008, "Wrong alignment on FX6OverlayCurveData");
static_assert(sizeof(FX6OverlayCurveData) == 0x000018, "Wrong size on FX6OverlayCurveData");
static_assert(offsetof(FX6OverlayCurveData, bUseCurve) == 0x000000, "Member 'FX6OverlayCurveData::bUseCurve' has a wrong offset!");
static_assert(offsetof(FX6OverlayCurveData, AlphaCurve) == 0x000008, "Member 'FX6OverlayCurveData::AlphaCurve' has a wrong offset!");
static_assert(offsetof(FX6OverlayCurveData, alpha) == 0x000010, "Member 'FX6OverlayCurveData::alpha' has a wrong offset!");

// ScriptStruct X6Animation.X6OverlayPerBoneBlendWeights
// 0x0058 (0x0058 - 0x0000)
struct FX6OverlayPerBoneBlendWeights final
{
public:
	TArray<struct FPerBoneBlendWeight>            PerBoneBlendWeights;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerBoneBlendWeight>            DesiredBoneBlendWeights;                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceAdditive;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceRotationBlend;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRootMSpaceRotationBlend;                          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FX6OverlayCurveData                    MotionAlphaData;                                   // 0x0028(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FX6OverlayCurveData                    OverlayAlphaData;                                  // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FX6OverlayPerBoneBlendWeights) == 0x000008, "Wrong alignment on FX6OverlayPerBoneBlendWeights");
static_assert(sizeof(FX6OverlayPerBoneBlendWeights) == 0x000058, "Wrong size on FX6OverlayPerBoneBlendWeights");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, PerBoneBlendWeights) == 0x000000, "Member 'FX6OverlayPerBoneBlendWeights::PerBoneBlendWeights' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, DesiredBoneBlendWeights) == 0x000010, "Member 'FX6OverlayPerBoneBlendWeights::DesiredBoneBlendWeights' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, bMeshSpaceAdditive) == 0x000020, "Member 'FX6OverlayPerBoneBlendWeights::bMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, bMeshSpaceRotationBlend) == 0x000021, "Member 'FX6OverlayPerBoneBlendWeights::bMeshSpaceRotationBlend' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, bRootMSpaceRotationBlend) == 0x000022, "Member 'FX6OverlayPerBoneBlendWeights::bRootMSpaceRotationBlend' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, MotionAlphaData) == 0x000028, "Member 'FX6OverlayPerBoneBlendWeights::MotionAlphaData' has a wrong offset!");
static_assert(offsetof(FX6OverlayPerBoneBlendWeights, OverlayAlphaData) == 0x000040, "Member 'FX6OverlayPerBoneBlendWeights::OverlayAlphaData' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6ActionBlend
// 0x0300 (0x0310 - 0x0010)
struct FAnimNode_X6ActionBlend final : public FAnimNode_Base
{
public:
	EX6ActionBlendType                            ActionBlendType;                                   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              InputPose;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ActionMontage;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6ActionBlendData*                     BlendData;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BasicSlotName;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AdditiveSlotName;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           CacheActionMontage;                                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UX6ActionBlendData*                     CacheBlendData;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FX6OverlayPerBoneBlendWeights          AdditivePerBoneWeights;                            // 0x0058(0x0058)(NativeAccessSpecifierPrivate)
	struct FX6OverlayPerBoneBlendWeights          AuthoredPerBoneWeights;                            // 0x00B0(0x0058)(NativeAccessSpecifierPrivate)
	bool                                          bCacheOverlayChanged;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SkeletonGuid;                                      // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  VirtualBoneGuid;                                   // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x44];                                     // 0x012C(0x0044)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMirror;                                           // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0178(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x78];                                     // 0x0180(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         LeftHandSourceBone;                                // 0x01F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightHandSourceBone;                               // 0x0208(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0218(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x30];                                     // 0x0228(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInertializationRequest>        RequestQueue;                                      // 0x0258(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0xA0];                                     // 0x0268(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableNodeWithBlend;                             // 0x0309(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6ActionBlend) == 0x000008, "Wrong alignment on FAnimNode_X6ActionBlend");
static_assert(sizeof(FAnimNode_X6ActionBlend) == 0x000310, "Wrong size on FAnimNode_X6ActionBlend");
static_assert(offsetof(FAnimNode_X6ActionBlend, ActionBlendType) == 0x000010, "Member 'FAnimNode_X6ActionBlend::ActionBlendType' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, InputPose) == 0x000018, "Member 'FAnimNode_X6ActionBlend::InputPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, ActionMontage) == 0x000028, "Member 'FAnimNode_X6ActionBlend::ActionMontage' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, BlendData) == 0x000030, "Member 'FAnimNode_X6ActionBlend::BlendData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, BasicSlotName) == 0x000038, "Member 'FAnimNode_X6ActionBlend::BasicSlotName' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, AdditiveSlotName) == 0x000040, "Member 'FAnimNode_X6ActionBlend::AdditiveSlotName' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, CacheActionMontage) == 0x000048, "Member 'FAnimNode_X6ActionBlend::CacheActionMontage' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, CacheBlendData) == 0x000050, "Member 'FAnimNode_X6ActionBlend::CacheBlendData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, AdditivePerBoneWeights) == 0x000058, "Member 'FAnimNode_X6ActionBlend::AdditivePerBoneWeights' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, AuthoredPerBoneWeights) == 0x0000B0, "Member 'FAnimNode_X6ActionBlend::AuthoredPerBoneWeights' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, bCacheOverlayChanged) == 0x000108, "Member 'FAnimNode_X6ActionBlend::bCacheOverlayChanged' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, SkeletonGuid) == 0x00010C, "Member 'FAnimNode_X6ActionBlend::SkeletonGuid' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, VirtualBoneGuid) == 0x00011C, "Member 'FAnimNode_X6ActionBlend::VirtualBoneGuid' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, bMirror) == 0x000170, "Member 'FAnimNode_X6ActionBlend::bMirror' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, MirrorDataTable) == 0x000178, "Member 'FAnimNode_X6ActionBlend::MirrorDataTable' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, LeftHandSourceBone) == 0x0001F8, "Member 'FAnimNode_X6ActionBlend::LeftHandSourceBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, RightHandSourceBone) == 0x000208, "Member 'FAnimNode_X6ActionBlend::RightHandSourceBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, TargetBone) == 0x000218, "Member 'FAnimNode_X6ActionBlend::TargetBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, RequestQueue) == 0x000258, "Member 'FAnimNode_X6ActionBlend::RequestQueue' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, bEnabled) == 0x000308, "Member 'FAnimNode_X6ActionBlend::bEnabled' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6ActionBlend, bDisableNodeWithBlend) == 0x000309, "Member 'FAnimNode_X6ActionBlend::bDisableNodeWithBlend' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6AimOffsetLookAt
// 0x0030 (0x0210 - 0x01E0)
struct FAnimNode_X6AimOffsetLookAt final : public FAnimNode_AimOffsetLookAt
{
public:
	struct FVector2D                              AimOffsetDeadZone;                                 // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleAlpha;                                        // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bX6EnableCustomSmoothingTime;                      // 0x01F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         X6CustomSmoothingTime;                             // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            LastBlendSpace;                                    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6AimOffsetLookAt) == 0x000010, "Wrong alignment on FAnimNode_X6AimOffsetLookAt");
static_assert(sizeof(FAnimNode_X6AimOffsetLookAt) == 0x000210, "Wrong size on FAnimNode_X6AimOffsetLookAt");
static_assert(offsetof(FAnimNode_X6AimOffsetLookAt, AimOffsetDeadZone) == 0x0001E0, "Member 'FAnimNode_X6AimOffsetLookAt::AimOffsetDeadZone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6AimOffsetLookAt, AngleAlpha) == 0x0001F0, "Member 'FAnimNode_X6AimOffsetLookAt::AngleAlpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6AimOffsetLookAt, bX6EnableCustomSmoothingTime) == 0x0001F4, "Member 'FAnimNode_X6AimOffsetLookAt::bX6EnableCustomSmoothingTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6AimOffsetLookAt, X6CustomSmoothingTime) == 0x0001F8, "Member 'FAnimNode_X6AimOffsetLookAt::X6CustomSmoothingTime' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6AimOffsetLookAt, LastBlendSpace) == 0x000200, "Member 'FAnimNode_X6AimOffsetLookAt::LastBlendSpace' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6EyeLookAt
// 0x01A0 (0x01B0 - 0x0010)
struct alignas(0x10) FAnimNode_X6EyeLookAt final : public FAnimNode_Base
{
public:
	struct FPoseLink                              InputPose;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         alpha;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EyeMotionSpeed;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TwoEyesRotatorOffset;                              // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAimOffsetWithEyeMotion;                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipUpdateLookAtTarget;                           // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEyeRotationBaseOnReference;                       // 0x0042(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneControlSpace                             EyeMotionSpace;                                    // 0x0043(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         L_EyeBone;                                         // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               L_EyeRotation;                                     // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         R_EyeBone;                                         // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               R_EyeRotation;                                     // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x118];                                     // 0x0098(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6EyeLookAt) == 0x000010, "Wrong alignment on FAnimNode_X6EyeLookAt");
static_assert(sizeof(FAnimNode_X6EyeLookAt) == 0x0001B0, "Wrong size on FAnimNode_X6EyeLookAt");
static_assert(offsetof(FAnimNode_X6EyeLookAt, InputPose) == 0x000010, "Member 'FAnimNode_X6EyeLookAt::InputPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, alpha) == 0x000020, "Member 'FAnimNode_X6EyeLookAt::alpha' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, EyeMotionSpeed) == 0x000024, "Member 'FAnimNode_X6EyeLookAt::EyeMotionSpeed' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, TwoEyesRotatorOffset) == 0x000028, "Member 'FAnimNode_X6EyeLookAt::TwoEyesRotatorOffset' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, bAimOffsetWithEyeMotion) == 0x000040, "Member 'FAnimNode_X6EyeLookAt::bAimOffsetWithEyeMotion' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, bSkipUpdateLookAtTarget) == 0x000041, "Member 'FAnimNode_X6EyeLookAt::bSkipUpdateLookAtTarget' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, bEyeRotationBaseOnReference) == 0x000042, "Member 'FAnimNode_X6EyeLookAt::bEyeRotationBaseOnReference' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, EyeMotionSpace) == 0x000043, "Member 'FAnimNode_X6EyeLookAt::EyeMotionSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, L_EyeBone) == 0x000044, "Member 'FAnimNode_X6EyeLookAt::L_EyeBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, L_EyeRotation) == 0x000058, "Member 'FAnimNode_X6EyeLookAt::L_EyeRotation' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, R_EyeBone) == 0x000070, "Member 'FAnimNode_X6EyeLookAt::R_EyeBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6EyeLookAt, R_EyeRotation) == 0x000080, "Member 'FAnimNode_X6EyeLookAt::R_EyeRotation' has a wrong offset!");

// ScriptStruct X6Animation.IgnoreBlendPose
// 0x0010 (0x0010 - 0x0000)
struct FIgnoreBlendPose final
{
public:
	TArray<class FName>                           IgnoreBoneNames;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIgnoreBlendPose) == 0x000008, "Wrong alignment on FIgnoreBlendPose");
static_assert(sizeof(FIgnoreBlendPose) == 0x000010, "Wrong size on FIgnoreBlendPose");
static_assert(offsetof(FIgnoreBlendPose, IgnoreBoneNames) == 0x000000, "Member 'FIgnoreBlendPose::IgnoreBoneNames' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6LayeredBoneBlend
// 0x00F8 (0x0108 - 0x0010)
struct FAnimNode_X6LayeredBoneBlend final : public FAnimNode_Base
{
public:
	int32                                         DesiredBlendPoseNum;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           X6BlendIgnoreBoneNames;                            // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              BasePose;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPoseLink>                      BlendPoses;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	ELayeredBoneBlendMode                         BlendMode;                                         // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBlendProfile*>                  BlendMasks;                                        // 0x0050(0x0010)(Edit, EditFixedSize, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FInputBlendPose>                LayerSetup;                                        // 0x0060(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 BlendWeights;                                      // 0x0070(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceRotationBlend;                           // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceScaleBlend;                              // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECurveBlendOption                             CurveBlendOption;                                  // 0x0082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendRootMotionBasedOnRootBone;                   // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODThreshold;                                      // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPerBoneBlendWeight>            PerBoneBlendWeights;                               // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  SkeletonGuid;                                      // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  VirtualBoneGuid;                                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x48];                                      // 0x00C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6LayeredBoneBlend) == 0x000008, "Wrong alignment on FAnimNode_X6LayeredBoneBlend");
static_assert(sizeof(FAnimNode_X6LayeredBoneBlend) == 0x000108, "Wrong size on FAnimNode_X6LayeredBoneBlend");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, DesiredBlendPoseNum) == 0x000010, "Member 'FAnimNode_X6LayeredBoneBlend::DesiredBlendPoseNum' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, X6BlendIgnoreBoneNames) == 0x000018, "Member 'FAnimNode_X6LayeredBoneBlend::X6BlendIgnoreBoneNames' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, BasePose) == 0x000028, "Member 'FAnimNode_X6LayeredBoneBlend::BasePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, BlendPoses) == 0x000038, "Member 'FAnimNode_X6LayeredBoneBlend::BlendPoses' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, BlendMode) == 0x000048, "Member 'FAnimNode_X6LayeredBoneBlend::BlendMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, BlendMasks) == 0x000050, "Member 'FAnimNode_X6LayeredBoneBlend::BlendMasks' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, LayerSetup) == 0x000060, "Member 'FAnimNode_X6LayeredBoneBlend::LayerSetup' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, BlendWeights) == 0x000070, "Member 'FAnimNode_X6LayeredBoneBlend::BlendWeights' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, bMeshSpaceRotationBlend) == 0x000080, "Member 'FAnimNode_X6LayeredBoneBlend::bMeshSpaceRotationBlend' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, bMeshSpaceScaleBlend) == 0x000081, "Member 'FAnimNode_X6LayeredBoneBlend::bMeshSpaceScaleBlend' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, CurveBlendOption) == 0x000082, "Member 'FAnimNode_X6LayeredBoneBlend::CurveBlendOption' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, bBlendRootMotionBasedOnRootBone) == 0x000083, "Member 'FAnimNode_X6LayeredBoneBlend::bBlendRootMotionBasedOnRootBone' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, LODThreshold) == 0x000088, "Member 'FAnimNode_X6LayeredBoneBlend::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, PerBoneBlendWeights) == 0x000090, "Member 'FAnimNode_X6LayeredBoneBlend::PerBoneBlendWeights' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, SkeletonGuid) == 0x0000A0, "Member 'FAnimNode_X6LayeredBoneBlend::SkeletonGuid' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6LayeredBoneBlend, VirtualBoneGuid) == 0x0000B0, "Member 'FAnimNode_X6LayeredBoneBlend::VirtualBoneGuid' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6Mirror
// 0x0000 (0x0048 - 0x0048)
struct FAnimNode_X6Mirror final : public FAnimNode_Mirror
{
};
static_assert(alignof(FAnimNode_X6Mirror) == 0x000008, "Wrong alignment on FAnimNode_X6Mirror");
static_assert(sizeof(FAnimNode_X6Mirror) == 0x000048, "Wrong size on FAnimNode_X6Mirror");

// ScriptStruct X6Animation.X6OverlayBlendData
// 0x0048 (0x0048 - 0x0000)
struct FX6OverlayBlendData final
{
public:
	TArray<struct FBranchFilter>                  LayerSetup;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceAdditive;                                // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshSpaceRotationBlend;                           // 0x0011(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRootMSpaceRotationBlend;                          // 0x0012(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FX6OverlayCurveData                    MotionAlphaData;                                   // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FX6OverlayCurveData                    OverlayAlphaData;                                  // 0x0030(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FX6OverlayBlendData) == 0x000008, "Wrong alignment on FX6OverlayBlendData");
static_assert(sizeof(FX6OverlayBlendData) == 0x000048, "Wrong size on FX6OverlayBlendData");
static_assert(offsetof(FX6OverlayBlendData, LayerSetup) == 0x000000, "Member 'FX6OverlayBlendData::LayerSetup' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendData, bMeshSpaceAdditive) == 0x000010, "Member 'FX6OverlayBlendData::bMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendData, bMeshSpaceRotationBlend) == 0x000011, "Member 'FX6OverlayBlendData::bMeshSpaceRotationBlend' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendData, bRootMSpaceRotationBlend) == 0x000012, "Member 'FX6OverlayBlendData::bRootMSpaceRotationBlend' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendData, MotionAlphaData) == 0x000018, "Member 'FX6OverlayBlendData::MotionAlphaData' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendData, OverlayAlphaData) == 0x000030, "Member 'FX6OverlayBlendData::OverlayAlphaData' has a wrong offset!");

// ScriptStruct X6Animation.X6OverlayBlendProfilePerBoneInfo
// 0x0010 (0x0010 - 0x0000)
struct FX6OverlayBlendProfilePerBoneInfo final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecurse;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FX6OverlayBlendProfilePerBoneInfo) == 0x000004, "Wrong alignment on FX6OverlayBlendProfilePerBoneInfo");
static_assert(sizeof(FX6OverlayBlendProfilePerBoneInfo) == 0x000010, "Wrong size on FX6OverlayBlendProfilePerBoneInfo");
static_assert(offsetof(FX6OverlayBlendProfilePerBoneInfo, BoneName) == 0x000000, "Member 'FX6OverlayBlendProfilePerBoneInfo::BoneName' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendProfilePerBoneInfo, Scale) == 0x000008, "Member 'FX6OverlayBlendProfilePerBoneInfo::Scale' has a wrong offset!");
static_assert(offsetof(FX6OverlayBlendProfilePerBoneInfo, bRecurse) == 0x00000C, "Member 'FX6OverlayBlendProfilePerBoneInfo::bRecurse' has a wrong offset!");

// ScriptStruct X6Animation.X6InertialBlendInfo
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FX6InertialBlendInfo final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FX6InertialBlendInfo) == 0x000008, "Wrong alignment on FX6InertialBlendInfo");
static_assert(sizeof(FX6InertialBlendInfo) == 0x000018, "Wrong size on FX6InertialBlendInfo");

// ScriptStruct X6Animation.X6InertializationPose
// 0x00C0 (0x00C0 - 0x0000)
struct alignas(0x10) FX6InertializationPose final
{
public:
	uint8                                         Pad_0[0xC0];                                       // 0x0000(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FX6InertializationPose) == 0x000010, "Wrong alignment on FX6InertializationPose");
static_assert(sizeof(FX6InertializationPose) == 0x0000C0, "Wrong size on FX6InertializationPose");

// ScriptStruct X6Animation.X6InertializationPoseDiff
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FX6InertializationPoseDiff final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FX6InertializationPoseDiff) == 0x000008, "Wrong alignment on FX6InertializationPoseDiff");
static_assert(sizeof(FX6InertializationPoseDiff) == 0x000028, "Wrong size on FX6InertializationPoseDiff");

// ScriptStruct X6Animation.AnimNode_X6OverlayBlend
// 0x0248 (0x0258 - 0x0010)
struct FAnimNode_X6OverlayBlend final : public FAnimNode_Base
{
public:
	EX6OverlayBlendType                           OverlayType;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              LocomotionPose;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              BasePose;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              OverlayPose;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6OverlayData*                         OverlayData;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6OverlayCustomModeData*               OverlayCustomModeData;                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6OverlayFrameSettings*                FrameSettings;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlayAnimInternalTimeAccumulator;                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6OverlayData*                         CachedOverlayData;                                 // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UX6OverlayCustomModeData*               CachedOverlayCustomModeData;                       // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x20];                                      // 0x0080(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FX6OverlayPerBoneBlendWeights>  PerBoneWeights;                                    // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bCacheOverlayChanged;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SkeletonGuid;                                      // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  VirtualBoneGuid;                                   // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x20];                                      // 0x00D4(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableManualMirror;                               // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualMirror;                                     // 0x00F5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0xA0];                                     // 0x0100(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInertializationRequest>        RequestQueue;                                      // 0x01A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0xA0];                                     // 0x01B0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableNodeWithBlend;                             // 0x0251(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6OverlayBlend) == 0x000008, "Wrong alignment on FAnimNode_X6OverlayBlend");
static_assert(sizeof(FAnimNode_X6OverlayBlend) == 0x000258, "Wrong size on FAnimNode_X6OverlayBlend");
static_assert(offsetof(FAnimNode_X6OverlayBlend, OverlayType) == 0x000010, "Member 'FAnimNode_X6OverlayBlend::OverlayType' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, LocomotionPose) == 0x000018, "Member 'FAnimNode_X6OverlayBlend::LocomotionPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, BasePose) == 0x000028, "Member 'FAnimNode_X6OverlayBlend::BasePose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, OverlayPose) == 0x000038, "Member 'FAnimNode_X6OverlayBlend::OverlayPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, LODThreshold) == 0x000048, "Member 'FAnimNode_X6OverlayBlend::LODThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, OverlayData) == 0x000050, "Member 'FAnimNode_X6OverlayBlend::OverlayData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, OverlayCustomModeData) == 0x000058, "Member 'FAnimNode_X6OverlayBlend::OverlayCustomModeData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, FrameSettings) == 0x000060, "Member 'FAnimNode_X6OverlayBlend::FrameSettings' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, OverlayAnimInternalTimeAccumulator) == 0x000068, "Member 'FAnimNode_X6OverlayBlend::OverlayAnimInternalTimeAccumulator' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, CachedOverlayData) == 0x000070, "Member 'FAnimNode_X6OverlayBlend::CachedOverlayData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, CachedOverlayCustomModeData) == 0x000078, "Member 'FAnimNode_X6OverlayBlend::CachedOverlayCustomModeData' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, PerBoneWeights) == 0x0000A0, "Member 'FAnimNode_X6OverlayBlend::PerBoneWeights' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, bCacheOverlayChanged) == 0x0000B0, "Member 'FAnimNode_X6OverlayBlend::bCacheOverlayChanged' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, SkeletonGuid) == 0x0000B4, "Member 'FAnimNode_X6OverlayBlend::SkeletonGuid' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, VirtualBoneGuid) == 0x0000C4, "Member 'FAnimNode_X6OverlayBlend::VirtualBoneGuid' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, bEnableManualMirror) == 0x0000F4, "Member 'FAnimNode_X6OverlayBlend::bEnableManualMirror' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, bManualMirror) == 0x0000F5, "Member 'FAnimNode_X6OverlayBlend::bManualMirror' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, MirrorDataTable) == 0x0000F8, "Member 'FAnimNode_X6OverlayBlend::MirrorDataTable' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, RequestQueue) == 0x0001A0, "Member 'FAnimNode_X6OverlayBlend::RequestQueue' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, bEnabled) == 0x000250, "Member 'FAnimNode_X6OverlayBlend::bEnabled' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6OverlayBlend, bDisableNodeWithBlend) == 0x000251, "Member 'FAnimNode_X6OverlayBlend::bDisableNodeWithBlend' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6PoseBlendNode
// 0x0088 (0x0120 - 0x0098)
struct FAnimNode_X6PoseBlendNode final : public FAnimNode_PoseHandler
{
public:
	struct FPoseLink                              Source;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	EX6PoseBlendNodeMode                          PoseBlendMode;                                     // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetCurveValueBeforePoseExtract;                 // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeCurveAfterPoseExtract;                     // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x3D];                                      // 0x00AB(0x003D)(Fixing Size After Last Property [ Dumper-7 ])
	EAlphaBlendOption                             BlendOption;                                       // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CustomCurve;                                       // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysUpdateSourcePose;                           // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x1F];                                     // 0x0101(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6PoseBlendNode) == 0x000008, "Wrong alignment on FAnimNode_X6PoseBlendNode");
static_assert(sizeof(FAnimNode_X6PoseBlendNode) == 0x000120, "Wrong size on FAnimNode_X6PoseBlendNode");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, Source) == 0x000098, "Member 'FAnimNode_X6PoseBlendNode::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, PoseBlendMode) == 0x0000A8, "Member 'FAnimNode_X6PoseBlendNode::PoseBlendMode' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, bResetCurveValueBeforePoseExtract) == 0x0000A9, "Member 'FAnimNode_X6PoseBlendNode::bResetCurveValueBeforePoseExtract' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, bConsumeCurveAfterPoseExtract) == 0x0000AA, "Member 'FAnimNode_X6PoseBlendNode::bConsumeCurveAfterPoseExtract' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, BlendOption) == 0x0000E8, "Member 'FAnimNode_X6PoseBlendNode::BlendOption' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, CustomCurve) == 0x0000F0, "Member 'FAnimNode_X6PoseBlendNode::CustomCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, SlotName) == 0x0000F8, "Member 'FAnimNode_X6PoseBlendNode::SlotName' has a wrong offset!");
static_assert(offsetof(FAnimNode_X6PoseBlendNode, bAlwaysUpdateSourcePose) == 0x000100, "Member 'FAnimNode_X6PoseBlendNode::bAlwaysUpdateSourcePose' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6RootMotionWeightNormalizer
// 0x0018 (0x0028 - 0x0010)
struct FAnimNode_X6RootMotionWeightNormalizer final : public FAnimNode_Base
{
public:
	struct FPoseLink                              Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_X6RootMotionWeightNormalizer) == 0x000008, "Wrong alignment on FAnimNode_X6RootMotionWeightNormalizer");
static_assert(sizeof(FAnimNode_X6RootMotionWeightNormalizer) == 0x000028, "Wrong size on FAnimNode_X6RootMotionWeightNormalizer");
static_assert(offsetof(FAnimNode_X6RootMotionWeightNormalizer, Source) == 0x000010, "Member 'FAnimNode_X6RootMotionWeightNormalizer::Source' has a wrong offset!");

// ScriptStruct X6Animation.MatchSequences
// 0x0010 (0x0010 - 0x0000)
struct FMatchSequences final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMirror;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchSequences) == 0x000008, "Wrong alignment on FMatchSequences");
static_assert(sizeof(FMatchSequences) == 0x000010, "Wrong size on FMatchSequences");
static_assert(offsetof(FMatchSequences, AnimSequence) == 0x000000, "Member 'FMatchSequences::AnimSequence' has a wrong offset!");
static_assert(offsetof(FMatchSequences, bMirror) == 0x000008, "Member 'FMatchSequences::bMirror' has a wrong offset!");

// ScriptStruct X6Animation.AnimNode_X6SequencePlayer
// 0x00C8 (0x0108 - 0x0040)
struct FAnimNode_X6SequencePlayer final : public FAnimNode_SequencePlayerBase
{
public:
	class UAnimSequenceBase*                      TargetSequence;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Sequence;                                          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateSequence;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
