#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6BlueprintMultiPlayerNetWorkLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function X6BlueprintMultiPlayerNetWorkLibrary.X6BlueprintMultiPlayerNetWorkLibrary_C.GetMultiPlayerGetSeverTime
// 0x0020 (0x0020 - 0x0000)
struct X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         Ret;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UX6NetClientV2*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetSeverTime_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime) == 0x000008, "Wrong alignment on X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime");
static_assert(sizeof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime) == 0x000020, "Wrong size on X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime, __WorldContext) == 0x000000, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime, Ret) == 0x000008, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime::Ret' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime, CallFunc_GetSeverTime_ReturnValue) == 0x000018, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_GetMultiPlayerGetSeverTime::CallFunc_GetSeverTime_ReturnValue' has a wrong offset!");

// Function X6BlueprintMultiPlayerNetWorkLibrary.X6BlueprintMultiPlayerNetWorkLibrary_C.IsMultiPlayerMode
// 0x0020 (0x0020 - 0x0000)
struct X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6NetClientV2*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiPlayerMode_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode) == 0x000008, "Wrong alignment on X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode");
static_assert(sizeof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode) == 0x000020, "Wrong size on X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode, __WorldContext) == 0x000000, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode, Ret) == 0x000008, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode::Ret' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode, CallFunc_IsMultiPlayerMode_ReturnValue) == 0x000018, "Member 'X6BlueprintMultiPlayerNetWorkLibrary_C_IsMultiPlayerMode::CallFunc_IsMultiPlayerMode_ReturnValue' has a wrong offset!");

}

