#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6BlueprintMaterialEffectLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function X6BlueprintMaterialEffectLibrary.X6BlueprintMaterialEffectLibrary_C.AddScalarsByType
// 0x01B0 (0x01B0 - 0x0000)
struct X6BlueprintMaterialEffectLibrary_C_AddScalarsByType final
{
public:
	int32                                         EffectType;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     ExtraScalars;                                      // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     ScalarMap;                                         // 0x0068(0x0050)(Parm, OutParm)
	TArray<class FName>                           Args;                                              // 0x00B8(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, double>                     res;                                               // 0x00C8(0x0050)(Edit, BlueprintVisible)
	double                                        Temp_real_Variable;                                // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0140(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0170(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
};
static_assert(alignof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType) == 0x000008, "Wrong alignment on X6BlueprintMaterialEffectLibrary_C_AddScalarsByType");
static_assert(sizeof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType) == 0x0001B0, "Wrong size on X6BlueprintMaterialEffectLibrary_C_AddScalarsByType");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, EffectType) == 0x000000, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::EffectType' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Value) == 0x000008, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Value' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, ExtraScalars) == 0x000010, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::ExtraScalars' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, __WorldContext) == 0x000060, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, ScalarMap) == 0x000068, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::ScalarMap' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Args) == 0x0000B8, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Args' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, res) == 0x0000C8, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::res' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_real_Variable) == 0x000118, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_int_Array_Index_Variable) == 0x000120, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_int_Array_Index_Variable_1) == 0x00012C, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Array_Get_Item) == 0x000130, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Map_Keys_Keys) == 0x000140, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Array_Get_Item_1) == 0x000150, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Map_Find_Value) == 0x000160, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Map_Find_ReturnValue) == 0x000168, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Less_IntInt_ReturnValue) == 0x000169, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_real_Variable_1) == 0x000170, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Multiply_IntInt_ReturnValue) == 0x000178, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000180, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000184, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000188, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00018C, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Greater_IntInt_ReturnValue) == 0x00018D, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_BooleanAND_ReturnValue) == 0x00018E, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, Temp_int_Loop_Counter_Variable_1) == 0x000190, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Less_IntInt_ReturnValue_1) == 0x000194, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, CallFunc_Add_IntInt_ReturnValue_1) == 0x000198, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_AddScalarsByType, K2Node_MakeArray_Array) == 0x0001A0, "Member 'X6BlueprintMaterialEffectLibrary_C_AddScalarsByType::K2Node_MakeArray_Array' has a wrong offset!");

// Function X6BlueprintMaterialEffectLibrary.X6BlueprintMaterialEffectLibrary_C.BP_SetActorEffect
// 0x0160 (0x0160 - 0x0000)
struct X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectType;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     ExtraScalars;                                      // 0x0018(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FName, struct FVector>             ExtraVectors;                                      // 0x0068(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     CallFunc_AddScalarsByType_ScalarMap;               // 0x00C0(0x0050)()
	TMap<class FName, float>                      CallFunc_X6SetActorEffect_ScalarParams_ImplicitCast; // 0x0110(0x0050)(ConstParm)
};
static_assert(alignof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect) == 0x000008, "Wrong alignment on X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect");
static_assert(sizeof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect) == 0x000160, "Wrong size on X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, Actor) == 0x000000, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, EffectType) == 0x000008, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::EffectType' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, Value) == 0x000010, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::Value' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, ExtraScalars) == 0x000018, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::ExtraScalars' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, ExtraVectors) == 0x000068, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::ExtraVectors' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, __WorldContext) == 0x0000B8, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, CallFunc_AddScalarsByType_ScalarMap) == 0x0000C0, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::CallFunc_AddScalarsByType_ScalarMap' has a wrong offset!");
static_assert(offsetof(X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect, CallFunc_X6SetActorEffect_ScalarParams_ImplicitCast) == 0x000110, "Member 'X6BlueprintMaterialEffectLibrary_C_BP_SetActorEffect::CallFunc_X6SetActorEffect_ScalarParams_ImplicitCast' has a wrong offset!");

}

