#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6BlueprintAnimalLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.GetBelongingAnimalCluster
// 0x0040 (0x0040 - 0x0000)
struct X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster final
{
public:
	class AActor*                                 Member;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_AnimalClusterBase_C*                AnimalCluster;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AnimalClusterMemberFSMComponent_C*  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            CallFunc_GetInstance_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_AnimalClusterMemberBase_C*         K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster) == 0x000040, "Wrong size on X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, Member) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::Member' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, __WorldContext) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, AnimalCluster) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::AnimalCluster' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, CallFunc_GetInstance_ReturnValue) == 0x000028, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base) == 0x000030, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'X6BlueprintAnimalLibrary_C_GetBelongingAnimalCluster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.GetAnimalClusterMemberFSM
// 0x0040 (0x0040 - 0x0000)
struct X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_AnimalClusterMemberBase_C*         FSM;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AnimalClusterMemberFSMComponent_C*  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            CallFunc_GetInstance_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_AnimalClusterMemberBase_C*         K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM) == 0x000040, "Wrong size on X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, Actor) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, __WorldContext) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, FSM) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::FSM' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, CallFunc_GetInstance_ReturnValue) == 0x000028, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base) == 0x000030, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::K2Node_DynamicCast_AsFSM_Animal_Cluster_Member_Base' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalClusterMemberFSM::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.GetAnimalReactionFSM
// 0x0040 (0x0040 - 0x0000)
struct X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         FSM;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_QuadrupedAnimalReactionComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            CallFunc_GetInstance_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFSM_QuadrupedAnimalReaction_C*         K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM) == 0x000040, "Wrong size on X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, Actor) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, __WorldContext) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, FSM) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::FSM' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, CallFunc_GetInstance_ReturnValue) == 0x000028, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction) == 0x000030, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::K2Node_DynamicCast_AsFSM_Quadruped_Animal_Reaction' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'X6BlueprintAnimalLibrary_C_GetAnimalReactionFSM::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.IsHoldingBrush
// 0x0030 (0x0030 - 0x0000)
struct X6BlueprintAnimalLibrary_C_IsHoldingBrush final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bHoldingBrush;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CleaningAnimalComponent_V2_C*       CleaningComp;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CleaningAnimalComponent_V2_C*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_IsHoldingBrush) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_IsHoldingBrush");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_IsHoldingBrush) == 0x000030, "Wrong size on X6BlueprintAnimalLibrary_C_IsHoldingBrush");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, Actor) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, __WorldContext) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, bHoldingBrush) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::bHoldingBrush' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, CleaningComp) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::CleaningComp' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_IsHoldingBrush, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'X6BlueprintAnimalLibrary_C_IsHoldingBrush::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.GetSimpleFleePoint
// 0x01E0 (0x01E0 - 0x0000)
struct X6BlueprintAnimalLibrary_C_GetSimpleFleePoint final
{
public:
	class AActor*                                 Animal;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StimuliSourcePoint;                                // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FleeCenter;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FleeRadius;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FleePoint;                                         // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StimuliSourceInverseDir;                           // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AnimalDir;                                         // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue;              // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Normal2D_ReturnValue_1;            // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_GetSimpleFleePoint");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint) == 0x0001E0, "Wrong size on X6BlueprintAnimalLibrary_C_GetSimpleFleePoint");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, Animal) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::Animal' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, StimuliSourcePoint) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::StimuliSourcePoint' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, FleeCenter) == 0x000020, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::FleeCenter' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, FleeRadius) == 0x000038, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::FleeRadius' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, __WorldContext) == 0x000040, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, FleePoint) == 0x000048, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::FleePoint' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, StimuliSourceInverseDir) == 0x000060, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::StimuliSourceInverseDir' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, AnimalDir) == 0x000078, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::AnimalDir' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000090, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000098, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000B0, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Vector_Normal2D_ReturnValue) == 0x0000E0, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Vector_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000118, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Vector_Normal2D_ReturnValue_1) == 0x000130, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Vector_Normal2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_MakeLiteralDouble_ReturnValue_1) == 0x000148, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_MakeLiteralDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000150, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000168, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000180, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Divide_VectorVector_ReturnValue) == 0x000198, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001B0, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_GetSimpleFleePoint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001C8, "Member 'X6BlueprintAnimalLibrary_C_GetSimpleFleePoint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.BP_ConvBehaviorType2CharAnimSetTag
// 0x0020 (0x0020 - 0x0000)
struct X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag final
{
public:
	class AActor*                                 AnimalActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BehaviorType;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CharAnimSetTag;                                    // 0x0018(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag) == 0x000020, "Wrong size on X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag, AnimalActor) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag::AnimalActor' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag, BehaviorType) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag::BehaviorType' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag, __WorldContext) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag, CharAnimSetTag) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2CharAnimSetTag::CharAnimSetTag' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.BP_ConvBehaviorType2AnimSeqSoftRef
// 0x0040 (0x0040 - 0x0000)
struct X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef final
{
public:
	class AActor*                                 AnimalActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BehaviorType;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequenceBase>       AnimSeqSoftRef;                                    // 0x0018(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef) == 0x000040, "Wrong size on X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef, AnimalActor) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef::AnimalActor' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef, BehaviorType) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef::BehaviorType' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef, __WorldContext) == 0x000010, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef, AnimSeqSoftRef) == 0x000018, "Member 'X6BlueprintAnimalLibrary_C_BP_ConvBehaviorType2AnimSeqSoftRef::AnimSeqSoftRef' has a wrong offset!");

// Function X6BlueprintAnimalLibrary.X6BlueprintAnimalLibrary_C.BP_IsGlobalAnimalTickManagerActive
// 0x0010 (0x0010 - 0x0000)
struct X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive) == 0x000008, "Wrong alignment on X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive");
static_assert(sizeof(X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive) == 0x000010, "Wrong size on X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive, __WorldContext) == 0x000000, "Member 'X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive, bActive) == 0x000008, "Member 'X6BlueprintAnimalLibrary_C_BP_IsGlobalAnimalTickManagerActive::bActive' has a wrong offset!");

}

