#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6BlueprintCommonLibrary

#include "Basic.hpp"

#include "Enum_InformID_structs.hpp"
#include "ECharacterType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "E_SafezoneType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_CenterInfoType_structs.hpp"
#include "Engine_structs.hpp"
#include "MainHUDItem_structs.hpp"


namespace SDK::Params
{

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6SpawnNSAttached
// 0x0070 (0x0070 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6SpawnNSAttached final
{
public:
	class UNiagaraSystem*                         NSAsset;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComp;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachSocket;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         LocationType;                                      // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoDestroy;                                      // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoActivate;                                     // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXCom;                                             // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6SpawnNSAttached");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached) == 0x000070, "Wrong size on X6BlueprintCommonLibrary_C_X6SpawnNSAttached");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, NSAsset) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::NSAsset' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, AttachComp) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::AttachComp' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, AttachSocket) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::AttachSocket' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, Location) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::Location' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, Rotation) == 0x000030, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::Rotation' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, LocationType) == 0x000048, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::LocationType' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, bAutoDestroy) == 0x000049, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::bAutoDestroy' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, bAutoActivate) == 0x00004A, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::bAutoActivate' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, __WorldContext) == 0x000050, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, FXCom) == 0x000058, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::FXCom' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, CallFunc_GetValidValue_ReturnValue) == 0x000060, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAttached, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000068, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAttached::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6SpawnNSAtLocation
// 0x0078 (0x0078 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NSAsset;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoDestroy;                                      // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoActivate;                                     // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXCom;                                             // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation) == 0x000078, "Wrong size on X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, WorldContext) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, NSAsset) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::NSAsset' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, Location) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::Location' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, Rotation) == 0x000028, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::Rotation' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, Scale) == 0x000040, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::Scale' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, bAutoDestroy) == 0x000058, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::bAutoDestroy' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, bAutoActivate) == 0x000059, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::bAutoActivate' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, __WorldContext) == 0x000060, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, FXCom) == 0x000068, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::FXCom' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000070, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAtLocation::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6SpawnNSAlongSpline
// 0x0140 (0x0140 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline final
{
public:
	class UNiagaraSystem*                         NiagaraAsset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        HeightOffset;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              NiagaraComps;                                      // 0x0020(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              RetNiagaraComps;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_2;   // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline) == 0x000140, "Wrong size on X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, NiagaraAsset) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::NiagaraAsset' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, Spline) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::Spline' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, HeightOffset) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::HeightOffset' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, __WorldContext) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, NiagaraComps) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::NiagaraComps' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, RetNiagaraComps) == 0x000030, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::RetNiagaraComps' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, Temp_bool_Variable) == 0x000040, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, Temp_int_Variable) == 0x000044, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000050, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000058, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000078, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_GetLocationAtSplinePoint_ReturnValue_2) == 0x0000C0, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_GetLocationAtSplinePoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x0000D8, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000F8, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000100, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000108, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, Temp_struct_Variable) == 0x000110, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline, K2Node_Select_Default) == 0x000128, "Member 'X6BlueprintCommonLibrary_C_X6SpawnNSAlongSpline::K2Node_Select_Default' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6PushBackCharacter
// 0x00D0 (0x00D0 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6PushBackCharacter final
{
public:
	class ACharacter*                             TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ForceXY;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceZ;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6PushBackCharacter) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6PushBackCharacter");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6PushBackCharacter) == 0x0000D0, "Wrong size on X6BlueprintCommonLibrary_C_X6PushBackCharacter");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, TargetCharacter) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::TargetCharacter' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, Actor) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, ForceXY) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::ForceXY' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, ForceZ) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::ForceZ' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, __WorldContext) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_Normal_ReturnValue) == 0x000070, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_BreakVector_X) == 0x0000A0, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_BreakVector_Z) == 0x0000B0, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6PushBackCharacter, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'X6BlueprintCommonLibrary_C_X6PushBackCharacter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6HideActors
// 0x0040 (0x0040 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6HideActors final
{
public:
	TArray<class AActor*>                         Actor;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Hide;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6HideActors) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6HideActors");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6HideActors) == 0x000040, "Wrong size on X6BlueprintCommonLibrary_C_X6HideActors");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, Actor) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, Hide) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::Hide' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, __WorldContext) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, Temp_int_Array_Index_Variable) == 0x000024, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, CallFunc_Array_Get_Item) == 0x000030, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActors, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'X6BlueprintCommonLibrary_C_X6HideActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.X6HideActor
// 0x0030 (0x0030 - 0x0000)
struct X6BlueprintCommonLibrary_C_X6HideActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InteractiveActorComponent_C*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_X6HideActor) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_X6HideActor");
static_assert(sizeof(X6BlueprintCommonLibrary_C_X6HideActor) == 0x000030, "Wrong size on X6BlueprintCommonLibrary_C_X6HideActor");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, Actor) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::Actor' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, Hide) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::Hide' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, __WorldContext) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_X6HideActor, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'X6BlueprintCommonLibrary_C_X6HideActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.WidgetsCustomNavigation
// 0x0028 (0x0028 - 0x0000)
struct X6BlueprintCommonLibrary_C_WidgetsCustomNavigation final
{
public:
	TArray<class UWidget*>                        Widgets;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EUINavigation                                 NavigationDir;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Wrap;                                              // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusRecipient;                                    // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_WidgetsCustomNavigation");
static_assert(sizeof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation) == 0x000028, "Wrong size on X6BlueprintCommonLibrary_C_WidgetsCustomNavigation");
static_assert(offsetof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation, Widgets) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_WidgetsCustomNavigation::Widgets' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation, NavigationDir) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_WidgetsCustomNavigation::NavigationDir' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation, Wrap) == 0x000011, "Member 'X6BlueprintCommonLibrary_C_WidgetsCustomNavigation::Wrap' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation, __WorldContext) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_WidgetsCustomNavigation::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_WidgetsCustomNavigation, FocusRecipient) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_WidgetsCustomNavigation::FocusRecipient' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.UpdateAndClampInteger
// 0x0028 (0x0028 - 0x0000)
struct X6BlueprintCommonLibrary_C_UpdateAndClampInteger final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_UpdateAndClampInteger");
static_assert(sizeof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger) == 0x000028, "Wrong size on X6BlueprintCommonLibrary_C_UpdateAndClampInteger");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, Current) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::Current' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, Add) == 0x000004, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::Add' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, Min) == 0x000008, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::Min' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, Max) == 0x00000C, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::Max' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, __WorldContext) == 0x000010, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, ReturnValue) == 0x000018, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_UpdateAndClampInteger, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'X6BlueprintCommonLibrary_C_UpdateAndClampInteger::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.SpawnActorByActorSoftClassReference
// 0x00B0 (0x00B0 - 0x0000)
struct X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference final
{
public:
	TSoftClassPtr<class UClass>                   ActorClassRef;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ActorClass;                                        // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_1;                 // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_X6SpawnActor_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference");
static_assert(sizeof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference) == 0x0000B0, "Wrong size on X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, ActorClassRef) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::ActorClassRef' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, Location) == 0x000028, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::Location' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, Rotation) == 0x000040, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::Rotation' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, __WorldContext) == 0x000058, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::__WorldContext' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, ReturnValue) == 0x000060, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, ActorClass) == 0x000068, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::ActorClass' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000070, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, K2Node_ClassDynamicCast_AsActor) == 0x000078, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, K2Node_ClassDynamicCast_bSuccess) == 0x000080, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, K2Node_ClassDynamicCast_AsActor_1) == 0x000088, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::K2Node_ClassDynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, K2Node_ClassDynamicCast_bSuccess_1) == 0x000090, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, CallFunc_X6SpawnActor_ReturnValue) == 0x000098, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::CallFunc_X6SpawnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000A0, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000A8, "Member 'X6BlueprintCommonLibrary_C_SpawnActorByActorSoftClassReference::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function X6BlueprintCommonLibrary.X6BlueprintCommonLibrary_C.SnapToGround
// 0x03A0 (0x03A0 - 0x0000)
struct X6BlueprintCommonLibrary_C_SnapToGround final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LineTraceStartZ;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LineTraceEndZ;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x02A0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BlueprintCommonLibrary_C_SnapToGround) == 0x000008, "Wrong alignment on X6BlueprintCommonLibrary_C_SnapToGround");
static_assert(sizeof(X6BlueprintCommonLibrary_C_SnapToGround) == 0x0003A0, "Wrong size on X6BlueprintCommonLibrary_C_SnapToGround");
static_assert(offsetof(X6BlueprintCommonLibrary_C_SnapToGround, Actor) == 0x000000, "Member 'X6BlueprintCommonLibrary_C_SnapToGround::Actor' has a wrong offset!");
