#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6BTTask_LuaBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function X6BTTask_LuaBase.X6BTTask_LuaBase_C.ExecuteUbergraph_X6BTTask_LuaBase
// 0x0004 (0x0004 - 0x0000)
struct X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase) == 0x000004, "Wrong alignment on X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase");
static_assert(sizeof(X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase) == 0x000004, "Wrong size on X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase");
static_assert(offsetof(X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase, EntryPoint) == 0x000000, "Member 'X6BTTask_LuaBase_C_ExecuteUbergraph_X6BTTask_LuaBase::EntryPoint' has a wrong offset!");

// Function X6BTTask_LuaBase.X6BTTask_LuaBase_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct X6BTTask_LuaBase_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(X6BTTask_LuaBase_C_GetModuleName) == 0x000008, "Wrong alignment on X6BTTask_LuaBase_C_GetModuleName");
static_assert(sizeof(X6BTTask_LuaBase_C_GetModuleName) == 0x000010, "Wrong size on X6BTTask_LuaBase_C_GetModuleName");
static_assert(offsetof(X6BTTask_LuaBase_C_GetModuleName, ReturnValue) == 0x000000, "Member 'X6BTTask_LuaBase_C_GetModuleName::ReturnValue' has a wrong offset!");

}

