#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Camera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "X6Camera_structs.hpp"


namespace SDK::Params
{

// Function X6Camera.AdvancedCamera.AddCameraConfigModifierByClass
// 0x0038 (0x0038 - 0x0000)
struct AdvancedCamera_AddCameraConfigModifierByClass final
{
public:
	TSubclassOf<class UX6CameraRuntimeConfigModifier> ModifierClass;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6CameraConfigBlendParams             CameraConfigBlendParams;                           // 0x0008(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UX6CameraRuntimeConfigModifier*         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_AddCameraConfigModifierByClass) == 0x000008, "Wrong alignment on AdvancedCamera_AddCameraConfigModifierByClass");
static_assert(sizeof(AdvancedCamera_AddCameraConfigModifierByClass) == 0x000038, "Wrong size on AdvancedCamera_AddCameraConfigModifierByClass");
static_assert(offsetof(AdvancedCamera_AddCameraConfigModifierByClass, ModifierClass) == 0x000000, "Member 'AdvancedCamera_AddCameraConfigModifierByClass::ModifierClass' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_AddCameraConfigModifierByClass, CameraConfigBlendParams) == 0x000008, "Member 'AdvancedCamera_AddCameraConfigModifierByClass::CameraConfigBlendParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_AddCameraConfigModifierByClass, ReturnValue) == 0x000030, "Member 'AdvancedCamera_AddCameraConfigModifierByClass::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.BlendBackToFollow
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_BlendBackToFollow final
{
public:
	struct FViewTargetTransitionParams            CameraBlendParams;                                 // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_BlendBackToFollow) == 0x000008, "Wrong alignment on AdvancedCamera_BlendBackToFollow");
static_assert(sizeof(AdvancedCamera_BlendBackToFollow) == 0x000020, "Wrong size on AdvancedCamera_BlendBackToFollow");
static_assert(offsetof(AdvancedCamera_BlendBackToFollow, CameraBlendParams) == 0x000000, "Member 'AdvancedCamera_BlendBackToFollow::CameraBlendParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.BlendConfigFromCurrentCameraView
// 0x0028 (0x0028 - 0x0000)
struct AdvancedCamera_BlendConfigFromCurrentCameraView final
{
public:
	bool                                          bOverrideTransitionParams;                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_BlendConfigFromCurrentCameraView) == 0x000008, "Wrong alignment on AdvancedCamera_BlendConfigFromCurrentCameraView");
static_assert(sizeof(AdvancedCamera_BlendConfigFromCurrentCameraView) == 0x000028, "Wrong size on AdvancedCamera_BlendConfigFromCurrentCameraView");
static_assert(offsetof(AdvancedCamera_BlendConfigFromCurrentCameraView, bOverrideTransitionParams) == 0x000000, "Member 'AdvancedCamera_BlendConfigFromCurrentCameraView::bOverrideTransitionParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_BlendConfigFromCurrentCameraView, TransitionParams) == 0x000008, "Member 'AdvancedCamera_BlendConfigFromCurrentCameraView::TransitionParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.BlendToCameraView
// 0x0990 (0x0990 - 0x0000)
struct AdvancedCamera_BlendToCameraView final
{
public:
	struct FMinimalViewInfo                       NewCameraView;                                     // 0x0000(0x0970)(Parm, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            CameraBlendParams;                                 // 0x0970(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_BlendToCameraView) == 0x000010, "Wrong alignment on AdvancedCamera_BlendToCameraView");
static_assert(sizeof(AdvancedCamera_BlendToCameraView) == 0x000990, "Wrong size on AdvancedCamera_BlendToCameraView");
static_assert(offsetof(AdvancedCamera_BlendToCameraView, NewCameraView) == 0x000000, "Member 'AdvancedCamera_BlendToCameraView::NewCameraView' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_BlendToCameraView, CameraBlendParams) == 0x000970, "Member 'AdvancedCamera_BlendToCameraView::CameraBlendParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.CreateCameraCollisionProcessInstance
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_CreateCameraCollisionProcessInstance final
{
public:
	TSubclassOf<class UCameraCollisionProcess>    NewCameraCollisionProcessClass;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_CreateCameraCollisionProcessInstance) == 0x000008, "Wrong alignment on AdvancedCamera_CreateCameraCollisionProcessInstance");
static_assert(sizeof(AdvancedCamera_CreateCameraCollisionProcessInstance) == 0x000008, "Wrong size on AdvancedCamera_CreateCameraCollisionProcessInstance");
static_assert(offsetof(AdvancedCamera_CreateCameraCollisionProcessInstance, NewCameraCollisionProcessClass) == 0x000000, "Member 'AdvancedCamera_CreateCameraCollisionProcessInstance::NewCameraCollisionProcessClass' has a wrong offset!");

// Function X6Camera.AdvancedCamera.CreateCameraLagInstance
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_CreateCameraLagInstance final
{
public:
	TSubclassOf<class UCameraLagProcess>          NewCameraLagProcessClass;                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_CreateCameraLagInstance) == 0x000008, "Wrong alignment on AdvancedCamera_CreateCameraLagInstance");
static_assert(sizeof(AdvancedCamera_CreateCameraLagInstance) == 0x000008, "Wrong size on AdvancedCamera_CreateCameraLagInstance");
static_assert(offsetof(AdvancedCamera_CreateCameraLagInstance, NewCameraLagProcessClass) == 0x000000, "Member 'AdvancedCamera_CreateCameraLagInstance::NewCameraLagProcessClass' has a wrong offset!");

// Function X6Camera.AdvancedCamera.DoFixCameraByBasedMovement
// 0x0070 (0x0070 - 0x0000)
struct AdvancedCamera_DoFixCameraByBasedMovement final
{
public:
	struct FBasedMovementFixCameraHelper          Helper;                                            // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_DoFixCameraByBasedMovement) == 0x000010, "Wrong alignment on AdvancedCamera_DoFixCameraByBasedMovement");
static_assert(sizeof(AdvancedCamera_DoFixCameraByBasedMovement) == 0x000070, "Wrong size on AdvancedCamera_DoFixCameraByBasedMovement");
static_assert(offsetof(AdvancedCamera_DoFixCameraByBasedMovement, Helper) == 0x000000, "Member 'AdvancedCamera_DoFixCameraByBasedMovement::Helper' has a wrong offset!");

// Function X6Camera.AdvancedCamera.ExitZoom
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_ExitZoom final
{
public:
	float                                         BlendOutTime;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_ExitZoom) == 0x000004, "Wrong alignment on AdvancedCamera_ExitZoom");
static_assert(sizeof(AdvancedCamera_ExitZoom) == 0x000008, "Wrong size on AdvancedCamera_ExitZoom");
static_assert(offsetof(AdvancedCamera_ExitZoom, BlendOutTime) == 0x000000, "Member 'AdvancedCamera_ExitZoom::BlendOutTime' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_ExitZoom, ReturnValue) == 0x000004, "Member 'AdvancedCamera_ExitZoom::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.FindMostOpenSpaceRotation
// 0x0080 (0x0080 - 0x0000)
struct AdvancedCamera_FindMostOpenSpaceRotation final
{
public:
	struct FTransform                             RelativeTrans;                                     // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutDeltaRot;                                       // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_FindMostOpenSpaceRotation) == 0x000010, "Wrong alignment on AdvancedCamera_FindMostOpenSpaceRotation");
static_assert(sizeof(AdvancedCamera_FindMostOpenSpaceRotation) == 0x000080, "Wrong size on AdvancedCamera_FindMostOpenSpaceRotation");
static_assert(offsetof(AdvancedCamera_FindMostOpenSpaceRotation, RelativeTrans) == 0x000000, "Member 'AdvancedCamera_FindMostOpenSpaceRotation::RelativeTrans' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_FindMostOpenSpaceRotation, OutDeltaRot) == 0x000060, "Member 'AdvancedCamera_FindMostOpenSpaceRotation::OutDeltaRot' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_FindMostOpenSpaceRotation, ReturnValue) == 0x000078, "Member 'AdvancedCamera_FindMostOpenSpaceRotation::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.FindOrAddCameraConfigModifier
// 0x0038 (0x0038 - 0x0000)
struct AdvancedCamera_FindOrAddCameraConfigModifier final
{
public:
	class UX6CameraRuntimeConfigModifier*         NewModifier;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6CameraConfigBlendParams             CameraConfigBlendParams;                           // 0x0008(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UX6CameraRuntimeConfigModifier*         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_FindOrAddCameraConfigModifier) == 0x000008, "Wrong alignment on AdvancedCamera_FindOrAddCameraConfigModifier");
static_assert(sizeof(AdvancedCamera_FindOrAddCameraConfigModifier) == 0x000038, "Wrong size on AdvancedCamera_FindOrAddCameraConfigModifier");
static_assert(offsetof(AdvancedCamera_FindOrAddCameraConfigModifier, NewModifier) == 0x000000, "Member 'AdvancedCamera_FindOrAddCameraConfigModifier::NewModifier' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_FindOrAddCameraConfigModifier, CameraConfigBlendParams) == 0x000008, "Member 'AdvancedCamera_FindOrAddCameraConfigModifier::CameraConfigBlendParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_FindOrAddCameraConfigModifier, ReturnValue) == 0x000030, "Member 'AdvancedCamera_FindOrAddCameraConfigModifier::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.GetArmlengthLagSpeed
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_GetArmlengthLagSpeed final
{
public:
	float                                         ArmlengthLagSpeed;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_GetArmlengthLagSpeed) == 0x000004, "Wrong alignment on AdvancedCamera_GetArmlengthLagSpeed");
static_assert(sizeof(AdvancedCamera_GetArmlengthLagSpeed) == 0x000008, "Wrong size on AdvancedCamera_GetArmlengthLagSpeed");
static_assert(offsetof(AdvancedCamera_GetArmlengthLagSpeed, ArmlengthLagSpeed) == 0x000000, "Member 'AdvancedCamera_GetArmlengthLagSpeed::ArmlengthLagSpeed' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_GetArmlengthLagSpeed, ReturnValue) == 0x000004, "Member 'AdvancedCamera_GetArmlengthLagSpeed::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.GetCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct AdvancedCamera_GetCameraRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_GetCameraRotation) == 0x000008, "Wrong alignment on AdvancedCamera_GetCameraRotation");
static_assert(sizeof(AdvancedCamera_GetCameraRotation) == 0x000018, "Wrong size on AdvancedCamera_GetCameraRotation");
static_assert(offsetof(AdvancedCamera_GetCameraRotation, ReturnValue) == 0x000000, "Member 'AdvancedCamera_GetCameraRotation::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.GetCameraRotationLagSpeed
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_GetCameraRotationLagSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_GetCameraRotationLagSpeed) == 0x000004, "Wrong alignment on AdvancedCamera_GetCameraRotationLagSpeed");
static_assert(sizeof(AdvancedCamera_GetCameraRotationLagSpeed) == 0x000004, "Wrong size on AdvancedCamera_GetCameraRotationLagSpeed");
static_assert(offsetof(AdvancedCamera_GetCameraRotationLagSpeed, ReturnValue) == 0x000000, "Member 'AdvancedCamera_GetCameraRotationLagSpeed::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.OnRotateInput
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_OnRotateInput final
{
public:
	struct FVector                                InputVector;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_OnRotateInput) == 0x000008, "Wrong alignment on AdvancedCamera_OnRotateInput");
static_assert(sizeof(AdvancedCamera_OnRotateInput) == 0x000020, "Wrong size on AdvancedCamera_OnRotateInput");
static_assert(offsetof(AdvancedCamera_OnRotateInput, InputVector) == 0x000000, "Member 'AdvancedCamera_OnRotateInput::InputVector' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_OnRotateInput, ElapsedTime) == 0x000018, "Member 'AdvancedCamera_OnRotateInput::ElapsedTime' has a wrong offset!");

// Function X6Camera.AdvancedCamera.OnZoomInput
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_OnZoomInput final
{
public:
	float                                         InputValue;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_OnZoomInput) == 0x000004, "Wrong alignment on AdvancedCamera_OnZoomInput");
static_assert(sizeof(AdvancedCamera_OnZoomInput) == 0x000004, "Wrong size on AdvancedCamera_OnZoomInput");
static_assert(offsetof(AdvancedCamera_OnZoomInput, InputValue) == 0x000000, "Member 'AdvancedCamera_OnZoomInput::InputValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.PushBaseCameraConfig
// 0x000C (0x000C - 0x0000)
struct AdvancedCamera_PushBaseCameraConfig final
{
public:
	class FName                                   ConfigKey;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_PushBaseCameraConfig) == 0x000004, "Wrong alignment on AdvancedCamera_PushBaseCameraConfig");
static_assert(sizeof(AdvancedCamera_PushBaseCameraConfig) == 0x00000C, "Wrong size on AdvancedCamera_PushBaseCameraConfig");
static_assert(offsetof(AdvancedCamera_PushBaseCameraConfig, ConfigKey) == 0x000000, "Member 'AdvancedCamera_PushBaseCameraConfig::ConfigKey' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushBaseCameraConfig, ReturnValue) == 0x000008, "Member 'AdvancedCamera_PushBaseCameraConfig::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.PushBaseParams
// 0x01C0 (0x01C0 - 0x0000)
struct AdvancedCamera_PushBaseParams final
{
public:
	struct FCameraBaseParamsDefine                BaseParams;                                        // 0x0000(0x0160)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FX6CameraConfigBlendParams             CameraConfigBlendParams;                           // 0x0160(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FX6CameraConfigPriority                Priority;                                          // 0x0188(0x0030)(ConstParm, Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x01B8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_PushBaseParams) == 0x000008, "Wrong alignment on AdvancedCamera_PushBaseParams");
static_assert(sizeof(AdvancedCamera_PushBaseParams) == 0x0001C0, "Wrong size on AdvancedCamera_PushBaseParams");
static_assert(offsetof(AdvancedCamera_PushBaseParams, BaseParams) == 0x000000, "Member 'AdvancedCamera_PushBaseParams::BaseParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushBaseParams, CameraConfigBlendParams) == 0x000160, "Member 'AdvancedCamera_PushBaseParams::CameraConfigBlendParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushBaseParams, Priority) == 0x000188, "Member 'AdvancedCamera_PushBaseParams::Priority' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushBaseParams, ReturnValue) == 0x0001B8, "Member 'AdvancedCamera_PushBaseParams::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.PushCameraConfig
// 0x0040 (0x0040 - 0x0000)
struct AdvancedCamera_PushCameraConfig final
{
public:
	class UCameraBaseParamsData*                  TargetCameraDataBase;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetConfigKey;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideTransitionParams;                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0018(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_PushCameraConfig) == 0x000008, "Wrong alignment on AdvancedCamera_PushCameraConfig");
static_assert(sizeof(AdvancedCamera_PushCameraConfig) == 0x000040, "Wrong size on AdvancedCamera_PushCameraConfig");
static_assert(offsetof(AdvancedCamera_PushCameraConfig, TargetCameraDataBase) == 0x000000, "Member 'AdvancedCamera_PushCameraConfig::TargetCameraDataBase' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfig, TargetConfigKey) == 0x000008, "Member 'AdvancedCamera_PushCameraConfig::TargetConfigKey' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfig, bOverrideTransitionParams) == 0x000010, "Member 'AdvancedCamera_PushCameraConfig::bOverrideTransitionParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfig, TransitionParams) == 0x000018, "Member 'AdvancedCamera_PushCameraConfig::TransitionParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfig, ReturnValue) == 0x000038, "Member 'AdvancedCamera_PushCameraConfig::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.PushCameraConfigOfCameraDataBase
// 0x0038 (0x0038 - 0x0000)
struct AdvancedCamera_PushCameraConfigOfCameraDataBase final
{
public:
	class FName                                   TargetConfigKey;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6CameraConfigBlendParams             CameraConfigBlendParams;                           // 0x0008(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_PushCameraConfigOfCameraDataBase) == 0x000008, "Wrong alignment on AdvancedCamera_PushCameraConfigOfCameraDataBase");
static_assert(sizeof(AdvancedCamera_PushCameraConfigOfCameraDataBase) == 0x000038, "Wrong size on AdvancedCamera_PushCameraConfigOfCameraDataBase");
static_assert(offsetof(AdvancedCamera_PushCameraConfigOfCameraDataBase, TargetConfigKey) == 0x000000, "Member 'AdvancedCamera_PushCameraConfigOfCameraDataBase::TargetConfigKey' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfigOfCameraDataBase, CameraConfigBlendParams) == 0x000008, "Member 'AdvancedCamera_PushCameraConfigOfCameraDataBase::CameraConfigBlendParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_PushCameraConfigOfCameraDataBase, ReturnValue) == 0x000030, "Member 'AdvancedCamera_PushCameraConfigOfCameraDataBase::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.ReceiveUpdateLookAtTarget
// 0x0010 (0x0010 - 0x0000)
struct AdvancedCamera_ReceiveUpdateLookAtTarget final
{
public:
	const class AActor*                           OldLookAtTarget;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           NewLookAtTarget;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_ReceiveUpdateLookAtTarget) == 0x000008, "Wrong alignment on AdvancedCamera_ReceiveUpdateLookAtTarget");
static_assert(sizeof(AdvancedCamera_ReceiveUpdateLookAtTarget) == 0x000010, "Wrong size on AdvancedCamera_ReceiveUpdateLookAtTarget");
static_assert(offsetof(AdvancedCamera_ReceiveUpdateLookAtTarget, OldLookAtTarget) == 0x000000, "Member 'AdvancedCamera_ReceiveUpdateLookAtTarget::OldLookAtTarget' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_ReceiveUpdateLookAtTarget, NewLookAtTarget) == 0x000008, "Member 'AdvancedCamera_ReceiveUpdateLookAtTarget::NewLookAtTarget' has a wrong offset!");

// Function X6Camera.AdvancedCamera.RemoveBaseCameraConfigByIndex
// 0x0028 (0x0028 - 0x0000)
struct AdvancedCamera_RemoveBaseCameraConfigByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideTransitionParams;                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_RemoveBaseCameraConfigByIndex) == 0x000008, "Wrong alignment on AdvancedCamera_RemoveBaseCameraConfigByIndex");
static_assert(sizeof(AdvancedCamera_RemoveBaseCameraConfigByIndex) == 0x000028, "Wrong size on AdvancedCamera_RemoveBaseCameraConfigByIndex");
static_assert(offsetof(AdvancedCamera_RemoveBaseCameraConfigByIndex, Index_0) == 0x000000, "Member 'AdvancedCamera_RemoveBaseCameraConfigByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_RemoveBaseCameraConfigByIndex, bOverrideTransitionParams) == 0x000004, "Member 'AdvancedCamera_RemoveBaseCameraConfigByIndex::bOverrideTransitionParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_RemoveBaseCameraConfigByIndex, TransitionParams) == 0x000008, "Member 'AdvancedCamera_RemoveBaseCameraConfigByIndex::TransitionParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.RemoveCameraConfigByIndex
// 0x0028 (0x0028 - 0x0000)
struct AdvancedCamera_RemoveCameraConfigByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideTransitionParams;                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_RemoveCameraConfigByIndex) == 0x000008, "Wrong alignment on AdvancedCamera_RemoveCameraConfigByIndex");
static_assert(sizeof(AdvancedCamera_RemoveCameraConfigByIndex) == 0x000028, "Wrong size on AdvancedCamera_RemoveCameraConfigByIndex");
static_assert(offsetof(AdvancedCamera_RemoveCameraConfigByIndex, Index_0) == 0x000000, "Member 'AdvancedCamera_RemoveCameraConfigByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_RemoveCameraConfigByIndex, bOverrideTransitionParams) == 0x000004, "Member 'AdvancedCamera_RemoveCameraConfigByIndex::bOverrideTransitionParams' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_RemoveCameraConfigByIndex, TransitionParams) == 0x000008, "Member 'AdvancedCamera_RemoveCameraConfigByIndex::TransitionParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.RemoveCameraConfigModifier
// 0x0030 (0x0030 - 0x0000)
struct AdvancedCamera_RemoveCameraConfigModifier final
{
public:
	class UX6CameraRuntimeConfigModifier*         Modifier;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6CameraConfigBlendParams             CameraConfigBlendParams;                           // 0x0008(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_RemoveCameraConfigModifier) == 0x000008, "Wrong alignment on AdvancedCamera_RemoveCameraConfigModifier");
static_assert(sizeof(AdvancedCamera_RemoveCameraConfigModifier) == 0x000030, "Wrong size on AdvancedCamera_RemoveCameraConfigModifier");
static_assert(offsetof(AdvancedCamera_RemoveCameraConfigModifier, Modifier) == 0x000000, "Member 'AdvancedCamera_RemoveCameraConfigModifier::Modifier' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_RemoveCameraConfigModifier, CameraConfigBlendParams) == 0x000008, "Member 'AdvancedCamera_RemoveCameraConfigModifier::CameraConfigBlendParams' has a wrong offset!");

// Function X6Camera.AdvancedCamera.ResetToDefaultRelativeRotation
// 0x0002 (0x0002 - 0x0000)
struct AdvancedCamera_ResetToDefaultRelativeRotation final
{
public:
	bool                                          bApplyImmediate;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUpdateCamera;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_ResetToDefaultRelativeRotation) == 0x000001, "Wrong alignment on AdvancedCamera_ResetToDefaultRelativeRotation");
static_assert(sizeof(AdvancedCamera_ResetToDefaultRelativeRotation) == 0x000002, "Wrong size on AdvancedCamera_ResetToDefaultRelativeRotation");
static_assert(offsetof(AdvancedCamera_ResetToDefaultRelativeRotation, bApplyImmediate) == 0x000000, "Member 'AdvancedCamera_ResetToDefaultRelativeRotation::bApplyImmediate' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_ResetToDefaultRelativeRotation, bForceUpdateCamera) == 0x000001, "Member 'AdvancedCamera_ResetToDefaultRelativeRotation::bForceUpdateCamera' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetAcceptInput
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetAcceptInput final
{
public:
	bool                                          bNewAcceptInput;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetAcceptInput) == 0x000001, "Wrong alignment on AdvancedCamera_SetAcceptInput");
static_assert(sizeof(AdvancedCamera_SetAcceptInput) == 0x000001, "Wrong size on AdvancedCamera_SetAcceptInput");
static_assert(offsetof(AdvancedCamera_SetAcceptInput, bNewAcceptInput) == 0x000000, "Member 'AdvancedCamera_SetAcceptInput::bNewAcceptInput' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetAmbientConfigKey
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_SetAmbientConfigKey final
{
public:
	class FName                                   ConfigKey;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetAmbientConfigKey) == 0x000004, "Wrong alignment on AdvancedCamera_SetAmbientConfigKey");
static_assert(sizeof(AdvancedCamera_SetAmbientConfigKey) == 0x000008, "Wrong size on AdvancedCamera_SetAmbientConfigKey");
static_assert(offsetof(AdvancedCamera_SetAmbientConfigKey, ConfigKey) == 0x000000, "Member 'AdvancedCamera_SetAmbientConfigKey::ConfigKey' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetArmlengthLagSpeed
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_SetArmlengthLagSpeed final
{
public:
	float                                         ArmlengthLagSpeed;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetArmlengthLagSpeed) == 0x000004, "Wrong alignment on AdvancedCamera_SetArmlengthLagSpeed");
static_assert(sizeof(AdvancedCamera_SetArmlengthLagSpeed) == 0x000004, "Wrong size on AdvancedCamera_SetArmlengthLagSpeed");
static_assert(offsetof(AdvancedCamera_SetArmlengthLagSpeed, ArmlengthLagSpeed) == 0x000000, "Member 'AdvancedCamera_SetArmlengthLagSpeed::ArmlengthLagSpeed' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetCameraOrientationSynchronizer
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_SetCameraOrientationSynchronizer final
{
public:
	TSubclassOf<class UCameraOrientationSynchronizer> NewSynchronizerClass;                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetCameraOrientationSynchronizer) == 0x000008, "Wrong alignment on AdvancedCamera_SetCameraOrientationSynchronizer");
static_assert(sizeof(AdvancedCamera_SetCameraOrientationSynchronizer) == 0x000008, "Wrong size on AdvancedCamera_SetCameraOrientationSynchronizer");
static_assert(offsetof(AdvancedCamera_SetCameraOrientationSynchronizer, NewSynchronizerClass) == 0x000000, "Member 'AdvancedCamera_SetCameraOrientationSynchronizer::NewSynchronizerClass' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetCameraRotationLagSpeed
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_SetCameraRotationLagSpeed final
{
public:
	float                                         CameraRotationLagSpeed;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetCameraRotationLagSpeed) == 0x000004, "Wrong alignment on AdvancedCamera_SetCameraRotationLagSpeed");
static_assert(sizeof(AdvancedCamera_SetCameraRotationLagSpeed) == 0x000004, "Wrong size on AdvancedCamera_SetCameraRotationLagSpeed");
static_assert(offsetof(AdvancedCamera_SetCameraRotationLagSpeed, CameraRotationLagSpeed) == 0x000000, "Member 'AdvancedCamera_SetCameraRotationLagSpeed::CameraRotationLagSpeed' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetCameraWorldRotation
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_SetCameraWorldRotation final
{
public:
	struct FRotator                               NewDesireRotation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ApplyImmediate;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetCameraWorldRotation) == 0x000008, "Wrong alignment on AdvancedCamera_SetCameraWorldRotation");
static_assert(sizeof(AdvancedCamera_SetCameraWorldRotation) == 0x000020, "Wrong size on AdvancedCamera_SetCameraWorldRotation");
static_assert(offsetof(AdvancedCamera_SetCameraWorldRotation, NewDesireRotation) == 0x000000, "Member 'AdvancedCamera_SetCameraWorldRotation::NewDesireRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetCameraWorldRotation, ApplyImmediate) == 0x000018, "Member 'AdvancedCamera_SetCameraWorldRotation::ApplyImmediate' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetDesiredFOV
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_SetDesiredFOV final
{
public:
	float                                         NewDesireFov;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyImmediate;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetDesiredFOV) == 0x000004, "Wrong alignment on AdvancedCamera_SetDesiredFOV");
static_assert(sizeof(AdvancedCamera_SetDesiredFOV) == 0x000008, "Wrong size on AdvancedCamera_SetDesiredFOV");
static_assert(offsetof(AdvancedCamera_SetDesiredFOV, NewDesireFov) == 0x000000, "Member 'AdvancedCamera_SetDesiredFOV::NewDesireFov' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetDesiredFOV, ApplyImmediate) == 0x000004, "Member 'AdvancedCamera_SetDesiredFOV::ApplyImmediate' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetDesireLocation
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_SetDesireLocation final
{
public:
	struct FVector                                NewDesireLocation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyImmediate;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetDesireLocation) == 0x000008, "Wrong alignment on AdvancedCamera_SetDesireLocation");
static_assert(sizeof(AdvancedCamera_SetDesireLocation) == 0x000020, "Wrong size on AdvancedCamera_SetDesireLocation");
static_assert(offsetof(AdvancedCamera_SetDesireLocation, NewDesireLocation) == 0x000000, "Member 'AdvancedCamera_SetDesireLocation::NewDesireLocation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetDesireLocation, ApplyImmediate) == 0x000018, "Member 'AdvancedCamera_SetDesireLocation::ApplyImmediate' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetDesireRotation
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_SetDesireRotation final
{
public:
	struct FRotator                               NewDesireRotation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ApplyImmediate;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUpdateCamera;                                // 0x0019(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetDesireRotation) == 0x000008, "Wrong alignment on AdvancedCamera_SetDesireRotation");
static_assert(sizeof(AdvancedCamera_SetDesireRotation) == 0x000020, "Wrong size on AdvancedCamera_SetDesireRotation");
static_assert(offsetof(AdvancedCamera_SetDesireRotation, NewDesireRotation) == 0x000000, "Member 'AdvancedCamera_SetDesireRotation::NewDesireRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetDesireRotation, ApplyImmediate) == 0x000018, "Member 'AdvancedCamera_SetDesireRotation::ApplyImmediate' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetDesireRotation, bForceUpdateCamera) == 0x000019, "Member 'AdvancedCamera_SetDesireRotation::bForceUpdateCamera' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetDissolveEnable
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetDissolveEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetDissolveEnable) == 0x000001, "Wrong alignment on AdvancedCamera_SetDissolveEnable");
static_assert(sizeof(AdvancedCamera_SetDissolveEnable) == 0x000001, "Wrong size on AdvancedCamera_SetDissolveEnable");
static_assert(offsetof(AdvancedCamera_SetDissolveEnable, bEnable) == 0x000000, "Member 'AdvancedCamera_SetDissolveEnable::bEnable' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetEnableZoom
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetEnableZoom final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetEnableZoom) == 0x000001, "Wrong alignment on AdvancedCamera_SetEnableZoom");
static_assert(sizeof(AdvancedCamera_SetEnableZoom) == 0x000001, "Wrong size on AdvancedCamera_SetEnableZoom");
static_assert(offsetof(AdvancedCamera_SetEnableZoom, bEnable) == 0x000000, "Member 'AdvancedCamera_SetEnableZoom::bEnable' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetInterpLookAtLocationSpeedScale
// 0x0018 (0x0018 - 0x0000)
struct AdvancedCamera_SetInterpLookAtLocationSpeedScale final
{
public:
	struct FVector                                InInterpLookAtLocationSpeedScale;                  // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetInterpLookAtLocationSpeedScale) == 0x000008, "Wrong alignment on AdvancedCamera_SetInterpLookAtLocationSpeedScale");
static_assert(sizeof(AdvancedCamera_SetInterpLookAtLocationSpeedScale) == 0x000018, "Wrong size on AdvancedCamera_SetInterpLookAtLocationSpeedScale");
static_assert(offsetof(AdvancedCamera_SetInterpLookAtLocationSpeedScale, InInterpLookAtLocationSpeedScale) == 0x000000, "Member 'AdvancedCamera_SetInterpLookAtLocationSpeedScale::InInterpLookAtLocationSpeedScale' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetLockRelativeRotationToLookAtTarget
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetLockRelativeRotationToLookAtTarget final
{
public:
	bool                                          bInLock;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetLockRelativeRotationToLookAtTarget) == 0x000001, "Wrong alignment on AdvancedCamera_SetLockRelativeRotationToLookAtTarget");
static_assert(sizeof(AdvancedCamera_SetLockRelativeRotationToLookAtTarget) == 0x000001, "Wrong size on AdvancedCamera_SetLockRelativeRotationToLookAtTarget");
static_assert(offsetof(AdvancedCamera_SetLockRelativeRotationToLookAtTarget, bInLock) == 0x000000, "Member 'AdvancedCamera_SetLockRelativeRotationToLookAtTarget::bInLock' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetLookAtRotation
// 0x0020 (0x0020 - 0x0000)
struct AdvancedCamera_SetLookAtRotation final
{
public:
	struct FRotator                               NewDesireRotation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ApplyImmediate;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetLookAtRotation) == 0x000008, "Wrong alignment on AdvancedCamera_SetLookAtRotation");
static_assert(sizeof(AdvancedCamera_SetLookAtRotation) == 0x000020, "Wrong size on AdvancedCamera_SetLookAtRotation");
static_assert(offsetof(AdvancedCamera_SetLookAtRotation, NewDesireRotation) == 0x000000, "Member 'AdvancedCamera_SetLookAtRotation::NewDesireRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetLookAtRotation, ApplyImmediate) == 0x000018, "Member 'AdvancedCamera_SetLookAtRotation::ApplyImmediate' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetMaxDistanceToInterpTargetScale
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_SetMaxDistanceToInterpTargetScale final
{
public:
	float                                         InMaxDistanceToInterpTargetScale;                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetMaxDistanceToInterpTargetScale) == 0x000004, "Wrong alignment on AdvancedCamera_SetMaxDistanceToInterpTargetScale");
static_assert(sizeof(AdvancedCamera_SetMaxDistanceToInterpTargetScale) == 0x000004, "Wrong size on AdvancedCamera_SetMaxDistanceToInterpTargetScale");
static_assert(offsetof(AdvancedCamera_SetMaxDistanceToInterpTargetScale, InMaxDistanceToInterpTargetScale) == 0x000000, "Member 'AdvancedCamera_SetMaxDistanceToInterpTargetScale::InMaxDistanceToInterpTargetScale' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetNeedInterpLookAtLocation
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetNeedInterpLookAtLocation final
{
public:
	bool                                          bInNeedInterpLookAtLocation;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetNeedInterpLookAtLocation) == 0x000001, "Wrong alignment on AdvancedCamera_SetNeedInterpLookAtLocation");
static_assert(sizeof(AdvancedCamera_SetNeedInterpLookAtLocation) == 0x000001, "Wrong size on AdvancedCamera_SetNeedInterpLookAtLocation");
static_assert(offsetof(AdvancedCamera_SetNeedInterpLookAtLocation, bInNeedInterpLookAtLocation) == 0x000000, "Member 'AdvancedCamera_SetNeedInterpLookAtLocation::bInNeedInterpLookAtLocation' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetOverrideCameraRotationLagSpeed
// 0x0008 (0x0008 - 0x0000)
struct AdvancedCamera_SetOverrideCameraRotationLagSpeed final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraRotationLagSpeed;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetOverrideCameraRotationLagSpeed) == 0x000004, "Wrong alignment on AdvancedCamera_SetOverrideCameraRotationLagSpeed");
static_assert(sizeof(AdvancedCamera_SetOverrideCameraRotationLagSpeed) == 0x000008, "Wrong size on AdvancedCamera_SetOverrideCameraRotationLagSpeed");
static_assert(offsetof(AdvancedCamera_SetOverrideCameraRotationLagSpeed, bOverride) == 0x000000, "Member 'AdvancedCamera_SetOverrideCameraRotationLagSpeed::bOverride' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetOverrideCameraRotationLagSpeed, CameraRotationLagSpeed) == 0x000004, "Member 'AdvancedCamera_SetOverrideCameraRotationLagSpeed::CameraRotationLagSpeed' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetPassiveDesiredRotationBySpeed
// 0x0028 (0x0028 - 0x0000)
struct AdvancedCamera_SetPassiveDesiredRotationBySpeed final
{
public:
	struct FRotator                               NewDesireRotation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AngularSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunction;                                     // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetPassiveDesiredRotationBySpeed) == 0x000008, "Wrong alignment on AdvancedCamera_SetPassiveDesiredRotationBySpeed");
static_assert(sizeof(AdvancedCamera_SetPassiveDesiredRotationBySpeed) == 0x000028, "Wrong size on AdvancedCamera_SetPassiveDesiredRotationBySpeed");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationBySpeed, NewDesireRotation) == 0x000000, "Member 'AdvancedCamera_SetPassiveDesiredRotationBySpeed::NewDesireRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationBySpeed, AngularSpeed) == 0x000018, "Member 'AdvancedCamera_SetPassiveDesiredRotationBySpeed::AngularSpeed' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationBySpeed, BlendFunction) == 0x00001C, "Member 'AdvancedCamera_SetPassiveDesiredRotationBySpeed::BlendFunction' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationBySpeed, BlendExp) == 0x000020, "Member 'AdvancedCamera_SetPassiveDesiredRotationBySpeed::BlendExp' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetPassiveDesiredRotationByTime
// 0x0028 (0x0028 - 0x0000)
struct AdvancedCamera_SetPassiveDesiredRotationByTime final
{
public:
	struct FRotator                               NewDesireRotation;                                 // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunction;                                     // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AdvancedCamera_SetPassiveDesiredRotationByTime) == 0x000008, "Wrong alignment on AdvancedCamera_SetPassiveDesiredRotationByTime");
static_assert(sizeof(AdvancedCamera_SetPassiveDesiredRotationByTime) == 0x000028, "Wrong size on AdvancedCamera_SetPassiveDesiredRotationByTime");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationByTime, NewDesireRotation) == 0x000000, "Member 'AdvancedCamera_SetPassiveDesiredRotationByTime::NewDesireRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationByTime, TotalTime) == 0x000018, "Member 'AdvancedCamera_SetPassiveDesiredRotationByTime::TotalTime' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationByTime, BlendFunction) == 0x00001C, "Member 'AdvancedCamera_SetPassiveDesiredRotationByTime::BlendFunction' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_SetPassiveDesiredRotationByTime, BlendExp) == 0x000020, "Member 'AdvancedCamera_SetPassiveDesiredRotationByTime::BlendExp' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetUsingGamepad
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_SetUsingGamepad final
{
public:
	bool                                          bInUsingGamepad;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetUsingGamepad) == 0x000001, "Wrong alignment on AdvancedCamera_SetUsingGamepad");
static_assert(sizeof(AdvancedCamera_SetUsingGamepad) == 0x000001, "Wrong size on AdvancedCamera_SetUsingGamepad");
static_assert(offsetof(AdvancedCamera_SetUsingGamepad, bInUsingGamepad) == 0x000000, "Member 'AdvancedCamera_SetUsingGamepad::bInUsingGamepad' has a wrong offset!");

// Function X6Camera.AdvancedCamera.SetZoomedTargetOffsetZAdjustment
// 0x0004 (0x0004 - 0x0000)
struct AdvancedCamera_SetZoomedTargetOffsetZAdjustment final
{
public:
	float                                         NewZoomedTargetOffsetZAdjustment;                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_SetZoomedTargetOffsetZAdjustment) == 0x000004, "Wrong alignment on AdvancedCamera_SetZoomedTargetOffsetZAdjustment");
static_assert(sizeof(AdvancedCamera_SetZoomedTargetOffsetZAdjustment) == 0x000004, "Wrong size on AdvancedCamera_SetZoomedTargetOffsetZAdjustment");
static_assert(offsetof(AdvancedCamera_SetZoomedTargetOffsetZAdjustment, NewZoomedTargetOffsetZAdjustment) == 0x000000, "Member 'AdvancedCamera_SetZoomedTargetOffsetZAdjustment::NewZoomedTargetOffsetZAdjustment' has a wrong offset!");

// Function X6Camera.AdvancedCamera.TransformVectorByRotation
// 0x0048 (0x0048 - 0x0000)
struct AdvancedCamera_TransformVectorByRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                TransformVector;                                   // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_TransformVectorByRotation) == 0x000008, "Wrong alignment on AdvancedCamera_TransformVectorByRotation");
static_assert(sizeof(AdvancedCamera_TransformVectorByRotation) == 0x000048, "Wrong size on AdvancedCamera_TransformVectorByRotation");
static_assert(offsetof(AdvancedCamera_TransformVectorByRotation, InRotation) == 0x000000, "Member 'AdvancedCamera_TransformVectorByRotation::InRotation' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_TransformVectorByRotation, TransformVector) == 0x000018, "Member 'AdvancedCamera_TransformVectorByRotation::TransformVector' has a wrong offset!");
static_assert(offsetof(AdvancedCamera_TransformVectorByRotation, ReturnValue) == 0x000030, "Member 'AdvancedCamera_TransformVectorByRotation::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.TryToUpdateBasedMovementHelper
// 0x0001 (0x0001 - 0x0000)
struct AdvancedCamera_TryToUpdateBasedMovementHelper final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AdvancedCamera_TryToUpdateBasedMovementHelper) == 0x000001, "Wrong alignment on AdvancedCamera_TryToUpdateBasedMovementHelper");
static_assert(sizeof(AdvancedCamera_TryToUpdateBasedMovementHelper) == 0x000001, "Wrong size on AdvancedCamera_TryToUpdateBasedMovementHelper");
static_assert(offsetof(AdvancedCamera_TryToUpdateBasedMovementHelper, ReturnValue) == 0x000000, "Member 'AdvancedCamera_TryToUpdateBasedMovementHelper::ReturnValue' has a wrong offset!");

// Function X6Camera.AdvancedCamera.UpdateBasedMovementHelper
// 0x01A0 (0x01A0 - 0x0000)
struct AdvancedCamera_UpdateBasedMovementHelper final
{
public:
	const class UCharacterMovementComponent*      MovementComponent;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastBaseTransform;                                 // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
