#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Camera

#include "Basic.hpp"

#include "X6Camera_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class X6Camera.X6BaseCameraComponent
// 0x0010 (0x0B50 - 0x0B40)
#pragma pack(push, 0x1)
class alignas(0x10) UX6BaseCameraComponent : public UCameraComponent
{
public:
	ECameraState                                  CameraMode;                                        // 0x0B40(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B41[0x7];                                      // 0x0B41(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorSetViewTarget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6BaseCameraComponent">();
	}
	static class UX6BaseCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6BaseCameraComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UX6BaseCameraComponent) == 0x000010, "Wrong alignment on UX6BaseCameraComponent");
static_assert(sizeof(UX6BaseCameraComponent) == 0x000B50, "Wrong size on UX6BaseCameraComponent");
static_assert(offsetof(UX6BaseCameraComponent, CameraMode) == 0x000B40, "Member 'UX6BaseCameraComponent::CameraMode' has a wrong offset!");

// Class X6Camera.AdvancedCamera
// 0x21C0 (0x2D10 - 0x0B50)
class UAdvancedCamera : public UX6BaseCameraComponent
{
public:
	bool                                          bRewriteFromSetting;                               // 0x0B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraBaseParamsData*                  CameraDataBase;                                    // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6CameraConfigManager*                 CameraConfigManager;                               // 0x0B58(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UX6CameraRuntimeConfigModifier*> CameraConfigModifierList;                          // 0x0B60(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_B70[0x604];                                    // 0x0B70(0x0604)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AX6PlayerCameraManagerBase> OwnerPlayerCameraManager;                       // 0x1174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAcceptInput;                                      // 0x117C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_117D[0x3];                                     // 0x117D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputXRotateSpeedFactor;                           // 0x1180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputYRotateSpeedFactor;                           // 0x1184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               BirthRotation;                                     // 0x1188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OriginRotation;                                    // 0x11A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxPitchAngle;                                     // 0x11B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPitchAngle;                                     // 0x11BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxYawAngle;                                       // 0x11C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinYawAngle;                                       // 0x11C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      DefaultBlendFunction;                              // 0x11C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C9[0x7];                                     // 0x11C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FX6CameraZoomProcessor                 ZoomProcessor;                                     // 0x11D0(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCameraInputOptimizationConfig> CameraInputOptimizationConfigs;                    // 0x1378(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                InputVectorCache;                                  // 0x1388(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputVectorSize;                                   // 0x13A0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13A4[0x4];                                     // 0x13A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InputDeltaRotation;                                // 0x13A8(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHaveInputData;                                    // 0x13C0(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C1[0x7F];                                    // 0x13C1(0x007F)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsLookAt;                                         // 0x1440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1441[0x3];                                     // 0x1441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetArmLength;                                   // 0x1444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableInterpLookAtLocation;                       // 0x1448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1449[0x7];                                     // 0x1449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InterpLocationSpeed;                               // 0x1450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InterpLookAtLocationSpeed;                         // 0x1468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpLookAtLocationMaxDistanceToTarget;           // 0x1480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1484[0x4];                                     // 0x1484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviousActualArmLength;                           // 0x1488(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148C[0x4];                                     // 0x148C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxArmLength;                                      // 0x1490(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinArmLength;                                      // 0x1494(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetArmLengthModifier;                           // 0x1498(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149C[0x4];                                     // 0x149C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableInfluenceOffsetByPitch;                     // 0x14A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A1[0x7];                                     // 0x14A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           OffsetCurveByPitch;                                // 0x14A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SocketOffset;                                      // 0x14B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SocketOffsetModifier;                              // 0x14C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               SocketRotationOffset;                              // 0x14E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14F8[0xB0];                                    // 0x14F8(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetOffset;                                      // 0x15A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetOffsetModifier;                              // 0x15C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x15D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOVModifier;                                       // 0x15DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FixedSpringArmByPitch;                             // 0x15E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15E1[0x7];                                     // 0x15E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            FixedSpringArmByPitchCurveAsset;                   // 0x15E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoCollisionTest;                                  // 0x15F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15F1[0x3];                                     // 0x15F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProbeSize;                                         // 0x15F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraCollisionProcess>    CameraCollisionProcessClass;                       // 0x15F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraCollisionProcess*                CameraCollisionProcess;                            // 0x1600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoLocationLag;                                    // 0x1608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoRotationLag;                                    // 0x1609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoTargetArmlengthLag;                             // 0x160A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160B[0x5];                                     // 0x160B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraLagProcess>          CameraLagProcessClass;                             // 0x1610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraLagProcess*                      CameraLagProcess;                                  // 0x1618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NormalConfigKey;                                   // 0x1620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1628[0x18];                                    // 0x1628(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               PreviousDesiredSpringArmRot;                       // 0x1640(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1658[0xA0];                                    // 0x1658(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSpecifiedTargetView;                              // 0x16F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpecifiedTargetViewBlending;                      // 0x16F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16FA[0x6];                                     // 0x16FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            BlendParams;                                       // 0x1700(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       SpecifiedTargetBeginBlendViewInfo;                 // 0x1720(0x0970)(NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       SpecifiedTargetViewInfo;                           // 0x2090(0x0970)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         SpecifiedTargetTime;                               // 0x2A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideArmlength;                                // 0x2A04(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A05[0x3];                                     // 0x2A05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideArmlengthValue;                            // 0x2A08(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockRelativeRotationToLookAtTarget;               // 0x2A0C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0D[0x24];                                    // 0x2A0D(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlueprintDevelopment;                             // 0x2A31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A32[0x46];                                    // 0x2A32(0x0046)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DebugSumInputVector;                               // 0x2A78(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DebugSumFinalInputVector;                          // 0x2A90(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AA8[0xA8];                                    // 0x2AA8(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnX6CameraRuntimeConfigChanged;                    // 0x2B50(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector                                InterpLookAtLocationSpeedScale;                    // 0x2B60(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceToInterpTargetScale;                    // 0x2B78(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedInterpLookAtLocation;                         // 0x2B7C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B7D[0x3];                                     // 0x2B7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LookAtTarget;                                      // 0x2B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, int32>              CameraConfigPrioritySet;                           // 0x2B88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, int32>              BaseCameraConfigPrioritySet;                       // 0x2BD8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C28[0x18];                                    // 0x2C28(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraOrientationSynchronizer> CameraOrientationSynchronizerClass;            // 0x2C40(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraOrientationSynchronizer> BlueprintSetDefaultSynchronizerClass;          // 0x2C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C50[0x28];                                    // 0x2C50(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraOrientationSynchronizer*         CameraOrientationSynchronizer;                     // 0x2C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C80[0x10];                                    // 0x2C80(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableBasedMovementFix;                           // 0x2C90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C91[0xF];                                     // 0x2C91(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBasedMovementFixCameraHelper          BasedMovementHelper;                               // 0x2CA0(0x0070)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	class UX6CameraRuntimeConfigModifier* AddCameraConfigModifierByClass(const TSubclassOf<class UX6CameraRuntimeConfigModifier> ModifierClass, const struct FX6CameraConfigBlendParams& CameraConfigBlendParams);
	void BlendBackToFollow(const struct FViewTargetTransitionParams& CameraBlendParams);
	void BlendConfigFromCurrentCameraView(const bool bOverrideTransitionParams, const struct FViewTargetTransitionParams& TransitionParams);
	void BlendToCameraView(const struct FMinimalViewInfo& NewCameraView, const struct FViewTargetTransitionParams& CameraBlendParams);
	void CreateCameraCollisionProcessInstance(TSubclassOf<class UCameraCollisionProcess> NewCameraCollisionProcessClass);
	void CreateCameraLagInstance(TSubclassOf<class UCameraLagProcess> NewCameraLagProcessClass);
	void DoFixCameraByBasedMovement(const struct FBasedMovementFixCameraHelper& Helper);
	float ExitZoom(const float BlendOutTime);
	bool FindMostOpenSpaceRotation(const struct FTransform& RelativeTrans, struct FRotator* OutDeltaRot);
	class UX6CameraRuntimeConfigModifier* FindOrAddCameraConfigModifier(class UX6CameraRuntimeConfigModifier* NewModifier, const struct FX6CameraConfigBlendParams& CameraConfigBlendParams);
	void FixCameraByBasedMovement();
	float GetArmlengthLagSpeed(float ArmlengthLagSpeed);
	struct FRotator GetCameraRotation();
	float GetCameraRotationLagSpeed();
	void OnLookAtTargetBecomeViewTargetEvent();
	void OnLookAtTargetEndViewTargetEvent();
	void OnOwnerBecomeViewTargetEvent();
	void OnOwnerEndViewTargetEvent();
	void OnOwnerFullyBlendInViewTargetEvent();
	void OnOwnerFullyBlendOutViewTargetEvent();
	void OnRotateInput(const struct FVector& InputVector, float ElapsedTime);
	void OnZoomInput(const float InputValue);
	int32 PushBaseCameraConfig(class FName ConfigKey);
	int32 PushBaseParams(const struct FCameraBaseParamsDefine& BaseParams, const struct FX6CameraConfigBlendParams& CameraConfigBlendParams, const struct FX6CameraConfigPriority& Priority);
	int32 PushCameraConfig(class UCameraBaseParamsData* TargetCameraDataBase, class FName TargetConfigKey, bool bOverrideTransitionParams, const struct FViewTargetTransitionParams& TransitionParams);
	int32 PushCameraConfigOfCameraDataBase(const class FName& TargetConfigKey, const struct FX6CameraConfigBlendParams& CameraConfigBlendParams);
	void RecalculateCameraTransformIgnoreLag();
	void ReceiveUpdateLookAtTarget(const class AActor* OldLookAtTarget, const class AActor* NewLookAtTarget);
	void RemoveBaseCameraConfigByIndex(int32 Index_0, bool bOverrideTransitionParams, const struct FViewTargetTransitionParams& TransitionParams);
	void RemoveCameraConfigByIndex(int32 Index_0, bool bOverrideTransitionParams, const struct FViewTargetTransitionParams& TransitionParams);
	void RemoveCameraConfigModifier(class UX6CameraRuntimeConfigModifier* Modifier, const struct FX6CameraConfigBlendParams& CameraConfigBlendParams);
	void ResetData();
	void ResetToDefaultRelativeRotation(bool bApplyImmediate, const bool bForceUpdateCamera);
	void SetAcceptInput(bool bNewAcceptInput);
	void SetAmbientConfigKey(class FName ConfigKey);
	void SetArmlengthLagSpeed(float ArmlengthLagSpeed);
	void SetCameraOrientationSynchronizer(TSubclassOf<class UCameraOrientationSynchronizer> NewSynchronizerClass);
	void SetCameraRotationLagSpeed(float CameraRotationLagSpeed);
	void SetCameraWorldRotation(const struct FRotator& NewDesireRotation, bool ApplyImmediate);
	void SetDesiredFOV(float NewDesireFov, bool ApplyImmediate);
	void SetDesireLocation(const struct FVector& NewDesireLocation, bool ApplyImmediate);
	void SetDesireRotation(const struct FRotator& NewDesireRotation, bool ApplyImmediate, const bool bForceUpdateCamera);
	void SetDissolveEnable(bool bEnable);
	void SetEnableZoom(bool bEnable);
	void SetInterpLookAtLocationSpeedScale(const struct FVector& InInterpLookAtLocationSpeedScale);
	void SetLockRelativeRotationToLookAtTarget(bool bInLock);
	void SetLookAtRotation(const struct FRotator& NewDesireRotation, bool ApplyImmediate);
	void SetMaxDistanceToInterpTargetScale(float InMaxDistanceToInterpTargetScale);
	void SetNeedInterpLookAtLocation(bool bInNeedInterpLookAtLocation);
	void SetOverrideCameraRotationLagSpeed(bool bOverride, float CameraRotationLagSpeed);
	void SetPassiveDesiredRotationBySpeed(const struct FRotator& NewDesireRotation, float AngularSpeed, EViewTargetBlendFunction BlendFunction, float BlendExp);
	void SetPassiveDesiredRotationByTime(const struct FRotator& NewDesireRotation, float TotalTime, EViewTargetBlendFunction BlendFunction, float BlendExp);
	void SetUsingGamepad(bool bInUsingGamepad);
	void SetZoomedTargetOffsetZAdjustment(const float NewZoomedTargetOffsetZAdjustment);
	void StartAutoZoomOutCountDown();
	struct FVector TransformVectorByRotation(const struct FRotator& InRotation, const struct FVector& TransformVector);
	void TriggerAutoZoomOut();
	bool TryToUpdateBasedMovementHelper();
	bool UpdateBasedMovementHelper(const class UCharacterMovementComponent* MovementComponent, const struct FTransform& LastBaseTransform, const struct FTransform& CurrentBaseTransform, const struct FTransform& LastActorTransform, const struct FTransform& CurrentActorTransform);
	void UpdateCameraConfig(const float DeltaTime);
	void UpdateDesiredArmLocation(bool bDoTrace, float DeltaTime, bool bRotationLag, bool bLocationLag, bool bTargetArmlengthLag);
	void UpdateDesiredArmLocationFunction(bool bDoTrace, float DeltaTime, bool bRotationLag, bool bLocationLag, bool bTargetArmlengthLag);
	void UpdatePassiveRotate(struct FRotator* DesiredRot, float DeltaTime);

	void CollectInputDebugOutput(TArray<class FString>* InOutDebugInfoLines) const;
	void CollectLookAtTargetDebugOutput(TArray<class FString>* InOutDebugInfoLines) const;
	void CollectSpringArmDebugOutput(TArray<class FString>* InOutDebugInfoLines) const;
	struct FVector FixLocationByBasedMovement(const struct FBasedMovementFixCameraHelper& Helper, const struct FVector& InLocation) const;
	struct FRotator FixRotationByBasedMovement(const struct FBasedMovementFixCameraHelper& Helper, const struct FRotator& InRotation) const;
	float GetCameraArmlength() const;
	class FName GetCameraConfigkey() const;
	class UCameraOrientationSynchronizer* GetCameraOrientationSynchronizer() const;
	const struct FX6CameraBlendableSettings GetCameraSettings() const;
	struct FRotator GetCurrentSocketRotationOffset() const;
	float GetDesiredFOV() const;
	struct FVector GetDesiredLocation() const;
	struct FRotator GetDesiredRotation() const;
	class AActor* GetLookAtTarget() const;
	struct FVector GetPreviousArmOriginLocation() const;
	bool IsZoomedIn() const;
	void SetEnableRotationPitchSync(const bool bEnable) const;
	void SetEnableRotationYawSync(const bool bEnable) const;
	void SetOrientationSyncCanResetPitch(const bool bInEnabled) const;
	void StartResetRotation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdvancedCamera">();
	}
	static class UAdvancedCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdvancedCamera>();
	}
};
static_assert(alignof(UAdvancedCamera) == 0x000010, "Wrong alignment on UAdvancedCamera");
static_assert(sizeof(UAdvancedCamera) == 0x002D10, "Wrong size on UAdvancedCamera");
static_assert(offsetof(UAdvancedCamera, bRewriteFromSetting) == 0x000B48, "Member 'UAdvancedCamera::bRewriteFromSetting' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraDataBase) == 0x000B50, "Member 'UAdvancedCamera::CameraDataBase' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraConfigManager) == 0x000B58, "Member 'UAdvancedCamera::CameraConfigManager' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraConfigModifierList) == 0x000B60, "Member 'UAdvancedCamera::CameraConfigModifierList' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, OwnerPlayerCameraManager) == 0x001174, "Member 'UAdvancedCamera::OwnerPlayerCameraManager' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bAcceptInput) == 0x00117C, "Member 'UAdvancedCamera::bAcceptInput' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InputXRotateSpeedFactor) == 0x001180, "Member 'UAdvancedCamera::InputXRotateSpeedFactor' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InputYRotateSpeedFactor) == 0x001184, "Member 'UAdvancedCamera::InputYRotateSpeedFactor' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, BirthRotation) == 0x001188, "Member 'UAdvancedCamera::BirthRotation' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, OriginRotation) == 0x0011A0, "Member 'UAdvancedCamera::OriginRotation' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MaxPitchAngle) == 0x0011B8, "Member 'UAdvancedCamera::MaxPitchAngle' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MinPitchAngle) == 0x0011BC, "Member 'UAdvancedCamera::MinPitchAngle' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MaxYawAngle) == 0x0011C0, "Member 'UAdvancedCamera::MaxYawAngle' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MinYawAngle) == 0x0011C4, "Member 'UAdvancedCamera::MinYawAngle' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, DefaultBlendFunction) == 0x0011C8, "Member 'UAdvancedCamera::DefaultBlendFunction' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, ZoomProcessor) == 0x0011D0, "Member 'UAdvancedCamera::ZoomProcessor' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraInputOptimizationConfigs) == 0x001378, "Member 'UAdvancedCamera::CameraInputOptimizationConfigs' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InputVectorCache) == 0x001388, "Member 'UAdvancedCamera::InputVectorCache' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InputVectorSize) == 0x0013A0, "Member 'UAdvancedCamera::InputVectorSize' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InputDeltaRotation) == 0x0013A8, "Member 'UAdvancedCamera::InputDeltaRotation' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bHaveInputData) == 0x0013C0, "Member 'UAdvancedCamera::bHaveInputData' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bIsLookAt) == 0x001440, "Member 'UAdvancedCamera::bIsLookAt' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, TargetArmLength) == 0x001444, "Member 'UAdvancedCamera::TargetArmLength' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bEnableInterpLookAtLocation) == 0x001448, "Member 'UAdvancedCamera::bEnableInterpLookAtLocation' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InterpLocationSpeed) == 0x001450, "Member 'UAdvancedCamera::InterpLocationSpeed' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InterpLookAtLocationSpeed) == 0x001468, "Member 'UAdvancedCamera::InterpLookAtLocationSpeed' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InterpLookAtLocationMaxDistanceToTarget) == 0x001480, "Member 'UAdvancedCamera::InterpLookAtLocationMaxDistanceToTarget' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, PreviousActualArmLength) == 0x001488, "Member 'UAdvancedCamera::PreviousActualArmLength' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MaxArmLength) == 0x001490, "Member 'UAdvancedCamera::MaxArmLength' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MinArmLength) == 0x001494, "Member 'UAdvancedCamera::MinArmLength' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, TargetArmLengthModifier) == 0x001498, "Member 'UAdvancedCamera::TargetArmLengthModifier' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bEnableInfluenceOffsetByPitch) == 0x0014A0, "Member 'UAdvancedCamera::bEnableInfluenceOffsetByPitch' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, OffsetCurveByPitch) == 0x0014A8, "Member 'UAdvancedCamera::OffsetCurveByPitch' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SocketOffset) == 0x0014B0, "Member 'UAdvancedCamera::SocketOffset' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SocketOffsetModifier) == 0x0014C8, "Member 'UAdvancedCamera::SocketOffsetModifier' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SocketRotationOffset) == 0x0014E0, "Member 'UAdvancedCamera::SocketRotationOffset' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, TargetOffset) == 0x0015A8, "Member 'UAdvancedCamera::TargetOffset' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, TargetOffsetModifier) == 0x0015C0, "Member 'UAdvancedCamera::TargetOffsetModifier' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, FOV) == 0x0015D8, "Member 'UAdvancedCamera::FOV' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, FOVModifier) == 0x0015DC, "Member 'UAdvancedCamera::FOVModifier' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, FixedSpringArmByPitch) == 0x0015E0, "Member 'UAdvancedCamera::FixedSpringArmByPitch' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, FixedSpringArmByPitchCurveAsset) == 0x0015E8, "Member 'UAdvancedCamera::FixedSpringArmByPitchCurveAsset' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bDoCollisionTest) == 0x0015F0, "Member 'UAdvancedCamera::bDoCollisionTest' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, ProbeSize) == 0x0015F4, "Member 'UAdvancedCamera::ProbeSize' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraCollisionProcessClass) == 0x0015F8, "Member 'UAdvancedCamera::CameraCollisionProcessClass' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraCollisionProcess) == 0x001600, "Member 'UAdvancedCamera::CameraCollisionProcess' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bDoLocationLag) == 0x001608, "Member 'UAdvancedCamera::bDoLocationLag' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bDoRotationLag) == 0x001609, "Member 'UAdvancedCamera::bDoRotationLag' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bDoTargetArmlengthLag) == 0x00160A, "Member 'UAdvancedCamera::bDoTargetArmlengthLag' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraLagProcessClass) == 0x001610, "Member 'UAdvancedCamera::CameraLagProcessClass' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraLagProcess) == 0x001618, "Member 'UAdvancedCamera::CameraLagProcess' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, NormalConfigKey) == 0x001620, "Member 'UAdvancedCamera::NormalConfigKey' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, PreviousDesiredSpringArmRot) == 0x001640, "Member 'UAdvancedCamera::PreviousDesiredSpringArmRot' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bSpecifiedTargetView) == 0x0016F8, "Member 'UAdvancedCamera::bSpecifiedTargetView' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bSpecifiedTargetViewBlending) == 0x0016F9, "Member 'UAdvancedCamera::bSpecifiedTargetViewBlending' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, BlendParams) == 0x001700, "Member 'UAdvancedCamera::BlendParams' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SpecifiedTargetBeginBlendViewInfo) == 0x001720, "Member 'UAdvancedCamera::SpecifiedTargetBeginBlendViewInfo' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SpecifiedTargetViewInfo) == 0x002090, "Member 'UAdvancedCamera::SpecifiedTargetViewInfo' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, SpecifiedTargetTime) == 0x002A00, "Member 'UAdvancedCamera::SpecifiedTargetTime' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bOverrideArmlength) == 0x002A04, "Member 'UAdvancedCamera::bOverrideArmlength' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, OverrideArmlengthValue) == 0x002A08, "Member 'UAdvancedCamera::OverrideArmlengthValue' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bLockRelativeRotationToLookAtTarget) == 0x002A0C, "Member 'UAdvancedCamera::bLockRelativeRotationToLookAtTarget' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bBlueprintDevelopment) == 0x002A31, "Member 'UAdvancedCamera::bBlueprintDevelopment' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, DebugSumInputVector) == 0x002A78, "Member 'UAdvancedCamera::DebugSumInputVector' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, DebugSumFinalInputVector) == 0x002A90, "Member 'UAdvancedCamera::DebugSumFinalInputVector' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, OnX6CameraRuntimeConfigChanged) == 0x002B50, "Member 'UAdvancedCamera::OnX6CameraRuntimeConfigChanged' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, InterpLookAtLocationSpeedScale) == 0x002B60, "Member 'UAdvancedCamera::InterpLookAtLocationSpeedScale' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, MaxDistanceToInterpTargetScale) == 0x002B78, "Member 'UAdvancedCamera::MaxDistanceToInterpTargetScale' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bNeedInterpLookAtLocation) == 0x002B7C, "Member 'UAdvancedCamera::bNeedInterpLookAtLocation' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, LookAtTarget) == 0x002B80, "Member 'UAdvancedCamera::LookAtTarget' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraConfigPrioritySet) == 0x002B88, "Member 'UAdvancedCamera::CameraConfigPrioritySet' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, BaseCameraConfigPrioritySet) == 0x002BD8, "Member 'UAdvancedCamera::BaseCameraConfigPrioritySet' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraOrientationSynchronizerClass) == 0x002C40, "Member 'UAdvancedCamera::CameraOrientationSynchronizerClass' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, BlueprintSetDefaultSynchronizerClass) == 0x002C48, "Member 'UAdvancedCamera::BlueprintSetDefaultSynchronizerClass' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, CameraOrientationSynchronizer) == 0x002C78, "Member 'UAdvancedCamera::CameraOrientationSynchronizer' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, bEnableBasedMovementFix) == 0x002C90, "Member 'UAdvancedCamera::bEnableBasedMovementFix' has a wrong offset!");
static_assert(offsetof(UAdvancedCamera, BasedMovementHelper) == 0x002CA0, "Member 'UAdvancedCamera::BasedMovementHelper' has a wrong offset!");

// Class X6Camera.AdvancedCameraBPFLibrary
// 0x0000 (0x0028 - 0x0028)
class UAdvancedCameraBPFLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetOverriddenCameraBaseParams(const struct FCameraBaseParamsDefine& Origin, const struct FCameraBaseParamsDefine& Override, struct FCameraBaseParamsDefine* OutOverridden);
	static void GetOverriddenCameraInputConfig(const struct FX6CameraInputConfig& Origin, const struct FX6CameraInputConfig& Override, struct FX6CameraInputConfig* OutOverridden);
	static struct FVector3f VectorSpringInterp(const struct FVector3f& Current, const struct FVector3f& Target, struct FVectorSpringStateInfo& SpringState, float Stiffness, float CriticalDamping, float DeltaTime, float Mass, float TargetVelocityAmount, bool bClamp, const struct FVector3f& MinValue, const struct FVector3f& MaxValue, bool bInitializeFromTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdvancedCameraBPFLibrary">();
	}
	static class UAdvancedCameraBPFLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdvancedCameraBPFLibrary>();
	}
};
static_assert(alignof(UAdvancedCameraBPFLibrary) == 0x000008, "Wrong alignment on UAdvancedCameraBPFLibrary");
static_assert(sizeof(UAdvancedCameraBPFLibrary) == 0x000028, "Wrong size on UAdvancedCameraBPFLibrary");

// Class X6Camera.X6PlayerCameraManagerBase
// 0x46C0 (0x7280 - 0x2BC0)
class AX6PlayerCameraManagerBase : public APlayerCameraManager
{
public:
	bool                                          bBlendignNewCameraView;                            // 0x2BB8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BB9[0x1F];                                    // 0x2BB9(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	ECameraBlendPathType                          CameraBlendType;                                   // 0x2BD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BD9[0x7];                                     // 0x2BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       CacheCameraView;                                   // 0x2BE0(0x0970)(Transient, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       BeginBlendCameraView;                              // 0x3550(0x0970)(Transient, NativeAccessSpecifierPublic)
	struct FTransCameraViewData                   NewCameraViewData;                                 // 0x3EC0(0x0990)(Transient, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       CachePOV;                                          // 0x4850(0x0970)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTViewTarget                           LastBlendCompleteTarget;                           // 0x51C0(0x0990)(Transient, NativeAccessSpecifierPublic)
	struct FViewTargetCurveTransitionParams       CurveTransitionParams;                             // 0x5B50(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBlendBackToViewTargetFromCameraView;              // 0x5B70(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B71[0x7];                                     // 0x5B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraSpringArmPathBlend              SpringArmPathBlend;                                // 0x5B78(0x0070)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSplineCurves                          SplineCurves;                                      // 0x5BE8(0x0070)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        BezierPoints;                                      // 0x5C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C68[0x28];                                    // 0x5C68(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULegacyCameraShake>         CustomizeCameraShake;                              // 0x5C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C98[0x18];                                    // 0x5C98(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* NewViewTarget)> OnNewTargetBlendEndEvent;            // 0x5CB0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* NewViewTarget)> OnNewTargetBlendBeginEvent;          // 0x5CC0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* OldViewTarget, class AActor* NewViewTarget)> OnTargetBlendCompleteEvent; // 0x5CD0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool YawValue, bool PitchValue)> OnCameraPitchYawSyncSettingValueChanged; // 0x5CE0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FCameraStateViewTagetData>      CameraStates;                                      // 0x5CF0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName VFXType, float Value)> OnCameraVFXValueChangedEvent;   // 0x5D00(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D10[0x8];                                     // 0x5D10(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCameraModifiersDetailData*, struct FCameraModifierList> ModifierMap;                 // 0x5D18(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UCameraTaskExecuter*>            TaskExecuters;                                     // 0x5D68(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D78[0x2A];                                    // 0x5D78(0x002A)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowInputDuringBlend;                            // 0x5DA2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DA3[0x5];                                     // 0x5DA3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FX6CameraZoomCommonSettings            ZoomCommonSettings;                                // 0x5DA8(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bZoomLimitReached)> OnCameraZoomInLimitReached;               // 0x5E28(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E38[0x8];                                     // 0x5E38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TransitionKey;                                     // 0x5E40(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastTransitionKey;                                 // 0x5E50(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                 TargetCameraStateObject;                           // 0x5E60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             CameraStateTransition;                             // 0x5E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraState                                  CameraState;                                       // 0x5E70(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               BlendingCollisionTraceType;                        // 0x5E71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E72[0x6];                                     // 0x5E72(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EX6CameraInputDeviceType, struct FVector2D> InputAxisScaleMap;                              // 0x5E78(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             CameraConfigPriorityDataTable;                     // 0x5EC8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FString, EX6CameraPlatformType>    X6CameraPlatformKeywordTypeMap;                    // 0x5ED0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bCameraIsBlending;                                 // 0x5F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F21[0x3F];                                    // 0x5F21(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraCacheEntry                      CameraCachePublic;                                 // 0x5F60(0x0980)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_68E0[0x9A0];                                   // 0x68E0(0x09A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCameraModifierToCustomList(class UCameraModifiersDetailData* CameraModifierDataAsset);
	void BezierCurvePathBlend(const struct FVector& BeginPoint, const struct FVector& EndPoint, const struct FVector& Direction, float ControlPointVerticalLineDistance, float ExtremePointAlphy, int32 PointFrequency, bool DrawDebug);
	void BlendBackToFollow(const struct FViewTargetTransitionParams& TransitionParams);
	void BlendBackToViewTarget(const struct FViewTargetTransitionParams& TransitionParams);
	void BlendToNewViewInfo(const struct FMinimalViewInfo& NewInfo, const struct FViewTargetTransitionParams& TransitionParams);
	float ExitCameraZoom(const float BlendOutTime);
	void GenCustomCurve_Parabola(const struct FVector& StartPoint, const struct FVector& EndPoint, const struct FVector& ControllPoint, bool bTracePath, float ProjectileRadius, float SimFrequency, float MaxSimTime, TArray<struct FVector>* OutPathPositions, TArray<struct FVector>* OutPathVelocitys);
	void GenSecondOrderBezierCurve(const struct FVector& BeginPoint, const struct FVector& EndPoint, const struct FVector& InfluencePoint, int32 PointFrequency, bool DrawDebug);
	bool GenThirdOrderBezierCurve(const struct FVector& BeginPoint, const struct FVector& EndPoint, const struct FVector& InfluencePointA, const struct FVector& InfluencePointB, int32 PointFrequency, bool DrawDebug);
	void OnCameraRotateInput(const struct FVector& InputVector, const float ElapsedTime, const EX6CameraInputDeviceType InputDeviceType);
	void OnCameraZoomInput(const float InputValue, const EX6CameraInputDeviceType InputDeviceType);
	void PopCameraState();
	void PostChangeCameraStates();
	void PushCameraState(struct FCameraStateViewTagetData* InCameraState);
	void RemoveCameraModifierFromCustomList(class UCameraModifiersDetailData* CameraModifierDataAsset);
	void RemoveCameraStateByIndex(const int32 IndexToRemove, const bool bAllowShrinking);
	void SetCameraDrawDebug(bool bEnable, float DrawDebugTime);
	void SetCameraViewPointWithBlend(const struct FMinimalViewInfo& ViewInfo, const struct FViewTargetTransitionParams& TransitionParams);
	void SetEnableRotateInput(const bool bEnable);
	void SetEnableZoomInput(const bool bEnable);
	void SetPitchSyncSettingValue(bool PitchValue);
	void SetViewTargetBezierCurve(class AActor* Target, const struct FViewTargetTransitionParams& TransitionParams, const struct FVector& Direction, float ControlPointVerticalLineDistance, float ExtremePointAlphy, int32 PointFrequency);
	bool SetViewTargetWithParabolaPath(class AActor* Target, const struct FViewTargetCurveTransitionParams& TransitionParams, float FrontViewAngleScope, float MinHeight, float MaxHeight, float SimFrequency, bool HeightTakePrecedence, bool bErgodicFromMiddle);
	void SetX6CameraInputDeviceType(const EX6CameraInputDeviceType InputDeviceType);
	void SetYawSyncSettingValue(bool YawValue);
	void SortCameraStatesByPriority(const bool bDescendOrder);
	class UCameraShakeBase* StartCustomizeCameraShake(float Duration, float BlendInTime, float BlendOutTime, const struct FROscillator& ROscillator, const struct FVOscillator& VOscillator, const struct FFOscillator& Oscillator);
	bool SwitchCameraState(const class FString& ConfigKey, class UObject* TargetObject);
	bool SwitchToLastCameraState(class AActor* NewTarget);

	struct FTViewTarget GetCameraPendingViewTarget() const;
	struct FTViewTarget GetCameraViewTarget() const;
	bool GetEnableRotateInput() const;
	bool GetEnableZoomInput() const;
	struct FVector GetLastCameraLocation() const;
	struct FRotator GetLastCameraRotation() const;
	struct FVector GetPlayerInputForwardVector() const;
	struct FVector GetPlayerInputRightVector() const;
	EX6CameraInputDeviceType GetX6CameraInputDeviceType() const;
	EX6CameraPlatformType GetX6CameraPlatformType() const;
	bool IsCameraZoomedIn() const;
	const struct FCameraStateViewTagetData K2_GetCameraStateData(int32 Index_0) const;
	int32 K2_GetCameraStateNum() const;
	ECameraState K2_TopCameraState() const;
	const struct FCameraStateViewTagetData K2_TopCameraStateData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6PlayerCameraManagerBase">();
	}
	static class AX6PlayerCameraManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AX6PlayerCameraManagerBase>();
	}
};
static_assert(alignof(AX6PlayerCameraManagerBase) == 0x000010, "Wrong alignment on AX6PlayerCameraManagerBase");
static_assert(sizeof(AX6PlayerCameraManagerBase) == 0x007280, "Wrong size on AX6PlayerCameraManagerBase");
static_assert(offsetof(AX6PlayerCameraManagerBase, bBlendignNewCameraView) == 0x002BB8, "Member 'AX6PlayerCameraManagerBase::bBlendignNewCameraView' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, CameraBlendType) == 0x002BD8, "Member 'AX6PlayerCameraManagerBase::CameraBlendType' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, CacheCameraView) == 0x002BE0, "Member 'AX6PlayerCameraManagerBase::CacheCameraView' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, BeginBlendCameraView) == 0x003550, "Member 'AX6PlayerCameraManagerBase::BeginBlendCameraView' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, NewCameraViewData) == 0x003EC0, "Member 'AX6PlayerCameraManagerBase::NewCameraViewData' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, CachePOV) == 0x004850, "Member 'AX6PlayerCameraManagerBase::CachePOV' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, LastBlendCompleteTarget) == 0x0051C0, "Member 'AX6PlayerCameraManagerBase::LastBlendCompleteTarget' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, CurveTransitionParams) == 0x005B50, "Member 'AX6PlayerCameraManagerBase::CurveTransitionParams' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, bBlendBackToViewTargetFromCameraView) == 0x005B70, "Member 'AX6PlayerCameraManagerBase::bBlendBackToViewTargetFromCameraView' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, SpringArmPathBlend) == 0x005B78, "Member 'AX6PlayerCameraManagerBase::SpringArmPathBlend' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, SplineCurves) == 0x005BE8, "Member 'AX6PlayerCameraManagerBase::SplineCurves' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, BezierPoints) == 0x005C58, "Member 'AX6PlayerCameraManagerBase::BezierPoints' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, CustomizeCameraShake) == 0x005C90, "Member 'AX6PlayerCameraManagerBase::CustomizeCameraShake' has a wrong offset!");
static_assert(offsetof(AX6PlayerCameraManagerBase, OnNewTargetBlendEndEvent) == 0x005CB0, "Member 'AX6PlayerCameraManagerBase::OnNewTargetBlendEndEvent' has a wrong offset!");
