#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Camera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum X6Camera.ECameraViewTargetBlendType
// NumValues: 0x0003
enum class ECameraViewTargetBlendType : uint8
{
	CVBT_Normal                              = 0,
	CVBT_Follow                              = 1,
	CVBT_MAX                                 = 2,
};

// Enum X6Camera.ECameraRotationYawSyncMode
// NumValues: 0x0004
enum class ECameraRotationYawSyncMode : uint8
{
	FollowVelocityDirection                  = 0,
	FollowInputDirection                     = 1,
	FollowActorForwardDirection              = 2,
	ECameraRotationYawSyncMode_MAX           = 3,
};

// Enum X6Camera.EConsumeTimeMethod
// NumValues: 0x0004
enum class EConsumeTimeMethod : uint8
{
	ECM_ActiveConsume                        = 0,
	ECM_AlwaysConsume                        = 1,
	ECM_NoConsumeTime                        = 2,
	ECM_MAX                                  = 3,
};

// Enum X6Camera.ECameraTaskLookAtType
// NumValues: 0x0004
enum class ECameraTaskLookAtType : uint8
{
	ECTLT_Follow                             = 0,
	ECTLT_Fixed                              = 1,
	ECTLT_Focus                              = 2,
	ECTLT_MAX                                = 3,
};

// Enum X6Camera.EX6CameraDataPriority
// NumValues: 0x0006
enum class EX6CameraDataPriority : uint8
{
	X6CP_PRIORITY_1                          = 0,
	X6CP_PRIORITY_2                          = 1,
	X6CP_PRIORITY_3                          = 2,
	X6CP_PRIORITY_4                          = 3,
	X6CP_PRIORITY_5                          = 4,
	X6CP_PRIORITY_MAX                        = 5,
};

// Enum X6Camera.ECameraBlendPathType
// NumValues: 0x0007
enum class ECameraBlendPathType : uint8
{
	CBPT_Default                             = 0,
	CBPT_Follow                              = 1,
	CBPT_Curve                               = 2,
	CBPT_LookAt                              = 3,
	CBPT_Bezier                              = 4,
	CBPT_SpringArm                           = 5,
	CBPT_MAX                                 = 6,
};

// Enum X6Camera.ECameraLayer
// NumValues: 0x0006
enum class ECameraLayer : uint8
{
	CL_LAYER_1                               = 0,
	CL_LAYER_2                               = 1,
	CL_LAYER_3                               = 2,
	CL_LAYER_4                               = 3,
	CL_LAYER_5                               = 4,
	CL_LAYER_MAX                             = 5,
};

// Enum X6Camera.ECameraValueModifyType
// NumValues: 0x0004
enum class ECameraValueModifyType : uint8
{
	CVMT_ADDITIVE                            = 0,
	CVMT_OVERRIDE                            = 1,
	CVMT_BASE                                = 2,
	CVMT_MAX                                 = 3,
};

// Enum X6Camera.ECameraTransitionPermission
// NumValues: 0x0003
enum class ECameraTransitionPermission : uint8
{
	Permit                                   = 0,
	Refuse                                   = 1,
	ECameraTransitionPermission_MAX          = 2,
};

// Enum X6Camera.ECameraState
// NumValues: 0x0026
enum class ECameraState : uint8
{
	None                                     = 0,
	BirthMode                                = 1,
	DeathMode                                = 2,
	UIMode                                   = 3,
	InteractMode                             = 4,
	CombatMode                               = 5,
	SplineMode                               = 6,
	FixedMode                                = 7,
	FollowMode                               = 8,
	SequenceMode                             = 9,
	ArbitrarilyMode                          = 10,
	TransitionMode                           = 11,
	CameraMode_NativeBound                   = 12,
	CameraMode10                             = 13,
	CameraMode11                             = 14,
	CameraMode12                             = 15,
	CameraMode13                             = 16,
	CameraMode14                             = 17,
	CameraMode15                             = 18,
	CameraMode16                             = 19,
	CameraMode17                             = 20,
	CameraMode18                             = 21,
	CameraMode19                             = 22,
	CameraMode20                             = 23,
	CameraMode21                             = 24,
	CameraMode22                             = 25,
	CameraMode23                             = 26,
	CameraMode24                             = 27,
	CameraMode25                             = 28,
	CameraMode26                             = 29,
	CameraMode27                             = 30,
	CameraMode28                             = 31,
	CameraMode29                             = 32,
	CameraMode30                             = 33,
	CameraMode31                             = 34,
	CameraMode32                             = 35,
	CameraMode_MAX                           = 36,
	ECameraState_MAX                         = 37,
};

// Enum X6Camera.ECameraCollisionMoveMode
// NumValues: 0x0004
enum class ECameraCollisionMoveMode : uint8
{
	CCMM_INTER                               = 0,
	CCMM_SPRING                              = 1,
	CCMM_CONST_INTERP                        = 2,
	CCMM_MAX                                 = 3,
};

// Enum X6Camera.ECameraModifierStage
// NumValues: 0x0004
enum class ECameraModifierStage : uint8
{
	CMS_Blend                                = 0,
	CMS_Nomal                                = 1,
	CVMT_EndLife                             = 2,
	ECameraModifierStage_MAX                 = 3,
};

// Enum X6Camera.ECameraLagReferenceType
// NumValues: 0x0005
enum class ECameraLagReferenceType : uint8
{
	CameraForward                            = 0,
	ActorForward                             = 1,
	PawnVelocity                             = 2,
	PawnAcceleration                         = 3,
	ECameraLagReferenceType_MAX              = 4,
};

// Enum X6Camera.EX6CameraPlatformType
// NumValues: 0x0005
enum class EX6CameraPlatformType : uint8
{
	None                                     = 0,
	PC                                       = 1,
	Mobile                                   = 2,
	Console                                  = 3,
	EX6CameraPlatformType_MAX                = 4,
};

// Enum X6Camera.EX6CameraInputDeviceType
// NumValues: 0x0005
enum class EX6CameraInputDeviceType : uint8
{
	None                                     = 0,
	Mouse                                    = 1,
	Gamepad                                  = 2,
	TouchScreen                              = 3,
	EX6CameraInputDeviceType_MAX             = 4,
};

// ScriptStruct X6Camera.X6CameraConfigBlendParams
// 0x0028 (0x0028 - 0x0000)
struct FX6CameraConfigBlendParams final
{
public:
	bool                                          bOverrideTransitionParams;                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCacheCameraSettingsWhenLockOutgoingBlend;         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0008(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FX6CameraConfigBlendParams) == 0x000008, "Wrong alignment on FX6CameraConfigBlendParams");
static_assert(sizeof(FX6CameraConfigBlendParams) == 0x000028, "Wrong size on FX6CameraConfigBlendParams");
static_assert(offsetof(FX6CameraConfigBlendParams, bOverrideTransitionParams) == 0x000000, "Member 'FX6CameraConfigBlendParams::bOverrideTransitionParams' has a wrong offset!");
static_assert(offsetof(FX6CameraConfigBlendParams, bCacheCameraSettingsWhenLockOutgoingBlend) == 0x000001, "Member 'FX6CameraConfigBlendParams::bCacheCameraSettingsWhenLockOutgoingBlend' has a wrong offset!");
static_assert(offsetof(FX6CameraConfigBlendParams, TransitionParams) == 0x000008, "Member 'FX6CameraConfigBlendParams::TransitionParams' has a wrong offset!");

// ScriptStruct X6Camera.CameraOrientationSyncConfig
// 0x00B8 (0x00B8 - 0x0000)
struct FCameraOrientationSyncConfig final
{
public:
	float                                         StopYawSyncInputAngularThreshold;                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterruptResetInputAngularThreshold;               // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResetYawSyncDelayTimeInputAngularThreshold;        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OwnerIsMovingSpeedTolerance;                       // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ResetRotationAngularSpeedCurve;                    // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResetRotationAngularSpeedIncreaseInterpSpeed;      // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableYawSync;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoYawSyncWhenNotMoving;                           // 0x001D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopYawSyncInAir;                                 // 0x001E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StopYawSyncInAirDelaySeconds;                      // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraRotationYawSyncMode                    YawSyncMode;                                       // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnableCameraRotationSyncMinAngle;                  // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableCameraRotationSyncMaxAngle;                  // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableForwardRotationSyncMaxAngle;                 // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockFollowCameraWhenNoCameraInput;                // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartLockFollowCameraTolerance;                    // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartRotationSyncAngle;                            // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RotationYawSyncAngularSpeedCurve;                  // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RotationYawSyncAngularSpeedScaleCurve;             // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawSyncAngularSpeedIncreaseInterpSpeed;            // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartRotationYawSyncDelay;                         // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSyncEaseTime;                              // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   RotationSyncEaseType;                              // 0x005C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCombatYawSync;                                    // 0x005D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayForFirstEngage;                               // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHorizontalDistance;                             // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVerticalDistance;                               // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopRotationSyncMaxAngle;                          // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalCharacterRotationWeight;                      // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecreaseForCharacterRotation;                      // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalCharacterDistanceWeight;                      // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecreaseForCharacterDistance;                      // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalCameraRotationWeight;                         // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecreaseForCameraRotation;                         // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchThresholdRate;                               // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumWeightToEnableSync;                         // 0x008C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePitchSync;                                  // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartRotationPitchSyncDelay;                       // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchSyncSpringSmoothTime;                         // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchSyncSpringDamp;                               // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                           RotationPitchSyncMapCurve;                         // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchCheckChangeLength;                            // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchCheckYawRange;                                // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirLandPitch;                                      // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraOrientationSyncConfig) == 0x000008, "Wrong alignment on FCameraOrientationSyncConfig");
static_assert(sizeof(FCameraOrientationSyncConfig) == 0x0000B8, "Wrong size on FCameraOrientationSyncConfig");
static_assert(offsetof(FCameraOrientationSyncConfig, StopYawSyncInputAngularThreshold) == 0x000000, "Member 'FCameraOrientationSyncConfig::StopYawSyncInputAngularThreshold' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, InterruptResetInputAngularThreshold) == 0x000004, "Member 'FCameraOrientationSyncConfig::InterruptResetInputAngularThreshold' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, ResetYawSyncDelayTimeInputAngularThreshold) == 0x000008, "Member 'FCameraOrientationSyncConfig::ResetYawSyncDelayTimeInputAngularThreshold' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, OwnerIsMovingSpeedTolerance) == 0x00000C, "Member 'FCameraOrientationSyncConfig::OwnerIsMovingSpeedTolerance' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, ResetRotationAngularSpeedCurve) == 0x000010, "Member 'FCameraOrientationSyncConfig::ResetRotationAngularSpeedCurve' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, ResetRotationAngularSpeedIncreaseInterpSpeed) == 0x000018, "Member 'FCameraOrientationSyncConfig::ResetRotationAngularSpeedIncreaseInterpSpeed' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bEnableYawSync) == 0x00001C, "Member 'FCameraOrientationSyncConfig::bEnableYawSync' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bDoYawSyncWhenNotMoving) == 0x00001D, "Member 'FCameraOrientationSyncConfig::bDoYawSyncWhenNotMoving' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bStopYawSyncInAir) == 0x00001E, "Member 'FCameraOrientationSyncConfig::bStopYawSyncInAir' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StopYawSyncInAirDelaySeconds) == 0x000020, "Member 'FCameraOrientationSyncConfig::StopYawSyncInAirDelaySeconds' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, YawSyncMode) == 0x000024, "Member 'FCameraOrientationSyncConfig::YawSyncMode' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, EnableCameraRotationSyncMinAngle) == 0x000028, "Member 'FCameraOrientationSyncConfig::EnableCameraRotationSyncMinAngle' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, EnableCameraRotationSyncMaxAngle) == 0x00002C, "Member 'FCameraOrientationSyncConfig::EnableCameraRotationSyncMaxAngle' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, EnableForwardRotationSyncMaxAngle) == 0x000030, "Member 'FCameraOrientationSyncConfig::EnableForwardRotationSyncMaxAngle' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bLockFollowCameraWhenNoCameraInput) == 0x000034, "Member 'FCameraOrientationSyncConfig::bLockFollowCameraWhenNoCameraInput' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StartLockFollowCameraTolerance) == 0x000038, "Member 'FCameraOrientationSyncConfig::StartLockFollowCameraTolerance' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StartRotationSyncAngle) == 0x00003C, "Member 'FCameraOrientationSyncConfig::StartRotationSyncAngle' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, RotationYawSyncAngularSpeedCurve) == 0x000040, "Member 'FCameraOrientationSyncConfig::RotationYawSyncAngularSpeedCurve' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, RotationYawSyncAngularSpeedScaleCurve) == 0x000048, "Member 'FCameraOrientationSyncConfig::RotationYawSyncAngularSpeedScaleCurve' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, YawSyncAngularSpeedIncreaseInterpSpeed) == 0x000050, "Member 'FCameraOrientationSyncConfig::YawSyncAngularSpeedIncreaseInterpSpeed' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StartRotationYawSyncDelay) == 0x000054, "Member 'FCameraOrientationSyncConfig::StartRotationYawSyncDelay' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, RotationSyncEaseTime) == 0x000058, "Member 'FCameraOrientationSyncConfig::RotationSyncEaseTime' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, RotationSyncEaseType) == 0x00005C, "Member 'FCameraOrientationSyncConfig::RotationSyncEaseType' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bCombatYawSync) == 0x00005D, "Member 'FCameraOrientationSyncConfig::bCombatYawSync' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, DelayForFirstEngage) == 0x000060, "Member 'FCameraOrientationSyncConfig::DelayForFirstEngage' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, MaxHorizontalDistance) == 0x000064, "Member 'FCameraOrientationSyncConfig::MaxHorizontalDistance' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, MaxVerticalDistance) == 0x000068, "Member 'FCameraOrientationSyncConfig::MaxVerticalDistance' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StopRotationSyncMaxAngle) == 0x00006C, "Member 'FCameraOrientationSyncConfig::StopRotationSyncMaxAngle' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, TotalCharacterRotationWeight) == 0x000070, "Member 'FCameraOrientationSyncConfig::TotalCharacterRotationWeight' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, DecreaseForCharacterRotation) == 0x000074, "Member 'FCameraOrientationSyncConfig::DecreaseForCharacterRotation' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, TotalCharacterDistanceWeight) == 0x000078, "Member 'FCameraOrientationSyncConfig::TotalCharacterDistanceWeight' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, DecreaseForCharacterDistance) == 0x00007C, "Member 'FCameraOrientationSyncConfig::DecreaseForCharacterDistance' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, TotalCameraRotationWeight) == 0x000080, "Member 'FCameraOrientationSyncConfig::TotalCameraRotationWeight' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, DecreaseForCameraRotation) == 0x000084, "Member 'FCameraOrientationSyncConfig::DecreaseForCameraRotation' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, SwitchThresholdRate) == 0x000088, "Member 'FCameraOrientationSyncConfig::SwitchThresholdRate' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, MinimumWeightToEnableSync) == 0x00008C, "Member 'FCameraOrientationSyncConfig::MinimumWeightToEnableSync' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, bEnablePitchSync) == 0x000090, "Member 'FCameraOrientationSyncConfig::bEnablePitchSync' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, StartRotationPitchSyncDelay) == 0x000094, "Member 'FCameraOrientationSyncConfig::StartRotationPitchSyncDelay' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, PitchSyncSpringSmoothTime) == 0x000098, "Member 'FCameraOrientationSyncConfig::PitchSyncSpringSmoothTime' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, PitchSyncSpringDamp) == 0x00009C, "Member 'FCameraOrientationSyncConfig::PitchSyncSpringDamp' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, RotationPitchSyncMapCurve) == 0x0000A0, "Member 'FCameraOrientationSyncConfig::RotationPitchSyncMapCurve' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, PitchCheckChangeLength) == 0x0000A8, "Member 'FCameraOrientationSyncConfig::PitchCheckChangeLength' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, PitchCheckYawRange) == 0x0000AC, "Member 'FCameraOrientationSyncConfig::PitchCheckYawRange' has a wrong offset!");
static_assert(offsetof(FCameraOrientationSyncConfig, AirLandPitch) == 0x0000B0, "Member 'FCameraOrientationSyncConfig::AirLandPitch' has a wrong offset!");

// ScriptStruct X6Camera.X6CameraInputConfig
// 0x00D0 (0x00D0 - 0x0000)
struct FX6CameraInputConfig final
{
public:
	uint8                                         bOverride_bAcceptInput : 1;                        // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bAcceptInput;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_InputXRotateSpeedFactor : 1;             // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputXRotateSpeedFactor;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_InputYRotateSpeedFactor : 1;             // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputYRotateSpeedFactor;                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_CameraOrientationSyncConfig : 1;         // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraOrientationSyncConfig           CameraOrientationSyncConfig;                       // 0x0018(0x00B8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FX6CameraInputConfig) == 0x000008, "Wrong alignment on FX6CameraInputConfig");
static_assert(sizeof(FX6CameraInputConfig) == 0x0000D0, "Wrong size on FX6CameraInputConfig");
static_assert(offsetof(FX6CameraInputConfig, bAcceptInput) == 0x000001, "Member 'FX6CameraInputConfig::bAcceptInput' has a wrong offset!");
static_assert(offsetof(FX6CameraInputConfig, InputXRotateSpeedFactor) == 0x000004, "Member 'FX6CameraInputConfig::InputXRotateSpeedFactor' has a wrong offset!");
static_assert(offsetof(FX6CameraInputConfig, InputYRotateSpeedFactor) == 0x00000C, "Member 'FX6CameraInputConfig::InputYRotateSpeedFactor' has a wrong offset!");
static_assert(offsetof(FX6CameraInputConfig, CameraOrientationSyncConfig) == 0x000018, "Member 'FX6CameraInputConfig::CameraOrientationSyncConfig' has a wrong offset!");

// ScriptStruct X6Camera.CameraTaskEventData
// 0x0090 (0x0090 - 0x0000)
struct FCameraTaskEventData final
{
public:
	class FName                                   CameraTaskTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransfrom;                                   // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OldViewTarget;                                     // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraTaskEventData) == 0x000010, "Wrong alignment on FCameraTaskEventData");
static_assert(sizeof(FCameraTaskEventData) == 0x000090, "Wrong size on FCameraTaskEventData");
static_assert(offsetof(FCameraTaskEventData, CameraTaskTag) == 0x000000, "Member 'FCameraTaskEventData::CameraTaskTag' has a wrong offset!");
static_assert(offsetof(FCameraTaskEventData, CameraTransfrom) == 0x000010, "Member 'FCameraTaskEventData::CameraTransfrom' has a wrong offset!");
static_assert(offsetof(FCameraTaskEventData, TotalTime) == 0x000070, "Member 'FCameraTaskEventData::TotalTime' has a wrong offset!");
static_assert(offsetof(FCameraTaskEventData, OldViewTarget) == 0x000078, "Member 'FCameraTaskEventData::OldViewTarget' has a wrong offset!");
static_assert(offsetof(FCameraTaskEventData, NewViewTarget) == 0x000080, "Member 'FCameraTaskEventData::NewViewTarget' has a wrong offset!");

// ScriptStruct X6Camera.BasedMovementFixCameraHelper
// 0x0070 (0x0070 - 0x0000)
struct FBasedMovementFixCameraHelper final
{
public:
	struct FVector                                LastLocation;                                      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExpectLocation;                                    // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  DeltaQuat;                                         // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotationChanged;                                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocationChanged;                                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaYaw;                                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBasedMovementFixCameraHelper) == 0x000010, "Wrong alignment on FBasedMovementFixCameraHelper");
static_assert(sizeof(FBasedMovementFixCameraHelper) == 0x000070, "Wrong size on FBasedMovementFixCameraHelper");
static_assert(offsetof(FBasedMovementFixCameraHelper, LastLocation) == 0x000000, "Member 'FBasedMovementFixCameraHelper::LastLocation' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, ExpectLocation) == 0x000018, "Member 'FBasedMovementFixCameraHelper::ExpectLocation' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, DeltaQuat) == 0x000030, "Member 'FBasedMovementFixCameraHelper::DeltaQuat' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, DeltaLocation) == 0x000050, "Member 'FBasedMovementFixCameraHelper::DeltaLocation' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, bRotationChanged) == 0x000068, "Member 'FBasedMovementFixCameraHelper::bRotationChanged' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, bLocationChanged) == 0x000069, "Member 'FBasedMovementFixCameraHelper::bLocationChanged' has a wrong offset!");
static_assert(offsetof(FBasedMovementFixCameraHelper, DeltaYaw) == 0x00006C, "Member 'FBasedMovementFixCameraHelper::DeltaYaw' has a wrong offset!");

// ScriptStruct X6Camera.VectorSpringStateInfo
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FVectorSpringStateInfo final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVectorSpringStateInfo) == 0x000004, "Wrong alignment on FVectorSpringStateInfo");
static_assert(sizeof(FVectorSpringStateInfo) == 0x00001C, "Wrong size on FVectorSpringStateInfo");

// ScriptStruct X6Camera.ViewTargetCurveTransitionParams
// 0x0020 (0x0020 - 0x0000)
struct FViewTargetCurveTransitionParams final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunction;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLockOutgoing : 1;                                 // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCustomRotateBlend;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateToVelocityDirection;                        // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationBlendToVelocityDirectionInOutTime;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      RotationBlendFunction;                             // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationBlendExp;                                  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FViewTargetCurveTransitionParams) == 0x000004, "Wrong alignment on FViewTargetCurveTransitionParams");
static_assert(sizeof(FViewTargetCurveTransitionParams) == 0x000020, "Wrong size on FViewTargetCurveTransitionParams");
static_assert(offsetof(FViewTargetCurveTransitionParams, BlendTime) == 0x000000, "Member 'FViewTargetCurveTransitionParams::BlendTime' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, BlendFunction) == 0x000004, "Member 'FViewTargetCurveTransitionParams::BlendFunction' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, BlendExp) == 0x000008, "Member 'FViewTargetCurveTransitionParams::BlendExp' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, bCustomRotateBlend) == 0x000010, "Member 'FViewTargetCurveTransitionParams::bCustomRotateBlend' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, bRotateToVelocityDirection) == 0x000011, "Member 'FViewTargetCurveTransitionParams::bRotateToVelocityDirection' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, RotationBlendToVelocityDirectionInOutTime) == 0x000014, "Member 'FViewTargetCurveTransitionParams::RotationBlendToVelocityDirectionInOutTime' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, RotationBlendFunction) == 0x000018, "Member 'FViewTargetCurveTransitionParams::RotationBlendFunction' has a wrong offset!");
static_assert(offsetof(FViewTargetCurveTransitionParams, RotationBlendExp) == 0x00001C, "Member 'FViewTargetCurveTransitionParams::RotationBlendExp' has a wrong offset!");

// ScriptStruct X6Camera.TransCameraViewData
// 0x0990 (0x0990 - 0x0000)
struct FTransCameraViewData final
{
public:
	struct FMinimalViewInfo                       NewCameraView;                                     // 0x0000(0x0970)(NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0970(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTransCameraViewData) == 0x000010, "Wrong alignment on FTransCameraViewData");
static_assert(sizeof(FTransCameraViewData) == 0x000990, "Wrong size on FTransCameraViewData");
static_assert(offsetof(FTransCameraViewData, NewCameraView) == 0x000000, "Member 'FTransCameraViewData::NewCameraView' has a wrong offset!");
static_assert(offsetof(FTransCameraViewData, TransitionParams) == 0x000970, "Member 'FTransCameraViewData::TransitionParams' has a wrong offset!");

// ScriptStruct X6Camera.CameraStateViewTagetData
// 0x0020 (0x0020 - 0x0000)
struct FCameraStateViewTagetData final
{
public:
	ECameraState                                  CameraState;                                       // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ViewTargetActor;                                   // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRemoveWhenNotOnTop;                               // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCameraStateViewTagetData) == 0x000008, "Wrong alignment on FCameraStateViewTagetData");
static_assert(sizeof(FCameraStateViewTagetData) == 0x000020, "Wrong size on FCameraStateViewTagetData");
static_assert(offsetof(FCameraStateViewTagetData, CameraState) == 0x000000, "Member 'FCameraStateViewTagetData::CameraState' has a wrong offset!");
static_assert(offsetof(FCameraStateViewTagetData, ViewTargetActor) == 0x000008, "Member 'FCameraStateViewTagetData::ViewTargetActor' has a wrong offset!");
static_assert(offsetof(FCameraStateViewTagetData, Priority) == 0x000010, "Member 'FCameraStateViewTagetData::Priority' has a wrong offset!");
static_assert(offsetof(FCameraStateViewTagetData, bRemoveWhenNotOnTop) == 0x000018, "Member 'FCameraStateViewTagetData::bRemoveWhenNotOnTop' has a wrong offset!");

// ScriptStruct X6Camera.CameraInputOptimizationConfig
// 0x0028 (0x0028 - 0x0000)
struct FCameraInputOptimizationConfig final
{
public:
	uint8                                         CacheCameraInputFrameNum;                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Input2UnValidToleranceTime;                        // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 RatioArray;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FirstFrameAllowMaxSpeed;                           // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowMaxSpeed;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            SpeedMapScaleCurve;                                // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCameraInputOptimizationConfig) == 0x000008, "Wrong alignment on FCameraInputOptimizationConfig");
static_assert(sizeof(FCameraInputOptimizationConfig) == 0x000028, "Wrong size on FCameraInputOptimizationConfig");
static_assert(offsetof(FCameraInputOptimizationConfig, CacheCameraInputFrameNum) == 0x000000, "Member 'FCameraInputOptimizationConfig::CacheCameraInputFrameNum' has a wrong offset!");
static_assert(offsetof(FCameraInputOptimizationConfig, Input2UnValidToleranceTime) == 0x000004, "Member 'FCameraInputOptimizationConfig::Input2UnValidToleranceTime' has a wrong offset!");
static_assert(offsetof(FCameraInputOptimizationConfig, RatioArray) == 0x000008, "Member 'FCameraInputOptimizationConfig::RatioArray' has a wrong offset!");
static_assert(offsetof(FCameraInputOptimizationConfig, FirstFrameAllowMaxSpeed) == 0x000018, "Member 'FCameraInputOptimizationConfig::FirstFrameAllowMaxSpeed' has a wrong offset!");
static_assert(offsetof(FCameraInputOptimizationConfig, AllowMaxSpeed) == 0x00001C, "Member 'FCameraInputOptimizationConfig::AllowMaxSpeed' has a wrong offset!");
static_assert(offsetof(FCameraInputOptimizationConfig, SpeedMapScaleCurve) == 0x000020, "Member 'FCameraInputOptimizationConfig::SpeedMapScaleCurve' has a wrong offset!");

// ScriptStruct X6Camera.X6CameraBlendableSettings
// 0x0118 (0x0118 - 0x0000)
struct FX6CameraBlendableSettings
{
public:
	uint8                                         bOverride_FOV : 1;                                 // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FOV;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BirthRotation : 1;                       // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               BirthRotation;                                     // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bOverride_OriginRotation : 1;                      // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OriginRotation;                                    // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MaxPitchAngle : 1;                       // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxPitchAngle;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MinPitchAngle : 1;                       // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinPitchAngle;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MaxYawAngle : 1;                         // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxYawAngle;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MinYawAngle : 1;                         // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinYawAngle;                                       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BaseArmLength : 1;                       // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseArmLength;                                     // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_bEnableInfluencedByPitch : 1;            // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bEnableInfluencedByPitch;                          // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_ArmlengthCurveByPitch : 1;               // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ArmlengthCurveByPitch;                             // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x4];                                       // 0x0080(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_MaxArmLength : 1;                        // 0x0084(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxArmLength;                                      // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_MinArmLength : 1;                        // 0x008C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinArmLength;                                      // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_bEnableInfluenceOffsetByPitch : 1;       // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bEnableInfluenceOffsetByPitch;                     // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_OffsetCurveByPitch : 1;                  // 0x0096(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           OffsetCurveByPitch;                                // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_SocketOffset : 1;                        // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SocketOffset;                                      // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_SocketRotationOffset : 1;                // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               SocketRotationOffset;                              // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
