#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6ClothesSkeletonCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function X6ClothesSkeletonCore.OrnamentBoneEvent.GetOrnamentBoneTransform
// 0x0038 (0x0038 - 0x0000)
struct OrnamentBoneEvent_GetOrnamentBoneTransform final
{
public:
	TArray<class FName>                           OutBoneNames;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     OutBoneTransforms;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          InHatMesh;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          InHairMesh;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OrnamentBoneEvent_GetOrnamentBoneTransform) == 0x000008, "Wrong alignment on OrnamentBoneEvent_GetOrnamentBoneTransform");
static_assert(sizeof(OrnamentBoneEvent_GetOrnamentBoneTransform) == 0x000038, "Wrong size on OrnamentBoneEvent_GetOrnamentBoneTransform");
static_assert(offsetof(OrnamentBoneEvent_GetOrnamentBoneTransform, OutBoneNames) == 0x000000, "Member 'OrnamentBoneEvent_GetOrnamentBoneTransform::OutBoneNames' has a wrong offset!");
static_assert(offsetof(OrnamentBoneEvent_GetOrnamentBoneTransform, OutBoneTransforms) == 0x000010, "Member 'OrnamentBoneEvent_GetOrnamentBoneTransform::OutBoneTransforms' has a wrong offset!");
static_assert(offsetof(OrnamentBoneEvent_GetOrnamentBoneTransform, InHatMesh) == 0x000020, "Member 'OrnamentBoneEvent_GetOrnamentBoneTransform::InHatMesh' has a wrong offset!");
static_assert(offsetof(OrnamentBoneEvent_GetOrnamentBoneTransform, InHairMesh) == 0x000028, "Member 'OrnamentBoneEvent_GetOrnamentBoneTransform::InHairMesh' has a wrong offset!");
static_assert(offsetof(OrnamentBoneEvent_GetOrnamentBoneTransform, ReturnValue) == 0x000030, "Member 'OrnamentBoneEvent_GetOrnamentBoneTransform::ReturnValue' has a wrong offset!");

}

