#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6ClothDIYRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "X6ClothDIYRuntime_structs.hpp"


namespace SDK::Params
{

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.AsyncConstructTexture2DFromEncryptedFiles
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles final
{
public:
	TArray<class FString>                         PhotoPaths;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<class FString>& Paths, const TArray<class UTexture2D*>& Tex)> Callback; // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles, PhotoPaths) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles::PhotoPaths' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles, Callback) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_AsyncConstructTexture2DFromEncryptedFiles::Callback' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.AsyncSaveTexture2DToEncryptedFile
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSavePath;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile, InTexture) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile::InTexture' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile, InSavePath) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_AsyncSaveTexture2DToEncryptedFile::InSavePath' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex
// 0x0038 (0x0038 - 0x0000)
struct X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2DArray*            TextureRenderTarget;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6DIYDrawToRenderTarget2DArrayContext Context;                                           // 0x0028(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex) == 0x000038, "Wrong size on X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex, WorldContextObject) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex::WorldContextObject' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex, TextureRenderTarget) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex::TextureRenderTarget' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex, Canvas) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex::Canvas' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex, Size) == 0x000018, "Member 'X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex::Size' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex, Context) == 0x000028, "Member 'X6ClothDIYBlueprintLibrary_BeginDrawCanvasToRenderTarget2DArrayWithSliceIndex::Context' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ConstructTexture2DArrayByRenderTarget2Ds
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds final
{
public:
	TArray<class UTextureRenderTarget2D*>         InSourceTargets;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UTexture2DArray*                        OutTexture2DArray;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds, InSourceTargets) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds::InSourceTargets' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds, OutTexture2DArray) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds::OutTexture2DArray' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds, ReturnValue) == 0x000018, "Member 'X6ClothDIYBlueprintLibrary_ConstructTexture2DArrayByRenderTarget2Ds::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ConstructTexture2DFromEncryptedFile
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile final
{
public:
	class FString                                 InFilePath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile, InFilePath) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile::InFilePath' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ConstructTexture2DFromEncryptedFile::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ConvertBase64DataToString
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ConvertBase64DataToString final
{
public:
	class FString                                 InBase64Data;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ConvertBase64DataToString) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ConvertBase64DataToString");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ConvertBase64DataToString) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_ConvertBase64DataToString");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConvertBase64DataToString, InBase64Data) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ConvertBase64DataToString::InBase64Data' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConvertBase64DataToString, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ConvertBase64DataToString::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ConvertStringToBase64Data
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data, InString) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data::InString' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ConvertStringToBase64Data::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.CopyTexture2DArrayToTarget2DArray
// 0x0010 (0x0010 - 0x0000)
struct X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray final
{
public:
	class UTexture2DArray*                        InSourceTexture2DArray;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2DArray*                        InTargetTexture2DArray;                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray) == 0x000010, "Wrong size on X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray, InSourceTexture2DArray) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray::InSourceTexture2DArray' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray, InTargetTexture2DArray) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_CopyTexture2DArrayToTarget2DArray::InTargetTexture2DArray' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.DrawMPTToRT
// 0x0040 (0x0040 - 0x0000)
struct X6ClothDIYBlueprintLibrary_DrawMPTToRT final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               InTexture;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              WriteValue;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_DrawMPTToRT) == 0x000010, "Wrong alignment on X6ClothDIYBlueprintLibrary_DrawMPTToRT");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_DrawMPTToRT) == 0x000040, "Wrong size on X6ClothDIYBlueprintLibrary_DrawMPTToRT");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_DrawMPTToRT, WorldContextObject) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_DrawMPTToRT::WorldContextObject' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_DrawMPTToRT, InTexture) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_DrawMPTToRT::InTexture' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_DrawMPTToRT, RenderTarget) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_DrawMPTToRT::RenderTarget' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_DrawMPTToRT, WriteValue) == 0x000020, "Member 'X6ClothDIYBlueprintLibrary_DrawMPTToRT::WriteValue' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_DrawMPTToRT, Index_0) == 0x000030, "Member 'X6ClothDIYBlueprintLibrary_DrawMPTToRT::Index_0' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.EndDrawCanvasToRenderTarget2DArrayWithSliceIndex
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6DIYDrawToRenderTarget2DArrayContext Context;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         TargetSliceIndex;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex, WorldContextObject) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex::WorldContextObject' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex, Context) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex::Context' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex, TargetSliceIndex) == 0x000018, "Member 'X6ClothDIYBlueprintLibrary_EndDrawCanvasToRenderTarget2DArrayWithSliceIndex::TargetSliceIndex' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.GetScalarParameterValue
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_GetScalarParameterValue final
{
public:
	class UMaterialInterface*                     InMaterialInterface;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_GetScalarParameterValue) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_GetScalarParameterValue");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_GetScalarParameterValue) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_GetScalarParameterValue");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetScalarParameterValue, InMaterialInterface) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_GetScalarParameterValue::InMaterialInterface' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetScalarParameterValue, InParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_GetScalarParameterValue::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetScalarParameterValue, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_GetScalarParameterValue::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.GetTextureParameterValue
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_GetTextureParameterValue final
{
public:
	class UMaterialInterface*                     InMaterialInterface;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_GetTextureParameterValue) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_GetTextureParameterValue");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_GetTextureParameterValue) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_GetTextureParameterValue");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetTextureParameterValue, InMaterialInterface) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_GetTextureParameterValue::InMaterialInterface' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetTextureParameterValue, InParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_GetTextureParameterValue::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetTextureParameterValue, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_GetTextureParameterValue::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.GetVectorParameterValue
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_GetVectorParameterValue final
{
public:
	class UMaterialInterface*                     InMaterialInterface;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_GetVectorParameterValue) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_GetVectorParameterValue");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_GetVectorParameterValue) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_GetVectorParameterValue");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetVectorParameterValue, InMaterialInterface) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_GetVectorParameterValue::InMaterialInterface' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetVectorParameterValue, InParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_GetVectorParameterValue::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_GetVectorParameterValue, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_GetVectorParameterValue::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.MarkComponentRenderStateDirty
// 0x0008 (0x0008 - 0x0000)
struct X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty final
{
public:
	class UActorComponent*                        InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty) == 0x000008, "Wrong size on X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty, InComponent) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_MarkComponentRenderStateDirty::InComponent' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ResetMaterialInstanceDynamicScalarParam
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam final
{
public:
	class UMaterialInstanceDynamic*               InMID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam, InMID) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam::InMID' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam, ParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam::ParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicScalarParam::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ResetMaterialInstanceDynamicTextureParam
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam final
{
public:
	class UMaterialInstanceDynamic*               InMID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam, InMID) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam::InMID' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam, ParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam::ParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicTextureParam::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.ResetMaterialInstanceDynamicVectorParam
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam final
{
public:
	class UMaterialInstanceDynamic*               InMID;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam, InMID) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam::InMID' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam, ParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam::ParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam, ReturnValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_ResetMaterialInstanceDynamicVectorParam::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.SetScalarParameterValue
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_SetScalarParameterValue final
{
public:
	class UMaterialInstance*                      InMaterialInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_SetScalarParameterValue");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_SetScalarParameterValue");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue, InMaterialInstance) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_SetScalarParameterValue::InMaterialInstance' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue, InParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_SetScalarParameterValue::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue, InValue) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_SetScalarParameterValue::InValue' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetScalarParameterValue, ReturnValue) == 0x000014, "Member 'X6ClothDIYBlueprintLibrary_SetScalarParameterValue::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.SetTextureParameterValueByParentMaterial
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ParentMI;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               InTexture;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial, MeshComponent) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial::MeshComponent' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial, ParentMI) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial::ParentMI' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial, InParamName) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial, InTexture) == 0x000018, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueByParentMaterial::InTexture' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.SetTextureParameterValueOnMaterials
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InParamName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               InTexture;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials) == 0x000018, "Wrong size on X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials, MeshComponent) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials::MeshComponent' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials, InParamName) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials::InParamName' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials, InTexture) == 0x000010, "Member 'X6ClothDIYBlueprintLibrary_SetTextureParameterValueOnMaterials::InTexture' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYBlueprintLibrary.SpliteTexture2DArrayIntoTexture2Ds
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds final
{
public:
	class UTexture2DArray*                        InTexture2DArray;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     OutTexture2Ds;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds) == 0x000008, "Wrong alignment on X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds");
static_assert(sizeof(X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds) == 0x000020, "Wrong size on X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds, InTexture2DArray) == 0x000000, "Member 'X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds::InTexture2DArray' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds, OutTexture2Ds) == 0x000008, "Member 'X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds::OutTexture2Ds' has a wrong offset!");
static_assert(offsetof(X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds, ReturnValue) == 0x000018, "Member 'X6ClothDIYBlueprintLibrary_SpliteTexture2DArrayIntoTexture2Ds::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYEditorOnlyBlueprintLibrary.GetSkeletalMeshFurMaterials
// 0x0018 (0x0018 - 0x0000)
struct X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials final
{
public:
	class USkeletalMesh*                          InSkeletalMesh;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials) == 0x000008, "Wrong alignment on X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials");
static_assert(sizeof(X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials) == 0x000018, "Wrong size on X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials, InSkeletalMesh) == 0x000000, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials::InSkeletalMesh' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials, ReturnValue) == 0x000008, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetSkeletalMeshFurMaterials::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYEditorOnlyBlueprintLibrary.GetTextureAreaMeanColor
// 0x0040 (0x0040 - 0x0000)
struct X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor final
{
public:
	class UTexture*                               InQueryTexture;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LeftUpPoint;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutMeanColor;                                      // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor) == 0x000008, "Wrong alignment on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor");
static_assert(sizeof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor) == 0x000040, "Wrong size on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor, InQueryTexture) == 0x000000, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor::InQueryTexture' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor, LeftUpPoint) == 0x000008, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor::LeftUpPoint' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor, Size) == 0x000018, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor::Size' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor, OutMeanColor) == 0x000028, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor::OutMeanColor' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor, ReturnValue) == 0x000038, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureAreaMeanColor::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYEditorOnlyBlueprintLibrary.GetTextureParamNameFromEvolutionDT
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT final
{
public:
	class UDataTable*                             InDT;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               InQueryTexture;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT) == 0x000008, "Wrong alignment on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT");
static_assert(sizeof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT) == 0x000020, "Wrong size on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT, InDT) == 0x000000, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT::InDT' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT, MatIndex) == 0x000008, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT::MatIndex' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT, InQueryTexture) == 0x000010, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT::InQueryTexture' has a wrong offset!");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT, ReturnValue) == 0x000018, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromEvolutionDT::ReturnValue' has a wrong offset!");

// Function X6ClothDIYRuntime.X6ClothDIYEditorOnlyBlueprintLibrary.GetTextureParamNameFromSkeletalMesh
// 0x0020 (0x0020 - 0x0000)
struct X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh final
{
public:
	class USkeletalMesh*                          InSkeletalMesh;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               InQueryTexture;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh) == 0x000008, "Wrong alignment on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh");
static_assert(sizeof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh) == 0x000020, "Wrong size on X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh");
static_assert(offsetof(X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh, InSkeletalMesh) == 0x000000, "Member 'X6ClothDIYEditorOnlyBlueprintLibrary_GetTextureParamNameFromSkeletalMesh::InSkeletalMesh' has a wrong offset!");
