#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6EnhancedInput

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "X6EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function X6EnhancedInput.X6EnhancedInputComponent.GetBoundActionValue
// 0x0028 (0x0028 - 0x0000)
struct X6EnhancedInputComponent_GetBoundActionValue final
{
public:
	const class UX6InputAction*                   Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6InputActionValue                    ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputComponent_GetBoundActionValue) == 0x000008, "Wrong alignment on X6EnhancedInputComponent_GetBoundActionValue");
static_assert(sizeof(X6EnhancedInputComponent_GetBoundActionValue) == 0x000028, "Wrong size on X6EnhancedInputComponent_GetBoundActionValue");
static_assert(offsetof(X6EnhancedInputComponent_GetBoundActionValue, Action) == 0x000000, "Member 'X6EnhancedInputComponent_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputComponent_GetBoundActionValue, ReturnValue) == 0x000008, "Member 'X6EnhancedInputComponent_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.Conv_InputActionValueToAxis1D
// 0x0028 (0x0028 - 0x0000)
struct X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D final
{
public:
	struct FX6InputActionValue                    InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(sizeof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D) == 0x000028, "Wrong size on X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D, InValue) == 0x000000, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D::InValue' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D, ReturnValue) == 0x000020, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis1D::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.Conv_InputActionValueToAxis2D
// 0x0030 (0x0030 - 0x0000)
struct X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D final
{
public:
	struct FX6InputActionValue                    InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(sizeof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D) == 0x000030, "Wrong size on X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D, InValue) == 0x000000, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D::InValue' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D, ReturnValue) == 0x000020, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis2D::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.Conv_InputActionValueToAxis3D
// 0x0038 (0x0038 - 0x0000)
struct X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D final
{
public:
	struct FX6InputActionValue                    InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(sizeof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D) == 0x000038, "Wrong size on X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D, InValue) == 0x000000, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D::InValue' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D, ReturnValue) == 0x000020, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToAxis3D::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.Conv_InputActionValueToBool
// 0x0028 (0x0028 - 0x0000)
struct X6EnhancedInputLibrary_Conv_InputActionValueToBool final
{
public:
	struct FX6InputActionValue                    InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(sizeof(X6EnhancedInputLibrary_Conv_InputActionValueToBool) == 0x000028, "Wrong size on X6EnhancedInputLibrary_Conv_InputActionValueToBool");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToBool, InValue) == 0x000000, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToBool::InValue' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_Conv_InputActionValueToBool, ReturnValue) == 0x000020, "Member 'X6EnhancedInputLibrary_Conv_InputActionValueToBool::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.GetBoundActionValue
// 0x0030 (0x0030 - 0x0000)
struct X6EnhancedInputLibrary_GetBoundActionValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UX6InputAction*                   Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FX6InputActionValue                    ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputLibrary_GetBoundActionValue) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_GetBoundActionValue");
static_assert(sizeof(X6EnhancedInputLibrary_GetBoundActionValue) == 0x000030, "Wrong size on X6EnhancedInputLibrary_GetBoundActionValue");
static_assert(offsetof(X6EnhancedInputLibrary_GetBoundActionValue, Actor) == 0x000000, "Member 'X6EnhancedInputLibrary_GetBoundActionValue::Actor' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_GetBoundActionValue, Action) == 0x000008, "Member 'X6EnhancedInputLibrary_GetBoundActionValue::Action' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_GetBoundActionValue, ReturnValue) == 0x000010, "Member 'X6EnhancedInputLibrary_GetBoundActionValue::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLibrary.RequestRebuildControlMappingsUsingContext
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext final
{
public:
	const class UX6InputMappingContext*           Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext) == 0x000008, "Wrong alignment on X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext");
static_assert(sizeof(X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext) == 0x000010, "Wrong size on X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext");
static_assert(offsetof(X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext, Context) == 0x000000, "Member 'X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext::Context' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext, bForceImmediately) == 0x000008, "Member 'X6EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext::bForceImmediately' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.AddEventInput
// 0x0038 (0x0038 - 0x0000)
struct X6EnhancedInputSubsystemInterface_AddEventInput final
{
public:
	class UClass*                                 EventClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EventPropertyName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EventTarget;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InRawValue;                                        // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAccumulate;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_AddEventInput) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_AddEventInput");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_AddEventInput) == 0x000038, "Wrong size on X6EnhancedInputSubsystemInterface_AddEventInput");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddEventInput, EventClass) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_AddEventInput::EventClass' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddEventInput, EventPropertyName) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_AddEventInput::EventPropertyName' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddEventInput, EventTarget) == 0x000010, "Member 'X6EnhancedInputSubsystemInterface_AddEventInput::EventTarget' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddEventInput, InRawValue) == 0x000018, "Member 'X6EnhancedInputSubsystemInterface_AddEventInput::InRawValue' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddEventInput, IsAccumulate) == 0x000030, "Member 'X6EnhancedInputSubsystemInterface_AddEventInput::IsAccumulate' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.AddGlobalDisabledInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_AddGlobalDisabledInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.AddGlobalEnabledInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_AddGlobalEnabledInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.AddMappingContext
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_AddMappingContext final
{
public:
	const class UX6InputMappingContext*           MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_AddMappingContext) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_AddMappingContext");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_AddMappingContext) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_AddMappingContext");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddMappingContext, MappingContext) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_AddMappingContext::MappingContext' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddMappingContext, Priority) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_AddMappingContext::Priority' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.AddOverwriteMappings
// 0x0060 (0x0060 - 0x0000)
struct X6EnhancedInputSubsystemInterface_AddOverwriteMappings final
{
public:
	const class UX6InputMappingContext*           InMappingContext;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FOverwriteKeyArray>        InOverwriteMappingIndexDatas;                      // 0x0008(0x0050)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          bNeedClear;                                        // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_AddOverwriteMappings) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_AddOverwriteMappings");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_AddOverwriteMappings) == 0x000060, "Wrong size on X6EnhancedInputSubsystemInterface_AddOverwriteMappings");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddOverwriteMappings, InMappingContext) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_AddOverwriteMappings::InMappingContext' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddOverwriteMappings, InOverwriteMappingIndexDatas) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_AddOverwriteMappings::InOverwriteMappingIndexDatas' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_AddOverwriteMappings, bNeedClear) == 0x000058, "Member 'X6EnhancedInputSubsystemInterface_AddOverwriteMappings::bNeedClear' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.ClearInputActionOverrideSound
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6TriggerEvent                               InTriggerEvent;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound::InAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound, InTriggerEvent) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_ClearInputActionOverrideSound::InTriggerEvent' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.ClearOverwriteMappings
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_ClearOverwriteMappings final
{
public:
	const class UX6InputMappingContext*           InMappingContext;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_ClearOverwriteMappings) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_ClearOverwriteMappings");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_ClearOverwriteMappings) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_ClearOverwriteMappings");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_ClearOverwriteMappings, InMappingContext) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_ClearOverwriteMappings::InMappingContext' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.DisableInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_DisableInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_DisableInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_DisableInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_DisableInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_DisableInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_DisableInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_DisableInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.DisableInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_DisableInputActions final
{
public:
	TArray<class UX6InputAction*>                 InActions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_DisableInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_DisableInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_DisableInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_DisableInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_DisableInputActions, InActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_DisableInputActions::InActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.EnableInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_EnableInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_EnableInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_EnableInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_EnableInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_EnableInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_EnableInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_EnableInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.EnableInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_EnableInputActions final
{
public:
	TArray<class UX6InputAction*>                 InActions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_EnableInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_EnableInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_EnableInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_EnableInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_EnableInputActions, InActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_EnableInputActions::InActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetActionKeyMappings
// 0x0018 (0x0018 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetActionKeyMappings final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FX6EnhancedActionKeyMapping>    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetActionKeyMappings) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetActionKeyMappings");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetActionKeyMappings) == 0x000018, "Wrong size on X6EnhancedInputSubsystemInterface_GetActionKeyMappings");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionKeyMappings, InputAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetActionKeyMappings::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionKeyMappings, ReturnValue) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_GetActionKeyMappings::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetActionMappingKeys
// 0x0018 (0x0018 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetActionMappingKeys final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetActionMappingKeys) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetActionMappingKeys");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetActionMappingKeys) == 0x000018, "Wrong size on X6EnhancedInputSubsystemInterface_GetActionMappingKeys");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeys, InputAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeys::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeys, ReturnValue) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeys::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetActionMappingKeysWithTriggers
// 0x0030 (0x0030 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         InTriggerClasss;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OutKeys;                                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers) == 0x000030, "Wrong size on X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers, InputAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers, InTriggerClasss) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers::InTriggerClasss' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers, OutKeys) == 0x000018, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers::OutKeys' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers, ReturnValue) == 0x000028, "Member 'X6EnhancedInputSubsystemInterface_GetActionMappingKeysWithTriggers::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetDisabledInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetDisabledInputActions final
{
public:
	TArray<class UX6InputAction*>                 OutActions;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetDisabledInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetDisabledInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetDisabledInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_GetDisabledInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetDisabledInputActions, OutActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetDisabledInputActions::OutActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetForceInputState
// 0x0001 (0x0001 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetForceInputState final
{
public:
	EX6ForceInputState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetForceInputState) == 0x000001, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetForceInputState");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetForceInputState) == 0x000001, "Wrong size on X6EnhancedInputSubsystemInterface_GetForceInputState");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetForceInputState, ReturnValue) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetForceInputState::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetForceInputStateExceptActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions final
{
public:
	TArray<class UX6InputAction*>                 OutActions;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions, OutActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetForceInputStateExceptActions::OutActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetGlobalDisabledInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions final
{
public:
	TArray<class UX6InputAction*>                 OutActions;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions, OutActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetGlobalDisabledInputActions::OutActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.GetGlobalEnabledInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions final
{
public:
	TArray<class UX6InputAction*>                 OutActions;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions, OutActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_GetGlobalEnabledInputActions::OutActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.InitInputActionDefaultSound
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound final
{
public:
	TArray<struct FX6InputActionSoundInfo>        InSoundInfos;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound, InSoundInfos) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_InitInputActionDefaultSound::InSoundInfos' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.RemoveGlobalDisabledInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_RemoveGlobalDisabledInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.RemoveGlobalEnabledInputAction
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_RemoveGlobalEnabledInputAction::InAction' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.RemoveMappingContext
// 0x0008 (0x0008 - 0x0000)
struct X6EnhancedInputSubsystemInterface_RemoveMappingContext final
{
public:
	const class UX6InputMappingContext*           MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_RemoveMappingContext) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_RemoveMappingContext");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_RemoveMappingContext) == 0x000008, "Wrong size on X6EnhancedInputSubsystemInterface_RemoveMappingContext");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_RemoveMappingContext, MappingContext) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_RemoveMappingContext::MappingContext' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.RequestRebuildControlMappings
// 0x0001 (0x0001 - 0x0000)
struct X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings final
{
public:
	bool                                          bForceImmediately;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings) == 0x000001, "Wrong alignment on X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings) == 0x000001, "Wrong size on X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings, bForceImmediately) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_RequestRebuildControlMappings::bForceImmediately' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.SetForceInputState
// 0x0018 (0x0018 - 0x0000)
struct X6EnhancedInputSubsystemInterface_SetForceInputState final
{
public:
	EX6ForceInputState                            InForceInputState;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UX6InputAction*>                 InExceptActions;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_SetForceInputState) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_SetForceInputState");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_SetForceInputState) == 0x000018, "Wrong size on X6EnhancedInputSubsystemInterface_SetForceInputState");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetForceInputState, InForceInputState) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_SetForceInputState::InForceInputState' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetForceInputState, InExceptActions) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_SetForceInputState::InExceptActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.SetGlobalDisabledInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions final
{
public:
	TArray<class UX6InputAction*>                 InActions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions, InActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_SetGlobalDisabledInputActions::InActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.SetGlobalEnabledInputActions
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions final
{
public:
	TArray<class UX6InputAction*>                 InActions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions, InActions) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_SetGlobalEnabledInputActions::InActions' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.SetInputActionOverrideSound
// 0x0038 (0x0038 - 0x0000)
struct X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound final
{
public:
	const class UX6InputAction*                   InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>           InAudioEvent;                                      // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6TriggerEvent                               InTriggerEvent;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound) == 0x000038, "Wrong size on X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound, InAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound::InAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound, InAudioEvent) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound::InAudioEvent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound, InTriggerEvent) == 0x000030, "Member 'X6EnhancedInputSubsystemInterface_SetInputActionOverrideSound::InTriggerEvent' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.TriggerAction
// 0x0028 (0x0028 - 0x0000)
struct X6EnhancedInputSubsystemInterface_TriggerAction final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6TriggerEvent                               InTriggerEvent;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InRawValue;                                        // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_TriggerAction) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_TriggerAction");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_TriggerAction) == 0x000028, "Wrong size on X6EnhancedInputSubsystemInterface_TriggerAction");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_TriggerAction, InputAction) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_TriggerAction::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_TriggerAction, InTriggerEvent) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_TriggerAction::InTriggerEvent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_TriggerAction, InRawValue) == 0x000010, "Member 'X6EnhancedInputSubsystemInterface_TriggerAction::InRawValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputSubsystemInterface.HasMappingContext
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputSubsystemInterface_HasMappingContext final
{
public:
	const class UX6InputMappingContext*           MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputSubsystemInterface_HasMappingContext) == 0x000008, "Wrong alignment on X6EnhancedInputSubsystemInterface_HasMappingContext");
static_assert(sizeof(X6EnhancedInputSubsystemInterface_HasMappingContext) == 0x000010, "Wrong size on X6EnhancedInputSubsystemInterface_HasMappingContext");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_HasMappingContext, MappingContext) == 0x000000, "Member 'X6EnhancedInputSubsystemInterface_HasMappingContext::MappingContext' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputSubsystemInterface_HasMappingContext, ReturnValue) == 0x000008, "Member 'X6EnhancedInputSubsystemInterface_HasMappingContext::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLocalPlayerSubsystem.RegisterInputActionUIFilterDelegate
// 0x0010 (0x0010 - 0x0000)
struct X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate final
{
public:
	TDelegate<void(const class UObject* Widget)>  UIFilterDelegate;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate) == 0x000004, "Wrong alignment on X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate");
static_assert(sizeof(X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate) == 0x000010, "Wrong size on X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate, UIFilterDelegate) == 0x000000, "Member 'X6EnhancedInputLocalPlayerSubsystem_RegisterInputActionUIFilterDelegate::UIFilterDelegate' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLocalPlayerSubsystem.BindAction
// 0x0038 (0x0038 - 0x0000)
struct X6EnhancedInputLocalPlayerSubsystem_BindAction final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6TriggerEvent                               InTriggerEvent;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InObject;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FX6InputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const TArray<struct FX6InputActionTriggerKeyData>& TriggerKeyDatas)> OnTriggerAction; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6EnhancedInputComponent*              BindToComponent;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLocalPlayerSubsystem_BindAction) == 0x000008, "Wrong alignment on X6EnhancedInputLocalPlayerSubsystem_BindAction");
static_assert(sizeof(X6EnhancedInputLocalPlayerSubsystem_BindAction) == 0x000038, "Wrong size on X6EnhancedInputLocalPlayerSubsystem_BindAction");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, InputAction) == 0x000000, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, InTriggerEvent) == 0x000008, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::InTriggerEvent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, InObject) == 0x000010, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::InObject' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, OnTriggerAction) == 0x000018, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::OnTriggerAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, BindToComponent) == 0x000028, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::BindToComponent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindAction, ReturnValue) == 0x000030, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindAction::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLocalPlayerSubsystem.BindActionByFuntionName
// 0x0030 (0x0030 - 0x0000)
struct X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName final
{
public:
	const class UX6InputAction*                   InputAction;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6TriggerEvent                               InTriggerEvent;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InObject;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InFunctionName;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6EnhancedInputComponent*              BindToComponent;                                   // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName) == 0x000008, "Wrong alignment on X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName");
static_assert(sizeof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName) == 0x000030, "Wrong size on X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, InputAction) == 0x000000, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::InputAction' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, InTriggerEvent) == 0x000008, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::InTriggerEvent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, InObject) == 0x000010, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::InObject' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, InFunctionName) == 0x000018, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::InFunctionName' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, BindToComponent) == 0x000020, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::BindToComponent' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName, ReturnValue) == 0x000028, "Member 'X6EnhancedInputLocalPlayerSubsystem_BindActionByFuntionName::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLocalPlayerSubsystem.CheckInputActionState
// 0x0018 (0x0018 - 0x0000)
struct X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState final
{
public:
	class FString                                 InputActionPath;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EX6InputActionCheckState                      ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState) == 0x000008, "Wrong alignment on X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState");
static_assert(sizeof(X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState) == 0x000018, "Wrong size on X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState, InputActionPath) == 0x000000, "Member 'X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState::InputActionPath' has a wrong offset!");
static_assert(offsetof(X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState, ReturnValue) == 0x000010, "Member 'X6EnhancedInputLocalPlayerSubsystem_CheckInputActionState::ReturnValue' has a wrong offset!");

// Function X6EnhancedInput.X6EnhancedInputLocalPlayerSubsystem.UnbindActionByHandle
// 0x0018 (0x0018 - 0x0000)
struct X6EnhancedInputLocalPlayerSubsystem_UnbindActionByHandle final
{
public:
	int32                                         BindingHandle;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6EnhancedInputComponent*              UnbindFromComponent;                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceRemove;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6EnhancedInputLocalPlayerSubsystem_UnbindActionByHandle) == 0x000008, "Wrong alignment on X6EnhancedInputLocalPlayerSubsystem_UnbindActionByHandle");
static_assert(sizeof(X6EnhancedInputLocalPlayerSubsystem_UnbindActionByHandle) == 0x000018, "Wrong size on X6EnhancedInputLocalPlayerSubsystem_UnbindActionByHandle");
