#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6EventMap

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct X6EventMap.ProjectTagEnumInfo
// 0x0018 (0x0018 - 0x0000)
struct FProjectTagEnumInfo final
{
public:
	int64                                         EnumValue;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EnumName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EnumAlias;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProjectTagEnumInfo) == 0x000008, "Wrong alignment on FProjectTagEnumInfo");
static_assert(sizeof(FProjectTagEnumInfo) == 0x000018, "Wrong size on FProjectTagEnumInfo");
static_assert(offsetof(FProjectTagEnumInfo, EnumValue) == 0x000000, "Member 'FProjectTagEnumInfo::EnumValue' has a wrong offset!");
static_assert(offsetof(FProjectTagEnumInfo, EnumName) == 0x000008, "Member 'FProjectTagEnumInfo::EnumName' has a wrong offset!");
static_assert(offsetof(FProjectTagEnumInfo, EnumAlias) == 0x000010, "Member 'FProjectTagEnumInfo::EnumAlias' has a wrong offset!");

}

