#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6ExportRuntime

#include "Basic.hpp"

#include "X6ExportRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class X6ExportRuntime.X6EncounterMonsterInfo
// 0x0000 (0x0028 - 0x0028)
class UX6EncounterMonsterInfo final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6EncounterMonsterInfo">();
	}
	static class UX6EncounterMonsterInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6EncounterMonsterInfo>();
	}
};
static_assert(alignof(UX6EncounterMonsterInfo) == 0x000008, "Wrong alignment on UX6EncounterMonsterInfo");
static_assert(sizeof(UX6EncounterMonsterInfo) == 0x000028, "Wrong size on UX6EncounterMonsterInfo");

// Class X6ExportRuntime.X6ExportBaseActor
// 0x0000 (0x03A8 - 0x03A8)
class AX6ExportBaseActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ExportBaseActor">();
	}
	static class AX6ExportBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AX6ExportBaseActor>();
	}
};
static_assert(alignof(AX6ExportBaseActor) == 0x000008, "Wrong alignment on AX6ExportBaseActor");
static_assert(sizeof(AX6ExportBaseActor) == 0x0003A8, "Wrong size on AX6ExportBaseActor");

// Class X6ExportRuntime.X6ExportLandscapeVolume
// 0x0000 (0x03E0 - 0x03E0)
class AX6ExportLandscapeVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ExportLandscapeVolume">();
	}
	static class AX6ExportLandscapeVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AX6ExportLandscapeVolume>();
	}
};
static_assert(alignof(AX6ExportLandscapeVolume) == 0x000008, "Wrong alignment on AX6ExportLandscapeVolume");
static_assert(sizeof(AX6ExportLandscapeVolume) == 0x0003E0, "Wrong size on AX6ExportLandscapeVolume");

// Class X6ExportRuntime.X6ExportPropertyBase
// 0x0000 (0x0028 - 0x0028)
class UX6ExportPropertyBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ExportPropertyBase">();
	}
	static class UX6ExportPropertyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6ExportPropertyBase>();
	}
};
static_assert(alignof(UX6ExportPropertyBase) == 0x000008, "Wrong alignment on UX6ExportPropertyBase");
static_assert(sizeof(UX6ExportPropertyBase) == 0x000028, "Wrong size on UX6ExportPropertyBase");

// Class X6ExportRuntime.X6ExportRefreshPointBase
// 0x0008 (0x03B0 - 0x03A8)
class AX6ExportRefreshPointBase final : public AActor
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString CheckItem();
	void DrawLine();
	TArray<class AX6ExportBaseActor*> GetChildItemList();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ExportRefreshPointBase">();
	}
	static class AX6ExportRefreshPointBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AX6ExportRefreshPointBase>();
	}
};
static_assert(alignof(AX6ExportRefreshPointBase) == 0x000008, "Wrong alignment on AX6ExportRefreshPointBase");
static_assert(sizeof(AX6ExportRefreshPointBase) == 0x0003B0, "Wrong size on AX6ExportRefreshPointBase");

// Class X6ExportRuntime.X6ExportToolRuntimeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UX6ExportToolRuntimeFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int64 GetAutoAssignedHomePoint(class APaperGamesSEMDataHostBase* Host);
	static int64 GetSpawnerID(class APaperGamesSEMDataHostBase* Host);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ExportToolRuntimeFunctionLibrary">();
	}
	static class UX6ExportToolRuntimeFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6ExportToolRuntimeFunctionLibrary>();
	}
};
static_assert(alignof(UX6ExportToolRuntimeFunctionLibrary) == 0x000008, "Wrong alignment on UX6ExportToolRuntimeFunctionLibrary");
static_assert(sizeof(UX6ExportToolRuntimeFunctionLibrary) == 0x000028, "Wrong size on UX6ExportToolRuntimeFunctionLibrary");

// Class X6ExportRuntime.X6SEM_DynamicSplineComponent
// 0x0000 (0x06C0 - 0x06C0)
class UX6SEM_DynamicSplineComponent final : public USplineComponent
{
public:
	void AddInstanceComponentByActor(class AActor* Actor);
	void RenameComponent(const class FString& InNewName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6SEM_DynamicSplineComponent">();
	}
	static class UX6SEM_DynamicSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6SEM_DynamicSplineComponent>();
	}
};
static_assert(alignof(UX6SEM_DynamicSplineComponent) == 0x000010, "Wrong alignment on UX6SEM_DynamicSplineComponent");
static_assert(sizeof(UX6SEM_DynamicSplineComponent) == 0x0006C0, "Wrong size on UX6SEM_DynamicSplineComponent");

// Class X6ExportRuntime.X6SpawnerActorCacheData
// 0x00E8 (0x0110 - 0x0028)
class UX6SpawnerActorCacheData final : public UObject
{
public:
	uint8                                         Pad_28[0x1];                                       // 0x0028(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          CanEditor;                                         // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DatalayerId;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DataLayerName;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DataLayerWorldID;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int64, struct FSpawnerActorInfo>         SpawnerActors;                                     // 0x0060(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSoftObjectPath>   ReferenceSoftObjectPath;                           // 0x00B0(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FLocTextGatherPair>             ReferenceText;                                     // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6SpawnerActorCacheData">();
	}
	static class UX6SpawnerActorCacheData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6SpawnerActorCacheData>();
	}
};
static_assert(alignof(UX6SpawnerActorCacheData) == 0x000008, "Wrong alignment on UX6SpawnerActorCacheData");
static_assert(sizeof(UX6SpawnerActorCacheData) == 0x000110, "Wrong size on UX6SpawnerActorCacheData");
static_assert(offsetof(UX6SpawnerActorCacheData, CanEditor) == 0x000029, "Member 'UX6SpawnerActorCacheData::CanEditor' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, DatalayerId) == 0x000030, "Member 'UX6SpawnerActorCacheData::DatalayerId' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, DataLayerName) == 0x000040, "Member 'UX6SpawnerActorCacheData::DataLayerName' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, DataLayerWorldID) == 0x000050, "Member 'UX6SpawnerActorCacheData::DataLayerWorldID' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, SpawnerActors) == 0x000060, "Member 'UX6SpawnerActorCacheData::SpawnerActors' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, ReferenceSoftObjectPath) == 0x0000B0, "Member 'UX6SpawnerActorCacheData::ReferenceSoftObjectPath' has a wrong offset!");
static_assert(offsetof(UX6SpawnerActorCacheData, ReferenceText) == 0x000100, "Member 'UX6SpawnerActorCacheData::ReferenceText' has a wrong offset!");

// Class X6ExportRuntime.X6CacheDataTextSerlizeHelper
// 0x0010 (0x0038 - 0x0028)
class UX6CacheDataTextSerlizeHelper final : public UObject
{
public:
	class FText                                   String2TextProperty;                               // 0x0028(0x0010)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6CacheDataTextSerlizeHelper">();
	}
	static class UX6CacheDataTextSerlizeHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6CacheDataTextSerlizeHelper>();
	}
};
static_assert(alignof(UX6CacheDataTextSerlizeHelper) == 0x000008, "Wrong alignment on UX6CacheDataTextSerlizeHelper");
static_assert(sizeof(UX6CacheDataTextSerlizeHelper) == 0x000038, "Wrong size on UX6CacheDataTextSerlizeHelper");
static_assert(offsetof(UX6CacheDataTextSerlizeHelper, String2TextProperty) == 0x000028, "Member 'UX6CacheDataTextSerlizeHelper::String2TextProperty' has a wrong offset!");

}

