#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6ExportRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function X6ExportRuntime.X6ExportRefreshPointBase.CheckItem
// 0x0010 (0x0010 - 0x0000)
struct X6ExportRefreshPointBase_CheckItem final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ExportRefreshPointBase_CheckItem) == 0x000008, "Wrong alignment on X6ExportRefreshPointBase_CheckItem");
static_assert(sizeof(X6ExportRefreshPointBase_CheckItem) == 0x000010, "Wrong size on X6ExportRefreshPointBase_CheckItem");
static_assert(offsetof(X6ExportRefreshPointBase_CheckItem, ReturnValue) == 0x000000, "Member 'X6ExportRefreshPointBase_CheckItem::ReturnValue' has a wrong offset!");

// Function X6ExportRuntime.X6ExportRefreshPointBase.GetChildItemList
// 0x0010 (0x0010 - 0x0000)
struct X6ExportRefreshPointBase_GetChildItemList final
{
public:
	TArray<class AX6ExportBaseActor*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ExportRefreshPointBase_GetChildItemList) == 0x000008, "Wrong alignment on X6ExportRefreshPointBase_GetChildItemList");
static_assert(sizeof(X6ExportRefreshPointBase_GetChildItemList) == 0x000010, "Wrong size on X6ExportRefreshPointBase_GetChildItemList");
static_assert(offsetof(X6ExportRefreshPointBase_GetChildItemList, ReturnValue) == 0x000000, "Member 'X6ExportRefreshPointBase_GetChildItemList::ReturnValue' has a wrong offset!");

// Function X6ExportRuntime.X6ExportToolRuntimeFunctionLibrary.GetAutoAssignedHomePoint
// 0x0010 (0x0010 - 0x0000)
struct X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint final
{
public:
	class APaperGamesSEMDataHostBase*             Host;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint) == 0x000008, "Wrong alignment on X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint");
static_assert(sizeof(X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint) == 0x000010, "Wrong size on X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint");
static_assert(offsetof(X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint, Host) == 0x000000, "Member 'X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint::Host' has a wrong offset!");
static_assert(offsetof(X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint, ReturnValue) == 0x000008, "Member 'X6ExportToolRuntimeFunctionLibrary_GetAutoAssignedHomePoint::ReturnValue' has a wrong offset!");

// Function X6ExportRuntime.X6ExportToolRuntimeFunctionLibrary.GetSpawnerID
// 0x0010 (0x0010 - 0x0000)
struct X6ExportToolRuntimeFunctionLibrary_GetSpawnerID final
{
public:
	class APaperGamesSEMDataHostBase*             Host;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6ExportToolRuntimeFunctionLibrary_GetSpawnerID) == 0x000008, "Wrong alignment on X6ExportToolRuntimeFunctionLibrary_GetSpawnerID");
static_assert(sizeof(X6ExportToolRuntimeFunctionLibrary_GetSpawnerID) == 0x000010, "Wrong size on X6ExportToolRuntimeFunctionLibrary_GetSpawnerID");
static_assert(offsetof(X6ExportToolRuntimeFunctionLibrary_GetSpawnerID, Host) == 0x000000, "Member 'X6ExportToolRuntimeFunctionLibrary_GetSpawnerID::Host' has a wrong offset!");
static_assert(offsetof(X6ExportToolRuntimeFunctionLibrary_GetSpawnerID, ReturnValue) == 0x000008, "Member 'X6ExportToolRuntimeFunctionLibrary_GetSpawnerID::ReturnValue' has a wrong offset!");

// Function X6ExportRuntime.X6SEM_DynamicSplineComponent.AddInstanceComponentByActor
// 0x0008 (0x0008 - 0x0000)
struct X6SEM_DynamicSplineComponent_AddInstanceComponentByActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6SEM_DynamicSplineComponent_AddInstanceComponentByActor) == 0x000008, "Wrong alignment on X6SEM_DynamicSplineComponent_AddInstanceComponentByActor");
static_assert(sizeof(X6SEM_DynamicSplineComponent_AddInstanceComponentByActor) == 0x000008, "Wrong size on X6SEM_DynamicSplineComponent_AddInstanceComponentByActor");
static_assert(offsetof(X6SEM_DynamicSplineComponent_AddInstanceComponentByActor, Actor) == 0x000000, "Member 'X6SEM_DynamicSplineComponent_AddInstanceComponentByActor::Actor' has a wrong offset!");

// Function X6ExportRuntime.X6SEM_DynamicSplineComponent.RenameComponent
// 0x0010 (0x0010 - 0x0000)
struct X6SEM_DynamicSplineComponent_RenameComponent final
{
public:
	class FString                                 InNewName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6SEM_DynamicSplineComponent_RenameComponent) == 0x000008, "Wrong alignment on X6SEM_DynamicSplineComponent_RenameComponent");
static_assert(sizeof(X6SEM_DynamicSplineComponent_RenameComponent) == 0x000010, "Wrong size on X6SEM_DynamicSplineComponent_RenameComponent");
static_assert(offsetof(X6SEM_DynamicSplineComponent_RenameComponent, InNewName) == 0x000000, "Member 'X6SEM_DynamicSplineComponent_RenameComponent::InNewName' has a wrong offset!");

}

