#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Game

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "StructUtils_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TargetingSystem_structs.hpp"


namespace SDK
{

// Enum X6Game.ELookAtEventType
// NumValues: 0x0007
enum class ELookAtEventType : uint8
{
	Event_None                               = 0,
	Event_StimulatedByNikki                  = 1,
	Event_DialogRequest                      = 2,
	Event_TakePhotoRequest                   = 3,
	Event_FaceTowards                        = 4,
	Event_InteractiveIdleBreak               = 5,
	Event_MAX                                = 6,
};

// Enum X6Game.ELookAtUpdateMode
// NumValues: 0x0003
enum class ELookAtUpdateMode : uint8
{
	Static                                   = 0,
	Dynamic                                  = 1,
	ELookAtUpdateMode_MAX                    = 2,
};

// Enum X6Game.EPreProcessConditionType
// NumValues: 0x0005
enum class EPreProcessConditionType : uint8
{
	StimuliTag                               = 0,
	IsSourceInRange                          = 1,
	TriggerTiming                            = 2,
	IsInSight                                = 3,
	EPreProcessConditionType_MAX             = 4,
};

// Enum X6Game.EX6InputTouchEvent
// NumValues: 0x0005
enum class EX6InputTouchEvent : uint8
{
	X6ITE_Pressed                            = 0,
	X6ITE_Released                           = 1,
	X6ITE_Moved                              = 2,
	X6ITE_Canceled                           = 3,
	X6ITE_MAX                                = 4,
};

// Enum X6Game.EX6InputDeviceKeyType
// NumValues: 0x0006
enum class EX6InputDeviceKeyType : uint8
{
	None                                     = 0,
	Keyboard                                 = 1,
	Mouse                                    = 2,
	GamePad                                  = 3,
	TouchScreen                              = 4,
	EX6InputDeviceKeyType_MAX                = 5,
};

// Enum X6Game.EGroundFlyMovementMode
// NumValues: 0x0006
enum class EGroundFlyMovementMode : uint8
{
	Default                                  = 0,
	GroundFly                                = 1,
	GroundFlyCustomHeight                    = 2,
	Land                                     = 3,
	Fly                                      = 4,
	EGroundFlyMovementMode_MAX               = 5,
};

// Enum X6Game.ECharacterSituationType
// NumValues: 0x0007
enum class ECharacterSituationType : uint8
{
	ECharacterSituationType_None             = 0,
	ECharacterSituationType_InWater          = 1,
	ECharacterSituationType_OnDynamicMovementBase = 2,
	ECharacterSituationType_InRain           = 3,
	ECharacterSituationType_TakingWoolenHeart = 4,
	ECharacterSituationType_Leisure          = 5,
	ECharacterSituationType_MAX              = 6,
};

// Enum X6Game.EFootstepEffectEnvironmentType
// NumValues: 0x0003
enum class EFootstepEffectEnvironmentType : uint8
{
	Default                                  = 0,
	Wet                                      = 1,
	EFootstepEffectEnvironmentType_MAX       = 2,
};

// Enum X6Game.EFootstepEffectShoeType
// NumValues: 0x0007
enum class EFootstepEffectShoeType : uint8
{
	BareFoot                                 = 0,
	Flattie                                  = 1,
	LowHeel                                  = 2,
	MidHeel                                  = 3,
	HighHeel                                 = 4,
	SuperHighHeel                            = 5,
	EFootstepEffectShoeType_MAX              = 6,
};

// Enum X6Game.EFootstepAnimationType
// NumValues: 0x000B
enum class EFootstepAnimationType : uint8
{
	None                                     = 0,
	JumpStart                                = 1,
	JumpStop                                 = 2,
	RunHeavy                                 = 3,
	RunLight                                 = 4,
	Bike_Loop                                = 5,
	Bike_Braking                             = 6,
	Bike_JumpFront                           = 7,
	Bike_JumpRear                            = 8,
	Bike_Landing                             = 9,
	EFootstepAnimationType_MAX               = 10,
};

// Enum X6Game.ELookAtMethod
// NumValues: 0x0004
enum class ELookAtMethod : uint8
{
	LookAtNone                               = 0,
	LookAtActor                              = 1,
	LookAtLocation                           = 2,
	ELookAtMethod_MAX                        = 3,
};

// Enum X6Game.ENikkiJumpState
// NumValues: 0x0005
enum class ENikkiJumpState : uint8
{
	ENJS_NONE                                = 0,
	ENJS_TAKEOFF                             = 1,
	ENJS_FLOAT                               = 2,
	ENJS_FALL                                = 3,
	ENJS_MAX                                 = 4,
};

// Enum X6Game.ENikkiJumpState_TakeOff
// NumValues: 0x0003
enum class ENikkiJumpState_TakeOff : uint8
{
	ENJS_TO_TAKEOFF                          = 0,
	ENJS_TO_VAULT                            = 1,
	ENJS_TO_MAX                              = 2,
};

// Enum X6Game.ENikkiJumpState_Fall
// NumValues: 0x0003
enum class ENikkiJumpState_Fall : uint8
{
	ENJS_F_TAKEOFF                           = 0,
	ENJS_F_VAULT                             = 1,
	ENJS_F_MAX                               = 2,
};

// Enum X6Game.EEaseMode
// NumValues: 0x0006
enum class EEaseMode : uint8
{
	LinearIn                                 = 0,
	QuadEaseIn                               = 1,
	QuadEaseOut                              = 2,
	CubicEaseIn                              = 3,
	CubicEaseOut                             = 4,
	EEaseMode_MAX                            = 5,
};

// Enum X6Game.ERuleTriggerTiming
// NumValues: 0x0004
enum class ERuleTriggerTiming : uint8
{
	OnRulePass                               = 0,
	OnFirstEnterRange                        = 1,
	OnFirstLeaveRange                        = 2,
	ERuleTriggerTiming_MAX                   = 3,
};

// Enum X6Game.ETargetSwitchMode
// NumValues: 0x0006
enum class ETargetSwitchMode : uint8
{
	TargetSwitchMode_None                    = 0,
	TargetSwitchMode_ActiveTryLocking        = 1,
	TargetSwitchMode_PlaySkill               = 2,
	TargetSwitchMode_Attacked                = 3,
	TargetSwitchMode_Death                   = 4,
	TargetSwitchMode_MAX                     = 5,
};

// Enum X6Game.EVisibilityClipMode
// NumValues: 0x0003
enum class EVisibilityClipMode : uint8
{
	OutOfViewport                            = 0,
	BelowViewport                            = 1,
	EVisibilityClipMode_MAX                  = 2,
};

// Enum X6Game.ESenseShapeProperty
// NumValues: 0x0007
enum class ESenseShapeProperty : uint8
{
	Radius                                   = 0,
	LostRadius                               = 1,
	Degrees                                  = 2,
	LostDegrees                              = 3,
	Height                                   = 4,
	LostHeight                               = 5,
	ESenseShapeProperty_MAX                  = 6,
};

// Enum X6Game.EX6AISenseSightResultType
// NumValues: 0x0004
enum class EX6AISenseSightResultType : uint8
{
	InSight                                  = 0,
	OutSight                                 = 1,
	TraceHit                                 = 2,
	EX6AISenseSightResultType_MAX            = 3,
};

// Enum X6Game.EX6ArcOrientation
// NumValues: 0x0005
enum class EX6ArcOrientation : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	EX6ArcOrientation_MAX                    = 4,
};

// Enum X6Game.EX6AsyncTraceType
// NumValues: 0x0004
enum class EX6AsyncTraceType : uint8
{
	ATT_FastCheck                            = 0,
	ATT_Single                               = 1,
	ATT_Multi                                = 2,
	ATT_MAX                                  = 3,
};

// Enum X6Game.ETrackBehaviourType
// NumValues: 0x0005
enum class ETrackBehaviourType : uint8
{
	OneShot                                  = 0,
	OneShot_Reverse                          = 1,
	Loop_Reset                               = 2,
	PingPong                                 = 3,
	ETrackBehaviourType_MAX                  = 4,
};

// Enum X6Game.EInitializationMode
// NumValues: 0x0003
enum class EInitializationMode : uint8
{
	BySplineInputKey                         = 0,
	BySplineIndex                            = 1,
	EInitializationMode_MAX                  = 2,
};

// Enum X6Game.EX6BulletClass
// NumValues: 0x0004
enum class EX6BulletClass : uint8
{
	BC_Default                               = 0,
	EffectBullet                             = 1,
	EffectFlyItem                            = 2,
	EX6BulletClass_MAX                       = 3,
};

// Enum X6Game.EActorBuoyancyState
// NumValues: 0x0007
enum class EActorBuoyancyState : uint8
{
	EBuoyancyState_None                      = 0,
	EBuoyancyState_EnteringWater             = 1,
	EBuoyancyState_FloatOnWater              = 2,
	EBuoyancyState_FloatInWater              = 3,
	EBuoyancyState_StayAtWaterBottom         = 4,
	EBuoyancyState_FrozenByWaterIce          = 5,
	EBuoyancyState_MAX                       = 6,
};

// Enum X6Game.ESimulateWaterFlowType
// NumValues: 0x0005
enum class ESimulateWaterFlowType : uint8
{
	EWaterFlow_None                          = 0,
	EWaterFlow_TowardToTargetPoint           = 1,
	EWaterFlow_LeaveFromPoint                = 2,
	EWaterFlow_FlowAlongLine                 = 3,
	EWaterFlow_MAX                           = 4,
};

// Enum X6Game.EPlayerCameraWorkingState
// NumValues: 0x0003
enum class EPlayerCameraWorkingState : uint8
{
	ECameraState_None                        = 0,
	ECameraState_FocusOnActor                = 1,
	ECameraState_Max                         = 2,
};

// Enum X6Game.EPlayerCameraFocusType
// NumValues: 0x0007
enum class EPlayerCameraFocusType : uint8
{
	EFocus_None                              = 0,
	EFocus_LookAtStatically                  = 1,
	EFocus_LookAtShake                       = 2,
	EFocus_LookAtInCircleTrack               = 3,
	EFocus_LookAtMoveForward                 = 4,
	EFocus_LookAtZoomInOut                   = 5,
	EFocus_Max                               = 6,
};

// Enum X6Game.EPlayerCameraFocusBlendType
// NumValues: 0x0004
enum class EPlayerCameraFocusBlendType : uint8
{
	EFocusBlend_None                         = 0,
	EFocusBlend_InTime                       = 1,
	EFocusBlend_AtSpeed                      = 2,
	EFocusBlend_Max                          = 3,
};

// Enum X6Game.EPlayerCameraState
// NumValues: 0x0005
enum class EPlayerCameraState : uint8
{
	Idle                                     = 0,
	Sprint                                   = 1,
	Targeting                                = 2,
	SuperSkill                               = 3,
	EPlayerCameraState_MAX                   = 4,
};

// Enum X6Game.EBlendFunction
// NumValues: 0x0006
enum class EBlendFunction : uint8
{
	Cubic                                    = 0,
	EaseIn                                   = 1,
	EaseOut                                  = 2,
	EaseInOut                                = 3,
	Curve                                    = 4,
	EBlendFunction_MAX                       = 5,
};

// Enum X6Game.EX6ComponentRepInfoResolveMethod
// NumValues: 0x0004
enum class EX6ComponentRepInfoResolveMethod : uint32
{
	None                                     = 0,
	Path                                     = 1,
	OwnerSpawnerIDAndName                    = 2,
	EX6ComponentRepInfoResolveMethod_MAX     = 3,
};

// Enum X6Game.EBushType
// NumValues: 0x0005
enum class EBushType : uint8
{
	None                                     = 0,
	SmallBush                                = 1,
	BigBush                                  = 2,
	FlowerBush                               = 3,
	EBushType_MAX                            = 4,
};

// Enum X6Game.EX6CustomMovementMode
// NumValues: 0x0004
enum class EX6CustomMovementMode : uint8
{
	EX6CustomMove_None                       = 0,
	EX6CustomMove_EmotionPerformance         = 1,
	EX6CustomMove_Frozen                     = 2,
	EX6CustomMove_MAX                        = 3,
};

// Enum X6Game.EGameSavedDirType
// NumValues: 0x0003
enum class EGameSavedDirType : uint8
{
	Root                                     = 0,
	Temp                                     = 1,
	EGameSavedDirType_MAX                    = 2,
};

// Enum X6Game.EFollowSplineState
// NumValues: 0x000A
enum class EFollowSplineState : uint8
{
	Idle                                     = 0,
	Prepare                                  = 1,
	Start                                    = 2,
	Move                                     = 3,
	Stop                                     = 4,
	ShowTime                                 = 5,
	ReactToNikki                             = 6,
	End                                      = 7,
	WaitingReturnStart                       = 8,
	EFollowSplineState_MAX                   = 9,
};

// Enum X6Game.EMovingState
// NumValues: 0x0004
enum class EMovingState : uint8
{
	Center                                   = 0,
	Offset                                   = 1,
	ReturnCenter                             = 2,
	EMovingState_MAX                         = 3,
};

// Enum X6Game.EX6AbilityActivationPolicy
// NumValues: 0x0005
enum class EX6AbilityActivationPolicy : uint8
{
	OnInputTriggered                         = 0,
	OnSpawn                                  = 1,
	OnInputReleaseMonitor                    = 2,
	OnInputTimeoutMonitor                    = 3,
	EX6AbilityActivationPolicy_MAX           = 4,
};

// Enum X6Game.EX6BulletDestroyType
// NumValues: 0x0007
enum class EX6BulletDestroyType : uint8
{
	None                                     = 0,
	HitDestroy                               = 1,
	TimeOutDestroy                           = 2,
	StaticCollisionDestroy                   = 3,
	CollisionBulletDestroy                   = 4,
	CollisionSummonActor                     = 5,
	EX6BulletDestroyType_MAX                 = 6,
};

// Enum X6Game.ETraceSelect
// NumValues: 0x0009
enum class ETraceSelect : uint8
{
	LineTraceSingle                          = 0,
	LineTraceMulti                           = 1,
	SphereTraceSingle                        = 2,
	SphereTraceMulti                         = 3,
	BoxTraceSingle                           = 4,
	BoxTraceMulti                            = 5,
	CapsuleTraceSingle                       = 6,
	CapsuleTraceMulti                        = 7,
	ETraceSelect_MAX                         = 8,
};

// Enum X6Game.EFilterOutLineType
// NumValues: 0x0004
enum class EFilterOutLineType : uint8
{
	AlwaysAimingType                         = 0,
	ChargeUpPreAimingType                    = 1,
	ChargeUpFinishAimingType                 = 2,
	EFilterOutLineType_MAX                   = 3,
};

// Enum X6Game.EOutLineEffectType
// NumValues: 0x0004
enum class EOutLineEffectType : uint8
{
	WholeOutlineType                         = 0,
	StencilGradientOutlineType               = 1,
	StencilInvalidOutlineType                = 2,
	EOutLineEffectType_MAX                   = 3,
};

// Enum X6Game.EMovementBlockedByType
// NumValues: 0x0004
enum class EMovementBlockedByType : uint8
{
	MOVEBLOCKEDBY_None                       = 0,
	MOVEBLOCKEDBY_Lower                      = 1,
	MOVEBLOCKEDBY_Higher                     = 2,
	MOVEBLOCKEDBY_MAX                        = 3,
};

// Enum X6Game.EHandHeldObjType
// NumValues: 0x0004
enum class EHandHeldObjType : uint8
{
	EHandHeldObjType_Custom                  = 0,
	EHandHeldObjType_StaticMesh              = 1,
	EHandHeldObjType_SkeletalMesh            = 2,
	EHandHeldObjType_MAX                     = 3,
};

// Enum X6Game.EBuffDurationType
// NumValues: 0x0004
enum class EBuffDurationType : uint8
{
	Instant                                  = 0,
	Infinite                                 = 1,
	HasDuration                              = 2,
	EBuffDurationType_MAX                    = 3,
};

// Enum X6Game.ERegularLocomotionType
// NumValues: 0x0006
enum class ERegularLocomotionType : uint8
{
	EMovementType_None                       = 0,
	EMovementType_Walking                    = 1,
	EMovementType_Running                    = 2,
	EMovementType_Sprinting                  = 3,
	EMovementType_MAX                        = 4,
	Max                                      = 5,
};

// Enum X6Game.EPlayerRegularForbidInputType
// NumValues: 0x0006
enum class EPlayerRegularForbidInputType : uint8
{
	Common                                   = 0,
	Interactive                              = 1,
	AdjustTransform                          = 2,
	Mantle                                   = 3,
	Skill                                    = 4,
	EPlayerRegularForbidInputType_MAX        = 5,
};

// Enum X6Game.ERegularFloatingJumpStage
// NumValues: 0x0006
enum class ERegularFloatingJumpStage : uint8
{
	OnLand                                   = 0,
	Jump                                     = 1,
	Fall                                     = 2,
	Crash                                    = 3,
	Float                                    = 4,
	ERegularFloatingJumpStage_MAX            = 5,
};

// Enum X6Game.ERegularJumpActionType
// NumValues: 0x0005
enum class ERegularJumpActionType : uint8
{
	Jump                                     = 0,
	Rejump                                   = 1,
	Float                                    = 2,
	ReleaseToFall                            = 3,
	ERegularJumpActionType_MAX               = 4,
};

// Enum X6Game.ERegularJumpMode
// NumValues: 0x0006
enum class ERegularJumpMode : uint8
{
	Normal                                   = 0,
	Mantle                                   = 1,
	WalkingOffLedge                          = 2,
	LandingCache                             = 3,
	BeingLaunched                            = 4,
	ERegularJumpMode_MAX                     = 5,
};

// Enum X6Game.ERegularPlaySkillMovementType
// NumValues: 0x0006
enum class ERegularPlaySkillMovementType : uint8
{
	None                                     = 0,
	SlowDown                                 = 1,
	Stop                                     = 2,
	JustStopZ                                = 3,
	Crash                                    = 4,
	ERegularPlaySkillMovementType_MAX        = 5,
};

// Enum X6Game.EX6EnvResponseType
// NumValues: 0x0005
enum class EX6EnvResponseType : uint8
{
	None                                     = 0,
	IdleBreak                                = 1,
	OverlayBlend                             = 2,
	Montage                                  = 3,
	EX6EnvResponseType_MAX                   = 4,
};

// Enum X6Game.EX6InteractiveIdleBreakParticipantFacingDirection
// NumValues: 0x0004
enum class EX6InteractiveIdleBreakParticipantFacingDirection : uint8
{
	None                                     = 0,
	TowardsInitiator                         = 1,
	TowardsInitiatorForward                  = 2,
	EX6InteractiveIdleBreakParticipantFacingDirection_MAX = 3,
};

// Enum X6Game.EGlobalIlluminationMethod
// NumValues: 0x0004
enum class EGlobalIlluminationMethod : uint8
{
	None                                     = 0,
	Enlighten                                = 1,
	Lumen                                    = 2,
	EGlobalIlluminationMethod_MAX            = 3,
};

// Enum X6Game.ESceneDetailMode
// NumValues: 0x0005
enum class ESceneDetailMode : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Epic                                     = 3,
	ESceneDetailMode_MAX                     = 4,
};

// Enum X6Game.EGUSAntiAliasingMethod
// NumValues: 0x000A
enum class EGUSAntiAliasingMethod : uint8
{
	Off                                      = 0,
	FXAA                                     = 1,
	TAA                                      = 2,
	MSAA                                     = 3,
	TSR                                      = 4,
	DLSS                                     = 5,
	FSR3                                     = 6,
	MobileFSR2                               = 7,
	MobileGSR2                               = 8,
	EGUSAntiAliasingMethod_MAX               = 9,
};

// Enum X6Game.EUpScaleMode
// NumValues: 0x0003
enum class EUpScaleMode : uint8
{
	Default                                  = 0,
	Custom                                   = 1,
	EUpScaleMode_MAX                         = 2,
};

// Enum X6Game.ET2StaticNpcDistanceLevel
// NumValues: 0x0007
enum class ET2StaticNpcDistanceLevel : uint8
{
	E_DistanceNone                           = 0,
	E_ClosestDistance                        = 1,
	E_MiddleDistance                         = 2,
	E_FarDistance                            = 3,
	E_FarAwayDistance                        = 4,
	E_DistanceMax                            = 5,
	E_MAX                                    = 6,
};

// Enum X6Game.EX6GameArea
// NumValues: 0x0003
enum class EX6GameArea : uint8
{
	Cn                                       = 0,
	Oversea                                  = 1,
	EX6GameArea_MAX                          = 2,
};

// Enum X6Game.EX6DirectMoveCheckMode
// NumValues: 0x0003
enum class EX6DirectMoveCheckMode : uint8
{
	LineCheck                                = 0,
	CapsuleCheck                             = 1,
	EX6DirectMoveCheckMode_MAX               = 2,
};

// Enum X6Game.EX6AIMoveRequestFlag
// NumValues: 0x0007
enum class EX6AIMoveRequestFlag : uint8
{
	None                                     = 0,
	KeepHeight                               = 1,
	UpdatePath                               = 2,
	DisableForceRepath                       = 4,
	SimulatePath                             = 8,
	FirstScriptFlagShift                     = 9,
	EX6AIMoveRequestFlag_MAX                 = 10,
};

// Enum X6Game.EX6FunctionExec
// NumValues: 0x0003
enum class EX6FunctionExec : uint8
{
	EAFE_Valid                               = 0,
	EAFE_InValid                             = 1,
	EAFE_MAX                                 = 2,
};

// Enum X6Game.EMantleTypeNative
// NumValues: 0x0006
enum class EMantleTypeNative : uint8
{
	NoMantle                                 = 0,
	LowMantle                                = 1,
	MidMantle                                = 2,
	HighMantle                               = 3,
	TransitionMantle                         = 4,
	EMantleTypeNative_MAX                    = 5,
};

// Enum X6Game.EX6TargetingAOEShape
// NumValues: 0x0006
enum class EX6TargetingAOEShape : uint8
{
	Box                                      = 0,
	Cylinder                                 = 1,
	Sphere                                   = 2,
	Capsule                                  = 3,
	SourceComponent                          = 4,
	EX6TargetingAOEShape_MAX                 = 5,
};

// Enum X6Game.EX6SystemMsgType
// NumValues: 0x0004
enum class EX6SystemMsgType : uint8
{
	StoreEmpty                               = 0,
	CameraNotConnected                       = 1,
	CommunicationRestriction                 = 2,
	EX6SystemMsgType_MAX                     = 3,
};

// Enum X6Game.EX6CommerceType
// NumValues: 0x0002
enum class EX6CommerceType : uint8
{
	Premium                                  = 0,
	EX6CommerceType_MAX                      = 1,
};

// Enum X6Game.ECarriageMovingState
// NumValues: 0x0003
enum class ECarriageMovingState : uint8
{
	Center                                   = 0,
	ReturnCenter                             = 1,
	ECarriageMovingState_MAX                 = 2,
};

// Enum X6Game.ECarriageFollowSplineState
// NumValues: 0x0008
enum class ECarriageFollowSplineState : uint8
{
	Idle                                     = 0,
	Prepare                                  = 1,
	Start                                    = 2,
	Move                                     = 3,
	Stop                                     = 4,
	PauseMove                                = 5,
	End                                      = 6,
	ECarriageFollowSplineState_MAX           = 7,
};

// Enum X6Game.EX6AbilityActivationGroup
// NumValues: 0x0004
enum class EX6AbilityActivationGroup : uint8
{
	Independent                              = 0,
	Exclusive_Replaceable                    = 1,
	Exclusive_Blocking                       = 2,
	MAX                                      = 3,
};

// ScriptStruct X6Game.DaMiaoInAirJumpAnimSet
// 0x0010 (0x0010 - 0x0000)
struct FDaMiaoInAirJumpAnimSet final
{
public:
	class UAnimSequence*                          JumpStart;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          JumpStartLoop;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDaMiaoInAirJumpAnimSet) == 0x000008, "Wrong alignment on FDaMiaoInAirJumpAnimSet");
static_assert(sizeof(FDaMiaoInAirJumpAnimSet) == 0x000010, "Wrong size on FDaMiaoInAirJumpAnimSet");
static_assert(offsetof(FDaMiaoInAirJumpAnimSet, JumpStart) == 0x000000, "Member 'FDaMiaoInAirJumpAnimSet::JumpStart' has a wrong offset!");
static_assert(offsetof(FDaMiaoInAirJumpAnimSet, JumpStartLoop) == 0x000008, "Member 'FDaMiaoInAirJumpAnimSet::JumpStartLoop' has a wrong offset!");

// ScriptStruct X6Game.LookAtParams
// 0x000C (0x000C - 0x0000)
struct FLookAtParams final
{
public:
	ELookAtEventType                              LookAtEventType;                                   // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideTriggerTurnAngle;                          // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KeepLookAtAngle;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLookAtParams) == 0x000004, "Wrong alignment on FLookAtParams");
static_assert(sizeof(FLookAtParams) == 0x00000C, "Wrong size on FLookAtParams");
static_assert(offsetof(FLookAtParams, LookAtEventType) == 0x000000, "Member 'FLookAtParams::LookAtEventType' has a wrong offset!");
static_assert(offsetof(FLookAtParams, OverrideTriggerTurnAngle) == 0x000004, "Member 'FLookAtParams::OverrideTriggerTurnAngle' has a wrong offset!");
static_assert(offsetof(FLookAtParams, KeepLookAtAngle) == 0x000008, "Member 'FLookAtParams::KeepLookAtAngle' has a wrong offset!");

// ScriptStruct X6Game.FoliageGeometryInfo
// 0x0080 (0x0080 - 0x0000)
struct FFoliageGeometryInfo final
{
public:
	struct FTransform                             InstanceTransform;                                 // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InstanceBoxExtent;                                 // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFoliageGeometryInfo) == 0x000010, "Wrong alignment on FFoliageGeometryInfo");
static_assert(sizeof(FFoliageGeometryInfo) == 0x000080, "Wrong size on FFoliageGeometryInfo");
static_assert(offsetof(FFoliageGeometryInfo, InstanceTransform) == 0x000000, "Member 'FFoliageGeometryInfo::InstanceTransform' has a wrong offset!");
static_assert(offsetof(FFoliageGeometryInfo, InstanceBoxExtent) == 0x000060, "Member 'FFoliageGeometryInfo::InstanceBoxExtent' has a wrong offset!");

// ScriptStruct X6Game.BipedalGroundedMoveAnimSet
// 0x0048 (0x0048 - 0x0000)
struct FBipedalGroundedMoveAnimSet final
{
public:
	class UBlendSpace*                            WalkJogBlendSpace;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      WalkInPlace;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Walk;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardWalkSpeed;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Jog;                                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardJogSpeed;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardSprintSpeed;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          Sprint;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            JogLeanAdditiveBlendSpace;                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                            SprintLeanAdditiveBlendSpace;                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBipedalGroundedMoveAnimSet) == 0x000008, "Wrong alignment on FBipedalGroundedMoveAnimSet");
static_assert(sizeof(FBipedalGroundedMoveAnimSet) == 0x000048, "Wrong size on FBipedalGroundedMoveAnimSet");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, WalkJogBlendSpace) == 0x000000, "Member 'FBipedalGroundedMoveAnimSet::WalkJogBlendSpace' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, WalkInPlace) == 0x000008, "Member 'FBipedalGroundedMoveAnimSet::WalkInPlace' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, Walk) == 0x000010, "Member 'FBipedalGroundedMoveAnimSet::Walk' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, StandardWalkSpeed) == 0x000018, "Member 'FBipedalGroundedMoveAnimSet::StandardWalkSpeed' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, Jog) == 0x000020, "Member 'FBipedalGroundedMoveAnimSet::Jog' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, StandardJogSpeed) == 0x000028, "Member 'FBipedalGroundedMoveAnimSet::StandardJogSpeed' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, StandardSprintSpeed) == 0x00002C, "Member 'FBipedalGroundedMoveAnimSet::StandardSprintSpeed' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, Sprint) == 0x000030, "Member 'FBipedalGroundedMoveAnimSet::Sprint' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, JogLeanAdditiveBlendSpace) == 0x000038, "Member 'FBipedalGroundedMoveAnimSet::JogLeanAdditiveBlendSpace' has a wrong offset!");
static_assert(offsetof(FBipedalGroundedMoveAnimSet, SprintLeanAdditiveBlendSpace) == 0x000040, "Member 'FBipedalGroundedMoveAnimSet::SprintLeanAdditiveBlendSpace' has a wrong offset!");

// ScriptStruct X6Game.RMBehaviorNodeInterface
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FRMBehaviorNodeInterface
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRMBehaviorNodeInterface) == 0x000008, "Wrong alignment on FRMBehaviorNodeInterface");
static_assert(sizeof(FRMBehaviorNodeInterface) == 0x000008, "Wrong size on FRMBehaviorNodeInterface");

// ScriptStruct X6Game.RMBehavior_OnGround_StartTurnAroundMovement
// 0x0008 (0x0010 - 0x0008)
struct FRMBehavior_OnGround_StartTurnAroundMovement final : public FRMBehaviorNodeInterface
{
public:
	class AX6PlayerCameraManager*                 CurPlayerCameraManager;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FRMBehavior_OnGround_StartTurnAroundMovement) == 0x000008, "Wrong alignment on FRMBehavior_OnGround_StartTurnAroundMovement");
static_assert(sizeof(FRMBehavior_OnGround_StartTurnAroundMovement) == 0x000010, "Wrong size on FRMBehavior_OnGround_StartTurnAroundMovement");
static_assert(offsetof(FRMBehavior_OnGround_StartTurnAroundMovement, CurPlayerCameraManager) == 0x000008, "Member 'FRMBehavior_OnGround_StartTurnAroundMovement::CurPlayerCameraManager' has a wrong offset!");

// ScriptStruct X6Game.FootIKFeatureTargetData
// 0x0160 (0x0160 - 0x0000)
struct FFootIKFeatureTargetData final
{
public:
	struct FVector                                PelvisTargetOffset;                                // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisAlpha;                                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftFootLockAlpha;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftFootIKAlpha;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeftFootTargetOffset;                              // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LeftFootOffset;                                    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LeftFootRotationOffset;                            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LeftFootLockLocation;                              // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               LeftFootLockRotation;                              // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LeftFootWorldOffsetLocation;                       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftFootInAir;                                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RightFootLockAlpha;                                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightFootIKAlpha;                                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RightFootTargetOffset;                             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightFootOffset;                                   // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RightFootRotationOffset;                           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RightFootLockLocation;                             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RightFootLockRotation;                             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RightFootWorldOffsetLocation;                      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightFootInAir;                                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFootIKFeatureTargetData) == 0x000008, "Wrong alignment on FFootIKFeatureTargetData");
static_assert(sizeof(FFootIKFeatureTargetData) == 0x000160, "Wrong size on FFootIKFeatureTargetData");
static_assert(offsetof(FFootIKFeatureTargetData, PelvisTargetOffset) == 0x000000, "Member 'FFootIKFeatureTargetData::PelvisTargetOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, PelvisAlpha) == 0x000018, "Member 'FFootIKFeatureTargetData::PelvisAlpha' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootLockAlpha) == 0x00001C, "Member 'FFootIKFeatureTargetData::LeftFootLockAlpha' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootIKAlpha) == 0x000020, "Member 'FFootIKFeatureTargetData::LeftFootIKAlpha' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootTargetOffset) == 0x000028, "Member 'FFootIKFeatureTargetData::LeftFootTargetOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootOffset) == 0x000040, "Member 'FFootIKFeatureTargetData::LeftFootOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootRotationOffset) == 0x000058, "Member 'FFootIKFeatureTargetData::LeftFootRotationOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootLockLocation) == 0x000070, "Member 'FFootIKFeatureTargetData::LeftFootLockLocation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootLockRotation) == 0x000088, "Member 'FFootIKFeatureTargetData::LeftFootLockRotation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, LeftFootWorldOffsetLocation) == 0x0000A0, "Member 'FFootIKFeatureTargetData::LeftFootWorldOffsetLocation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, bLeftFootInAir) == 0x0000B8, "Member 'FFootIKFeatureTargetData::bLeftFootInAir' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootLockAlpha) == 0x0000BC, "Member 'FFootIKFeatureTargetData::RightFootLockAlpha' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootIKAlpha) == 0x0000C0, "Member 'FFootIKFeatureTargetData::RightFootIKAlpha' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootTargetOffset) == 0x0000C8, "Member 'FFootIKFeatureTargetData::RightFootTargetOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootOffset) == 0x0000E0, "Member 'FFootIKFeatureTargetData::RightFootOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootRotationOffset) == 0x0000F8, "Member 'FFootIKFeatureTargetData::RightFootRotationOffset' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootLockLocation) == 0x000110, "Member 'FFootIKFeatureTargetData::RightFootLockLocation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootLockRotation) == 0x000128, "Member 'FFootIKFeatureTargetData::RightFootLockRotation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, RightFootWorldOffsetLocation) == 0x000140, "Member 'FFootIKFeatureTargetData::RightFootWorldOffsetLocation' has a wrong offset!");
static_assert(offsetof(FFootIKFeatureTargetData, bRightFootInAir) == 0x000158, "Member 'FFootIKFeatureTargetData::bRightFootInAir' has a wrong offset!");

// ScriptStruct X6Game.NikkiAroundMeshInfo
// 0x0010 (0x0010 - 0x0000)
struct FNikkiAroundMeshInfo final
{
public:
	TArray<struct FVector2D>                      Info;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNikkiAroundMeshInfo) == 0x000008, "Wrong alignment on FNikkiAroundMeshInfo");
static_assert(sizeof(FNikkiAroundMeshInfo) == 0x000010, "Wrong size on FNikkiAroundMeshInfo");
static_assert(offsetof(FNikkiAroundMeshInfo, Info) == 0x000000, "Member 'FNikkiAroundMeshInfo::Info' has a wrong offset!");

// ScriptStruct X6Game.LookAtRequestParams
// 0x0020 (0x0020 - 0x0000)
struct FLookAtRequestParams final
{
public:
	ELookAtUpdateMode                             LookAtUpdateMode;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PriorityOrder;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetSocketName;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyUseAOHead;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryToLookAtWhenOutOfBounds;                       // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomAOSmoothingTime;                            // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedTriggerTurn;                                  // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AOSmoothingTime;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideTriggerTurnInPlaceAngle;                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BlinkEyeWhenLargeOffset;                           // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForwardBaseOnNeckBone;                            // 0x001D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLookAtRequestParams) == 0x000004, "Wrong alignment on FLookAtRequestParams");
static_assert(sizeof(FLookAtRequestParams) == 0x000020, "Wrong size on FLookAtRequestParams");
static_assert(offsetof(FLookAtRequestParams, LookAtUpdateMode) == 0x000000, "Member 'FLookAtRequestParams::LookAtUpdateMode' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, PriorityOrder) == 0x000004, "Member 'FLookAtRequestParams::PriorityOrder' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, TargetSocketName) == 0x000008, "Member 'FLookAtRequestParams::TargetSocketName' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, bOnlyUseAOHead) == 0x000010, "Member 'FLookAtRequestParams::bOnlyUseAOHead' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, bTryToLookAtWhenOutOfBounds) == 0x000011, "Member 'FLookAtRequestParams::bTryToLookAtWhenOutOfBounds' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, bCustomAOSmoothingTime) == 0x000012, "Member 'FLookAtRequestParams::bCustomAOSmoothingTime' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, bNeedTriggerTurn) == 0x000013, "Member 'FLookAtRequestParams::bNeedTriggerTurn' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, AOSmoothingTime) == 0x000014, "Member 'FLookAtRequestParams::AOSmoothingTime' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, OverrideTriggerTurnInPlaceAngle) == 0x000018, "Member 'FLookAtRequestParams::OverrideTriggerTurnInPlaceAngle' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, BlinkEyeWhenLargeOffset) == 0x00001C, "Member 'FLookAtRequestParams::BlinkEyeWhenLargeOffset' has a wrong offset!");
static_assert(offsetof(FLookAtRequestParams, bForwardBaseOnNeckBone) == 0x00001D, "Member 'FLookAtRequestParams::bForwardBaseOnNeckBone' has a wrong offset!");

// ScriptStruct X6Game.QueryFlyingFollowPositionArgs
// 0x0038 (0x0038 - 0x0000)
struct FQueryFlyingFollowPositionArgs final
{
public:
	class FName                                   FollowSocket;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetToSocket;                                    // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFollowDistance;                                 // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredRelativeDegrees;                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumbersOfPoints;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalOffsetAngle;                               // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAvoidCamera;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraAvoidDegrees;                                // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FQueryFlyingFollowPositionArgs) == 0x000008, "Wrong alignment on FQueryFlyingFollowPositionArgs");
static_assert(sizeof(FQueryFlyingFollowPositionArgs) == 0x000038, "Wrong size on FQueryFlyingFollowPositionArgs");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, FollowSocket) == 0x000000, "Member 'FQueryFlyingFollowPositionArgs::FollowSocket' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, OffsetToSocket) == 0x000008, "Member 'FQueryFlyingFollowPositionArgs::OffsetToSocket' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, MaxFollowDistance) == 0x000020, "Member 'FQueryFlyingFollowPositionArgs::MaxFollowDistance' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, DesiredRelativeDegrees) == 0x000024, "Member 'FQueryFlyingFollowPositionArgs::DesiredRelativeDegrees' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, NumbersOfPoints) == 0x000028, "Member 'FQueryFlyingFollowPositionArgs::NumbersOfPoints' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, VerticalOffsetAngle) == 0x00002C, "Member 'FQueryFlyingFollowPositionArgs::VerticalOffsetAngle' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, bAvoidCamera) == 0x000030, "Member 'FQueryFlyingFollowPositionArgs::bAvoidCamera' has a wrong offset!");
static_assert(offsetof(FQueryFlyingFollowPositionArgs, CameraAvoidDegrees) == 0x000034, "Member 'FQueryFlyingFollowPositionArgs::CameraAvoidDegrees' has a wrong offset!");

// ScriptStruct X6Game.BipedalIdleAnimSet
// 0x0020 (0x0020 - 0x0000)
struct FBipedalIdleAnimSet final
{
public:
	class UAnimSequenceBase*                      IdleReady;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequenceBase*>              IdleBreakArray;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         IdleBreakInterval;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBipedalIdleAnimSet) == 0x000008, "Wrong alignment on FBipedalIdleAnimSet");
static_assert(sizeof(FBipedalIdleAnimSet) == 0x000020, "Wrong size on FBipedalIdleAnimSet");
static_assert(offsetof(FBipedalIdleAnimSet, IdleReady) == 0x000000, "Member 'FBipedalIdleAnimSet::IdleReady' has a wrong offset!");
static_assert(offsetof(FBipedalIdleAnimSet, IdleBreakArray) == 0x000008, "Member 'FBipedalIdleAnimSet::IdleBreakArray' has a wrong offset!");
static_assert(offsetof(FBipedalIdleAnimSet, IdleBreakInterval) == 0x000018, "Member 'FBipedalIdleAnimSet::IdleBreakInterval' has a wrong offset!");

// ScriptStruct X6Game.BipedalInAirAnimSet
// 0x0020 (0x0020 - 0x0000)
struct FBipedalInAirAnimSet final
{
public:
	class UAnimSequenceBase*                      Jump;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      FallLoop;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoopFallLoop;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      LandRecoveryAdditive;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBipedalInAirAnimSet) == 0x000008, "Wrong alignment on FBipedalInAirAnimSet");
static_assert(sizeof(FBipedalInAirAnimSet) == 0x000020, "Wrong size on FBipedalInAirAnimSet");
static_assert(offsetof(FBipedalInAirAnimSet, Jump) == 0x000000, "Member 'FBipedalInAirAnimSet::Jump' has a wrong offset!");
static_assert(offsetof(FBipedalInAirAnimSet, FallLoop) == 0x000008, "Member 'FBipedalInAirAnimSet::FallLoop' has a wrong offset!");
static_assert(offsetof(FBipedalInAirAnimSet, bLoopFallLoop) == 0x000010, "Member 'FBipedalInAirAnimSet::bLoopFallLoop' has a wrong offset!");
static_assert(offsetof(FBipedalInAirAnimSet, LandRecoveryAdditive) == 0x000018, "Member 'FBipedalInAirAnimSet::LandRecoveryAdditive' has a wrong offset!");

// ScriptStruct X6Game.BipedalLocomotionAnimSet
// 0x0088 (0x0088 - 0x0000)
struct FBipedalLocomotionAnimSet final
{
public:
	struct FBipedalIdleAnimSet                    IdleAnimSet;                                       // 0x0000(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBipedalInAirAnimSet                   InAirAnimSet;                                      // 0x0020(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBipedalGroundedMoveAnimSet            GroundedMoveAnimSet;                               // 0x0040(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBipedalLocomotionAnimSet) == 0x000008, "Wrong alignment on FBipedalLocomotionAnimSet");
static_assert(sizeof(FBipedalLocomotionAnimSet) == 0x000088, "Wrong size on FBipedalLocomotionAnimSet");
static_assert(offsetof(FBipedalLocomotionAnimSet, IdleAnimSet) == 0x000000, "Member 'FBipedalLocomotionAnimSet::IdleAnimSet' has a wrong offset!");
static_assert(offsetof(FBipedalLocomotionAnimSet, InAirAnimSet) == 0x000020, "Member 'FBipedalLocomotionAnimSet::InAirAnimSet' has a wrong offset!");
static_assert(offsetof(FBipedalLocomotionAnimSet, GroundedMoveAnimSet) == 0x000040, "Member 'FBipedalLocomotionAnimSet::GroundedMoveAnimSet' has a wrong offset!");

// ScriptStruct X6Game.FootprintConfig
// 0x0050 (0x0050 - 0x0000)
struct FFootprintConfig final
{
public:
	TMap<EFootstepEffectShoeType, TSoftObjectPtr<class UFootstepDecalConfigTemplate>> ShoeTypeMap;   // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFootprintConfig) == 0x000008, "Wrong alignment on FFootprintConfig");
static_assert(sizeof(FFootprintConfig) == 0x000050, "Wrong size on FFootprintConfig");
static_assert(offsetof(FFootprintConfig, ShoeTypeMap) == 0x000000, "Member 'FFootprintConfig::ShoeTypeMap' has a wrong offset!");

// ScriptStruct X6Game.FootstepEffectConfig
// 0x0078 (0x0078 - 0x0000)
struct FFootstepEffectConfig final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NSConfig;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFootprintConfig                       FootprintConfig;                                   // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFootstepEffectConfig) == 0x000008, "Wrong alignment on FFootstepEffectConfig");
static_assert(sizeof(FFootstepEffectConfig) == 0x000078, "Wrong size on FFootstepEffectConfig");
static_assert(offsetof(FFootstepEffectConfig, NSConfig) == 0x000000, "Member 'FFootstepEffectConfig::NSConfig' has a wrong offset!");
static_assert(offsetof(FFootstepEffectConfig, FootprintConfig) == 0x000028, "Member 'FFootstepEffectConfig::FootprintConfig' has a wrong offset!");

// ScriptStruct X6Game.FootstepEffectEnvironmentConfig
// 0x0050 (0x0050 - 0x0000)
struct FFootstepEffectEnvironmentConfig final
{
public:
	TMap<EFootstepEffectEnvironmentType, struct FFootstepEffectConfig> EnvironmentMap;               // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFootstepEffectEnvironmentConfig) == 0x000008, "Wrong alignment on FFootstepEffectEnvironmentConfig");
static_assert(sizeof(FFootstepEffectEnvironmentConfig) == 0x000050, "Wrong size on FFootstepEffectEnvironmentConfig");
static_assert(offsetof(FFootstepEffectEnvironmentConfig, EnvironmentMap) == 0x000000, "Member 'FFootstepEffectEnvironmentConfig::EnvironmentMap' has a wrong offset!");

// ScriptStruct X6Game.InWaterFootstepEffectConfig
// 0x0080 (0x0080 - 0x0000)
struct FInWaterFootstepEffectConfig final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NSConfig;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EPhysicalSurface, struct FFootprintConfig> FootprintConfigMap;                              // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bConstantEffect;                                   // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
