#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Game

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "TargetingSystem_structs.hpp"
#include "TargetingSystem_classes.hpp"
#include "X6Game_structs.hpp"
#include "X6Camera_structs.hpp"
#include "X6Camera_classes.hpp"
#include "X6Animation_structs.hpp"
#include "X6Animation_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MotionWarping_structs.hpp"
#include "MotionWarping_classes.hpp"
#include "NikkiPhysics_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "InputCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PaperPathFinding_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "PaperLuaFrameworkBase_classes.hpp"
#include "MovieScene_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "X6ExportRuntime_structs.hpp"
#include "UIPF_structs.hpp"
#include "StructUtils_structs.hpp"
#include "PaperLuaFrameworkApp_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class X6Game.ActorEventListener
// 0x0050 (0x0078 - 0x0028)
class UActorEventListener final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPooledActorDestroyed(class AActor* InActorAboutToDestroy);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorEventListener">();
	}
	static class UActorEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorEventListener>();
	}
};
static_assert(alignof(UActorEventListener) == 0x000008, "Wrong alignment on UActorEventListener");
static_assert(sizeof(UActorEventListener) == 0x000078, "Wrong size on UActorEventListener");

// Class X6Game.AsyncQueryPositionTask
// 0x0010 (0x0038 - 0x0028)
class UAsyncQueryPositionTask final : public UObject
{
public:
	TDelegate<void(const struct FVector& Position, const struct FVector& RelativePosition)> ReceiveFlyingFollowPosition; // 0x0028(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool QueryFlyingFollowPosition(class AActor* GoalActor, class AActor* FollowingActor, const struct FQueryFlyingFollowPositionArgs& Args);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncQueryPositionTask">();
	}
	static class UAsyncQueryPositionTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncQueryPositionTask>();
	}
};
static_assert(alignof(UAsyncQueryPositionTask) == 0x000008, "Wrong alignment on UAsyncQueryPositionTask");
static_assert(sizeof(UAsyncQueryPositionTask) == 0x000038, "Wrong size on UAsyncQueryPositionTask");
static_assert(offsetof(UAsyncQueryPositionTask, ReceiveFlyingFollowPosition) == 0x000028, "Member 'UAsyncQueryPositionTask::ReceiveFlyingFollowPosition' has a wrong offset!");

// Class X6Game.AISenseEvent_Blueprint
// 0x0008 (0x0030 - 0x0028)
class UAISenseEvent_Blueprint final : public UAISenseEvent
{
public:
	TSubclassOf<class UAISense>                   RouteSense;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISenseEvent_Blueprint">();
	}
	static class UAISenseEvent_Blueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseEvent_Blueprint>();
	}
};
static_assert(alignof(UAISenseEvent_Blueprint) == 0x000008, "Wrong alignment on UAISenseEvent_Blueprint");
static_assert(sizeof(UAISenseEvent_Blueprint) == 0x000030, "Wrong size on UAISenseEvent_Blueprint");
static_assert(offsetof(UAISenseEvent_Blueprint, RouteSense) == 0x000028, "Member 'UAISenseEvent_Blueprint::RouteSense' has a wrong offset!");

// Class X6Game.AnimNotifyState_AdjustmentBlendWarp
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_AdjustmentBlendWarp final : public UAnimNotifyState
{
public:
	class UMotionModifier_AdjustmentBlendWarp*    RootMotionModifier;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_AdjustmentBlendWarp">();
	}
	static class UAnimNotifyState_AdjustmentBlendWarp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_AdjustmentBlendWarp>();
	}
};
static_assert(alignof(UAnimNotifyState_AdjustmentBlendWarp) == 0x000008, "Wrong alignment on UAnimNotifyState_AdjustmentBlendWarp");
static_assert(sizeof(UAnimNotifyState_AdjustmentBlendWarp) == 0x000038, "Wrong size on UAnimNotifyState_AdjustmentBlendWarp");
static_assert(offsetof(UAnimNotifyState_AdjustmentBlendWarp, RootMotionModifier) == 0x000030, "Member 'UAnimNotifyState_AdjustmentBlendWarp::RootMotionModifier' has a wrong offset!");

// Class X6Game.AnimNotifyState_NoTransToMove
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_NoTransToMove final : public UAnimNotifyState
{
public:
	class FName                                   AnimInstanceTag;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_NoTransToMove">();
	}
	static class UAnimNotifyState_NoTransToMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_NoTransToMove>();
	}
};
static_assert(alignof(UAnimNotifyState_NoTransToMove) == 0x000008, "Wrong alignment on UAnimNotifyState_NoTransToMove");
static_assert(sizeof(UAnimNotifyState_NoTransToMove) == 0x000038, "Wrong size on UAnimNotifyState_NoTransToMove");
static_assert(offsetof(UAnimNotifyState_NoTransToMove, AnimInstanceTag) == 0x000030, "Member 'UAnimNotifyState_NoTransToMove::AnimInstanceTag' has a wrong offset!");

// Class X6Game.AnimNotifyState_SetActorEffect
// 0x0028 (0x0058 - 0x0030)
class UAnimNotifyState_SetActorEffect final : public UAnimNotifyState
{
public:
	class FName                                   ParamName;                                         // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ParamCurve;                                        // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SetActorEffect">();
	}
	static class UAnimNotifyState_SetActorEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SetActorEffect>();
	}
};
static_assert(alignof(UAnimNotifyState_SetActorEffect) == 0x000008, "Wrong alignment on UAnimNotifyState_SetActorEffect");
static_assert(sizeof(UAnimNotifyState_SetActorEffect) == 0x000058, "Wrong size on UAnimNotifyState_SetActorEffect");
static_assert(offsetof(UAnimNotifyState_SetActorEffect, ParamName) == 0x000030, "Member 'UAnimNotifyState_SetActorEffect::ParamName' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_SetActorEffect, ParamCurve) == 0x000038, "Member 'UAnimNotifyState_SetActorEffect::ParamCurve' has a wrong offset!");

// Class X6Game.AnimNotifyState_SetCustomDissolve
// 0x0028 (0x0058 - 0x0030)
class UAnimNotifyState_SetCustomDissolve final : public UAnimNotifyState
{
public:
	class UCurveFloat*                            ParamCurve;                                        // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SetCustomDissolve">();
	}
	static class UAnimNotifyState_SetCustomDissolve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SetCustomDissolve>();
	}
};
static_assert(alignof(UAnimNotifyState_SetCustomDissolve) == 0x000008, "Wrong alignment on UAnimNotifyState_SetCustomDissolve");
static_assert(sizeof(UAnimNotifyState_SetCustomDissolve) == 0x000058, "Wrong size on UAnimNotifyState_SetCustomDissolve");
static_assert(offsetof(UAnimNotifyState_SetCustomDissolve, ParamCurve) == 0x000030, "Member 'UAnimNotifyState_SetCustomDissolve::ParamCurve' has a wrong offset!");

// Class X6Game.AnimNotifyState_SkillHitFrame
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SkillHitFrame final : public UAnimNotifyState
{
public:
	TArray<class UX6AbilityModifierBase*>         Modifies;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SkillHitFrame">();
	}
	static class UAnimNotifyState_SkillHitFrame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SkillHitFrame>();
	}
};
static_assert(alignof(UAnimNotifyState_SkillHitFrame) == 0x000008, "Wrong alignment on UAnimNotifyState_SkillHitFrame");
static_assert(sizeof(UAnimNotifyState_SkillHitFrame) == 0x000040, "Wrong size on UAnimNotifyState_SkillHitFrame");
static_assert(offsetof(UAnimNotifyState_SkillHitFrame, Modifies) == 0x000030, "Member 'UAnimNotifyState_SkillHitFrame::Modifies' has a wrong offset!");

// Class X6Game.AnimNotify_PlayFootstepEffect
// 0x0078 (0x00B0 - 0x0038)
class UAnimNotify_PlayFootstepEffect final : public UAnimNotify
{
public:
	class FName                                   SocketName;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttached;                                         // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDefaultMirrorConfig;                           // 0x0091(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRowName(const class FName& NewRowName) const;
	void SetSocketName(const class FName& NewSocketName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlayFootstepEffect">();
	}
	static class UAnimNotify_PlayFootstepEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayFootstepEffect>();
	}
};
static_assert(alignof(UAnimNotify_PlayFootstepEffect) == 0x000008, "Wrong alignment on UAnimNotify_PlayFootstepEffect");
static_assert(sizeof(UAnimNotify_PlayFootstepEffect) == 0x0000B0, "Wrong size on UAnimNotify_PlayFootstepEffect");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, SocketName) == 0x000038, "Member 'UAnimNotify_PlayFootstepEffect::SocketName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, LocationOffset) == 0x000040, "Member 'UAnimNotify_PlayFootstepEffect::LocationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, RotationOffset) == 0x000058, "Member 'UAnimNotify_PlayFootstepEffect::RotationOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, Scale) == 0x000070, "Member 'UAnimNotify_PlayFootstepEffect::Scale' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, RowName) == 0x000088, "Member 'UAnimNotify_PlayFootstepEffect::RowName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, bAttached) == 0x000090, "Member 'UAnimNotify_PlayFootstepEffect::bAttached' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, bUseDefaultMirrorConfig) == 0x000091, "Member 'UAnimNotify_PlayFootstepEffect::bUseDefaultMirrorConfig' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayFootstepEffect, MirrorDataTable) == 0x000098, "Member 'UAnimNotify_PlayFootstepEffect::MirrorDataTable' has a wrong offset!");

// Class X6Game.ANS_TimedBikeTraceEffect
// 0x00C8 (0x00F8 - 0x0030)
class UANS_TimedBikeTraceEffect final : public UAnimNotifyState
{
public:
	class FName                                   SocketName;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyAtEnd;                                     // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RefreshEffectConfigInternal;                       // 0x008C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x68];                                      // 0x0090(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ANS_TimedBikeTraceEffect">();
	}
	static class UANS_TimedBikeTraceEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_TimedBikeTraceEffect>();
	}
};
static_assert(alignof(UANS_TimedBikeTraceEffect) == 0x000008, "Wrong alignment on UANS_TimedBikeTraceEffect");
static_assert(sizeof(UANS_TimedBikeTraceEffect) == 0x0000F8, "Wrong size on UANS_TimedBikeTraceEffect");
static_assert(offsetof(UANS_TimedBikeTraceEffect, SocketName) == 0x000030, "Member 'UANS_TimedBikeTraceEffect::SocketName' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, RowName) == 0x000038, "Member 'UANS_TimedBikeTraceEffect::RowName' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, LocationOffset) == 0x000040, "Member 'UANS_TimedBikeTraceEffect::LocationOffset' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, RotationOffset) == 0x000058, "Member 'UANS_TimedBikeTraceEffect::RotationOffset' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, Scale) == 0x000070, "Member 'UANS_TimedBikeTraceEffect::Scale' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, bDestroyAtEnd) == 0x000088, "Member 'UANS_TimedBikeTraceEffect::bDestroyAtEnd' has a wrong offset!");
static_assert(offsetof(UANS_TimedBikeTraceEffect, RefreshEffectConfigInternal) == 0x00008C, "Member 'UANS_TimedBikeTraceEffect::RefreshEffectConfigInternal' has a wrong offset!");

// Class X6Game.ANS_TimedPlayFootstepEffect
// 0x0070 (0x00A0 - 0x0030)
class UANS_TimedPlayFootstepEffect final : public UAnimNotifyState
{
public:
	class FName                                   SocketName;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0068(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttached;                                         // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x17];                                      // 0x0089(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ANS_TimedPlayFootstepEffect">();
	}
	static class UANS_TimedPlayFootstepEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_TimedPlayFootstepEffect>();
	}
};
static_assert(alignof(UANS_TimedPlayFootstepEffect) == 0x000008, "Wrong alignment on UANS_TimedPlayFootstepEffect");
static_assert(sizeof(UANS_TimedPlayFootstepEffect) == 0x0000A0, "Wrong size on UANS_TimedPlayFootstepEffect");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, SocketName) == 0x000030, "Member 'UANS_TimedPlayFootstepEffect::SocketName' has a wrong offset!");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, LocationOffset) == 0x000038, "Member 'UANS_TimedPlayFootstepEffect::LocationOffset' has a wrong offset!");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, RotationOffset) == 0x000050, "Member 'UANS_TimedPlayFootstepEffect::RotationOffset' has a wrong offset!");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, Scale) == 0x000068, "Member 'UANS_TimedPlayFootstepEffect::Scale' has a wrong offset!");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, RowName) == 0x000080, "Member 'UANS_TimedPlayFootstepEffect::RowName' has a wrong offset!");
static_assert(offsetof(UANS_TimedPlayFootstepEffect, bAttached) == 0x000088, "Member 'UANS_TimedPlayFootstepEffect::bAttached' has a wrong offset!");

// Class X6Game.ANS_X6HoldItemPlayMaterialAnim
// 0x0008 (0x0038 - 0x0030)
class UANS_X6HoldItemPlayMaterialAnim final : public UAnimNotifyState
{
public:
	class FName                                   HoldItemTag;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ANS_X6HoldItemPlayMaterialAnim">();
	}
	static class UANS_X6HoldItemPlayMaterialAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_X6HoldItemPlayMaterialAnim>();
	}
};
static_assert(alignof(UANS_X6HoldItemPlayMaterialAnim) == 0x000008, "Wrong alignment on UANS_X6HoldItemPlayMaterialAnim");
static_assert(sizeof(UANS_X6HoldItemPlayMaterialAnim) == 0x000038, "Wrong size on UANS_X6HoldItemPlayMaterialAnim");
static_assert(offsetof(UANS_X6HoldItemPlayMaterialAnim, HoldItemTag) == 0x000030, "Member 'UANS_X6HoldItemPlayMaterialAnim::HoldItemTag' has a wrong offset!");

// Class X6Game.AN_CanInterruptLocomotionState
// 0x0000 (0x0038 - 0x0038)
class UAN_CanInterruptLocomotionState final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AN_CanInterruptLocomotionState">();
	}
	static class UAN_CanInterruptLocomotionState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAN_CanInterruptLocomotionState>();
	}
};
static_assert(alignof(UAN_CanInterruptLocomotionState) == 0x000008, "Wrong alignment on UAN_CanInterruptLocomotionState");
static_assert(sizeof(UAN_CanInterruptLocomotionState) == 0x000038, "Wrong size on UAN_CanInterruptLocomotionState");

// Class X6Game.X6MovieSceneLookAtPreviewPoint
// 0x0060 (0x0408 - 0x03A8)
class AX6MovieSceneLookAtPreviewPoint final : public AActor
{
public:
	bool                                          bUseLookAt;                                        // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELookAtUpdateMode                             LookAtUpdateMode;                                  // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyUseAOHead;                                    // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AB[0x5];                                      // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LookAtTargetActor;                                 // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LookAtOffsetLocation;                              // 0x03B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LookAtTargetSocketName;                            // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPauseAimOffset;                                   // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LookAtSmoothingTime;                               // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedTriggerTurn;                                  // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideTriggerTurnInPlaceAngle;                   // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryToLookAtWhenOutOfBounds;                       // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomBlinkRange;                                 // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRuntimeBlink;                               // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F3[0x5];                                      // 0x03F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 LookAtOwnerActor;                                  // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6MovieSceneLookAtPreviewPoint">();
	}
	static class AX6MovieSceneLookAtPreviewPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AX6MovieSceneLookAtPreviewPoint>();
	}
};
static_assert(alignof(AX6MovieSceneLookAtPreviewPoint) == 0x000008, "Wrong alignment on AX6MovieSceneLookAtPreviewPoint");
static_assert(sizeof(AX6MovieSceneLookAtPreviewPoint) == 0x000408, "Wrong size on AX6MovieSceneLookAtPreviewPoint");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bUseLookAt) == 0x0003A8, "Member 'AX6MovieSceneLookAtPreviewPoint::bUseLookAt' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtUpdateMode) == 0x0003A9, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtUpdateMode' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bOnlyUseAOHead) == 0x0003AA, "Member 'AX6MovieSceneLookAtPreviewPoint::bOnlyUseAOHead' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtTargetActor) == 0x0003B0, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtTargetActor' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtOffsetLocation) == 0x0003B8, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtOffsetLocation' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtTargetSocketName) == 0x0003D0, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtTargetSocketName' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bPauseAimOffset) == 0x0003E0, "Member 'AX6MovieSceneLookAtPreviewPoint::bPauseAimOffset' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtSmoothingTime) == 0x0003E4, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtSmoothingTime' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bNeedTriggerTurn) == 0x0003E8, "Member 'AX6MovieSceneLookAtPreviewPoint::bNeedTriggerTurn' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, OverrideTriggerTurnInPlaceAngle) == 0x0003EC, "Member 'AX6MovieSceneLookAtPreviewPoint::OverrideTriggerTurnInPlaceAngle' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bTryToLookAtWhenOutOfBounds) == 0x0003F0, "Member 'AX6MovieSceneLookAtPreviewPoint::bTryToLookAtWhenOutOfBounds' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bRandomBlinkRange) == 0x0003F1, "Member 'AX6MovieSceneLookAtPreviewPoint::bRandomBlinkRange' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, bEnableRuntimeBlink) == 0x0003F2, "Member 'AX6MovieSceneLookAtPreviewPoint::bEnableRuntimeBlink' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, StaticMeshComponent) == 0x0003F8, "Member 'AX6MovieSceneLookAtPreviewPoint::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AX6MovieSceneLookAtPreviewPoint, LookAtOwnerActor) == 0x000400, "Member 'AX6MovieSceneLookAtPreviewPoint::LookAtOwnerActor' has a wrong offset!");

// Class X6Game.BipedalLocomotionAnimInstance
// 0x00C0 (0x0490 - 0x03D0)
class UBipedalLocomotionAnimInstance final : public UAnimInstance
{
public:
	class UBipedalLocomotionDataContainer*        DataContainer;                                     // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UX6GeneralAnimationDataComponent*       OwnerDataComponent;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandRecoveryStandardFallingDuration;               // 0x03D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBipedalLocomotionAnimSet              AnimSet;                                           // 0x03E0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         PlayRateMin;                                       // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRateMax;                                       // 0x046C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovingLandAdditiveAlpha;                           // 0x0470(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleLandAdditiveAlpha;                             // 0x0474(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalcPlayerSpeedByInput;                           // 0x0478(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceIdleReadyInIdleState;                        // 0x0479(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47A[0x16];                                     // 0x047A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlueprintPostInitializeDataContainer();
	float GetAdditiveAlpha();
	float GetLandRecoveryAlpha();
	class UAnimSequenceBase* GetNextIdleBreak();
	bool HasAnyIdleBreak();
	bool IsForcingIdleReadyInIdleState();
	bool UseFallLoopAsJump();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BipedalLocomotionAnimInstance">();
	}
	static class UBipedalLocomotionAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBipedalLocomotionAnimInstance>();
	}
};
static_assert(alignof(UBipedalLocomotionAnimInstance) == 0x000010, "Wrong alignment on UBipedalLocomotionAnimInstance");
static_assert(sizeof(UBipedalLocomotionAnimInstance) == 0x000490, "Wrong size on UBipedalLocomotionAnimInstance");
static_assert(offsetof(UBipedalLocomotionAnimInstance, DataContainer) == 0x0003C8, "Member 'UBipedalLocomotionAnimInstance::DataContainer' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, OwnerDataComponent) == 0x0003D0, "Member 'UBipedalLocomotionAnimInstance::OwnerDataComponent' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, LandRecoveryStandardFallingDuration) == 0x0003D8, "Member 'UBipedalLocomotionAnimInstance::LandRecoveryStandardFallingDuration' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, AnimSet) == 0x0003E0, "Member 'UBipedalLocomotionAnimInstance::AnimSet' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, PlayRateMin) == 0x000468, "Member 'UBipedalLocomotionAnimInstance::PlayRateMin' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, PlayRateMax) == 0x00046C, "Member 'UBipedalLocomotionAnimInstance::PlayRateMax' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, MovingLandAdditiveAlpha) == 0x000470, "Member 'UBipedalLocomotionAnimInstance::MovingLandAdditiveAlpha' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, IdleLandAdditiveAlpha) == 0x000474, "Member 'UBipedalLocomotionAnimInstance::IdleLandAdditiveAlpha' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, bCalcPlayerSpeedByInput) == 0x000478, "Member 'UBipedalLocomotionAnimInstance::bCalcPlayerSpeedByInput' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionAnimInstance, bForceIdleReadyInIdleState) == 0x000479, "Member 'UBipedalLocomotionAnimInstance::bForceIdleReadyInIdleState' has a wrong offset!");

// Class X6Game.LocomotionDataContainerBase
// 0x0010 (0x0038 - 0x0028)
class ULocomotionDataContainerBase : public UObject
{
public:
	class UX6GeneralAnimationDataComponent*       OwnerAnimDataComponent;                            // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAnimInstance(class UAnimInstance* AnimInstance);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LocomotionDataContainerBase">();
	}
	static class ULocomotionDataContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocomotionDataContainerBase>();
	}
};
static_assert(alignof(ULocomotionDataContainerBase) == 0x000008, "Wrong alignment on ULocomotionDataContainerBase");
static_assert(sizeof(ULocomotionDataContainerBase) == 0x000038, "Wrong size on ULocomotionDataContainerBase");
static_assert(offsetof(ULocomotionDataContainerBase, OwnerAnimDataComponent) == 0x000028, "Member 'ULocomotionDataContainerBase::OwnerAnimDataComponent' has a wrong offset!");

// Class X6Game.BipedalLocomotionDataContainer
// 0x00A8 (0x00E0 - 0x0038)
class UBipedalLocomotionDataContainer final : public ULocomotionDataContainerBase
{
public:
	struct FVector                                PlayerVelocity;                                    // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerSpeed;                                       // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMoving;                                         // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGroundedMoving;                                 // 0x0055(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x1];                                       // 0x0056(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasInput;                                         // 0x0057(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocomotionGait                               AllowGait;                                         // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsWalking;                                        // 0x0059(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJoging;                                         // 0x005A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x005B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentAllowSpeed;                                 // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnAngle;                                         // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditiveLeanAngle;                                 // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x10];                                      // 0x006C(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x007C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CycleBlendSpaceInput;                              // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableJogLeanAdditive;                            // 0x0084(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0xB];                                       // 0x0085(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         CurrentFloatingJumpStage;                          // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x0091(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJump;                                           // 0x0092(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFalling;                                        // 0x0093(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallDuration;                                      // 0x0094(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInJumpingLoop;                                  // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFlying;                                         // 0x0099(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             OwnerCharacter;                                    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterMovementComponent*            OwnerCharacterMovement;                            // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x30];                                      // 0x00B0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PrevCustomMode);
	void SetStandardSpeeds(float InStandardWalkSpeed, float InStandardJogSpeed, float InStandardSprintSpeed);
	void UpdateFloatingJumpStates(uint8 InFloatingJumpStage);
	void UpdatePlayerMovementStates(EMovementMode InMovementMode, ELocomotionGait InAllowGait, float InAllowSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BipedalLocomotionDataContainer">();
	}
	static class UBipedalLocomotionDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBipedalLocomotionDataContainer>();
	}
};
static_assert(alignof(UBipedalLocomotionDataContainer) == 0x000008, "Wrong alignment on UBipedalLocomotionDataContainer");
static_assert(sizeof(UBipedalLocomotionDataContainer) == 0x0000E0, "Wrong size on UBipedalLocomotionDataContainer");
static_assert(offsetof(UBipedalLocomotionDataContainer, PlayerVelocity) == 0x000038, "Member 'UBipedalLocomotionDataContainer::PlayerVelocity' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, PlayerSpeed) == 0x000050, "Member 'UBipedalLocomotionDataContainer::PlayerSpeed' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsMoving) == 0x000054, "Member 'UBipedalLocomotionDataContainer::bIsMoving' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsGroundedMoving) == 0x000055, "Member 'UBipedalLocomotionDataContainer::bIsGroundedMoving' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bHasInput) == 0x000057, "Member 'UBipedalLocomotionDataContainer::bHasInput' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, AllowGait) == 0x000058, "Member 'UBipedalLocomotionDataContainer::AllowGait' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsWalking) == 0x000059, "Member 'UBipedalLocomotionDataContainer::bIsWalking' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsJoging) == 0x00005A, "Member 'UBipedalLocomotionDataContainer::bIsJoging' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsSprinting) == 0x00005B, "Member 'UBipedalLocomotionDataContainer::bIsSprinting' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, CurrentAllowSpeed) == 0x00005C, "Member 'UBipedalLocomotionDataContainer::CurrentAllowSpeed' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, TurnAngle) == 0x000060, "Member 'UBipedalLocomotionDataContainer::TurnAngle' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, AdditiveLeanAngle) == 0x000068, "Member 'UBipedalLocomotionDataContainer::AdditiveLeanAngle' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, PlayRate) == 0x00007C, "Member 'UBipedalLocomotionDataContainer::PlayRate' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, CycleBlendSpaceInput) == 0x000080, "Member 'UBipedalLocomotionDataContainer::CycleBlendSpaceInput' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bEnableJogLeanAdditive) == 0x000084, "Member 'UBipedalLocomotionDataContainer::bEnableJogLeanAdditive' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, CurrentFloatingJumpStage) == 0x000090, "Member 'UBipedalLocomotionDataContainer::CurrentFloatingJumpStage' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsInAir) == 0x000091, "Member 'UBipedalLocomotionDataContainer::bIsInAir' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsJump) == 0x000092, "Member 'UBipedalLocomotionDataContainer::bIsJump' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsFalling) == 0x000093, "Member 'UBipedalLocomotionDataContainer::bIsFalling' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, FallDuration) == 0x000094, "Member 'UBipedalLocomotionDataContainer::FallDuration' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsInJumpingLoop) == 0x000098, "Member 'UBipedalLocomotionDataContainer::bIsInJumpingLoop' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, bIsFlying) == 0x000099, "Member 'UBipedalLocomotionDataContainer::bIsFlying' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, OwnerCharacter) == 0x0000A0, "Member 'UBipedalLocomotionDataContainer::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UBipedalLocomotionDataContainer, OwnerCharacterMovement) == 0x0000A8, "Member 'UBipedalLocomotionDataContainer::OwnerCharacterMovement' has a wrong offset!");

// Class X6Game.BTComposite_RandomSelector
// 0x0068 (0x00E8 - 0x0080)
class UBTComposite_RandomSelector final : public UBTCompositeNode
{
public:
	uint8                                         bReRandomWhenFailed : 1;                           // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint32>                                BranchWeightArray;                                 // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x50];                                      // 0x0098(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTComposite_RandomSelector">();
	}
	static class UBTComposite_RandomSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTComposite_RandomSelector>();
	}
};
static_assert(alignof(UBTComposite_RandomSelector) == 0x000008, "Wrong alignment on UBTComposite_RandomSelector");
static_assert(sizeof(UBTComposite_RandomSelector) == 0x0000E8, "Wrong size on UBTComposite_RandomSelector");
static_assert(offsetof(UBTComposite_RandomSelector, BranchWeightArray) == 0x000088, "Member 'UBTComposite_RandomSelector::BranchWeightArray' has a wrong offset!");

// Class X6Game.CameraModifierVolumeActor
// 0x0038 (0x03E0 - 0x03A8)
class ACameraModifierVolumeActor final : public AActor
{
public:
	class USceneComponent*                        Root;                                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                          EnterBox;                                          // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                          ExitBox;                                           // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModifierKey;                                       // 0x03C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x10];                                     // 0x03D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorEnterVolume(class AActor* Actor);
	void OnActorLeaveVolume(class AActor* Actor);
	void OnEnterBoxComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnExitBoxBoxComponentEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifierVolumeActor">();
	}
	static class ACameraModifierVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraModifierVolumeActor>();
	}
};
static_assert(alignof(ACameraModifierVolumeActor) == 0x000008, "Wrong alignment on ACameraModifierVolumeActor");
static_assert(sizeof(ACameraModifierVolumeActor) == 0x0003E0, "Wrong size on ACameraModifierVolumeActor");
static_assert(offsetof(ACameraModifierVolumeActor, Root) == 0x0003A8, "Member 'ACameraModifierVolumeActor::Root' has a wrong offset!");
static_assert(offsetof(ACameraModifierVolumeActor, EnterBox) == 0x0003B0, "Member 'ACameraModifierVolumeActor::EnterBox' has a wrong offset!");
static_assert(offsetof(ACameraModifierVolumeActor, ExitBox) == 0x0003B8, "Member 'ACameraModifierVolumeActor::ExitBox' has a wrong offset!");
static_assert(offsetof(ACameraModifierVolumeActor, ModifierKey) == 0x0003C0, "Member 'ACameraModifierVolumeActor::ModifierKey' has a wrong offset!");

// Class X6Game.CameraModifier_CameraBlur
// 0x0028 (0x0070 - 0x0048)
class UCameraModifier_CameraBlur final : public UCameraModifier
{
public:
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AX6PlayerCameraManager>  X6CameraOwner;                                     // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitializeBlend(const float BlendInTime, const float BlendOutTime);
	void InitializeMotionBlur(const float InBlurAmount, const float InBlurMax);
	void InitializeRadiusBlur(const float InOffset, const float InRadius, const float InHardness, const float InSwitchDir);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraModifier_CameraBlur">();
	}
	static class UCameraModifier_CameraBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_CameraBlur>();
	}
};
static_assert(alignof(UCameraModifier_CameraBlur) == 0x000008, "Wrong alignment on UCameraModifier_CameraBlur");
static_assert(sizeof(UCameraModifier_CameraBlur) == 0x000070, "Wrong size on UCameraModifier_CameraBlur");
static_assert(offsetof(UCameraModifier_CameraBlur, X6CameraOwner) == 0x000068, "Member 'UCameraModifier_CameraBlur::X6CameraOwner' has a wrong offset!");

// Class X6Game.FootstepDecalConfigTemplate
// 0x0038 (0x0068 - 0x0030)
class UFootstepDecalConfigTemplate final : public UDataAsset
{
public:
	class UMaterialInstance*                      Material;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Size;                                              // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftScaleZ;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightScaleZ;                                       // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FootstepDecalConfigTemplate">();
	}
	static class UFootstepDecalConfigTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootstepDecalConfigTemplate>();
	}
};
static_assert(alignof(UFootstepDecalConfigTemplate) == 0x000008, "Wrong alignment on UFootstepDecalConfigTemplate");
static_assert(sizeof(UFootstepDecalConfigTemplate) == 0x000068, "Wrong size on UFootstepDecalConfigTemplate");
static_assert(offsetof(UFootstepDecalConfigTemplate, Material) == 0x000030, "Member 'UFootstepDecalConfigTemplate::Material' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, Size) == 0x000038, "Member 'UFootstepDecalConfigTemplate::Size' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, Duration) == 0x000050, "Member 'UFootstepDecalConfigTemplate::Duration' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, FadeOutTime) == 0x000054, "Member 'UFootstepDecalConfigTemplate::FadeOutTime' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, Pitch) == 0x000058, "Member 'UFootstepDecalConfigTemplate::Pitch' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, Roll) == 0x00005C, "Member 'UFootstepDecalConfigTemplate::Roll' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, LeftScaleZ) == 0x000060, "Member 'UFootstepDecalConfigTemplate::LeftScaleZ' has a wrong offset!");
static_assert(offsetof(UFootstepDecalConfigTemplate, RightScaleZ) == 0x000064, "Member 'UFootstepDecalConfigTemplate::RightScaleZ' has a wrong offset!");

// Class X6Game.CustomNavLinkMoveInterface
// 0x0000 (0x0000 - 0x0000)
class ICustomNavLinkMoveInterface final : public IInterface
{
public:
	void OnLanded();
