#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Game

#include "Basic.hpp"

#include "TargetingSystem_structs.hpp"
#include "X6Game_structs.hpp"
#include "Engine_structs.hpp"
#include "X6Camera_structs.hpp"
#include "X6Animation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MotionWarping_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "GameplayCameras_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UIPF_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function X6Game.ActorEventListener.OnPooledActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct ActorEventListener_OnPooledActorDestroyed final
{
public:
	class AActor*                                 InActorAboutToDestroy;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorEventListener_OnPooledActorDestroyed) == 0x000008, "Wrong alignment on ActorEventListener_OnPooledActorDestroyed");
static_assert(sizeof(ActorEventListener_OnPooledActorDestroyed) == 0x000008, "Wrong size on ActorEventListener_OnPooledActorDestroyed");
static_assert(offsetof(ActorEventListener_OnPooledActorDestroyed, InActorAboutToDestroy) == 0x000000, "Member 'ActorEventListener_OnPooledActorDestroyed::InActorAboutToDestroy' has a wrong offset!");

// Function X6Game.AsyncQueryPositionTask.QueryFlyingFollowPosition
// 0x0050 (0x0050 - 0x0000)
struct AsyncQueryPositionTask_QueryFlyingFollowPosition final
{
public:
	class AActor*                                 GoalActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FollowingActor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQueryFlyingFollowPositionArgs         Args;                                              // 0x0010(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AsyncQueryPositionTask_QueryFlyingFollowPosition) == 0x000008, "Wrong alignment on AsyncQueryPositionTask_QueryFlyingFollowPosition");
static_assert(sizeof(AsyncQueryPositionTask_QueryFlyingFollowPosition) == 0x000050, "Wrong size on AsyncQueryPositionTask_QueryFlyingFollowPosition");
static_assert(offsetof(AsyncQueryPositionTask_QueryFlyingFollowPosition, GoalActor) == 0x000000, "Member 'AsyncQueryPositionTask_QueryFlyingFollowPosition::GoalActor' has a wrong offset!");
static_assert(offsetof(AsyncQueryPositionTask_QueryFlyingFollowPosition, FollowingActor) == 0x000008, "Member 'AsyncQueryPositionTask_QueryFlyingFollowPosition::FollowingActor' has a wrong offset!");
static_assert(offsetof(AsyncQueryPositionTask_QueryFlyingFollowPosition, Args) == 0x000010, "Member 'AsyncQueryPositionTask_QueryFlyingFollowPosition::Args' has a wrong offset!");
static_assert(offsetof(AsyncQueryPositionTask_QueryFlyingFollowPosition, ReturnValue) == 0x000048, "Member 'AsyncQueryPositionTask_QueryFlyingFollowPosition::ReturnValue' has a wrong offset!");

// Function X6Game.AnimNotify_PlayFootstepEffect.SetRowName
// 0x0008 (0x0008 - 0x0000)
struct AnimNotify_PlayFootstepEffect_SetRowName final
{
public:
	class FName                                   NewRowName;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotify_PlayFootstepEffect_SetRowName) == 0x000004, "Wrong alignment on AnimNotify_PlayFootstepEffect_SetRowName");
static_assert(sizeof(AnimNotify_PlayFootstepEffect_SetRowName) == 0x000008, "Wrong size on AnimNotify_PlayFootstepEffect_SetRowName");
static_assert(offsetof(AnimNotify_PlayFootstepEffect_SetRowName, NewRowName) == 0x000000, "Member 'AnimNotify_PlayFootstepEffect_SetRowName::NewRowName' has a wrong offset!");

// Function X6Game.AnimNotify_PlayFootstepEffect.SetSocketName
// 0x0008 (0x0008 - 0x0000)
struct AnimNotify_PlayFootstepEffect_SetSocketName final
{
public:
	class FName                                   NewSocketName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotify_PlayFootstepEffect_SetSocketName) == 0x000004, "Wrong alignment on AnimNotify_PlayFootstepEffect_SetSocketName");
static_assert(sizeof(AnimNotify_PlayFootstepEffect_SetSocketName) == 0x000008, "Wrong size on AnimNotify_PlayFootstepEffect_SetSocketName");
static_assert(offsetof(AnimNotify_PlayFootstepEffect_SetSocketName, NewSocketName) == 0x000000, "Member 'AnimNotify_PlayFootstepEffect_SetSocketName::NewSocketName' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.GetAdditiveAlpha
// 0x0004 (0x0004 - 0x0000)
struct BipedalLocomotionAnimInstance_GetAdditiveAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_GetAdditiveAlpha) == 0x000004, "Wrong alignment on BipedalLocomotionAnimInstance_GetAdditiveAlpha");
static_assert(sizeof(BipedalLocomotionAnimInstance_GetAdditiveAlpha) == 0x000004, "Wrong size on BipedalLocomotionAnimInstance_GetAdditiveAlpha");
static_assert(offsetof(BipedalLocomotionAnimInstance_GetAdditiveAlpha, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_GetAdditiveAlpha::ReturnValue' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.GetLandRecoveryAlpha
// 0x0004 (0x0004 - 0x0000)
struct BipedalLocomotionAnimInstance_GetLandRecoveryAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_GetLandRecoveryAlpha) == 0x000004, "Wrong alignment on BipedalLocomotionAnimInstance_GetLandRecoveryAlpha");
static_assert(sizeof(BipedalLocomotionAnimInstance_GetLandRecoveryAlpha) == 0x000004, "Wrong size on BipedalLocomotionAnimInstance_GetLandRecoveryAlpha");
static_assert(offsetof(BipedalLocomotionAnimInstance_GetLandRecoveryAlpha, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_GetLandRecoveryAlpha::ReturnValue' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.GetNextIdleBreak
// 0x0008 (0x0008 - 0x0000)
struct BipedalLocomotionAnimInstance_GetNextIdleBreak final
{
public:
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_GetNextIdleBreak) == 0x000008, "Wrong alignment on BipedalLocomotionAnimInstance_GetNextIdleBreak");
static_assert(sizeof(BipedalLocomotionAnimInstance_GetNextIdleBreak) == 0x000008, "Wrong size on BipedalLocomotionAnimInstance_GetNextIdleBreak");
static_assert(offsetof(BipedalLocomotionAnimInstance_GetNextIdleBreak, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_GetNextIdleBreak::ReturnValue' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.HasAnyIdleBreak
// 0x0001 (0x0001 - 0x0000)
struct BipedalLocomotionAnimInstance_HasAnyIdleBreak final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_HasAnyIdleBreak) == 0x000001, "Wrong alignment on BipedalLocomotionAnimInstance_HasAnyIdleBreak");
static_assert(sizeof(BipedalLocomotionAnimInstance_HasAnyIdleBreak) == 0x000001, "Wrong size on BipedalLocomotionAnimInstance_HasAnyIdleBreak");
static_assert(offsetof(BipedalLocomotionAnimInstance_HasAnyIdleBreak, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_HasAnyIdleBreak::ReturnValue' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.IsForcingIdleReadyInIdleState
// 0x0001 (0x0001 - 0x0000)
struct BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState) == 0x000001, "Wrong alignment on BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState");
static_assert(sizeof(BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState) == 0x000001, "Wrong size on BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState");
static_assert(offsetof(BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_IsForcingIdleReadyInIdleState::ReturnValue' has a wrong offset!");

// Function X6Game.BipedalLocomotionAnimInstance.UseFallLoopAsJump
// 0x0001 (0x0001 - 0x0000)
struct BipedalLocomotionAnimInstance_UseFallLoopAsJump final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionAnimInstance_UseFallLoopAsJump) == 0x000001, "Wrong alignment on BipedalLocomotionAnimInstance_UseFallLoopAsJump");
static_assert(sizeof(BipedalLocomotionAnimInstance_UseFallLoopAsJump) == 0x000001, "Wrong size on BipedalLocomotionAnimInstance_UseFallLoopAsJump");
static_assert(offsetof(BipedalLocomotionAnimInstance_UseFallLoopAsJump, ReturnValue) == 0x000000, "Member 'BipedalLocomotionAnimInstance_UseFallLoopAsJump::ReturnValue' has a wrong offset!");

// Function X6Game.LocomotionDataContainerBase.SetAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct LocomotionDataContainerBase_SetAnimInstance final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LocomotionDataContainerBase_SetAnimInstance) == 0x000008, "Wrong alignment on LocomotionDataContainerBase_SetAnimInstance");
static_assert(sizeof(LocomotionDataContainerBase_SetAnimInstance) == 0x000008, "Wrong size on LocomotionDataContainerBase_SetAnimInstance");
static_assert(offsetof(LocomotionDataContainerBase_SetAnimInstance, AnimInstance) == 0x000000, "Member 'LocomotionDataContainerBase_SetAnimInstance::AnimInstance' has a wrong offset!");

// Function X6Game.BipedalLocomotionDataContainer.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct BipedalLocomotionDataContainer_OnMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PrevCustomMode;                                    // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BipedalLocomotionDataContainer_OnMovementModeChanged) == 0x000008, "Wrong alignment on BipedalLocomotionDataContainer_OnMovementModeChanged");
static_assert(sizeof(BipedalLocomotionDataContainer_OnMovementModeChanged) == 0x000010, "Wrong size on BipedalLocomotionDataContainer_OnMovementModeChanged");
static_assert(offsetof(BipedalLocomotionDataContainer_OnMovementModeChanged, Character) == 0x000000, "Member 'BipedalLocomotionDataContainer_OnMovementModeChanged::Character' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_OnMovementModeChanged, PrevMovementMode) == 0x000008, "Member 'BipedalLocomotionDataContainer_OnMovementModeChanged::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_OnMovementModeChanged, PrevCustomMode) == 0x000009, "Member 'BipedalLocomotionDataContainer_OnMovementModeChanged::PrevCustomMode' has a wrong offset!");

// Function X6Game.BipedalLocomotionDataContainer.SetStandardSpeeds
// 0x000C (0x000C - 0x0000)
struct BipedalLocomotionDataContainer_SetStandardSpeeds final
{
public:
	float                                         InStandardWalkSpeed;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStandardJogSpeed;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStandardSprintSpeed;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionDataContainer_SetStandardSpeeds) == 0x000004, "Wrong alignment on BipedalLocomotionDataContainer_SetStandardSpeeds");
static_assert(sizeof(BipedalLocomotionDataContainer_SetStandardSpeeds) == 0x00000C, "Wrong size on BipedalLocomotionDataContainer_SetStandardSpeeds");
static_assert(offsetof(BipedalLocomotionDataContainer_SetStandardSpeeds, InStandardWalkSpeed) == 0x000000, "Member 'BipedalLocomotionDataContainer_SetStandardSpeeds::InStandardWalkSpeed' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_SetStandardSpeeds, InStandardJogSpeed) == 0x000004, "Member 'BipedalLocomotionDataContainer_SetStandardSpeeds::InStandardJogSpeed' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_SetStandardSpeeds, InStandardSprintSpeed) == 0x000008, "Member 'BipedalLocomotionDataContainer_SetStandardSpeeds::InStandardSprintSpeed' has a wrong offset!");

// Function X6Game.BipedalLocomotionDataContainer.UpdateFloatingJumpStates
// 0x0001 (0x0001 - 0x0000)
struct BipedalLocomotionDataContainer_UpdateFloatingJumpStates final
{
public:
	uint8                                         InFloatingJumpStage;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionDataContainer_UpdateFloatingJumpStates) == 0x000001, "Wrong alignment on BipedalLocomotionDataContainer_UpdateFloatingJumpStates");
static_assert(sizeof(BipedalLocomotionDataContainer_UpdateFloatingJumpStates) == 0x000001, "Wrong size on BipedalLocomotionDataContainer_UpdateFloatingJumpStates");
static_assert(offsetof(BipedalLocomotionDataContainer_UpdateFloatingJumpStates, InFloatingJumpStage) == 0x000000, "Member 'BipedalLocomotionDataContainer_UpdateFloatingJumpStates::InFloatingJumpStage' has a wrong offset!");

// Function X6Game.BipedalLocomotionDataContainer.UpdatePlayerMovementStates
// 0x0008 (0x0008 - 0x0000)
struct BipedalLocomotionDataContainer_UpdatePlayerMovementStates final
{
public:
	EMovementMode                                 InMovementMode;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocomotionGait                               InAllowGait;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InAllowSpeed;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BipedalLocomotionDataContainer_UpdatePlayerMovementStates) == 0x000004, "Wrong alignment on BipedalLocomotionDataContainer_UpdatePlayerMovementStates");
static_assert(sizeof(BipedalLocomotionDataContainer_UpdatePlayerMovementStates) == 0x000008, "Wrong size on BipedalLocomotionDataContainer_UpdatePlayerMovementStates");
static_assert(offsetof(BipedalLocomotionDataContainer_UpdatePlayerMovementStates, InMovementMode) == 0x000000, "Member 'BipedalLocomotionDataContainer_UpdatePlayerMovementStates::InMovementMode' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_UpdatePlayerMovementStates, InAllowGait) == 0x000001, "Member 'BipedalLocomotionDataContainer_UpdatePlayerMovementStates::InAllowGait' has a wrong offset!");
static_assert(offsetof(BipedalLocomotionDataContainer_UpdatePlayerMovementStates, InAllowSpeed) == 0x000004, "Member 'BipedalLocomotionDataContainer_UpdatePlayerMovementStates::InAllowSpeed' has a wrong offset!");

// Function X6Game.CameraModifierVolumeActor.OnActorEnterVolume
// 0x0008 (0x0008 - 0x0000)
struct CameraModifierVolumeActor_OnActorEnterVolume final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifierVolumeActor_OnActorEnterVolume) == 0x000008, "Wrong alignment on CameraModifierVolumeActor_OnActorEnterVolume");
static_assert(sizeof(CameraModifierVolumeActor_OnActorEnterVolume) == 0x000008, "Wrong size on CameraModifierVolumeActor_OnActorEnterVolume");
static_assert(offsetof(CameraModifierVolumeActor_OnActorEnterVolume, Actor) == 0x000000, "Member 'CameraModifierVolumeActor_OnActorEnterVolume::Actor' has a wrong offset!");

// Function X6Game.CameraModifierVolumeActor.OnActorLeaveVolume
// 0x0008 (0x0008 - 0x0000)
struct CameraModifierVolumeActor_OnActorLeaveVolume final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifierVolumeActor_OnActorLeaveVolume) == 0x000008, "Wrong alignment on CameraModifierVolumeActor_OnActorLeaveVolume");
static_assert(sizeof(CameraModifierVolumeActor_OnActorLeaveVolume) == 0x000008, "Wrong size on CameraModifierVolumeActor_OnActorLeaveVolume");
static_assert(offsetof(CameraModifierVolumeActor_OnActorLeaveVolume, Actor) == 0x000000, "Member 'CameraModifierVolumeActor_OnActorLeaveVolume::Actor' has a wrong offset!");

// Function X6Game.CameraModifierVolumeActor.OnEnterBoxComponentBeginOverlap
// 0x0118 (0x0118 - 0x0000)
struct CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap) == 0x000008, "Wrong alignment on CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap");
static_assert(sizeof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap) == 0x000118, "Wrong size on CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, OverlappedComponent) == 0x000000, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, OtherActor) == 0x000008, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, OtherComp) == 0x000010, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, bFromSweep) == 0x00001C, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap, SweepResult) == 0x000020, "Member 'CameraModifierVolumeActor_OnEnterBoxComponentBeginOverlap::SweepResult' has a wrong offset!");

// Function X6Game.CameraModifierVolumeActor.OnExitBoxBoxComponentEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap) == 0x000008, "Wrong alignment on CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap");
static_assert(sizeof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap) == 0x000020, "Wrong size on CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap");
static_assert(offsetof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap, OverlappedComponent) == 0x000000, "Member 'CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap, OtherActor) == 0x000008, "Member 'CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap, OtherComp) == 0x000010, "Member 'CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap, OtherBodyIndex) == 0x000018, "Member 'CameraModifierVolumeActor_OnExitBoxBoxComponentEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function X6Game.CameraModifier_CameraBlur.InitializeBlend
// 0x0008 (0x0008 - 0x0000)
struct CameraModifier_CameraBlur_InitializeBlend final
{
public:
	float                                         BlendInTime;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_CameraBlur_InitializeBlend) == 0x000004, "Wrong alignment on CameraModifier_CameraBlur_InitializeBlend");
static_assert(sizeof(CameraModifier_CameraBlur_InitializeBlend) == 0x000008, "Wrong size on CameraModifier_CameraBlur_InitializeBlend");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeBlend, BlendInTime) == 0x000000, "Member 'CameraModifier_CameraBlur_InitializeBlend::BlendInTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeBlend, BlendOutTime) == 0x000004, "Member 'CameraModifier_CameraBlur_InitializeBlend::BlendOutTime' has a wrong offset!");

// Function X6Game.CameraModifier_CameraBlur.InitializeMotionBlur
// 0x0008 (0x0008 - 0x0000)
struct CameraModifier_CameraBlur_InitializeMotionBlur final
{
public:
	float                                         InBlurAmount;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlurMax;                                         // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_CameraBlur_InitializeMotionBlur) == 0x000004, "Wrong alignment on CameraModifier_CameraBlur_InitializeMotionBlur");
static_assert(sizeof(CameraModifier_CameraBlur_InitializeMotionBlur) == 0x000008, "Wrong size on CameraModifier_CameraBlur_InitializeMotionBlur");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeMotionBlur, InBlurAmount) == 0x000000, "Member 'CameraModifier_CameraBlur_InitializeMotionBlur::InBlurAmount' has a wrong offset!");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeMotionBlur, InBlurMax) == 0x000004, "Member 'CameraModifier_CameraBlur_InitializeMotionBlur::InBlurMax' has a wrong offset!");

// Function X6Game.CameraModifier_CameraBlur.InitializeRadiusBlur
// 0x0010 (0x0010 - 0x0000)
struct CameraModifier_CameraBlur_InitializeRadiusBlur final
{
public:
	float                                         InOffset;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRadius;                                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InHardness;                                        // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSwitchDir;                                       // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraModifier_CameraBlur_InitializeRadiusBlur) == 0x000004, "Wrong alignment on CameraModifier_CameraBlur_InitializeRadiusBlur");
static_assert(sizeof(CameraModifier_CameraBlur_InitializeRadiusBlur) == 0x000010, "Wrong size on CameraModifier_CameraBlur_InitializeRadiusBlur");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeRadiusBlur, InOffset) == 0x000000, "Member 'CameraModifier_CameraBlur_InitializeRadiusBlur::InOffset' has a wrong offset!");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeRadiusBlur, InRadius) == 0x000004, "Member 'CameraModifier_CameraBlur_InitializeRadiusBlur::InRadius' has a wrong offset!");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeRadiusBlur, InHardness) == 0x000008, "Member 'CameraModifier_CameraBlur_InitializeRadiusBlur::InHardness' has a wrong offset!");
static_assert(offsetof(CameraModifier_CameraBlur_InitializeRadiusBlur, InSwitchDir) == 0x00000C, "Member 'CameraModifier_CameraBlur_InitializeRadiusBlur::InSwitchDir' has a wrong offset!");

// Function X6Game.CustomNavLinkMoveInterface.OnLinkMoveRemoved
// 0x0008 (0x0008 - 0x0000)
struct CustomNavLinkMoveInterface_OnLinkMoveRemoved final
{
public:
	class UX6PathFollowingComponent*              PathComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomNavLinkMoveInterface_OnLinkMoveRemoved) == 0x000008, "Wrong alignment on CustomNavLinkMoveInterface_OnLinkMoveRemoved");
static_assert(sizeof(CustomNavLinkMoveInterface_OnLinkMoveRemoved) == 0x000008, "Wrong size on CustomNavLinkMoveInterface_OnLinkMoveRemoved");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveRemoved, PathComp) == 0x000000, "Member 'CustomNavLinkMoveInterface_OnLinkMoveRemoved::PathComp' has a wrong offset!");

// Function X6Game.CustomNavLinkMoveInterface.OnLinkMoveStart
// 0x0040 (0x0040 - 0x0000)
struct CustomNavLinkMoveInterface_OnLinkMoveStart final
{
public:
	class UX6PathFollowingComponent*              PathComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartPoint;                                        // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DestPoint;                                         // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomNavLinkMoveInterface_OnLinkMoveStart) == 0x000008, "Wrong alignment on CustomNavLinkMoveInterface_OnLinkMoveStart");
static_assert(sizeof(CustomNavLinkMoveInterface_OnLinkMoveStart) == 0x000040, "Wrong size on CustomNavLinkMoveInterface_OnLinkMoveStart");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveStart, PathComp) == 0x000000, "Member 'CustomNavLinkMoveInterface_OnLinkMoveStart::PathComp' has a wrong offset!");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveStart, StartPoint) == 0x000008, "Member 'CustomNavLinkMoveInterface_OnLinkMoveStart::StartPoint' has a wrong offset!");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveStart, DestPoint) == 0x000020, "Member 'CustomNavLinkMoveInterface_OnLinkMoveStart::DestPoint' has a wrong offset!");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveStart, ReturnValue) == 0x000038, "Member 'CustomNavLinkMoveInterface_OnLinkMoveStart::ReturnValue' has a wrong offset!");

// Function X6Game.CustomNavLinkMoveInterface.OnLinkMoveStop
// 0x0008 (0x0008 - 0x0000)
struct CustomNavLinkMoveInterface_OnLinkMoveStop final
{
public:
	class UX6PathFollowingComponent*              PathComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomNavLinkMoveInterface_OnLinkMoveStop) == 0x000008, "Wrong alignment on CustomNavLinkMoveInterface_OnLinkMoveStop");
static_assert(sizeof(CustomNavLinkMoveInterface_OnLinkMoveStop) == 0x000008, "Wrong size on CustomNavLinkMoveInterface_OnLinkMoveStop");
static_assert(offsetof(CustomNavLinkMoveInterface_OnLinkMoveStop, PathComp) == 0x000000, "Member 'CustomNavLinkMoveInterface_OnLinkMoveStop::PathComp' has a wrong offset!");

// Function X6Game.CustomNavLinkMoveInterface.StopBlockDetectionInNavLink
// 0x0001 (0x0001 - 0x0000)
struct CustomNavLinkMoveInterface_StopBlockDetectionInNavLink final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomNavLinkMoveInterface_StopBlockDetectionInNavLink) == 0x000001, "Wrong alignment on CustomNavLinkMoveInterface_StopBlockDetectionInNavLink");
static_assert(sizeof(CustomNavLinkMoveInterface_StopBlockDetectionInNavLink) == 0x000001, "Wrong size on CustomNavLinkMoveInterface_StopBlockDetectionInNavLink");
static_assert(offsetof(CustomNavLinkMoveInterface_StopBlockDetectionInNavLink, ReturnValue) == 0x000000, "Member 'CustomNavLinkMoveInterface_StopBlockDetectionInNavLink::ReturnValue' has a wrong offset!");

// Function X6Game.CustomNavLinkMoveInterface.StopCheckingReachTarget
// 0x0001 (0x0001 - 0x0000)
struct CustomNavLinkMoveInterface_StopCheckingReachTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomNavLinkMoveInterface_StopCheckingReachTarget) == 0x000001, "Wrong alignment on CustomNavLinkMoveInterface_StopCheckingReachTarget");
static_assert(sizeof(CustomNavLinkMoveInterface_StopCheckingReachTarget) == 0x000001, "Wrong size on CustomNavLinkMoveInterface_StopCheckingReachTarget");
static_assert(offsetof(CustomNavLinkMoveInterface_StopCheckingReachTarget, ReturnValue) == 0x000000, "Member 'CustomNavLinkMoveInterface_StopCheckingReachTarget::ReturnValue' has a wrong offset!");

// Function X6Game.X6TickObject.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct X6TickObject_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6TickObject_ReceiveTick) == 0x000004, "Wrong alignment on X6TickObject_ReceiveTick");
static_assert(sizeof(X6TickObject_ReceiveTick) == 0x000004, "Wrong size on X6TickObject_ReceiveTick");
static_assert(offsetof(X6TickObject_ReceiveTick, DeltaTime) == 0x000000, "Member 'X6TickObject_ReceiveTick::DeltaTime' has a wrong offset!");

// Function X6Game.X6TickObject.SetTickable
// 0x0001 (0x0001 - 0x0000)
struct X6TickObject_SetTickable final
{
public:
	bool                                          IsTickable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6TickObject_SetTickable) == 0x000001, "Wrong alignment on X6TickObject_SetTickable");
static_assert(sizeof(X6TickObject_SetTickable) == 0x000001, "Wrong size on X6TickObject_SetTickable");
static_assert(offsetof(X6TickObject_SetTickable, IsTickable) == 0x000000, "Member 'X6TickObject_SetTickable::IsTickable' has a wrong offset!");

// Function X6Game.X6TickObject.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct X6TickObject_SetTickableWhenPaused final
{
public:
	bool                                          IsTickableWhenPaused;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6TickObject_SetTickableWhenPaused) == 0x000001, "Wrong alignment on X6TickObject_SetTickableWhenPaused");
static_assert(sizeof(X6TickObject_SetTickableWhenPaused) == 0x000001, "Wrong size on X6TickObject_SetTickableWhenPaused");
static_assert(offsetof(X6TickObject_SetTickableWhenPaused, IsTickableWhenPaused) == 0x000000, "Member 'X6TickObject_SetTickableWhenPaused::IsTickableWhenPaused' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.BlueprintPrepareDependencies
// 0x0001 (0x0001 - 0x0000)
struct DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies) == 0x000001, "Wrong alignment on DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies) == 0x000001, "Wrong size on DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies, ReturnValue) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_BlueprintPrepareDependencies::ReturnValue' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.BlueprintUpdatePlayerStates
// 0x0004 (0x0004 - 0x0000)
struct DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates) == 0x000004, "Wrong alignment on DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates) == 0x000004, "Wrong size on DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates, DeltaSeconds) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_BlueprintUpdatePlayerStates::DeltaSeconds' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.LoadDamiaoRelaxAnimCompeted
// 0x0018 (0x0018 - 0x0000)
struct DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted final
{
public:
	int32                                         AsyncId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        InLoadedObjects;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted) == 0x000018, "Wrong size on DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted, AsyncId) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted::AsyncId' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted, InLoadedObjects) == 0x000008, "Member 'DaMiaoLocomotionAnimInstance_LoadDamiaoRelaxAnimCompeted::InLoadedObjects' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnApplyAdditiveUpdate
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnApplyAdditiveUpdate::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnCycleStateMachineUpdate
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnCycleStateMachineUpdate::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnJumpStartStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnJumpStartStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnLandRecoveryAdditiveStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnLandRecoveryAdditiveStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnReJumpStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnReJumpStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStartLeanAdditiveBlendSpacePlayerUpdate
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStartLeanAdditiveBlendSpacePlayerUpdate::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStartSequencePlayerUpdate
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStartSequencePlayerUpdate::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStartStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStartStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStartStateUpdate
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStartStateUpdate final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStartStateUpdate) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStartStateUpdate");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStartStateUpdate) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStartStateUpdate");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartStateUpdate, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStartStateUpdate::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStartStateUpdate, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStartStateUpdate::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStopSequencePlayerBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStopSequencePlayerBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnStopStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnStopStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.OnTurnInPlaceStateBecomeRelevant
// 0x0020 (0x0020 - 0x0000)
struct DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant) == 0x000020, "Wrong size on DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant, Context) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant::Context' has a wrong offset!");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant, Node) == 0x000010, "Member 'DaMiaoLocomotionAnimInstance_OnTurnInPlaceStateBecomeRelevant::Node' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.SetDashState
// 0x0001 (0x0001 - 0x0000)
struct DaMiaoLocomotionAnimInstance_SetDashState final
{
public:
	bool                                          IsInDash;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_SetDashState) == 0x000001, "Wrong alignment on DaMiaoLocomotionAnimInstance_SetDashState");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_SetDashState) == 0x000001, "Wrong size on DaMiaoLocomotionAnimInstance_SetDashState");
static_assert(offsetof(DaMiaoLocomotionAnimInstance_SetDashState, IsInDash) == 0x000000, "Member 'DaMiaoLocomotionAnimInstance_SetDashState::IsInDash' has a wrong offset!");

// Function X6Game.DaMiaoLocomotionAnimInstance.SetPendingGroundedLocomotionAnimSet
// 0x0100 (0x0100 - 0x0000)
struct DaMiaoLocomotionAnimInstance_SetPendingGroundedLocomotionAnimSet final
{
public:
	struct FDaMiaoGroundedLocomotionAnimSet       InGroundedLocomotionAnimSet;                       // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DaMiaoLocomotionAnimInstance_SetPendingGroundedLocomotionAnimSet) == 0x000008, "Wrong alignment on DaMiaoLocomotionAnimInstance_SetPendingGroundedLocomotionAnimSet");
static_assert(sizeof(DaMiaoLocomotionAnimInstance_SetPendingGroundedLocomotionAnimSet) == 0x000100, "Wrong size on DaMiaoLocomotionAnimInstance_SetPendingGroundedLocomotionAnimSet");
