#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6GraphRuntimeDebug

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class X6GraphRuntimeDebug.X6GraphDebugNetSocketUtil
// 0x00A0 (0x00C8 - 0x0028)
class UX6GraphDebugNetSocketUtil final : public UObject
{
public:
	int32                                         Port;                                              // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ListenSocketNum;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConnectionStateCheckInterval;                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x94];                                      // 0x0034(0x0094)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisConnect();
	void InitDebuggerSocketWaitForConnect();
	bool IsDebuggerConnected();
	void OnReciveDebuggerMsg(int32 MsgType, const class FString& MsgContent);
	void SendMessageBytesToDebugger(TArray<uint8>* MsgData);
	void SendMessageToDebugger(const class FString& MsgData);
	void UnInitDebuggerSocket();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6GraphDebugNetSocketUtil">();
	}
	static class UX6GraphDebugNetSocketUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6GraphDebugNetSocketUtil>();
	}
};
static_assert(alignof(UX6GraphDebugNetSocketUtil) == 0x000008, "Wrong alignment on UX6GraphDebugNetSocketUtil");
static_assert(sizeof(UX6GraphDebugNetSocketUtil) == 0x0000C8, "Wrong size on UX6GraphDebugNetSocketUtil");
static_assert(offsetof(UX6GraphDebugNetSocketUtil, Port) == 0x000028, "Member 'UX6GraphDebugNetSocketUtil::Port' has a wrong offset!");
static_assert(offsetof(UX6GraphDebugNetSocketUtil, ListenSocketNum) == 0x00002C, "Member 'UX6GraphDebugNetSocketUtil::ListenSocketNum' has a wrong offset!");
static_assert(offsetof(UX6GraphDebugNetSocketUtil, ConnectionStateCheckInterval) == 0x000030, "Member 'UX6GraphDebugNetSocketUtil::ConnectionStateCheckInterval' has a wrong offset!");

// Class X6GraphRuntimeDebug.X6GraphRuntimeDebugBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UX6GraphRuntimeDebugBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString Conv_BytesToString(const TArray<uint8>& Bytes);
	static TArray<uint8> Conv_StringToBytes(const class FString& InStr);
	static TArray<uint8> ConvInt_HToN(int32 Value);
	static int32 ConvInt_NToH(TArray<uint8>* Bytes);
	static float X6GraphRuntimeDebugSampleFunction(float Param);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6GraphRuntimeDebugBPLibrary">();
	}
	static class UX6GraphRuntimeDebugBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6GraphRuntimeDebugBPLibrary>();
	}
};
static_assert(alignof(UX6GraphRuntimeDebugBPLibrary) == 0x000008, "Wrong alignment on UX6GraphRuntimeDebugBPLibrary");
static_assert(sizeof(UX6GraphRuntimeDebugBPLibrary) == 0x000028, "Wrong size on UX6GraphRuntimeDebugBPLibrary");

}

