#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6RawInput

#include "Basic.hpp"

#include "X6RawInput_structs.hpp"


namespace SDK::Params
{

// Function X6RawInput.X6RawInputFunctionLibrary.GetAllConnectedControllersAmount
// 0x0004 (0x0004 - 0x0000)
struct X6RawInputFunctionLibrary_GetAllConnectedControllersAmount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6RawInputFunctionLibrary_GetAllConnectedControllersAmount) == 0x000004, "Wrong alignment on X6RawInputFunctionLibrary_GetAllConnectedControllersAmount");
static_assert(sizeof(X6RawInputFunctionLibrary_GetAllConnectedControllersAmount) == 0x000004, "Wrong size on X6RawInputFunctionLibrary_GetAllConnectedControllersAmount");
static_assert(offsetof(X6RawInputFunctionLibrary_GetAllConnectedControllersAmount, ReturnValue) == 0x000000, "Member 'X6RawInputFunctionLibrary_GetAllConnectedControllersAmount::ReturnValue' has a wrong offset!");

// Function X6RawInput.X6RawInputFunctionLibrary.GetConnectedControllersNum
// 0x0004 (0x0004 - 0x0000)
struct X6RawInputFunctionLibrary_GetConnectedControllersNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6RawInputFunctionLibrary_GetConnectedControllersNum) == 0x000004, "Wrong alignment on X6RawInputFunctionLibrary_GetConnectedControllersNum");
static_assert(sizeof(X6RawInputFunctionLibrary_GetConnectedControllersNum) == 0x000004, "Wrong size on X6RawInputFunctionLibrary_GetConnectedControllersNum");
static_assert(offsetof(X6RawInputFunctionLibrary_GetConnectedControllersNum, ReturnValue) == 0x000000, "Member 'X6RawInputFunctionLibrary_GetConnectedControllersNum::ReturnValue' has a wrong offset!");

// Function X6RawInput.X6RawInputFunctionLibrary.GetRegisteredDevices
// 0x0010 (0x0010 - 0x0000)
struct X6RawInputFunctionLibrary_GetRegisteredDevices final
{
public:
	TArray<struct FX6RegisteredDeviceInfo>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6RawInputFunctionLibrary_GetRegisteredDevices) == 0x000008, "Wrong alignment on X6RawInputFunctionLibrary_GetRegisteredDevices");
static_assert(sizeof(X6RawInputFunctionLibrary_GetRegisteredDevices) == 0x000010, "Wrong size on X6RawInputFunctionLibrary_GetRegisteredDevices");
static_assert(offsetof(X6RawInputFunctionLibrary_GetRegisteredDevices, ReturnValue) == 0x000000, "Member 'X6RawInputFunctionLibrary_GetRegisteredDevices::ReturnValue' has a wrong offset!");

// Function X6RawInput.X6RawInputFunctionLibrary.IfConnectingPlayStationGamePad
// 0x0001 (0x0001 - 0x0000)
struct X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad) == 0x000001, "Wrong alignment on X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad");
static_assert(sizeof(X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad) == 0x000001, "Wrong size on X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad");
static_assert(offsetof(X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad, ReturnValue) == 0x000000, "Member 'X6RawInputFunctionLibrary_IfConnectingPlayStationGamePad::ReturnValue' has a wrong offset!");

// Function X6RawInput.X6RawInputFunctionLibrary.RegisterConnectedControllersChangeEvent
// 0x0020 (0x0020 - 0x0000)
struct X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FunctionName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent) == 0x000008, "Wrong alignment on X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent");
static_assert(sizeof(X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent) == 0x000020, "Wrong size on X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent");
static_assert(offsetof(X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent, Object) == 0x000000, "Member 'X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent::Object' has a wrong offset!");
static_assert(offsetof(X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent, FunctionName) == 0x000008, "Member 'X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent::FunctionName' has a wrong offset!");
static_assert(offsetof(X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent, ReturnValue) == 0x000018, "Member 'X6RawInputFunctionLibrary_RegisterConnectedControllersChangeEvent::ReturnValue' has a wrong offset!");

// Function X6RawInput.X6RawInputFunctionLibrary.UnregisterConnectedControllersChangeEvent
// 0x0004 (0x0004 - 0x0000)
struct X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent) == 0x000004, "Wrong alignment on X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent");
static_assert(sizeof(X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent) == 0x000004, "Wrong size on X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent");
static_assert(offsetof(X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent, Handle) == 0x000000, "Member 'X6RawInputFunctionLibrary_UnregisterConnectedControllersChangeEvent::Handle' has a wrong offset!");

}

