#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6RawInput

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "X6RawInput_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class X6RawInput.X6RawInputFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UX6RawInputFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetAllConnectedControllersAmount();
	static int32 GetConnectedControllersNum();
	static TArray<struct FX6RegisteredDeviceInfo> GetRegisteredDevices();
	static bool IfConnectingPlayStationGamePad();
	static int32 RegisterConnectedControllersChangeEvent(class UObject* Object, const class FString& FunctionName);
	static void UnregisterConnectedControllersChangeEvent(int32 Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6RawInputFunctionLibrary">();
	}
	static class UX6RawInputFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6RawInputFunctionLibrary>();
	}
};
static_assert(alignof(UX6RawInputFunctionLibrary) == 0x000008, "Wrong alignment on UX6RawInputFunctionLibrary");
static_assert(sizeof(UX6RawInputFunctionLibrary) == 0x000028, "Wrong size on UX6RawInputFunctionLibrary");

// Class X6RawInput.X6RawInputSettings
// 0x0018 (0x0050 - 0x0038)
class UX6RawInputSettings final : public UDeveloperSettings
{
public:
	TArray<struct FX6RawInputDeviceConfiguration> DeviceConfigurations;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bRegisterDefaultDevice;                            // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AxisDeadZone;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6RawInputSettings">();
	}
	static class UX6RawInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6RawInputSettings>();
	}
};
static_assert(alignof(UX6RawInputSettings) == 0x000008, "Wrong alignment on UX6RawInputSettings");
static_assert(sizeof(UX6RawInputSettings) == 0x000050, "Wrong size on UX6RawInputSettings");
static_assert(offsetof(UX6RawInputSettings, DeviceConfigurations) == 0x000038, "Member 'UX6RawInputSettings::DeviceConfigurations' has a wrong offset!");
static_assert(offsetof(UX6RawInputSettings, bRegisterDefaultDevice) == 0x000048, "Member 'UX6RawInputSettings::bRegisterDefaultDevice' has a wrong offset!");
static_assert(offsetof(UX6RawInputSettings, AxisDeadZone) == 0x00004C, "Member 'UX6RawInputSettings::AxisDeadZone' has a wrong offset!");

}

