#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6ResInfo

#include "Basic.hpp"

#include "X6ResInfo_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class X6ResInfo.X6ResDataAsset
// 0x0010 (0x0098 - 0x0088)
class UX6ResDataAsset : public UPrimaryAssetLabel
{
public:
	TArray<struct FX6ResStruct>                   X6ExplicitAssets;                                  // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6ResDataAsset">();
	}
	static class UX6ResDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6ResDataAsset>();
	}
};
static_assert(alignof(UX6ResDataAsset) == 0x000008, "Wrong alignment on UX6ResDataAsset");
static_assert(sizeof(UX6ResDataAsset) == 0x000098, "Wrong size on UX6ResDataAsset");
static_assert(offsetof(UX6ResDataAsset, X6ExplicitAssets) == 0x000088, "Member 'UX6ResDataAsset::X6ExplicitAssets' has a wrong offset!");

// Class X6ResInfo.X6DevResDataAsset
// 0x0000 (0x0098 - 0x0098)
class UX6DevResDataAsset final : public UX6ResDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6DevResDataAsset">();
	}
	static class UX6DevResDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6DevResDataAsset>();
	}
};
static_assert(alignof(UX6DevResDataAsset) == 0x000008, "Wrong alignment on UX6DevResDataAsset");
static_assert(sizeof(UX6DevResDataAsset) == 0x000098, "Wrong size on UX6DevResDataAsset");

}

