#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6SmartRichText

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// Class X6SmartRichText.X6SmartRichTextBlock
// 0x0070 (0x0910 - 0x08A0)
class UX6SmartRichTextBlock final : public URichTextBlock
{
public:
	class FName                                   DefaultFontRowName;                                // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A8[0x28];                                     // 0x08A8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UX6SmartRichTextCharColorDecorator*     CharColorDecorator;                                // 0x08D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UX6SmartRichTextImageDecorator*         ImageDecorator;                                    // 0x08D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8E0[0x30];                                     // 0x08E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideAllText();
	int32 InitRichText();
	void PrintLetter(int32 LetterNum);
	void SetX6TextStyleSet(class UDataTable* NewTextStyleSet);
	void ShowAllText();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6SmartRichTextBlock">();
	}
	static class UX6SmartRichTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6SmartRichTextBlock>();
	}
};
static_assert(alignof(UX6SmartRichTextBlock) == 0x000010, "Wrong alignment on UX6SmartRichTextBlock");
static_assert(sizeof(UX6SmartRichTextBlock) == 0x000910, "Wrong size on UX6SmartRichTextBlock");
static_assert(offsetof(UX6SmartRichTextBlock, DefaultFontRowName) == 0x0008A0, "Member 'UX6SmartRichTextBlock::DefaultFontRowName' has a wrong offset!");
static_assert(offsetof(UX6SmartRichTextBlock, CharColorDecorator) == 0x0008D0, "Member 'UX6SmartRichTextBlock::CharColorDecorator' has a wrong offset!");
static_assert(offsetof(UX6SmartRichTextBlock, ImageDecorator) == 0x0008D8, "Member 'UX6SmartRichTextBlock::ImageDecorator' has a wrong offset!");

// Class X6SmartRichText.X6SmartRichTextCharColorDecorator
// 0x0010 (0x0038 - 0x0028)
class UX6SmartRichTextCharColorDecorator final : public URichTextBlockDecorator
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6SmartRichTextCharColorDecorator">();
	}
	static class UX6SmartRichTextCharColorDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6SmartRichTextCharColorDecorator>();
	}
};
static_assert(alignof(UX6SmartRichTextCharColorDecorator) == 0x000008, "Wrong alignment on UX6SmartRichTextCharColorDecorator");
static_assert(sizeof(UX6SmartRichTextCharColorDecorator) == 0x000038, "Wrong size on UX6SmartRichTextCharColorDecorator");

// Class X6SmartRichText.X6SmartRichTextImageDecorator
// 0x0028 (0x0050 - 0x0028)
class UX6SmartRichTextImageDecorator final : public URichTextBlockDecorator
{
public:
	float                                         Scale;                                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     InlineTextureArray;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"X6SmartRichTextImageDecorator">();
	}
	static class UX6SmartRichTextImageDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UX6SmartRichTextImageDecorator>();
	}
};
static_assert(alignof(UX6SmartRichTextImageDecorator) == 0x000008, "Wrong alignment on UX6SmartRichTextImageDecorator");
static_assert(sizeof(UX6SmartRichTextImageDecorator) == 0x000050, "Wrong size on UX6SmartRichTextImageDecorator");
static_assert(offsetof(UX6SmartRichTextImageDecorator, Scale) == 0x000028, "Member 'UX6SmartRichTextImageDecorator::Scale' has a wrong offset!");
static_assert(offsetof(UX6SmartRichTextImageDecorator, InlineTextureArray) == 0x000030, "Member 'UX6SmartRichTextImageDecorator::InlineTextureArray' has a wrong offset!");

}

