#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: X6Sound

#include "Basic.hpp"


namespace SDK
{

// Enum X6Sound.EUISoundEventType
// NumValues: 0x000B
enum class EUISoundEventType : uint8
{
	Button_OnClicked                         = 0,
	Button_Hover                             = 1,
	Image_OnClicked                          = 2,
	Border_OnMouseButtonDown                 = 3,
	Border_OnMouseButtonUp                   = 4,
	ComboBoxString_OnOpening                 = 5,
	ComboBoxString_SelectionChanged          = 6,
	CheckBox_Checked                         = 7,
	CheckBox_Unchecked                       = 8,
	CheckBox_Hovered                         = 9,
	EUISoundEventType_MAX                    = 10,
};

// ScriptStruct X6Sound.X6UMGSoundConfigStruct
// 0x0038 (0x0038 - 0x0000)
struct FX6UMGSoundConfigStruct final
{
public:
	class FString                                 WidgetName;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UMGPackageName;                                    // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUISoundEventType                             EventType;                                         // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AudioEventPath;                                    // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FX6UMGSoundConfigStruct) == 0x000008, "Wrong alignment on FX6UMGSoundConfigStruct");
static_assert(sizeof(FX6UMGSoundConfigStruct) == 0x000038, "Wrong size on FX6UMGSoundConfigStruct");
static_assert(offsetof(FX6UMGSoundConfigStruct, WidgetName) == 0x000000, "Member 'FX6UMGSoundConfigStruct::WidgetName' has a wrong offset!");
static_assert(offsetof(FX6UMGSoundConfigStruct, UMGPackageName) == 0x000010, "Member 'FX6UMGSoundConfigStruct::UMGPackageName' has a wrong offset!");
static_assert(offsetof(FX6UMGSoundConfigStruct, EventType) == 0x000020, "Member 'FX6UMGSoundConfigStruct::EventType' has a wrong offset!");
static_assert(offsetof(FX6UMGSoundConfigStruct, AudioEventPath) == 0x000028, "Member 'FX6UMGSoundConfigStruct::AudioEventPath' has a wrong offset!");

}

